["As a reminder, /r/AskEngineers normal restrictions for career related posts are severely relaxed for this thread, so feel free to ask about intra-office politics, salaries, or just about anything else related to your job!", "As an early career in-house process utilities design engineer, will I be highly transferable to chemical process design EPCs? (We do selections of boilers, cooling tower, water, compressors, HVAC, piping)\n\n\nWe always visit our projects and commissioning every week. Also, does my every week plant visit give me a leg-up compared to engineers who started at EPCs ever since their career? Thanks.", "ARE THERE GOOD CAREER PROSPECTS IN RENEWABLE ENERGY ENGINEERING?\n\nHello, I’ve been admitted to a Sustainable energy engineering Master’s program and i am trying to figure out if it’s a good field to go into. I would like to hear what people from within the field have to say (preferably EU), since right now i am working in construction and i don’t know that much about the job market in SEE. For me, construction is just not very exciting and since i am quite passionate about the environment and the energy transition i thought this could be more motivating. However, i do still want to be able to secure a well paying job. Should I do this or better choose another topic? Thanks!!!", "at a lost where I should go next. Been at job for 2.5 years (2 of them FT grad dec 2021) with promotion being dangled in front of my face (E1 to 2) but people keep leaving (two sr. engs that were awesome to work with left back-to-back last 2 weeks). I'm open to making complete change, but not sure if I got the skills to go for (recently went to a career fair and was unsuccessful) what I think would be the best move or if I should double down on path I'm on and maybe just switch companies. Or even switch over to sales eng.\n\nWhat would be the best thing to do? I'm assuming figure it out first, but with other priorities to attend after work I don't get enough time to figure it out and I hate my job as they will give me more responsibilities without the added pay.", "I am a student, can you give me some advice as I am not knowledgeable about this issue. Now I’m looking for where I can do an internship, but for this I need to choose a direction myself and understand what I want to achieve in the future. If I start with programming protection relays (including scada and dms), that is, relay logic in high-voltage electrical substations (programming relay protection terminals 0.4 kV-330 kV), will it then be easier for me to learn how to program PLCs in the future?", "Should I ask for a raise?\n\nI (30m) am an engineer that is 5.5 years into my job at a fortune 100 company. First job since graduating college.  MCOL area.\n\nBackground:  Mechanical Engineering bachelors degree.\n\nSalary/Title timeline: Engineer I, Controls. 58k. 2.5 years. Design control systems.\n\nEngineer II, Controls. 85k. 2 years. Estimate, design, program/startup PLC control systems. I was the only one in my department that was wearing all these hats on projects. These tasks were divided up by groups but I did them all for my projects, on my own accord. For my EOY review on year 2 I was going to get a 7% raise to take me from 90k to ~96k. During this time there was instability in the controls department so I applied for an Engineer III position in the Electrical/Power department. They offered me 100k base… this was before the 7% raise technically took effect. I knew I was kind of getting screwed raise-wise but I realized I was a ME graduate with no true “power” experience.\n\nEngineer III, Electrical. 102k, current (1.5 years). In this role I have progressed fast. I do my own design and drafting for power aspects of projects as well as the controls design and controls PM in some cases.  The rest of my team does not do their own drafting, they outsource it. They don’t design nor manage the controls aspects of projects either. I do this by my own accord again.\n\nI’m starting to think harder about this and the value I bring to the company and what I am worth on the market. The company’s median for my position is 115k and maxes at ~150k. I realize I am truly only 1.5 years into being an “electrical engineer” so I can’t justify any raise purely on time-in-role. However, all of these other hats I wear set me apart from my colleagues and saves the company $$. I’ve also created training modules for our design softwares and led training sessions for our controls and electrical departments.\n\nMy EOY review ratings have been Leading, Exceptional, Exceptional, Leading and Core since I’ve started. Execeptional being the highest and Leading being second highest. I have a great reputation at my company and also have been told I have great communication/social skills. I will also get my PE if I pass the Power exam in a few months. This is not required for the job though.\n\nI am lost in figuring my worth at my company and could use some honest opinions if you think I deserve a raise or not. My next promotion will be Engineer IV but I want a raise before I’m promoted, otherwise I fear I’ll be stuck at the lower end of the pay bands for my career at this company.", "Ask for a raise and if they say no you have your answer. If you don't like the answer you can start seeing what is out on the market. If you do like the answer you should still see what's out there. You might find something you like better.\n\nBasically, the worst outcome is they say no.", "Masters in Eng or MBA.\nMech Eng in Australia for context.\nIm at the point in my career where I either commit to a very narrow specialty or do a MBA and step across to Ops/bussiness managment.\n\nI live in a area without a heap of jobs or industry and not to keen on moving, but if i work another 3 years in my current job (which is great) i rekon i will be so entrenched in my industry that i will essentially be stuck in it.\nWill prob need to do a compleatly unessicary Masters to progress my career the next big step because HR like that kinda thing.\n\nWhat have other people done mid-late career in Aus?", "Is it a good career move to take a job with a very small company of 4 people with one engineer? I have an opportunity at a small company that works in a major field and one I want to be a part of. I'm a new graduate, and this role would offer me the chance to do design. I have experience doing design that I gained working on projects in school. I'm not overly worried about being able to do the work itself, and the engineer I would be working with seems like they would be good to work with.\n\nMy concern is, would a larger company consider my design experience for such a small company to be valid work?  I've seen up close this engineers work, I'm not overly experienced myself, but they've created elegant solutions to many problems and I feel there is a good deal to learn from them.", "Companies that small have large pros and cons.\n\nOn the upside, you will be in an excellent position if the company does well and grows. It could fast track your career, give you experience with a variety of tools, and you could spend many years there.\n\nIf it flops it probably won’t look stellar to future employers and you’ll be out of a job until you can find something new. \n\nThe answer to if you should take those risks is likely different for a 25 yr old recent graduate and 55 year old senior engineer.\n\nI’d say go for it.", "Need help deciding my next move: Join my dad's company or not?\n\nCurrently a contract electrical integration engineer, degree in BSME, no FE. My contract is about to expire ($50/hr, $104k, effectively $94k) and they will not bring me on full time. I have an opportunity to become an HVAC project manager which they'd start me at $80k. I would have the opportunity to buy into the company and, if I bought enough stock, I could become president like my dad did. If I did that, the later 10 years of my career so would top out at $850k.\n\nThe problem is that I would be sacrificing a lot of money for years, and I don't know if I would have a better average quality of life going elsewhere. Could I potentially earn low six figures elsewhere and have a better net life? I also don't love the weather here either, but with climate change, its getting better.", "I think this is something only you can answer; it depends what you want out of life. I think as an engineer with some experience being north of six figures isn't too hard to find. \n\nIf you are a driven person that wants to succeed in the corporate world and climb the ladder then following along with your dads company is the way to go.\n\nIf you are comfortable with what you make and do now and don't want what comes with corporate life then taking a different job might be better. \n\nI don't see this as a binary problem though, there's very likely a way where you could be a player in your fathers company that would benefit you long term while not taking as much responsibility. I know I'm a huge fan of the work/life balance my current job offers. I could make more, I could push myself harder and sacrifice more but I'm much happier being able to spend more time with friends and family than climbing the cooperate ladder. Talking to your dad might be able to offer some other options if you're honest about what you'd like.", "I've lived with him all my life, so I know what the deal is as far as work goes. For work life balance, it's honestly fine. Very rarely did he put in extra hours. It's the nature of construction that the day ends when it ends. \n\nAppreciate the thoughts.", "Photos: [https://imgur.com/a/aFhWrYM](https://imgur.com/a/aFhWrYM)  \nThe first photo is the one right above my workspace.   \nThe next 2 photos are the units that were installed on the in side of our rooftop patio.  \nThe last photo is of the main unit that powers all of them. \n\nThe main cabinet unit (last photo) is about 50' on the opposite side of the cell towers (we're in between). The cabinet rings high-pitched enough that we can't open our living room window without hearing it, and our neighbors have noticed it too. We've been told that it's the fans. \n\nThe units on the patio also have a noise to them, understandably, but it's not as high-pitched. We've been told all of this stuff is safe as long as we didn't go on the other side of it (we can't). There were many workers up there for months, and upon inquiring when they began, I was told by one technician: \"I wouldn't live here with my wife and kids, but that's off the record\". Freaked us out. All the other workers have told us many times that it's safe. \n\nHowever, the high-pitched ringing is annoying and, despite being under them, still seems a little too close for comfort. Both myself and my roommate have developed tinnitus in the last year. It's likely entirely unrelated, and we're both under a lot of stress at work (a main cause of tinnitus), but it made us wonder. Especially after one of the techs insinuated a potential danger. \n\nAre we totally safe? Is it bad being in between that main cabinet and multiple towers connected to it? Are there any hazards to living this close to these at all? \n\nAgain, I'm not crazy (I swear!), just genuinely curious! Thank you!!", "The noise is honestly the biggest thing to worry about, complain to everyone, on repeat until it is addressed.\n\nThat said, the noise is likely just an annoyance (not an actual hazard), it's just not one you should have to deal with", "Noise pollution is a real thing with real health effects.", "It probably is a fan or a power supply. Probably nothing to do with RF.", "Yes, but its health effects are no different from living next to a noisy, busy street.\n\nThere are no Magic Death Ray health effects to worry about, like OP was hypothesizing.", "I'd be surprised if it were actually the same as a busy street.  Constant uncomfortably loud sound within a small frequency range is way more likely to deal damage to your hearing in that particular range than sounds across a wide spectrum.  Being around shitty fans or shitty pumps all day long is a recipe for losing your hearing at those frequencies.", "That’s extremely dangerous. Imagine if you lived in a quiet high rise and then they build a highway right next to your window.\n\nYou didn’t sign up to breathe in and hear all that shit", "The danger is the RF energy. No way to tell without taking readings in the home. \n\nWould you run your microwave oven with the door open? Very similar radiation, just a different frequency", "It's not just about hearing damage. Noise pollution causes stress which can lead to all kinds of stress related illnesses such as cardiovascular disease and mental health issues.", "> Would you run your microwave oven with the door open? Very similar radiation\n\nThat is conclusive proof you have no idea how radiofrequency works.", "Ah yes, much like that pesky solar radiation that we have to be so vigilant around. Very similar, just a different frequency.\n\nLol wtf. Go review your wave equations.", "you misunderstand how these antennae work. this would be a device that receives signals from all around, and then transmits them in a very small, specified path. there is no energy being directed everywhere. moreover, electromagnetic energy of the rf spectrum hasn't shown to be harmful to humans. in the same way that using your microwave is fine, because there is no energy being directed at you, this radio post offers no harm on that front.", "Railroad tracks have been shown to lower test scores on one side of a school (the closer side) more than on the other. The cognitive stress is real.", "He’s not wrong .. same type of radiation just not the kind that’s harmful.", "You might have been playing with your waveguide too much🤣", "Huh, I like train noise.", "He's implying cell tower radiation is harmful, which is batshit insane.", "And I like cocaine but it has a rather terrible impact on my long term academic success.", "Depending on how much power that thing is putting out, I'd rather not be super close.\n\nThen again, i have no idea what frequency it runs at. I just know that it's also not a great idea to live under HV power lines. Something something ionization and cancer rates.\n\nIt might all be hokum. If it actually effected me, I'd research more 😂", "See the trick is, you just use the cocaine when you're studying, not when you're partying. Then it has a *good* impact on your grades.", "> i have no idea what frequency it runs at.\n\nThat's right.\n\n> I just know that it's also not a great idea to live under HV power lines. Something something ionization and cancer rates.\n\nUtter bullshit.\n\n> It might all be hokum.\n\nExactly.", ">Something something ionization and cancer rates\n\nSadly, this is the most scientifically accurate part of your comment -- mainly for lack of any real content.", "I’ve worked on 4G networks. It looks like a regular antenna for a macro cell, and looks like it’s transmitting on at least two different frequencies (two colored tapes suggest to me two different radio units, but I don’t know if that’s a standard worldwide).\n\nThe good news is that antenna manufacturers do everything they can to focus the signal towards the front of the antenna. But there is still some leakage down and behind the antenna. \n\nIf you have a pacemaker or something like that I would be concerned. Other than that there are no proven health risks that I know of.\n\nYou could get some interference on your wireless devices depending on the frequencies they’re using (and viceversa) but it’s rare. If everything is working properly it shouldn’t be a problem.", "Oh I saw the other pictures. There seems to be 3 radio units, an UPS (the one with the safety square) and an outdoor cabinet for the network equipment (the long vertical one). The radio units all look different, so it’s either a big carrier or multiple smaller carriers sharing equipment.\n\nI can’t tell what frequencies or standard they are just by looking at them (but the Ericsson one looks modern). You might get that information if you catch one of the maintenance guys in a good mood and ask them about their job.\n\nEdit: yes those little fans are screamers. I wore earplugs in the data centers. I have sensory sensitivity issues, but I can imagine it’s still annoying without those. \n\nIn the third world these sites also have diesel generators sometimes. And the power goes out for multiple hours. One time they had a transfer switch that failed and they had to run the generator 24/7 for days until the company could get a replacement. The poor maintenance guys got verbally abused the whole time they were there. \n\n**Bonus:** Oh man those maintenance guys have the craziest stories. Most of the work happens at night because it disrupts service. One time they were in a rough neighborhood at 3AM and got stopped by the police. The police asked what they were up to and they said they had to do some maintenance on the cell tower. The police told them “OK my friend, look. We don’t go past that street over there, it’s too dangerous. You take care, but we’re leaving” and just left. That week maintenance almost unionized! From that point on they let them do the maintenance in broad daylight at that site.", "It's most likely fdma so a constantly changing large degree of frequencies.\nI'm an RF guy and work around large antennas and have known guys doing it for 20 years with very high power equipment all day and no issues", "Hmm it's definitely USA, I wanna say tmobile by the color code, I do use the same antennas for high band radios (1900-2100)mhz and low band radios (700-850) for Verizon builds", "Oh the stories… years ago I used to manage maintenance teams and sometimes they would call in because neighbors would chase them away with knives in hand, screaming about antennas and cancer. They would also put their own locks on the cabinets or stairwell access’ so no one could do maintenance. \n\nThey also so found a dead junkie in an IDU shed. He broke in to escape the cold or whatever and overdosed.\n\nOh and the amount of break-ins to steal batteries…", "Also the cabinet labelled \"T-Mobile Fiber\" is a pretty big clue :)", "Oh the batteries! And the fiber. I can’t tell you how many times we went to repair cut fiber just to find somebody thought it was all copper.", "Classic!", "Mobile frequencies are non-ionizing and of much lower energy/frequency than the suns own rays. You’re much more likely to get hurt not putting on UV-blocking sun screen and going out in the summer.\n\nAlso, the human skin at mobile frequencies has high permittivity and is a poor conductor. This means that there will be a large impedance mismatch between the air and skin. This mismatch will cause a large reflection of EM energy. \n\nThe skins poor conductivity also means that any transmitted energy will be quickly damped through conductive losses and dissipated at radiative heat. The increase will be so small you’ll likely not feel it. In other words very little energy is making its way into your body. The energy that does permeate, will ‘look’ like a static DC field to all of your cells and most of your organs.\n\n\nHowever the FCC with the help of IEEE and ANSI has determined that maximum RF exposure be no more than 580 microwatts per square centimeter. This is many times greater than the power received near a base station or tower. You would essentially have to be directly in the main beam to get this much energy.\nRooftop antennas like the one pictured operate on even lower power than tower/base station antennas. As such individuals living in a building are not at risk as the majority of the power is focused away from you.\n\n\nHowever if you want, you could try and complain to the FCC but in my opinion nothing will likely come from it once they see the photo", "non-ionizing doesn't mean safe. The sun's rays are also [mostly non-ionizing.](https://en.wikipedia.org/wiki/Ionizing_radiation#/media/File:EM-spectrum.svg) UV-A and UV-B [are non-ionizing](https://radiation.ncdhhs.gov/NonIonizing/UVRad.htm#:~:text=UV%2DA%20and%20UV%2DB%20are%20technically%20non%2Dionizing,and%20can%20cause%20skin%20cancer.), but still cause cancer and other health issues.\n\nI agree with your conclusion, but your explanations are muddled and inaccurate, and you fail to provide any sources.", "\nRF hazards are exclusively thermal in nature (as with any low photon-energy EM radiation). Here's a source: https://www.ehs.gatech.edu/radiation/rf\n\nYou were needlessly rude to the original commenter. I found his explanation perfectly clear and accurate. It's rather your *understanding* which is lacking, not his explanation. (Fitting username)\n\nIn your source it clearly states that UVA and UVB can catalyze photochemical reactions. This is exclusively due to their photon energy. Below the visible and IR spectra, photon energy falls below the level of electronic energy transitions and is therefore unable to catalyze photochemical reactions (outside of nonlinear effects only possible in a laboratory environment). I don't have a source for this besides the fact that I'm a vocational optics instructor and optical engineer by trade.\n\nYour point about the sun mostly emitting non-ionizing radiation is moot. It's the ionizing radiation (along with the nearly-ionizing UVA and UVB) that are responsible for 100% of the nonthermal hazards.", "Just because theyre thermal doesn't mean it can't hurt. Countless studies have directly shown a significant increase in oxidative tissue stress and the subsequent reduction in the size of blood vessels. It's the reason the WHO still classifies this tech as \"possibly carcinogenic\". Even just putting a cell phone in your pocket all day causes a measurable reduction in sperm count.  \n\n\nAll that being said, 5g tech should limit these effects as the higher frequency prevent deeper tissue penetration.", "Do you have sources for the studies you’ve cited? Curious under what conditions “significant increase in oxidative tissue stress” was observed … possibly a study from pre-4G? Wondering if it’s a body part resonance issue, or purely exposer to EM fields…", "[https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8038719/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8038719/)  \n\n\nWHO is actually more concerned about brain/heart cancer.  \n\n\nhttps://pubmed.ncbi.nlm.nih.gov/30448205/", "On the noise: that would drive me insane and may be enough to let you break your lease without forfeiting your security deposit. I’m not a lawyer, but I have some experience with sketchy landlords and housing regulations. In New York, at least, all residential leases have an implied warranty of habitability that cannot be waived. This is a guarantee that the property be maintained in a habitable state at all times, and that the tenant has the right to quiet enjoyment of the space. Courts have ruled that excess noise counts against habitability. Separately, the fact that the noise wasn’t there when you signed is a material change to the nature of the apartment that was entirely within the control of your landlord.\n\nFirst speak with the landlord about the noise. They may be able to get the installers to mitigate.", "I can't speak to the EM aspect of it but I do know that constant, unavoidable noise is detrimental to one's health.\n\n\nSome places have legal requirements for the maximum noise from this type of equipment. If your city is one of those places there's a good chance this equipment exceeds that limit. ", "> Am I safe?\n\nYes.", "Screw the radiation, go ask r/hacking how to tap into this and find a way to profit 😁", "5g is perfectly safe, it's the same rough wavelength as wifi, and no one sane has ever had an issue with that. there have been dozens of studies about if a person can tell if a wifi router is on or not. (They guess just as accurately as a coin flip)\n\n\n\nThe noise could be a problem. Especially if it's very loud and *just* outside your hearing range.\n\n\n\nThere are spectrum analysis apps you can download that will show you the frequencies your mic can pick up. I used [this](https://play.google.com/store/apps/details?id=org.intoorbit.spectrum) one to verify that I wasn't totally insane and the fish tank filter was making a super loud 60hz hum right where I put my head to sleep due to some weird resonace.  ", "But what about those people with electromagnetic hypersensitivity? Totally kidding.", "I was about to flip", "It's already affecting your mental health, so move out.", "The noise is a real issue, which is problematic. \n\nWe had a similar concern for our top floor office, above which was a mobile phone antenna array. We got some people in to record and assess EMF levels over time to quantify the emissions. \n\nThe results were inconclusive, but generally regarded as safe. EMF radiation of that type is *non-ionizing* radiation, meaning that there will be no electrons stripped of atoms or molecules with those atoms, leading to cell damage/breakdown or mutation. \n\nI believe that the conclusion was that there is generally more energy coming from sunlight over the course of the day than there is from cell towers - after all that energy is heating us - where the emissions from cell arrays do not.", "I work in RF everyday. RF is not the boogeyman that it’s often made out to be.  Unfortunately there is LOTS of pseudo science on this topic and lots of misinformation on the internet.  RF is non ionizing radiation. So it is relatively safe.  That being said: FCC and OSHA have exposure limits for a reason. \n\nIn theory, these antennas should comply with those regulations. In spite of this, people make mistakes.  Antennas are sometimes installed by people not properly trained. Or the knowledgeable engineers were never informed that there are people living / working that close to the antenna.  You want to know the SAR (specific absorption rate) of your physical location.  \n\nI don’t know how you verify that someone did the math.  It’s possible these antenna are completely safe and it’s possible you’re getting an unhealthy dose of RF.  depends on the engineering of the antenna. If you can get a name or manufacturer of the antenna, you may find out some of the engineering info from the manufacturer.\n\nThere are exposure sensors available.  They are worn by tower climbers, workers and first responders.  The sensor alarms when it’s exposed to an RF field that is not safe for humans.  \n\nThe largest risk is to eyes and temperature sensitive reproductive organs.  Eyes can develop glaucoma from extended exposure.  Men can go infertile. This is caused by heating the tissue from the RF.  The power is no where near the power of a microwave oven, but the basic theory is the same.", "Did you ever measure the noise level?", "Ask a Los Angeles County firefighter as a group went to court to not have them on top of their stations. Was a blip on the local television news.", "The ringing you are hearing is most likely an alarm inside the cabinet that hasn’t been addressed nothing to worry about. \n\nSource: telecom tech", "It sounds like one of your concerns is the location of the power equipment on the roof. there isn't any concern about that equipment. the containers for them are made to contain any electrical issues that could happen, and the transmission line is likewise not any threat. the antenna is facing away, and is of a frequency that isn't harmful to humans. you're good in the hood from an electromagnetic standpoint.", "Unless you’re sitting right infront of the antenna in the direction of signal you’re fine. They are super directional and you need to be almost right infront of it before a RF meter starts to move.", "The honest answer is *probably*. In the short to near term, yes. Long term? There hasn't been enough peer reviewed work done on the long term effects of consistent exposure to EM radiation to say for sure. I wouldn't tear my hair out over it, however. This applies to *all* wireless communication, including wifi internet.\n\nSome context facts:\n\n1. The IARC (a part of the WHO) has classified radio frequency emissions as [potentially carcinogenic](https://publications.iarc.fr/126) (mildly, if so. According to the WHO, [risk is extremely low](https://www.who.int/news-room/questions-and-answers/item/radiation-electromagnetic-fields)).\n2. As some have mentioned, your exposure levels will depend on the antenna's radiation cone and your distance to the tower.\n3. There are, in fact, federal and international regulations in place to minimize exposure to EM radiation and most people have nothing to worry about.", ">The IARC (a part of the WHO) has classified radio frequency emissions as potentially carcinogenic (mildly, if so).\n\nThis dosen't mean what you think it does. All this means if you cannot without any shred of doubt, empirically prove and pass peer review that it definitively does not cause cancer in any case at any distance or power.\n\nThis group (2B) contains things like caffeine, magnets, and Aloe Vera.\n\n>As some have mentioned, your exposure levels will depend on the antenna's radiation cone and your distance to the tower.\n\nYou forgot the main thing... THE ROOF!\n\n>There are, in fact, federal and international regulations in place to minimize exposure to EM radiation.\n\nTo telecommunications workers operating around equipment. The general public is never allowed within range of powered telecommunications equipment. They're on towers of a specific height above people for a reason. The lower the band, the higher the tower. The higher the transmit power, the higher the tower.\n\nIf they're on the roof of a building they're low power millimeter wave antennas.\n\nThe noise is the only thing that would even mildly inconvenience you.", "In that \"potentially carcinogenic\" is a label taken to mean that exposure may increase one's likelihood of contracting cancer. Its important to note that many items in everyday life fall in this category. It's not to say that exposure will for sure give you cancer. To the contrary, it means that, while the probability of any one individual getting cancer may be higher, *your* likelihood of contracting it remains low.", "What you are describing is just a carcinogen - something that can increase your chance of getting cancer.", "You're wrong. You're confident, but you're categorically wrong. 2A is likely carcinogenic. Thats the group you're talking about. 2B is the second lowest risk besides 4A - Not Carcinogenic.", "Yeah, buddy is illiterate lol.", "Yep!", ">In that everything can be assigned a score as to how carcinogenic it is.", "Where you don't want to be is directly in front of it. Your under it. You won't even get any benifits from it being there because your out of the cone. Usually one of the antenna transmits and the others receive", "Total power is 300 watts with 40 watt max RF power. A CB radio max 4 watt. A fm radio tower can be over 100 kilowatts. RF power perspective, IMO Bluetooth earbuds that left in for most of the day, every day is probably worse. \n\nThe bigger concern is actually the humming sound. The Fcc is very strict on the major frequency bands, but modern power supplies use fast switching to achieve a load target. This means that the hum can change frequency and can be missed on an rf power meter. So buy an rf power meter (it's like $50 from vevor) of your own and measure the output or a week. It will give you peace of mind that you're not slow cooking your brain.", "Its probably a 5g helium miner. (Crypto)", "Actually under the antenna would be the \"safest\" space as the waves are exiting the sides, if there would be anything to worry in the first place", "Move as soon as your lease is up. You wouldn’t have rented the apartment this way, so why continue?\n\nThe International Agency for Research on Cancer does consider RF waves more generally as potentially carcinogenic, so more research is needed. The FCC says there's no reason to believe that cell towers are a health hazard to nearby residents or students.", "> International Agency for Research on Cancer\n\nNote that they consider pretty much everything _potentially carcinogenic_ until proven otherwise, which is an even lower standard than the all-knowing State of California uses. I would take their pronouncements with a grain of salt.", "Being behind them is safe, you just don't want prolonged exposure right in front of them.", "I would move. I wouldn't risk cancer or a brain tumor.", "How’s your cell phone reception, eh? We probably all have 5G signal running thru our heads to some degree, while living in cities and suburbs.", "lol I live in 🇸🇬, where 5G reception and wireless connection is practically almost everywhere and anywhere. But tbf we are a tiny country. And no, I haven’t upgraded to using 5G mobile connection yet (I own an iPhone 15 📱and iPad Pro forgot which gen; obviously iP 15 is much newer).\n\nI’m doing fine. Yes, in my country, we have our own fair share of conspiracy theorists. But I’m just wondering — if there are those believe in some of the effects of 5G nonsense out there, then how are they still here in this country??!! 🤣", "Yeah sure 50 watts at 50mhz max exposure to non ionizing radiation so you are well within safe limits. I'd pop that whole unit off the wall and chuck it in a dumpster if I had kids in that place. Must have been the wind that picked up and took it off.\n\nIt's not lunatic conspiracy to not want your family exposed to anthropogenic sources of heavy metals, insecticides, micro plastics, and rf sources in excess of anything you'd find in nature. The problem being duty cycle and proximity.", "I know a guy who works on high power lines. People who live close to them have higher rates of cancer. I personally wouldn't want to live close to it. Better to be safe than sorry", "Link", "> People who live close to them have higher rates of cancer.\n\nIt's because power lines go through the poor areas. Rich people don't tolerate such \"eyesores\".", "This is like the chemtrails conspiracy theory, but with high voltage.", "I’ve never seen a study that indicated high power lines cause cancer. The most I’ve seen is people who live around power lines statistically have slightly elevated risk of cancer,^1 but then once you take into account where transmission lines are built (where the land is cheaper, which means people around them are poorer, and poorer people due to socioeconomic reasons have worse heath).\n\nMy guess? Some people think correlation equals causation.\n\n1 https://www.nature.com/articles/s41416-018-0097-7", "\"Incurable defect\" is apparently the real estate term. But any study worth publishing is going to control for that", "Also herbicides used to clear the right of way might be a factor.", ">y study worth publishing is going to control for that\n\nThey do. That's why it's only \"i know a guy\".", "I mean both of you developin tinnitus after they installed them, and they have a high pitch ring, honestly that doesn't sound like a coincidence to me. \n\nI would absolutely move when they were installing them, and sue if I didn't and developed tinnitus.\n\nRemember, studies that fail to prove a link between X and Y, don't prove there's not a link. I can't count the number of times someone claimed a link was disproven, when really the study showed there might be a link but it just didn't quite meet the needed p-value.", "woo-woo ^", "> mean both of you developin tinnitus\n\nIt's not tinnitus if it goes away when out of the house. It's capacitor whine from poorly insulated electronics.", "Op said they both developed tinnitus, and did not indicate it goes away when they leave the house, so I have no reason to believe they did not develop tinnitus.", "I would move just for peace of mind.\n\nStudies show mostly inconclusive for risk of cancer, but there are too many economical incentives to produce fake studies saying its safe.", "The vast majority of the RF energy is transmitted in front of the antenna so inside the building or even standing behind it on the roof is fine. I wouldn't go getting in front of it though.", "I would look into firefighters and their fight to keep them off firehouses \n\nhttps://mdsafetech.org/2019/09/28/firefighters-fighting-fires-and-now-cell-towers/?amp=1", "It looks like you shared an AMP link. These should load faster, but AMP is controversial because of [concerns over privacy and the Open Web](https://www.reddit.com/r/AmputatorBot/comments/ehrq3z/why_did_i_build_amputatorbot).\n\nMaybe check out **the canonical page** instead: **[https://mdsafetech.org/2019/09/28/firefighters-fighting-fires-and-now-cell-towers/](https://mdsafetech.org/2019/09/28/firefighters-fighting-fires-and-now-cell-towers/)**\n\n*****\n\n ^(I'm a bot | )[^(Why & About)](https://www.reddit.com/r/AmputatorBot/comments/ehrq3z/why_did_i_build_amputatorbot)^( | )[^(Summon: u/AmputatorBot)](https://www.reddit.com/r/AmputatorBot/comments/cchly3/you_can_now_summon_amputatorbot/)", "If your not going to move consider investing in a foil hat & cup!  Couldn't hurt... if mobile phone transmitters, clearly small in power output by comparison can cause cancer then i'd be concerned.  Of course the direction matters but even directional antenna bleed out in all directions... the power is going to be inverse to distance... so trying to be further way is good, maybe consider reorganizing your space so most of your time is spent with more distance between you and the antenna.... line your walls with Lead?  Personally I'd move; Why chance it especially when it seems like your dealing with noise issues as well.", "> Based on findings like these, a minimum safety distance of 1/4 mile (1320 feet) might be considered prudent.\nAnd again, individuals with EMF hypersensitivity or other serious health issues may want to consider a much greater safety distance, perhaps a half mile, or even more.\n\nhttps://emfcenter.com/what-distance-is-safe/#:~:text=Based%20on%20findings%20like%20these,half%20mile%2C%20or%20even%20more.\n\nhttps://www.sciencedirect.com/science/article/abs/pii/S0013935122011781", "The company that owns the antennae should be able to give you a hazard drawing showing the areas of concern around the antennae. It will show various views of the antennae with shaded areas of yellow and red on them. Yellow is areas that you're ok spending a working day in, red are areas that you shouldn't enter. Get the drawing and see what it shows?", "Move your desk away from there.\n\nThose antennas output a very large amount of power.  \n\nEven though it's not aimed at you the radiation  does spill around the antenna.\n\nBeing this close is akin to getting your brains slow cooked.\n\nYou will only know the damage many years in the future.\n\nIf you want scientific proof buy a houseplant and put it on your desk.  Keep us updated on what happens to it.", "\" I'm not a 5G conspiracy theorist\" \n\nNeither am I but I wouldn't want to be within shouting distance of one of those . Why risk it .", "Either you accept an evidence-based world view, or you don't.", "> Neither am I but\n\nYou and literally thousands of people out there, including OP - \"I'm not a conspiracy theorist, but\".\n\nIf there's a \"but\", then you are, in fact, buying into that stupid garbage. End of story.", "History is littered with so called \"safe\" things that turned out to be incredibly dangerous.  We were once told that smoking was safe , so was Thalidomide , Asbestos ( how did that turn out ? ) More recently Epilim . \n\nThats just from memory. \n\nSo no , I dont trust Humans to give me information that is 100% in my best interests and if given a choice I would stay well away from 5 G towers.", "You are confused.  Where do i suggest there is a conspiracy?", "> Where do i suggest there is a conspiracy?\n\nI know you don't understand. That's exactly what I'm saying.", "You dont know what you are saying . Is English your first language?", "From an EM perspective, and what you've been told, as long as you're not directly in front of the antennas you should be fine. However, if I was paranoid or expecting children I'd probably listen to that technician and move. \n\nSource: Worked on and designed aviation RF systems, and have friends who are 5G engineers\n\nEdit: Further explained in comment", "Is there math/science being your concerns, or some statistics, or a gut feeling?", "> Source: [...] have friends\n\nSuper-reliable. /s", "As I mentioned, from an electromagnetic perspective it should be fine. \n\nPatch antennas, like the one in the first pic, have a large symmetric ellipsoid radiation pattern propagating forward, but only a small one backward. If directly above or underneath, one can also be in a dead zone. (An array of antennas can make the EM field different and more complex tho). Energy also dissipates at 1/R^2 so the closer you are, the more energy is available. Also if that was a 5G system, it'll use really advanced techniques like beam forming and MIMO (and other stuff) to further optimize signal delivery to prevent wasted energy. \n\nSo being very near to the repeater, albeit from the rear, is unlikely to be harmful. (I'm only aware that immediate damage would be to your eyes since they're most sensitive to RF energy). But, if I was living there, was expecting kids, and had the means to, I'd still move out because I wouldn't take the chance.. because I get enough radiation from work already!", "Sorry I was asking why the concern for the unborn (and I guess now also the eyes). Is it something you learned about, found about, or just a gut feeling you have.\n\nThere’s nothing inherently wrong with having a gut feeling. Some things are just hard to explain.", ">ask for them to be removed if possible.\n\nHahahahahahahaha", "You’re gonna have some nasty headaches, potentially nausea, and probably think you have tinitus \n\nThey make an amazing amount of noise too.", "Why would they feel that way?", "Expect some headaches…I moved because I was 200ft away but man that doesn’t look legal", "Sorry if this is the wrong subreddit to ask this, but I figured this sub would have a good idea how to answer my question. I’ve tried googling for the answer but I can’t find a clear answer, just conflicting articles.\n\nI’m looking to get a ceiling fan installed in my living room in my apartment and I’m not sure what type of fan is best, a straight blade or a curved blade fan. These are the two options I’m looking at:\n\n-straight blade: https://kendallighting.com/fans/ac24144-sn-sn/\n\n-curved blade: https://kendallighting.com/fans/ac19544l-sn/\n\nIs there any advantage or benefit to having curved blades or is it purely aesthetic?", "According to the spec sheets, the curved one has higher airflow on high.", "I have units with fans with ECM 0-10V modulating motors in stock. The power supply is line voltage.\n\nClient has a retrofit project where they are using 24V on/off signal with no modulation.\n\nThis should work right? The fan will receive a 24V signal and read it as high and turn on at full speed?", "Hi, I'm ESL and I wonder how this type of locking mechanism is called. It is rotating shaft(bolt) with cut that rotated locks/unlocks two parts together.\nlocked:\n\nhttps://i.imgur.com/Xnn0Zdg.jpeg\n\nopen:\n\nhttps://i.imgur.com/nPt8XNq.jpeg", "Have you ever seen an Iceberg flip over? [Iceberg flipping over](https://www.youtube.com/watch?v=x-fyPPfyofY)\n\nI want to create a foam sculpture that slowly, roughly over the course of 30 minutes in full sun, changes its center of mass enough to flip over to one side, then return back to the first orientation. I was thinking of a linear actuator that moves a weight back and forth over the center of gravity. \n\nface up on each side is a small 6w 9\"x7\" solar panel that charges a capacitor that would then discharge and incrementally over time move the actuator to one side or the other depending on which side of the \"iceberg\" is up. \n\nCan a small solar panel and capacitor setup move the actuator slowly over time, in bursts as I envision?\n\nAlternately I was thinking about a stepper with a heavy offset weight attached that moves by a few degrees when the capacitor is full, but I worry this will need a controller and batteries and i want it to be totally solar powered... maybe panel charges a battery and when full turns on controller to move til it dies and recharges?\n\nAny thoughts on how I could move a weight with small solar panels enough to change the orientation of a floating sculpture?\n\nthanks\n\n&#x200B;", "Hi there,\n\nI live at a pre-war, 5th floor apartment in NYC. I am considering buying a \"soundproof\" booth to practice singing and playing (see [whisperroom.com](https://whisperroom.com)). The catch is that the booth weights 600lbs. \n\nI've read that bedrooms in the US have a min load capacity of 30psf. My bedroom is 300sqft, so that gives it a total capacity of 9000lbs. The base of the booth is 16sqft, so it produces 37.5psf (or 50psf with me inside). \n\nI am not sure how to make sense of these two numbers. While it looks like the room is big enough to support the weight, the base of the booth might be too small for its weight. Can anyone advice? Do I need to hire a structural engineer? I've messaged the landlord, but he said he doesn't really know. \n\nthanks!", "600lbs sounds like a lot but it’s really just two really big guys on a couch\nJust don’t throw a party in there", ">the extra weight that makes these booths better than a closet in the first place\n\nRight, the thing that worries me is that this weight will be always there. I wouldn't have two fat people constantly standing in my bedroom 😅", "Or a cast iron bathtub with 30 gallons of water in it.  I'm sure a pre-war apartment has or had that at some point.", "Instead of fat people, think of a bathtub, fish tank or fireplace hearth. It's perfectly fine.", "Static weight basically doesn’t exist compared to dynamic weight", ">I wouldn't have two fat people constantly standing in my bedroom\n\nSounds like the start of a good time.", "working out the weight of 30 gallons of water in pounds vs 120l in kgs...", "Fish tank is a terrible example if you just go buy the janky stands that people sometimes build on /r/aquariums. People really have no idea how heavy fish tanks get.", "I don’t like at least two of your examples, as they’re generally attached to the structure/designed for. Bathrooms are built for a bath tub.", "This is an accurate answer, I'm sure.  (Disclaimer: I'm not a civil or structural engineer; I'm not a building inspector or contractor; I claim no special qualifications or certifications.  I'm just another guy on the internet.)\n\nBut I do know things, and I know the extent of my knowledge.  So I am \"as certain as houses\" that /u/MountainDewFountain has provided an accurate response.  I'd be satisfied.  (I had already made up my own mind in agreement, and that was a useful analogy.)\n\nBut the OP may not be so sanguine, in which case a professional engineer should be consulted on a professional basis.  Don't just take advice from some randos on reddit (great name for a band, BTW), even if they are right.  And don't expect the landlord to be any more qualified to answer than the RoR.", "[removed]", "I'd rather not think of fat people either. ", "Except in terms of deflection of timber sections where the longer the duration of the load, the bigger the creep deflection will be.", "Are you telling me my fancy Ikea particle board bookshelf wont work?", "Ok, fair, but its just to illustrate heavy loads that no one even worries about. Other examples are water bed and pool table.", "Your comment has been removed for violating comment rule 3:\n\n> Be substantive. AskEngineers is a serious discussion-based subreddit with a focus on evidence and logic. We do not allow unsubstantiated opinions on engineering topics, low effort one-liner comments, memes, off-topic replies, or pejorative name-calling. Limit the use of engineering jokes.", "It will totally work, especially after it gets wet. That's when the particle board's strength really shines. You can see the muscles bulging as it gets stronger.", "Just because problem doesn’t worry about it doesn’t mean it can’t be a problem. I’m a piano player. A typical grand is 600-1000lbs. It’s a legitimate concern that’s talked about, it can cause floors to sag over time. It’s generally not advised to have one above the ground floor of a building that isn’t very well built.", "My dad was in college when water beds came out. Everyone rushed out to get one and the dorm ended up having structural issues because it was not designed for an extra 1500 lbs per room. The university pretty quickly banned them.", "You got me so far down the rabbit hole that I reread both the 1899 and 1938 NYC Building Code. TL;DR, relax. \n\nIn 1899, apartments would have been required to support 60psf, and from 1938 to modern day, they would have been required to support 40psf.", "There's a legitimate 1899 building code? Damn, I would have guessed they'd be winging it back then.", "While it would have been over constructed 80-90 years ago, I would also get a little heartburn wondering if any of the materials degraded over the decades.\n\nThat said this is easily made trivial by just putting the thing onto a 4'x8' sheet of plywood and cutting the pressure in half.", "Yep! [Link for the curious](https://archive.org/details/cu31924090411772)", "600lbs across what footprint? Like someone else said, it's like three big guys standing on a point in the condo. What's the footprint like? It doesn't raise crazy flags to me but then again I'm missing lots of info.", ">baffles and wire races having multiple layers, another 300 pounds doesn't seem outrageous.\n\nIt is 16sqft the base of the booth (4x4)", "That's 37.5lbs per square foot. That's like an eighth of the floor pressure of just standing. You're fine on that front, it's a pretty big footprint.", "If he was super worried you could easily build a large platform to distribute the weight over a larger area. I don’t think it’s necessary though.", "I hate analogies like this. One person doesn’t stand in the exact same spot for years or decades without moving.", "It's not perfect, of course, but floor pressure won't be an issue. It's not technically correct, sure, but it's correct enough with a large enough safety margin it's worth explaining it that way to a layman IMO.", "I agree, there's also a difference between minimum area load and point load requirements.", "Floors are designed for loads that last a decade or more.", "The issue isn’t immediate failure, but long term deformation.", "Yes, then *cite the building* code, doesn't just say \"two fat people hurr durr\". This is an engineering sub, we're better than that.", "Older apartment blocks are likely steel and concrete framed. It'll fail due to creep eventually, sure, but it's probably not significant enough to care about. We can't say for sure without knowing more about the exact structure of the building.", "What? Go look up the duration of live loading. It’s 10 years. Took 2 seconds on Google for me just now.", "600lb is not that much, think of it as four 150lb friends standing next to each other, or just 3 fat friends, or 2 really fat ones.", "Or one really really fat one", "Let's see how many chubby swingers we can pack in there.\n\nYou'll be fine.", "Funny, I was going to refer to it as a cuddle puddle of friends.", "Well I'm just glad to see we have avoided the low-hanging fruit that is a \"your mom\" joke. \n\nWe're changing as a society and I'm happy to witness it. \n\n/s", "Is 200 pounds fat?", "This might make a good test. Just have them walk around and see what the floor does. But I would probably also want to inspect the floors structure on top of that.", "Or like 60 babies stacked on top of each other.", "> Americans refusing to use the metric system be like", "That's really considerate of  you!\n\nWith you in it, that's 700+ lbs on 16ft^(2)?  You're probably fine, but I can see why you're worried.  Pre-war NYC buildings tend to have sagged over time, and will be strongest against an extierior wall. \n\nIf you're in one of the [classic NY walk-ups](https://www.nyc.gov/assets/planning/download/pdf/plans-studies/retrofitting-buildings/retrofitting_chapter4_mid_rise_walkup.pdf), the joists will run sideways, parallel to the front of the building.  If you can figure out where the joists are (they're often visible as a kind of speed bump in the floorboards), make sure to put the booth so it sits on three of them.  Or, if you're really worried, get a pair of 6' 2x4s, lay them across the joists (so front-to-back), and put the booth on them, that'll spread the weight out more.  But, again, you're probably fine with this.\n\nAnd not to butt-in, but followed the link. Are they really charging $6k for a 4x4 MDF box? That feels excessive.", "Thanks! And yes, it's over $6k for the booth. I've tested them at a guitar center (they use it for lessons). It's obviously not perfectly soundproof, but it's effective enough that I don't think people in a different room will be able to hear me. It's definitely expensive, but there are not really any cheaper options. The alternative is to build it yourself, which I am not capable of. Its the price of my partners peace of mind & me being able to practice a couple hours a day whenever I feel like.", "For sure, if it lets you live the way you want, it's worth it!  \n\nIf I still lived in NY and was under-employed though, I'd offer to build a real soundproof booth for about half that.", "I think you are fine.\n\nIf you want you could spread the weight out over more area.  In your floor there are joists (boards that support the floor).  If you buy 2 boards, 4 in by 4 in and 8 feet long (or longer) and put them perpendicular to the joists, and then put your booth on top of the 4\" by 4\"s you will be safer. \n\nBut I really don't think it is necessary....and you would have to figure out which way the joists are going when you can't see them.  Also then where these boards extend past the booth on the floor you will have trip hazards you'll have to deal with.", "How...do you plan on getting it there is what I want to know. Do NYC apartments have freight elevators?", "It's a modular booth. It comes in pieces and it is relatively easy to build / unmount", "What the hell is the booth made of that it's 600lbs and only 4 x 4ft?\n\nI have so many questions. Why don't you convert a closet into a soundproof room and get a clothes rack to put in your room?\n\nYour calculations are correct and there's no way to know the limiting factor or how to get around the min load capacity. My suggestion would be to find another solution.", "It doesn't seem all that surprising to me. A 3/4 plywood box at 4x4x8 would weigh about 300 pounds. Depending on the sound-deadening materials used (MLV, foam, and fabric?), the venting baffles and wire races having multiple layers, another 300 pounds doesn't seem outrageous. \n\nIt's partly the extra weight that makes these booths better than a closet in the first place.", "I'll take your word for it, I suppose I would design the structure not to be for sound insulation and then add the sound insulation on top of it.\n\nSeems like the benefit of something like this over a sound proof closet or room would be negligible?", "> Seems like the benefit of something like this over a sound proof closet or room would be negligible?\n\nThe benefit is mostly that it's pre-designed, and you can put it together on-site with simple tools. If you are willing to do major construction, you can soundproof a room to an equal or better standard than these booths. But what you end up doing is essentially building a room within a room, disconnecting the floor from the actual floor, and the walls from the actual walls.\n\nAnd maybe you don't *need* that level of sound isolation, but as someone who's \"soundproofed\" a closet in the middle of a suburban home for a recording studio, as far away as possible from any noise sources, you might be surprised how difficult it is to keep sound out/in, especially without roasting the person inside.\n\nJust sticking a bunch of egg-crate foam on the walls will do approximately nothing to reduce the sound of airliners flying overhead, for instance, though it makes the room sound remarkably \"dead\" from the inside.", "The idea is to decouple the vibrations of the room from the floor. I’d bet good money there’s some sort of elastomeric under the feet/base.", "Hate to say it, but this looks like kind of a scam. It's just a 1\" MDF box with some acoustic foam, not even enough foam to entirely cover it. Mass is mass, but there's no real decoupling. A real soundproof wall would do a lot better.\n\nIt does have the value add of a door and ventilation, but still.", "If you read the site, the floors have heavy rubber insulation. That’s gonna provide a lot of decoupling. The smaller models appear to have w feet to decouple the floor almost entirely. They even have an add on caster base that lets you wheel the whole thing around intact.", "Cool, that's much better. I only looked at the spec sheet for the 4x4, it doesn't mention any of that stuff. Or use the term \"dB\" anywhere.", "You don't really need the walls to be structural.  If you're fairly handy you could make one quite a bit lighter than 600lbs.  Build a frame for the corners/edges of each wall from 2x2 lumber.  Cover the outside, including the top and bottom, with the 2\" pink insulation foam.  Line the inside walls/door/ceiling and floor with the sound deadening material of your choice.\n\nDepending on your singing voice, you CAN tailor the dampening material(s) to target mostly that range.", "I mean if you are really worried about the weight, put it in a corner against 2 walls. That should minimize the load on the beams under the floor. But 600lbs isn’t that much, there are people that weigh more than that and have smaller footprints.", "You can look for a certificate of occupancy online for your location at oasisnyc.net. Often buildings in NYC have much higher live load capacity than current code requires. Generally 600 lb spread over 4x4 area doesn’t seem crazy to me.", "Not an engineer, but could you lay a series of 4x4 s that extend about 3 ft past the edges of something like this to spread the weight out over a larger area; perhaps engaging more floor joists if run the opposite direction?", "You need to find out the structure of your floorboards.  Example, do you have floorboards or is it concrete with sheet supports, do the boards run longitudinal or latitudinal?\n\nIdeally, you want to spread the weight across as many boards as possible and place the majority of the weight near the joists....but you won't know the direction of the floorboards without the blueprints.....but maybe you'll get lucky if you use a stud finder on your ceiling and hope they run the same way on your floor.\n\nI'm not going to take responsibility if you screw this up and cause some damage as I'm telling you outright to ask your landlord or as a licensed structural engineer.", "Structural engineer here - If you want to be on the safer side, avoid putting the booth in the middle of the room as this will put the max bending moment on the floor beams. The max bending moment is one of the governing factors in designing beams. If you put the booth closer to one wall or even in the corner, the forces (shear stresses) are approximately the same as they would be if the booth were in the middle but the individual beams do less bending (lower bending moments and the beam will deflect less).", "Your neighbors are going to think you’re a serial killer.", "To simply answer your question contact a structural engineer.", "Think of all the fat people fucking in NYC. And its all on 4 small feet.  And not a static weight.\n\nSomething like this, with the load spread should be perfectly fine.", "600 pounds isn’t that much, it’s like two guys on a couch. It’ll be fine.", "That's just 2 big guys spread out over way more area than 2 pairs of shoes. You're good", " Not an issue. The world’s smallest person has a larger psf than 37.5", "Prepare to find your self in the apartment downstairs.", "Now I want one of these just to sleep in, chill in, and study\n\nApartment living sucks", "https://imgur.com/wGjETkZ\n\nWhat would be the correct definition for these angles?\n\nI’m not finding the right terms to define the structures, specifically how they interact with each other. I am a bartender by trade, so they are objects I interact with and find myself explaining enough that I’d like to be more precise.\n\nThe closest thing I’ve found seems to be the angles involved with flight, Angle of Incidence, being fixed based on construction, and Angle of Attack, as it is a combination of the construction and relative to orientation.\n\nObviously I have no idea what I’m looking for or talking about. Help!", "Draft angle", "Thank you! \n\nI’m the case of the blue angle, that’s the draft angles combined(?) as to create a maximized point of leverage?", "It’s not the sum of the draft angles unless the top cup is straight vertical. In your drawing it’s tilted. \n\nIt’s not to create leverage, it’s to create an opening so you can pour. That angle is variable.", "Is it possible we've been looking at superconducting electronics from the wrong angle? Would it be easier to achieve a very small, low-energy cooling system to keep superconductors cold?", "Micro compressors would be difficult.the issue with miniaturization is the tolerances are tighter and more difficult to reliably achieve for mass scale. And then energy consumed in cooling would outweigh the energy saved from the super conductivity.", "In addition to the general problem of miniaturisation, the compressor always needs to compress. With a phase change that's easily a factor of several 100 in volume. No matter if you do that in steps or at once, that takes room", "Especially considering the fact you've already got superconductors around that may make this far easier, how hard would it be to make a magnetohydrodynamic compressor at a very small scale? That, and potentially thermoacoustics are the only ways I can think to make a compressor without moving parts.", "Why not? But cryostats are not a small things and I simply don't understand what are you going to use superconductor in a small rig for?\nSmallest system, capable of htsc we made 20 years ago was  300mm diameter and 600mm height + compressor 400x400x600. It cooled down an object with a size of a CPU with a typical cpu heat load. A bit less powerful compressor for sensor cooling (3-4W of heat) would be 150x150x400. But cryostat will not change a lot.", "Problem of scale to have like, helium coolant compressors in a tiny cable. Better just to pump the helium from a central place...", "There is another very clever approach to room-temperature superconductivity that most physicists aren't aware of. \n\nMost people have been trying to increase the critical superconducting temperature of the material. \n\nThis paper presents the strategy of reducing the temperature of the room: https://arxiv.org/ftp/arxiv/papers/2003/2003.14321.pdf\n\nIf your room is only 60K, there are many room-temperature superconductors. \n\n😄😄😅😅 /joke", "I just learned about miassite yesterday, will be awesome if it lives up to the hype.", "I'm looking for a way to retain a bulky item against some battery contacts when charging.  \n\n\nI've made a prototype with a snug fit, but the rubber on the product rubs and wears, so that's not a good look.\n\nI thought about a cam on a servo, but that's a lot of complexity for \"I want to shove this in and have it stay, then pull it out again\"\n\n&#x200B;\n\nIn my head I see a piece of spring steel as a curved ribbon, and it's got one bulge in it. As I push in the pack, the bulge first moves towards the back, then the ribbon flexes and causes the bulge to move towards the front, pushing against the device.\n\nPulling out the device allows the bulge to travel forward, helping release the unit.\n\n&#x200B;\n\nI have no idea what to search for when looking for this... thing. Any ideas?\n\n&#x200B;", "Your description isn't helping me, is a \"leaf spring battery contact\" in the right realm?", "Leaf spring compliant mechanism similar to screen window tension spring gets close, but it pushes on a device, not just the battery contacts. Looks like I’ll have to either add a leaf spring for holding or do a ball spring plunger arrangement.", "Depending on the exact use, you are probably better splitting these 2 requirements into 2 separate pieces. Good battery connections are hard enough to maintain over time without adding a strength/holding requirement to them. One other idea is adding a detent where the leaf springs contact your battery pack", "Like this, but fewer goats: [https://www.youtube.com/watch?v=58-atNakMWw](https://www.youtube.com/watch?v=58-atNakMWw)  \nA leaf spring that can hold something in place.", "Tension spring.", "Most tension springs I'm seeing are cylindrical, not a ribbon. Is there a modifier word you'd search with?", "Yes, most are cilindres. But some are like a flat ribbon, maybe window screen tension spring or spring clips. I know for sure those are flat ribbons. It is used to keep things tight.", "A wedge? \n\nOr tight fit with rubber rollers.", "I have these filtration units that filter out air…\nIf I want to increase suction power, then I would increase the diameter of the hose but keep hose length the same? Larger hose, less resistance and friction, more suction power?\n\nIf I want to reduce it, I would increase hose length but keep the diameter the same? From what I’ve read, longer hoses increase friction and resistance leading to less suction \n", "Depends on the magnitude that you’re looking to increase the suction by. You want to make it 5% more powerful? Decreasing the friction loss using the methods you described might work. You want to double or triple your suction power? Get a new fan.\n\nIt also depends on the current conditions. If your hose is only a few feet, decreasing the length isnt gonna help much, if your hose is a few hundred feet, decreasing the length might help a bunch. If your hose diameter is already large, increasing it some more probably wont help, but if your hose is the size of a straw, increasing it will help a ton!", "Hey guys! I’m working on a project and need something to function as a small/fast half inch push pull. I’ve tried a 12v actuator but it’s just too slow for my needs. Something quick (like the speed of a car locking mechanism) is what I need, as well as being as small as possible since I will be hiding it in a diorama. Any help would be awesome, I know there must be something! It doesn’t need to be strong, it will be moving very little weight. ", ">I’ve tried a 12v actuator but it’s just too slow for my needs. Something quick (like the speed of a car locking mechanism) is what I need,\n\nA central locking mechanism in car is a 12V actuator...\n\n They're a decent choice because millions are made so they're cheap, widely available and usually reliable.", "Try a different 12v actuator. You know..... Like a car lock actuator", "Push-pull solenoid, or a  Servo motor with a push rod. ", "https://www.amazon.com/dp/B0BDRFB7XK/ref=sspa_dk_detail_0?psc=1&pd_rd_i=B0BDRFB7XK&pd_rd_w=yZhHG&content-id=amzn1.sym.f734d1a2-0bf9-4a26-ad34-2e1b969a5a75&pf_rd_p=f734d1a2-0bf9-4a26-ad34-2e1b969a5a75&pf_rd_r=F355HJ3WT97CKBF1H6HK&pd_rd_wg=1t6Eb&pd_rd_r=ec0e2114-5266-471c-80f6-0b6c0f5b2312&s=industrial&sp_csd=d2lkZ2V0TmFtZT1zcF9kZXRhaWw", "I'm making a 6 bar linkage for a hinge of a solar car, and was wondering how to analyze and simulate springs as links to have the hinge stop as positions. I've been using linkage and motiongen for the last couple months and don't think they can perform the simulations I'm looking for. I've heard MSC Adams and Altair are good, but what software would be best for this goal of mine?", "I recently learned that the NRTL our company has used for our past several products is not \"recognized\" by OSHA to test to that product safety test standard. We have sold thousands of these units and they are installed all over the US. We are a small company in the energy industry producing electrical equipment.\n\nAccording to ChatGPT:\n\n> If an OSHA Nationally Recognized Testing Laboratory (NRTL) were to test a product outside the scope of their recognition or expertise, it could lead to several consequences:\n\n>   Invalid Certification: The certification issued by the NRTL for that product would likely be considered invalid or not recognized by OSHA and other regulatory bodies. This could result in the product not meeting safety standards required for use in certain industries or environments.\n\n>  Regulatory Non-Compliance: Using an invalid certification for a product can lead to regulatory non-compliance, which may result in penalties, fines, or legal consequences for the manufacturer or seller of the product.\n\n>  Risk to Safety: Testing a product outside of an NRTL's recognized scope could compromise safety standards. If the product is not adequately tested and certified according to relevant safety requirements, it could pose risks to users, workers, or the environment.\n\n> Loss of Reputation: For the NRTL itself, testing products outside of their recognized scope can damage their reputation and credibility. Stakeholders may lose trust in their testing and certification processes, impacting their ability to attract clients and maintain their status as a recognized testing laboratory.\n\n> In summary, it's crucial for manufacturers and NRTLs to ensure that products are tested and certified within the NRTL's recognized scope and expertise to avoid legal, safety, and reputational issues.\n\nI have not taken this to anyone in the company because I feel the need to understand the ramifications before raising the alarm.\n\nI did go to the OSHA website on the subject and verified that the lab we use is not recognized for the test they have authorized us to mark. \n\nIs there some workaround on the subject that I might be overlooking?\n\nEDIT: WTF is up with the downvotes? I think this is a valid topic to, you know, Ask Engineers.", "Ignore anything ChatGPT says and talk to an actual, thinking, compliance engineer and/or your corporate counsel.", "Yeah, I know ChatGPT is not to be relied on, I was using it as a starting point and hoping someone with more experience can chime in and let me know if it is completely incorrect. \n\nI tried searching the OSHA FAQ (assumed that is where Chatner got its info) but no luck yet.", "Bro I think government websites are deliberately designed for minimal readability. The OSHA website is a nightmare.", "Probably best to bring this up to whatever relevant department handles this sort of thing. More than likely it’s a clerical error, but your compliance or quality department should be able to run everything down quickly enough.", "We are so small that there is no compliance or quality department and I was privy to discussions about the testing. \n\nI have the ATM (Authorization to Mark) documents from the NRTL stating what they tested to and I can see that they are not recognized to test to the standard. \n\nDefinitely not a clerical error, at least on our side. Perhaps the OSHA website is incorrect.", "Can you request documentation from your lab on their accreditation?", "That would be the next step if you don’t have a department for that. Just telling them straight up “Hey, I see you’re not listed on OSHA’s website as Authorized for this testing you’ve provided us. Can you supply some documentation to the contrary?” They should be able to provide something, or will go very quiet and start communicating only through lawyers. \n\nIt’s likely that ChatGPT missed some critical verbiage about when testing is actually required, and that you’re in the clear, but better safe than sorry. In my line of work this sort of testing is only required when seeking initial approval for a product, and so long as my QMS covers ongoing testing and continues to pass audits successfully the NRTL testing only applies to the initial approval process.", "1. It is not worth reading what ChatGPT has to say about it, I used those responses for reddit comments and got burned badly, so I don't think it stands up even enough to write a comment on Reddit, nevermind understanding the ramifications.\n2. You need to understand what the actual OSHA requirement is, you didn't include that. Where does it say they are not certified and they have to be certified?\n3. Does the NRTL believe they are certified? Did they give you a certificate saying they are certified?\n\nGovernment laws and regulations tend to have exceptions that may be buried through too many layers of legalese for you to find, something missing from the list of approved things doesn't mean the list it accurate or complete, it doesn't mean they have to be on the list, and it doesn't mean they are not approved. Maybe they were approved, but it hasn't been updated, or they are grandfathered under some clause, or they approved it under a different, equivalent standard that is recognized by OSHA.\n\nThe point is, there are a lot of things you might be overlooking, but we'd need the name of the NRTL and the standard, and why you think OSHA doesn't recognize it, which I assume you can't provide, so you should probably have your legal people look into it.", "* Heard and understood, but that is where I started and so far no one has replied that Chatner is incorrect.\n* Here is what OSHA states on their website:\n\n> OSHA's Nationally Recognized Testing Laboratory (NRTL) Program\nrecognizes private sector organizations to perform certification for certain products to ensure that they meet the requirements of both the construction and general industry OSHA electrical standards. Each NRTL has a scope of test standards that they are recognized for, and each NRTL uses its own unique registered certification mark(s) to designate product conformance to the applicable product safety test standards. After certifying a product, the NRTL authorizes the manufacturer to apply a registered certification mark to the product. If the certification is done under the NRTL program, this mark signifies that the NRTL tested and certified the product, and that the product complies with the requirements of one or more appropriate product safety test standards.\n\n* Yes, we have the ATM (Authorization to Mark) documents from the NRTL stating what they tested to and I can see that they are not recognized to test to the standard on the OSHA website.\n\n* I am not comfortable stating the standard, since our industry is small enough that (assuming my understanding is correct) it would not take long to figure out our company name.", "I'd point out that the block of text doesn't say you have to use only NRTL stuff, which is kind of what I'm getting at. OSHA approved NRTLs likely provide automatic/implied OSHA approval via their certification. But if the underlying requirement is to comply with the standard, then it's essentially at your risk that it complies. The [OSHA FAQ](https://www.osha.gov/nationally-recognized-testing-laboratory-program/frequently-asked-questions#employers_regulators) lists this question for example:\n\n> **Does OSHA have alternatives to NRTL \"approval\" of products?**\n> An NRTL must, with limited exception, certify products requiring \"approval\" by OSHA standards. For example, the OSHA standards addressing electrical hazards (subpart S of 29 CFR Part 1910) define the term \"approved\" as acceptable to the Assistant Secretary of Labor for Occupational Safety and Health, and provide that equipment is acceptable to the Assistant Secretary of Labor:\n\n> If it is accepted, or certified, or listed, or labeled, or otherwise determined to be safe by a nationally recognized testing laboratory recognized pursuant to § 1910.7; or\n> With respect to an installation or equipment of a kind that no nationally recognized testing laboratory accepts, certifies, lists, labels, or determines to be safe, if it is inspected or tested by another Federal agency, or by a State, municipal, or other local authority responsible for enforcing occupational safety provisions of the National Electrical Code, and found in compliance with the provisions of the National Electrical Code as applied in this subpart; or\n> With respect to custom-made equipment or related installations that are designed, fabricated for, and intended for use by a particular customer, if it is determined to be safe for its intended use by its manufacturer on the basis of test data which the employer keeps and makes available for inspection to the Assistant Secretary and his authorized representatives.\n\nNote, that specific for stuff that needs to comply with that specific law (electrical safety), but they point out that it isn't actually required, the local government has the authority to approve it anyways which could mean it could be approved for use by your local inspector if they see the mark of an NRTL they are comfortable accepting. Likewise, for one off stuff, the company is allowed to do their own testing (such as send it off to the lab or their choice, such as their own lab, or whatever), and that go with that.\n\nNRTLs are there to reduce the paperwork basically, you use them, and their results are just considered \"good\" by law and their mark is automatically sufficient evidence. It's not however the only way to go about it, though if you don't use them, you may need a lot more stuff to sign off on it it's use (like showing the test results to the person inspecting it). The liability for a company would depends on what happened, did a company have someone deny some approval? Did they have damages that they want to sue you for? Did you say it's approved by OSHA, or did you say it's approved by the NRTL (which did say that?). If you didn't deceive your customers, it might not result in actual damage. And there may be alternative ways to get approval anyways (like showing test results from a non-approved lab).\n\nYou really do need to dig into the actual regulations, and determine what is actually required, and what's the actual approval requirements. Do not believe the OSHA website as the source of truth (the actual source of truth is federalregister.gov ).\n\nAnd yea, I understand you can't provide details, but without them we can't check the requirements.", "This is great, thanks. \n\nWhat I take from this is that even if the NRTL is not recognized for the specific test, if they performed it and were comfortable enough with the results and allowed us to use their mark, that is good enough. \n\nThere seems to be no legal requirement to use a recognized NRTL and as long as the local AHJ (electrical inspectors) accept the certification mark as evidence of meeting NEC code, that is good enough.", "It depends on what your product is. Certain products/categories legally require recognized NRTL approval. If you do not make a product which is on those lists, then using a NRTL is a \"best practice\", but ultimately only concerns liability not legality (your company is liable for flawed results from your test lab, so using a \"lesser\" lab might increase liability for flawed results, etc). The NRTL approval gives a reasonable basis for your company to presume the results are accurate representations. \n\n&#x200B;\n\nThere are 37 products/categories legally requiring NTRL approval.\n\n[https://www.osha.gov/nationally-recognized-testing-laboratory-program/products-requiring-approval](https://www.osha.gov/nationally-recognized-testing-laboratory-program/products-requiring-approval)", "I mean no matter what it's almost universally worse to not report it. Everyone with a decent compliance program will have ways to remediate this kindof thing. And usually a pretty decent insurance policy.\n\nEither way it's definitely above your pay grade, report it up and let the execs and lawyers handle it. Making a mistake can be argued against because mistakes happen, but if there are consequences the prime target for everyone is going to be whoever hid info.", "I am not an expert on this topic, nor am I a lawyer/work in safety compliance, but I would be surprised if there was a legal requirement to use an officially recognized NRTL. I would be even more surprised if there was a legal consequence for not using one.\n\nI can certainly tell you that using an officially recognized NRTL would NOT shield you from litigation if your product harmed someone.", "Won't save you from getting sued, but it does save employees from criminal negligence due to the effort put in testing and certification. Reasonable effort and proven intentions to produce safe product goes a long way in the court.", "Whether it's your job or not, hiding such information is negligence on your part which is a criminal conduct if it ends up in the court of law.  \n\nIn any case it's the onus of the manufacturer to comply to all applicable standards. Using OSHA certified lab to test your product helps in a way that you don't need to know all the standards required for conformance for a particular product. The lab will find them all and test them. \n\nYou can do your tests in a non OSHA certified NRTL lab, if you order tests you want done. They will be valid and will say that it complies the standard you asked to be tested for. But you may miss some required standards though, that you didn't even know they exist.", "I'm working on a project which is a camera casing but I need it to go up and down from about 20mm to 200mm instead of being fixed like in the image, this will be 3D printed and I need it to be compact (these legs are 10mm wide), I can ditch one side and just have 1 supporting leg if it makes it easier. I'd also like it to be telescopic if possible.  \nI don't even know where to start, I'm an electronics guy so mechanisms are completely new to me so I apologize for my ignorance.  \nAny help would be really appreciated  \nThanks so much\n\n&#x200B;\n\nhttps://ibb.co/wgKfrmY", "Not enough info. What are you trying to achieve? \n\nDoes it need to move continuously? Powered? Controlled manually? Precision requirements? \n\nIt could be as simple as a couple slots in a plate and tee nuts. A scissor mechanism, rails, basically anything.", "Thanks for the reply, just a simple manual controlled system, once it's stable and can be designed and 3D printed easily with food longevity\n\nWhat would you recommend?", "Still not enough info. Think about what you want it to do. How would you recognize a good solution? I am guessing that you want to be able to manually adjust the height of the camera - is that right? Do you want pan and tilt, too? Why not just buy a small tripod?\nHow big is your camera? Do you need continuous adjustment or are specific stops ok? How many of these are you planning on making?", "Slots in a plate is the simplest I can think of. What accuracy and precision do you need?", "I simple want to press a button on one of the sides and then be able to pull the camera up or down.\nI don't need pan and tilt. This is going to be integrated into an enclosure so a tripod wouldn't work. My camera is 100x50x60mm.\nI'm going to 3d print one but it's part of a major project that could possibly hit mass production.\n\nThanks", "Brilliant thanks so much", "Great, can you elaborate on how this system works?\n\nI'm not sure what accuracy and precision I need because I don't understand the mechanism", "For laser welded plastic parts with dissimilar CTEs, are there any heuristics or rules of thumb for when differential thermal expansion is expected to become a problem?", "Youll probably need a thermal sim because itll depend on your wattage, travel speed, thermal cond, etc before even CTE kicks in\n\nYou probably have a melting point for your plastics as a baseline but youll need the sim to tell you the temps at your weld penetration level", "Thanks for you response! I realize that a CTE mismatch plus heat affected area could cause complex frozen-in stress after the weld. But even if there's no stress after the weld, if the overall temperature of the part is changed after welding, e.g. by going from room temperature to -20 C, that will put stress on the weld. Without building a thermal sim, is there a way to ballpark whether or not this will be an issue?", "Initial shrinkage would not be problem as there will be cold flow in the weld mix, and the weld mix would have average CTE of the two materials. \n\n\n> But even if there's no stress after the weld, if the overall temperature of the part is changed after welding, e.g. by going from room temperature to -20 C, that will put stress on the weld. \n\nIf you expect high cycling temperature, and frequency, then welding dissimilar plastics should not be considered. A flexible adhesive bonded joint should be used. \n\n\nThere is no rule of thumb. \n\nBut you can calculate expansion of the total length of each material, given the temperature change, in their free state before welding, and come up with the total differential. Then you will compare the part in tension to its tensile stress curve and see where it is, elastic, plastic or failure range. It's got to be in the elastic range if you don't want fatigue failure. And (rule of thumb) not exceeding 3/4 of the yield strength.", "I'm familiar with sewers enough to know that they almost always have water flowing through them and don't go dry. Near the main line and the treatment plant I imagine there is enough collected flow to on average keep flowing water at all times, however at the extremities of the system there could easily be times where the natural usage of wastewater would cause the pipes to be empty.\n\nHow much potable water do we add to the ends of the system to keep water flowing? Or do we allow these sections to go dry? If so are the pipes setup different to compensate for the highly variable flow rates?", "None. They are set up to self clean.\n\nAt least in my agency.", "How do they self clean with reduced flow? I found the self-cleaning velocity online, does this keep working even with intermittent flow? I imagined depositions still occur when the flow in interrupted, obstructing the pipe.", "Just by the nature of the cross sectional area of a pipe, the lower the flow, the lower the cross sectional area the flow traverses thru the pipe, thus, velocity is SOMEWHAT the same as a hi flow scenario.", "Yeah, someone at my agency once told me but wastewater is something like 98% water or something crazy like that.\n\nSo every sink, every shower, and every toilet is putting in a lot of water.", "I feel like you're imagining a sewer system as a lazy-river of constantly flowing water, but that's a cartoon version of the reality. Much of the network is 6 to 12\" pipes sloped 2% to 5% that never have more than a few inches of water in them. They drain to lift stations that wil grind and pump the water through pressurized forcemains longer distances. There is, generally speaking, not room for mutant turtles to have pizza parties.\n\nLarge sewers with room to walk around in them are generally a relic of older combined-sewers that combine wastewater and stormwater. These are oversized for large storm events.\n\nAs long as there's enough slope in the pipes, solids shouldn't accumulate. This does break down for \"flushable\" wipes, and to some extent for garbage disposals, which is why they can often cause problems for plumbing in your house and sewer systems downstream of your house.", "Basically this.\n\nCollection systems are designed so that even one flush would be enough flow to get the waste to a lift station. There’s no potable water added to a collection system.", "Ah so this is why there is a requisite of being a ninja to train to get through tight spaces. Perhaps teenage and this not fully grown helps as well.", "Thanks, I wasn't imagining a lazy river, but in my mind the 12 inch pipes would normally be running with at least a partial flow threw them at all times, as the solids would flow slower then the liquids. It looks like they're mostly suspended in the liquid though and therefore as long as the water is above self-cleansing velocity a constant flow isn't needed.", "One could say. With an appropriate angled slope things will simply not get stuck within as they will tag along the water. Too much or too little angle will ruin that, though. Same goes for the drainage-pipes in your home.", "Shit flows downhill\n\nPay day is Friday\n\nThe boss is a prick\n\nPlumbing 101.", "Hot on the left", "The pipes aren’t set up any differently other than size, for example the main like is going to be bigger than the laterals because it is used to carry more flow, but since collection systems go into lift stations, they break head and therefore there isn’t a worry about pressure or flow rates. The slope of the pipe is enough to get the waste where it needs to be.", "There's no water added to sanitary systems other than the wastewater.   There's probably some groundwater seeping into the systems in some places but that's not of purpose.", "None is added.", "Practical engineering has an awesome video that explains how sewers are sloped in such a way to self clean.\n\nBasically, too fast and the water leaves the solids behind.  Too slow, and the solids can settle out of the water.\n\nhttps://youtu.be/UpHOkHxpTvQ?si=vWSXV5Hc5L0CZa06\n\nIt's worth a watch", "You think sewer pipes are all nice and clean. They are very not.", "Hi everyone,\nI'm building a dome for my 22ft pool. I'm currently building it with 3/4\" PVC conduit that has 3/4 OD, 0.062\" wall, 6061 alum inside it the pvc conduit for support. \nThe backside of the dome frame will be only PVC conduit supported by vertical pvc conduit with greenhouse frame clips, and the front will have 2 separate arches that will collapse up to the middle arches when we want to use the pool.\nThe main middle arches stand on their on with little squatting, but I've temporarily added rope to add some strength that I'll be changing out for coated aircraft cable (clothes line).\nMy question is, what is the best configuration for the cable center support?\nHere's a picture of it mocked up:\nPool dome https://imgur.com/gallery/uvOSNdK\n\nPlease don't laugh :)", "I've noticed that sometimes when I come across something that's threaded, I REALLY have to be careful to get the nut (or whatever) on correctly or it'll super easily cross thread. \n\nWhile other things (think of say a nut for a jack or vice or something) (or say a lid for a kitchen container) are nearly impossible to cross thread. You can just throw the nut on there any old way and it'll go on correctly. \n\nWhat is different about these threads? Is it the thread cross section profile? The pitch? The tolerances? The chamfer on the end of the male side? \n\nFurthermore, how do I design 3d printable threads that are hard to cross thread? (I would assume the answer is \"follow the above design guidelines for the differences in those threads.\")\n\nI've designed 3d printable threads in the past, but they always end up being easily cross threaded and I want to avoid that because it's annoying and I can't assume the people who print my designs are.... competent.", "Larger pitch / diameter  ratio = easier to thread  (Or to restate, large helix angle = easier to thread )\n\ne.g. M8 x 1 is much easier to thread than M80 x 1\n\nThink about what happens when pitch / diameter goes to infinity, the helix angle goes to 90 degrees and you basically end up with a key way (or spline if multi - start thread) which is impossible to cross thread.\n\nMore thread starts = easier to thread\n\nMulti start threads with large pitch to diameter is what you find on food jars (e.g. plastic peanut butter jars, glass mason jars etc)\n\nLead screws, like those in car jacks have large pitch to diameter ratios (relative to fasteners).", "So the coarser the better in terms of cross threading. \n\nWhat about thread shape? Does that matter at all? Do threads that are very shallow cross thread more easily?", "Yes\n\nFiner threads are harder to start because the area that you are trying to line up is smaller.\n\nOnce it's started crooked, fine threads are easier to continue cross-threading because the material you are deforming is smaller and sharper.", "It depends on how flexible the materials are. Like you can slap a plastic lid on sometimes and make it jump a thread and fit properly. Metal won't do that. Coarse threads, or Acme threads are harder to crossthread. Fine threads are easily screwed up.", "The trick to threading is to turn the bolt ( or nut ) backward until you hear/ feel it click then go forwards.", "Yeah I know but sometimes that just doesn't work.", "\\[t-swivel.png\\]([https://postimg.cc/PLkwL6TG](https://postimg.cc/PLkwL6TG))\n\nI am trying to replicate the t-swivel pictured for a water well drill. The bearings must be sealed around the drive shaft to prevent pressurized water from escaping. Are there any off the shelf bearing/caps that can be screwed onto a T fitting that would meet this need? ", "Compression seal used in a stuffing box or gland package. \n\nCould be greased flax or Teflon braded graphite packing. \n\n\nhttps://marinehowto.com/wp-content/uploads/2015/03/14RemovingFlaxWithAPick.jpg\n\nPerhaps it can work without the bearing."]