["**Please use this thread to post any Jobs that you're looking to fill (including interns), or services you're looking to render to other members.** \n\nWe do this to not overflow the main subreddit with personal offerings (such logo design, SEO, etc) so please try to limit the offerings to this weekly thread.  \n\n\n  Since this thread can fill up quickly, consider sorting the comments by \"new\" (instead of \"best\" or \"top\") to see the newest posts.", "**Professional and Budget-Friendly Graphic Design Services for Your Business**\n\nSee my work and client testimonials:\n\n[**https://johnery.com/clientele/businesses-and-startups.html**](https://johnery.com/clientele/businesses-and-startups.html)\n\n[**https://www.instagram.com/johnerycreatives/**](https://www.instagram.com/johnerycreatives/)\n\nEmail me for a free consultation: [contact@johnery.com](mailto:contact@johnery.com)\n\nHi everyone!\n\nI'm a freelance graphic designer specializing in graphic design services for entrepreneurs. From logo design to marketing materials to social media graphics, I provide a full range of services for your needs, with a focus on creating visually appealing work that engages your customers well.\n\nI understand that times are hard for most businesses in the current situation. As such, I'm happy to work with your budget, while delivering quality work for your business. If you're interested, feel free to send me a message and I'll try my best to answer any questions you may have.\n\nI look forward to hearing from you!", "Hey there! I'm Josh, and I'm a **freelance copy and content writer** specializing in writing web copy for US-based SMBs and content such as articles and blog posts. Let me do what I do best--which is to help your organization position itself as an authoritative voice and gain exposure--so you can focus on running your business!\n\nI'm based in Amsterdam, but I've lived in the Caribbean, U.S, Ghana, and Spain. I have a proven track record of researching and writing for often complex fields (such as law or medicine) and translating it into more readable, everyday language that engages and converts your readers and clients!\n\nI offer cutting-edge and engaging content at competitive rates. Drop me a PM to request additional samples or to see how we can work together!\n\nSamples: https://docs.google.com/document/d/1A3YPkHaGBfarJTG0IhDgZCbJuQ9tbwtqwQolonT6OjE/edit?usp=sharing", "Web scraping on-demand service for your eCommerce/Dropshipping or web scraping software for your eCommerce and price scraping. Projects of any complexity.   \r  \n\\- https://e-scraper.com/   \r  \n\\- https://e-scraper.com/software/ (smart scan & free trial available)", "**[Side Hustle & Passive Income Blueprint](https://old.reddit.com/user/travelguy23/comments/1aul9fb/the_side_hustle_passive_income_blueprint/)**.", "**Find the right programmer.** [Technical Interviewers](http://techinterviewers.com) provides vetted coders that are hand-picked for your needs. Our screening process uses IT professionals as interviewers so that you get only the best. Not ready for a developer yet? We also offer planning and consulting sessions to help you turn your idea into a real product.", "I have no debt in the business. After commission and capital gains, selling my house, and a penis enlargement surgery, I should have about 1.7M free and clear. Worse case I’ll have 1.5M.  Any less and I keep the business and run it a couple more years. \n\nI’m considering buying a home for about a million in Southern California and figuring out what my next move is. I could work as a bagger at Trader Joes and live peacefully for another 30 years. I’m 39 right now and live in the north and I’m tired of the winters. I gotta go south for my own sanity. \n\nAnyway, any advice is welcome. I’m not a savvy financial businessman. I’m more lucky and hard working. \n\nI figure it’s best buy a home cash and have no house payment. If a business opportunity comes up I can use the home as collateral and interest on the business loan will be a write off. \n\nMaybe do some CD’s, growth funds and bonds for the rest. 🤷‍♂️  $10k for the World Series of Poker.\n\nI can’t really tell anyone I know so here I am. ", "How big is it now?", "He dm'ed me an unsolicited pic and said it's twice as big now at a whopping 2\"\n\nCongratulations OP. I'm a teenee bit jealous and a lot a bit proud.", "Dude, it can go negative if it’s really cold. It looks so pathetic, like I’m uncut and hung like a squirrel. Gotta coax it out to pee. Normal is like 2” and hard is like 6.5. Definitely a grower. I’ve hit cervix before so I’m happy about that.", "It's only an inch but it smells like a foot ", "Man I can't compete with those numbers!", "Lol alright alright, now. Simmer down, son. You better get yourself right with God and repent for your sins.\n\nSaid in the voice of a Southern grandma.", "In terms of overall cubic space, and I’m a grower too, but like total cubic space delta I’d say is like a 10X, but the actual length is fine soft, it’s more like it becomes the hulk and gets all angry and veiny. Like if the Chia Pet and the Hulk Had a dick as a baby but without the magical water abilities. Also, it’s not green. Actually it seems to get more vacation time than the rest of my body given the like tan. \n\nI think growers were historically warriors if you go back enough generations. It’s like you can go on defensive like a turtle, but then slay after the pillaging is done. If your hog is always full length, you’re probably more of a gatherer going way back. Big honking tomato picker and home tender. \n\nWarrior out.", "What an odd yet intriguing turn of conversation 😂", "You shouldn’t be happy about that. That is not a good thing to do. JFC", "Don’t judge a balloon until it’s blown up my friend", "There's lots you can do before surgery. Check out pelvic floor exercises and reverse kegels.", "You might wanna read this, cowboy.\n\nhttps://www.propublica.org/article/penis-enlargement-enhancement-procedures-implants", "So: average American, then. I mean that factually: I believe that’s the average length.", "You guys have inches?", "I heard this in foghorn leghorn’s voice..", "Yeah, exactly. \n\nHitting a cervix is an act of domestic violence.", "I gotta accrue a few more and get my money’s worth.", "This made me laugh out loud at my new job. Colleagues wanted to know what was so funny, and unfortunately I couldn’t share this or I might get reported to hr.\n\nStill feeling out my colleagues.", "Autobots, roll out.", "True, proud i guess? Cervix doesn’t equal pleasure.", "Wait you get to 6.5 when hard and want it bigger?", "No. I was just joking. I’ll just tug on it a but and call it good.", "Lolol ok good. But also, with 1.7m anyone would suck a tiny peen for ya lol", "Lol!", "You need a good financial planner. The bulk of your gains from your sale should be invested. 39 is pretty young, so protecting your nest egg is important. How you allocate your money across asset classes is critical. At your age, equities should play a meaningful role. \n\nI would encourage you to put a modest sum down and borrow the balance for a new home. Always use other people's money when you can. In this instance, a mortgage is sensible.  Optimize your interest deduction. The increase in credit capacity will also open up opportunities for more credit should you want to buy another business down the road. \n\nCongratulations on your success and good luck!", "Thank you. This is the shit I just don’t know. What should I expect to pay a financial planner? How do I vet them?", "Lost me at bulk", "Wouldn't OP have trouble getting a mortgage even with a significant sum down, after he sells his business he will not have the income to prove repayment ability. Even if he has enough to buy the house twice in cash.  \n\n\nI could be wrong about this, but this is what I have been led to understand from my experience.", "Find a good local college and take some finance classes so you can save money on a planner without doing dumb things like paying cash for a house.", "Might one even say the shit post?", "Look up Creative Planning", "I highly recommend this service. A fiduciary is someone who is primarily responsible to YOU, and does not get commissions off of selling you crap.\n\nhttps://hellonectarine.com/\n\n$2.5 million is how much you need to live off indefinitely (lifespan be damned), so I wouldn't give up on the idea of working yet, but take a nice vacation for sure, and some time to figure out what's next for you.", "Don’t give them a percentage, do a flat amount, and ideally don’t use them long or at all imo", "Don’t waste money on hiring a planner. \n\nGet some books from the library and spend some time on r/bogleheads.", "With investments, they would count as your income. As long as the amount gained was historically over the interest rate, they would consider it positive income.", "I agree. I'd rather buy stocks that give you enough dividends to pay for the house. Just stay in debts and not pay taxes.", "College classes don't really teach this stuff.\n\nYou'd find better advice on YT and vet it on /r/personalfinance", "Dividends aren't special. They're essentially a forced sale of part of your position, forcing a taxable event. If a company pays out a dividend worth 1% of the share price, the shares will fall 1% and that payment will be taxable income. Companies that do buybacks are generally better imo. I just buy etfs though.", "My college finance classes taught me much more than r/personalfinance could", "Mine taught me how to run finance and figures for an actual business with accounting involved. \n\nNone about how to actually apply any of that to your personal life.", "It teaches you the financial concepts that make you capable of managing your own money. If you can't take away enough from multiple finance classes to manage your money, you should just ask your parents to handle your money because you're too busy trying to figure out how to tie your shoes.\n\nEdit: if your finance class focused on accounting, then it wasn't really a finance class. It was some hybrid principles of something or other. Finance is a discipline that has technical instruction.", "Care to share more about your story for the dreamers? What industry? I figured capital gains would be higher", "20% off the gains. Gaming/Bar industry. I basically bought the license and revamped the business to be profitable. Advertising, promotions and good employees did the trick. I was fun but I’m ready to do something else. Tired of making a living off of people losing their money.", "Is the business a casino?", "How'd you accumulate the original $390k? Been grinding for a while and I'm not even half way to that.", "20% huh? And what kind of penile gains are you looking to make?", "Did you pay yourself an income? Only asking because you might be subject to AMT (alternative minimum tax) on the gain, as opposed to just cap gains. Also, no state taxes? NH?", "Casino and bar.", "Bought a foreclosure and remodeled it. I had 4, no interest home depot credit cards at one point funding the supplies. Key is to only make one purchase on each and pay them off in full before the promo is up. \n\nRefinanced after it gained value and took out enough to satisfy the bank on the down for the business. Bank wanted about $100k down to bring the loan down to $280k.", "Nor-Cal.  Probably grew dope back when you could sell outdoor for more than $300 a pound.", "Which country? Eastern europe? Dont you need to be mafia to own casino?", "Amazing! Well done!", "Buying foreclosures or tax sales, flipping them/improving them seems like a good start. With the increase in ADUs you might be able to even add one or two extra units on the property and increase the value or cash flow if you hold and rent, depreciate the value and take out the equity after the improvements. Personally I would hold and rent but that is just me.", "Killer", "Good job! Mind sharing how you found the business?", "Looks like the USA.", "I demo’d the kitchen too early and had to do the dishes in the bathtub for a few months. 🤦‍♂️. Some times just shear will gets you through. I’m really not too different then John Wick if you think about it 😂. (Its a line from the second movie). \n\nI did get butcher block countertops for under a grand and did them all myself. Found some raw butcher block on sale around Christmas and got a great deal. Lots of sanding later it looked dope and was a significant selling point in the home. It was a wild ride.", "I was in the industry and found out they wanted to sell. No realtor involved. I almost passed on it because it was actually over valued for what the business did. I basically bought the license and buildout and had to make changes to make pencil out.", "If you like it, I’d recommend keeping it. Taxes will eat a large chunk of your earnings. \n\nYou should take out a loan against the business for $1M and take the money. Use the business income to pay it off and then do it again in another couple years.", "Interesting up ^", "Personally I wouldn’t put the entire $1m into a house, that’s too much for a low return. SoCal is super expensive, prices likely won’t drop much, but rates will, so take your time. \n\nId put down the min down payment to where you don’t need Mortgage Insurance - which I believe is 20% down / 80% LTV loan, buy SMART - which is hard in SoCal. As mentioned $1m home won’t get you anything nice. You can prob get something nice for $1.6m in San Diego, 10-20 min from the beach, good neighborhood. Even 10% down is only $160k. Anything west of the 5 highway will be $2m. \n\nTake the majority and invest in something safe and get 10-15% returns. I’m biased toward real estate, but there’s numerous ways to passively make 10-20% annual returns. Let that compound and consider working a remote online consulting gig (help write off a ton of taxes) and make enough to cover your mortgage/cost of living ($120k+ in SoCal). \n\nYou’ll really want to plan the sale with an experienced CPA. Taxes will be your best investment (of time/money in cpa) overall. CA taxes aren’t cheap. So make sure to complete the sale in your state. Consider renting in SoCal for a while if you’re never been (renting is still cheaper than buying here). Take time to find your purchase, there are deals out there if you work with the right network of people. \n\nGood luck!", "As someone that just recently got into full time real estate investing, what are some of the other \"numerous ways to passively make 10-20%\"? As I know bonds, HYSA and such are like 4-6%. Even real estate PMLing is like 10-15/30% tops unless get into short term loans multiple times a year.", "Before buying a house ( at least a permanent one ) try renting a place in the city/neighborhood for a year. See if you like it. Explore new countries as well, the exchange rate in some countries will ensure you don't live a mediocre life but a great one especially considering you are burnt out and just planning to bag stuff. You sacrificed alot and deserve a good life don't settle for less.", "Buy a duplex or a four plex, live in one unit and rent the others out. They'll pay your mortgage for ya.", "HELL YEAH!\n\n&#x200B;\n\nI bought a business for $750K in 2019 and just had a guy flake at $650K.", "Congratulations, well done!!! I would say get a real money advisor. It might be better to rent a year. Sometimes it's more important to control (rent) then to own (buy) and less expensive and more flexible. But well done!!", "Apparently people love working at Trader Joes so much, there are few positions available - same with Costco - so I’m also considering it!", "Congrats. It $1.5 isn’t going to go far after buying a house. I’d do some consulting on the side and just hang out. \n\nAlso if you want good weather you can come to florida", "Thanks. I figure 1 mil on the house and $700k spread across etfs , bonds and cds. Most people are saying that’s dumb and I get where they are coming from. Not having a mortgage payment would give me the security I desire. I really just want a nice home somewhere I enjoy living. I also don’t want to manage renters. Renters fucking suck. \n\nTaxes will be about 18k a year, expenses/utilities/food will be about another 20-30k. I could do farmers markets and sell nut bars and concrete hand painted sculptures and make a decent living. I’m good at picking apart businesses and finding the issues preventing profitability. I’m a good bookkeeper as well. Consulting could be a solid side hustle.", "I’d recommend taking a look at Mr money mustache’s website (go old to new blog posts) if you haven’t already. Sounds right up your alley. ", "don't you have to pay a shitload in capital gains? I've never sold a business but that's how it works with houses. If you sell for $2M you'll probably end up with $1.5M at best I would think?", "Cap gains should be 20% of the profit. \n\n(1.7-.38) * 0.8 will be what I’m left with. Plus .250 from home and some other stuff and I should have 1.5-1.7 left depending on sale of business. I gotta still talk to my accountant. He’s gonna think I’m absolutely nuts. He’s not all wrong tbf. \n\nI have Seasonal Effective Disorder. I came really close to blowing my brains out last winter. It’s time for a change. \n\nI’m fine now.  I know people will freak reading that. I’ve got some mental issues but I’m dealing with them. I don’t need help, other than what I’m gonna do with this money. I just gotta get way from where I’m at, regardless of how much I make each year. Time to cash in an move on.", "Move to SE Asia. Buy a condo. Put $$ in to a monthly income ETF like JEPQ. Pay no income tax on your first 100k as an expat. Enjoy your life.", "I have two dogs. Can’t move out of country. Maybe one day.", "One day, think about it lol!\n\nIn my country (Philippines), expats live like kings.\n\nA good, modern condo in the Metro will cost you like $150K. A Toyota will be $20k. \n\nYou can live on $1k a month", "You can bring your dogs to Belize", "[This is what $1M gets you](https://www.redfin.com/CA/Los-Angeles/3961-S-Centinela-Ave-90066/home/6739604) in SoCal. 1300 square feet in a postage stamp yard, and $15,000 a year property tax bill. Minimum wage and a 4% safe withdrawal per year on the rest of your money will still be a rough life. I'd look more at a medium or lower cost of living area (maybe Vegas or Phoenix area) where you can get a lot more for about half the price.", "You posted a house in LA. Southern California is huge, with plenty of cheaper areas. \n\nEither way, what non-Californians find it hard to comprehend is you don't need a big home because you don't spend much time at home. And home size eventually becomes a nuisance past a certain size. I understand some people are homebodies, but I'd think that people would choose to live in major cities are not.\n\nIn Las Vegas and Phoenix you're spending half the year indoors. I couldn't be paid to live there, as someone who enjoys the walking city life, and spending time at parks, cafes, and patios.", "A picture of a small home doesn't tell the full story of perfect weather and amazing outdoor living ", "He doesn't need to be in the city.", "Coming from a medium sized European city, it just completely blows my mind to see this for $1M.\n\nIt's like a joke or movie or something. \n\nA little outside my city you'd get a less than 30 year old house with a  swimming pool, 6 bedrooms and 3 bathrooms for US $1M.", "Soooo where’s the best place to live in your opinion? Nice weather all year around, no crazy traffic or insane home prices like the one listed above, good food, schools, people, patios, outdoors, etc- where you choosing?", "I lived there almost a decade and wouldn't call it amazing outdoor living if you only have a million to spend. It's either that size house or a 900 sq ft condo for that price with no outside lawn. Even up in Canyon Country the lots are tiny. It's just not a good place to retire to.", "There's no perfect place because it's person dependent. My point was that home size is just a small part of the equation to a home. Some people value walkability and public transport, vs. other value space for their 3 cars. Also, what you describe doesn't exist, because if it did it would be expensive.\n\nI live in San Francisco, so obviously I think it's the perfect place for me. But I enjoy being outside year round, the beach, parks, and the mountains. As well as the restaurants, patios, and music. I can walk to any of those in minutes, including Golden Gate Park, which is bigger than central park. Some people just like chilling at home, so San Francisco wouldn't be the place for them.  \n\nHomes are more expensive here, but you don't need a ton of space, so it's often an unfair comparison. Also, I get paid twice as much here vs. anywhere else in the country. I therefore live in a smaller place and bank the difference, and come out way ahead.", "Move to a quiet town by the beach……..", "Not for a million dollars in socal.  Have you seen home values there, especially by the beach?", "Where did you list it?", "I moved to Central America and invest in real estate, property development and a few other tourism related ventures. Worth a look.", "\"Maybe do some CD's\"\n\nI don't think cross dressing is gonna help, but it won't hurt and you can show off those 3 inches", "😂. Certificates of Deposits. Safe place for money with a little interest.", "*puts panties away*\n\nI knew that! I was joking! Yeah, so anyway....bout those stocks and bondage", "What kind of business?", "I don’t really have much to add other than good luck on the surgery. Hope you get to 7!", "He should use some of that money to buy a 2nd penis", "Im a RE agent in so cal so take this with a grain of salt. 1.5mm into multi-family should net you 5-7 or so 1mm properties (20% down) making 10k a month after mortgages conservatively. Puts you on cruise control for the rest of your life.", "Your saying buy 5-7, million dollar properties and put 20% down on each and rent them out. After all is said and done I’d be making $10k a month. That’s a solid plan. Thank you. 20 years later the properties are paid off and I’m rolling in the dough.", "This is riskier than it is made to sound. Theoretically it would be a great thing if it worked out, but it is not risk-free and will have plenty of headaches along the way.", "But he won't have any other income, are they going lend based solely on the rental income?", "Obviously, it's slightly more complicated, but yes. The other thing most don't consider is you then have the ability to continually pull out equity tax free. You also get massive tax benefits depreciating the buildings over 27.5 years. So you build equity, your tenants will pay the actual mortgage, you will end up with cash in your pocket, and you get tax breaks based on RE interest etc. With 1-2 properties your w-2 job (depending on pay scale) will almost be tax-free.", "Damn. This might be the way for me. Thanks again for the info.", "Do you specialize in finding these types of investment properties? If so, would love to DM you and discuss this further.", "Good Luck, let me know if you have any questions.", "Also to consider as one of the investment properties purchase - you can purchase a duplex or quadplex and live there too while the renters’ income pays for the mortgage, so you aren’t paying mortgage out of pocket. I know this probably isn’t what you desire currently or immediately but maybe keep that in mind when looking for investments to purchase while getting everything else lined up long term", "Feel free to DM me. I wouldn't say I specialize in them, but it's become my obsession for sure lol.", "Did we really need to know about the penis enlargement surgery", "It was a joke about my username.", "I think that information is absolutely relevant to this post.", "I thought it was funny OP lol", "Well done. I was scrolling through the comments trying to understand 😂", "You should probably still consider it, jokes aside.", "Small dick energy.", "Cool", "A house in california would evaporate your gains. Spend 500k on a nice home in TX and invest the rest", "Haha personal choice I would have just gotten a fancy car!", "Already got em. Fancy home is next.", "Then fancy woman or upgrade existing model… jk", "If it were me I’m going to a state with no state income tax and buying a larger home in a suburban neighborhood in one of those states.\n\nSticking everything else into an index fund, finding a job that’ll pay me 45-60k a year so I can afford the property tax and upkeep, maxing out my 401k and retiring at 50.\n\nIf you put a million dollars in an index fund and didn’t even contribute to it until you’re 50 it’s like 2.5 million dollars if I’m doing the math right.", "A million dollar house in Southern California will buy you a glorified shack", "Nope. I’m looking at the Coachella Valley. 2500 sqft, 3 car garage, pool and hot tub. One had a casita as well for just under a mil. I wanna be with the snowbirds and a lgbt crowd. I’ll just become a hermit for the summer and play CSGO and golf in the morning.", "The gay Mecca is still Palm Springs, not Coachella Valley. But you should seriously consider visiting for a week in the summer. Back to back 110+ days are absolutely brutal. Average temp of like 105 in July. My wife grew up nearby. She’s happy we call OC home now", "I lived there for couple years. It sucks being poor there. Having a garage, solar panels and a working a/c is a game changer. I can handle 120 degrees for a couple months.", "That’ll be my next venture. I always wanted to build my own brand and go from idea and a logo to a sale. It took forever but I finally did it. Now that I checked that off the list, I’ll be selling this in a couple years and buying something that’s already cash flowing. Not sure what yet but I’m gonna take my time deciding. Congrats btw.", "😝", "Would love to know the business you bought and what lead you to that specific type of business decision?! I come from a family that started with nothing and built a successful business from the ground up. Watched my parents work really really hard (still do) I give my parents all the credit to my work ethic bc I had to go straight from school as a child to work with them and turn around and do it all over again day after day!!! I've been pretty successful workihg for “the man” but it is starting to exhauste me and I don't feel appreciated anymore and as they fire more and more of my peers I get left with more work!!! My dream is to own a business, but I honestly don’t know where to begin to research on which businesses to buy?! Any help from someone that has it figured out would be so grateful! Why reinvent the wheel right?! Best of luck always God bless ~* Jen", "Casino/Bar business. I worked as a bartender, slot tech, route manager etc. I learned a lot about what makes a successful bar/casino and what doesn’t. \n\nI read ‘Outliers’ and realized I had a lot of hours in this business and leaned into it. Always keeping an objective eye. \n\nI was looking for a failing casino that the owners were running wrong. After several attempts, I found one that was priced right and bought it and made my changes. I’m good at motivating employees and creating a team. Seeing the boss do a better job than you is always humbling for them. \n\nThere were days where I was working my regular job, get done, cover a shift that night, do the books, sleep on a dog bed in the office and get up the next morning and do my regular job. It was a grind but it paid off. That shit was not easy.", "oh you bought a casino and a bar inside the casino? Did you have experieince in this industry before?", "It’s a casino/bar combo. I had a lot of experience in the industry. I saw what good run operations can make and just found one doing it wrong a fixed it. There’s a lot to running a good casino/bar. A lot seems obvious, but not for everyone I guess.", "but when you first bought it didn't you also need to have working capital to pay employees too and for emergency? and for marketing?", "Not much surprising. Some was built into the purchase price. I also worked in a no interest loan with the vendor for some working capital too. I worked for a vendor for years so I learned some tricks along the way.", "I don't want to burst your bubble here, but deals falls apart all the time. Even at the 1 yard line. I'd refrain from making any binding financial commitments until you see a wire to your bank account. But I guess you know best so keep that in mind as well while you are reading this. If you need any help financial planning, shoot me a dm.", "Thank you. I definitely get that. I’m not making any moves until funds are transferred. If I have to keep running it, thats cool too. I could always get a manager and winter in the south if need be.", "I wouldn't put I million in buying a house,how about you venture in real estate?", "Where’d you list the business for sale?", "Put some of them to bitcoin", "invest in real estate.  Do not buy a home cash.  Thats a terrible move.  Use that money to make more money.", "Congrats! Just make sure you make enough to pay your property taxes here in SoCal. Also, let me know if you ever want to play golf when you get here 😛. I’m from Boston and been in LA for 20 years", "Thank you. Property taxes are definitely in my equation. I’ll hit you up one day hopefully! I’m looking at the coachella valley, golf mecca ⛳️!", "If you’re a hockey fan, the AHL team there has the 2nd highest attendance in the entire league. I actually was out there this past weekend to watch a game and play golf. They made the Calder Cup finals last year and are doing really well heading into the playoffs. It’s a great show!", "I play at Palm Springs sometimes. Hit me up.", "I saw that stadium last time I was down there. I’ll definitely be checking out some games.", "Get out of CA if you hate winter, So Cal winters are turning colder and rainy and save taxes", "It's just El Niño. Was same in late 90's", "What kind of business", "whats the business?", "I know everyone is joking, but for real advice come to r/FIRE - digest the sidebar and read some of the top posts. It's a fairly tried and tested path these days.", "I’ve been there and read a bit. I like spending and making money too much. Those people just want to do as little as possible and coast. I’m not sure I’m there yet. Thanks for the info though.", "Meh, some do, the extremes are probably louder/more interesting. But most are similar to you and could r/CoastFIRE bagging at Trader Joe's.\n\nHave you read Mr Money Moustache's stuff?", "Your should check r/fatfire", "No, I’ll check it out. Thank you.", "Have you been to Southern California. $1m is a shack.", "https://www.zillow.com/homedetails/74129-E-Chinook-Cir-Palm-Desert-CA-92211/61300488_zpid/?utm_campaign=iosappmessage&utm_medium=referral&utm_source=txtshare. Nice shack.", "In my opinion get an Airbnb for a month or two in the state you want to live. After that you'll be able to tell if you actually want to live there. \n\nI always wanted to live in SoCal and once I lived there for 3 years I could not wait to get out. That state is run by a clown show and has deteriorated the living situation imo.", "I was so confident this post was satire but everyone in the comments is taking it seriously so idek anymore.", "It’s real expect for the penis surgery. That was a joke. Everything else is real. 😜", "Do you have any idea what life you can get for this money outside the US??? Why don’t you travel a year before you decide where to settle down?", "Fur babies. I love them but they sure limit what I can do.", "What type of business did you buy?  How did you purchase it with what capital?", "I did the same-ish. Look into opportunity zones and other long term investments that can provide some kind of cash flow and or tax benefits.", "Congratulations", "That’s surely inspiring, glad you made it. Congratulations on your success. I have a few recommendations for you, just in case if you would like to consider that -\n\n- Purchase a house for yourself as you like to shift to another place, and maybe a buy a small apartment flat and rent it out for consistent residual income. \n- Purchase some Gold coins, as after Real Estate, I think Gold is a real world asset. That’s real money and not like the paper currency. You won’t be spending that like using it to buy a bottle of coke, but then it’s super easy for liquidity.\n- If you are left with anything extra, buy some crypto, like Solana is a solid coin, Binance coin is another one, you can put some money in there and leave it for a couple of years and then cash out when you have doubled on it at least. \n\nWish you the best and I would love to maybe connect with you at some point and learn something from you.", "How about helping someone to reach the goal and your action plan how you got into it.", "I live in San diego that million will get you a 3/2 with a small yard. You need a better job than a bagge because the property taxes alone would eat that up. My wife and I both earn over 100k each and live nicely but for a single person with no rent or mortgage.. 75k a year my man.", "ANKR TO THE MOON!", "Don't forget you will have property tax on your $1M house. I'd look for something cheaper unless you have a family or something.", "Where do list a business for sale?", "If I were you...   \n1) Move out of Cali once the sale is complete. Look for a state with positive job outlook.   \n2) Buy a house in another state which is cheaper. For example, (TN median home price is $368,100)  \n3) Ensure a financial advisor is a \"fiduciary\". (A fiduciary financial professional who is legally and ethically bound to act in the interests of their clients)  \n3) Set up either an annuity or have an investor manage it. For example, (Charles Schwab).  \n4) Have a work life balance with plenty of land in case SHTF.", "buy short term treasuries and go live in thailand on $1500 per month like a king. you have won at life.", "Tell us more about enlargement surgery!", "Where did you list it for sale?", "Consider parts of Florida if you want sun and beach for a fraction of the price", "Are you doing p-shot? PRP? Or the girth surgery sleeve?", "how much it costs per inch of enlargement?", "I know folks that work in consulting, wealth management, and business services just like this.\n\nLet me know if you would like an introduction.", "Go yolo on nvidia and bitcoin💀💀", " Congratulation. You might want to consider moving to Florida instead. In Southern California a $1 million home is a 2/1 shack. \n\nIn most of Miami it's a 3000+ square-foot home and if you go anywhere north of Palm Beach County, you can get the same house for hundreds of thousands of dollars less. \n\nOf course, you'll want to self-insure as windstorm insurance is very high. Also, the possibility will be underwater in 30 years is another factor. 😜\n\nGood luck.", "You've come a long way, mate! Selling your business for such a handsome sum is no small feat. Thinking about settling down in sunny California sounds like a solid plan, especially if you're done with those chilly winters up north. And hey, treating yourself to the World Series of Poker sounds like a fun way to celebrate your success. Enjoy the journey ahead! You've earned it :)", "So we are just entertaining this? Playing along are we😅", "I have a house in so cal in a rad area. It’s coming up hard and I want out :) 39 here too. Buy my house :) and my 71 cutlass supreme in the garage", "The house may end up being too expensive to run. I have no idea about things like property taxes and HOA fees there but hear people say they're expensive. $500k wouldn't be much to last you the rest of your life. Maybe try building a similar business.", "For most brokers you can expect to pay around 1 pct annually. If they recommend mutual funds you don’t want them.  You can also do it yourself but the problem comes on with big market swings. Fear and greed can can make you crazy. So it has more to do with your own mindset whether or not you use a broker. Also unless you get a recommendation from close friend or relative brokers can be somewhat risky from the point of view of you don’t know if you are getting someone ethical. Fisher investments does not have commission brokers so that issue goes away. I do not recommend annuities.", "My advice from someone living in Southern California, don’t move to Southern California.", "I’d say let’s go to Texas. Houses are at 350-400k for a decent one, tax is around 2.7% and HOA is cheap. Then you can reinvest that money, or even travel to see if there’s a better place outside of the US.", "What did the initial business have that interested you?", "Document your \"growth\" and sell it as a course.  I'll buy it!", "That's an awesome business model. \n\nWorth trying ;)", "Being lucky is part of being successful - congrats for this sale!   \nWould love to connect at the World Series", "Skip the surgery, buy a boat instead.  get fat and bald. You'll be throwing droves of dimes overboard just so the yacht doesn't sink", "Probably won’t need the penis enlargement once you get out of the cold.", "Building a business for a surgery is kind of crazy but hey whatever motivates you", "Are you saying my business would be a success if I wasn't hung like a mule?", "Watch out for those CA taxes. Even without a substantial income you’ll have high property taxes etc. \n\nAt any rate, congrats on the potential sale! Love to see stories like yours.", "Wow. No taxes in the sale proceeds?  Nice. Let us know how you’re doing that.", "20% capital gains. I’m selling my home too and the equity will about cover the tax. It was in the first sentence…", "You'd eventually be unable to afford the upkeep and taxes on a million dollar home, even if it is paid off, working as a \"bagger\".\n\nIf you got $1.7, even clear? You'd be best off finding some place in the Midwest, for around $300k to $440k. THEN... you'd still have to get a better job than Trader Joe's bagger in order to ensure you'd keep up with taxes and inevitable upkeep on the property.", "Why wouldn’t I be able to afford upkeep? I plan to continue working. Bagger was more or less a joke, but still enough to pay the bills plus modest returns on the $700k. I could make an easy $70k a year selling cars. I turned down a sales manager position at a dealership for $100k base salary last year. I’d like to live somewhere I enjoy. Not risking my money on investments in a hot market seems like a better idea.\n\nIf my paid off home loses half it’s value because the market crashes, does it really matter to me? Not really. I will get my property tax reassessed. If I lose half my money due to shitty investments, then I’d be pretty upset. But I guess effectively in the same position because the home I want would be also half off. Fuckkk!  I just don’t know what the right call is. 🤦‍♂️", "If you think the market is already to hot? Then live more modestly.   \n\n\nInvest the majority in less volatile, even if the market crashes, investments, maybe turn the more modest home into a rental, when the market does crash, but in the meantime, stretch your money.  \n\n\nHouse upkeep is also much higher than most people consider. A new roof on a 2500 square foot house, can approach $25k, pretty quickly. HVAC, Water tank, electrical work. Home upkeep takes time and money.", "This is what I should do. Thank you.", "I'm exploring the most effective and practical lead generation methods for SaaS products and was wondering what your favorite approaches are.\r  \n\r  \nCurrently I'm using Apollo for email automation and data, as well as Dripify for LinkedIn and for cold calling we scrape contacts from Sales Navigator, but the results haven't been good so far. I suppose we lack professionalism in this area, and I prefer to focus on sales.\r  \n\r  \nI'm considering using a lead generation agency, but I would like to hear your thoughts before making any decisions. Thanks!", "As a tech company owner mixed multichannel outreach is the best strategy to get more appointments and grow the business, from my experience partnering with a lead generation company saves time and money in the long run. I started with one a few months ago, and the results are better than my solo efforts (Already used all the tools that you mentioned and more others)", "Thanks for your answer! I had a few meetings in the past with few lead generation agencies but most of them require a commitment for 1 year. Can you share more information about the company you are working with?", "how many meetings they booked for you per month? and what are the costs??", "Started with them in the middle of 2023 and every month they provide more leads to our business. It took them some time to understand our needs, but ROI has improved thanks to their efforts. The payment is month to month so there is no long term commitment. Hope its help you!", "It depends on how many prospects they reach out to every month. They have a few plans available. I have their Growth plan which includes around 5,000 prospects and provides us with 10 meetings per month.", "Thanks a lot!! Sounds great! just the name of the company is missing haha", "Right, they called Amplibiz", "Thanks! Just book a meeting with them", "[removed]", "Yes, you are right. If you have a great B2B product/SaaS, you should consider trying their services", "People don’t answer the phone anymore. What works consistently - is earning the right to pitch. If you don’t take the time to slowly get to know someone and their business, share best practices and knowledge, and even get them to actively engage with you - going in with a cold email offer and pitch will turn people off faster than you can imagine. You’ll lose far more in the long term if you’re not steady and patient.", "I found the combination of Apollo + Dripify really powerful. The message I used was: \n\n\"I have recently had some hours come free and am looking for something interesting to work on, let me know if you would be up for having a chat about \\[COMPANY NAME\\] and how I might be able to help you grow.\" - I targeted founders that recently raised, I was able to land 3 phone calls in a couple of days and landed one client. I think keep it super simple and make it feel real.", "Using LinkedIn Sales Navigator to find people who recently changed roles has been very good for me so far.", "Thanks! Good idea", "lead generation agency is a good idea. I usually get all my leads from Google and LinkedIn ads, a few months ago I also tried to use Apollo, but I never had the bandwidth to implement it fully. It my opinion all the B2B SaaS companies need to outsourcing the lead generation", "SDR within a set of accounts here. Using zoominfo and salesnav to gather data. Then start a cadence of intro email, one week later follow up email, then phone call 2-3 days later. Although these are current accounts so may be different depending on role, as I’m not trying to not come off as too spammy with outreach", "Thanks for that! We are already doing all of these, most of the phone numbers are incorrect, the reply rates are low I think most of the emails are going to the spam, and the licenses for all of the tools are SUPER expensive.", "I had some random person mark themselves on LinkedIn as a cleaner at my company. I'm a one person company. I don't have a janitorial workforce.\n\nAnyway, it got picked up by zoominfo and now I get spam from people like you all the time to his firstname.lastname@mycompany.\n\nI'm all for cold outreach, but bulk unsolicited e-mail is very ick. I can't imagine ever buying from people that do this to me, and can't imagine that it creates quality customers for you.", "pooping in empty orange juice cartons and sending them to local HOA presidents with a note of \"open this up, it's YOU inside xoxo\".", "- Outbound email prospection, find the email with Hunterio, Rocketreach, ZoomInfo or similar, customize a sequence of mails and send.\n- LinkedIn connections, don’t send InMails they don’t work a lot. Instead connect with people, engage with their posts and after some days, send them a message.\n\nIn both cases, try to not sound « too commercial ».", "I've experimented with Apollo and received responses, but unfortunately, none of the clients have closed the deal through it.", "Hey there! I stumbled upon an interesting article on outbound lead generation. Check it out here: [Outbound Lead Generation](https://www.uplead.com/outbound-lead-generation/). As for favorite methods, I think that combining personalized email outreach with targeted LinkedIn engagement can yield good results. However, if you're considering a lead generation agency, please do a thorough research and ensure it understands your goals and values. A good, professional lead generation agency goes a long way. Good luck!", "Ads", "Definitely cold email for us has been the cheapest and fastest ROI on an outbound channel.\n\nUse Apollo too, Instantly and just started using ColdClicks, pretty dope, writes the first line of our emails so we just have our value prop and CTA in the body.   \n\n\n\"Hey {first name},   \n\n\n{personalization}  \n\n\nWe work with eComm agencies like you guys...\"", "I've been making traction on LinkedIn ----\n\nI use navigator as my search list, click on the person of interest, then circle back to regular linkedIn search on a different tab and friend request them with a simple message asking to connect.\n\nIn that 1-2 sentence message --- I'll ask if they have anyone in their network that loves XYZ (for me it's boating and small business). \n\nHere's why it's working for me --- It's a softer approach and people are usually willing to help point you in the right direction. However, as they think about it for their network, they're also vetting it themselves and you'll usually get the chance to explain your product/service/opportunity. \n\nWorst case, you get more connections and can use your content to bring them in over time.", "I have my own startup, and we are launching in a couple of weeks on the app store. We are Pre-seed AI App and looking for our first check of around (500K-$1M). I have a solid team with high-ranking advisors from well-known companies publicly listed on the stock exchange.\n\nWe've received tremendous positive feedback and excitement about our app launch through multiple user testing sessions and private beta testing, which is great. So many people have told me it is a unique and niche app. It gives me some hope it will grow and become something.\n\nI'm currently using a platform called Foundersuite. However, I find that most of their database is outdated, and it's frustrating to get bounceback emails constantly or \"this message is Blocked.\" I considered subscribing to CrunchBase, but I've heard similar stories of it needing to be updated. I don't want to waste money on it, as things are already tight.\n\nAnother route I took- which I still need to implement, was hiring someone off Fiverr to give me a VC list. How they got this information is beyond me- most likely scrapping, but whatever works to get a VC's attention. Is there any other CRMS anyone recommends for getting in front of VCs?\n\nDoes anyone have any other recommendations or strategies to get in front of investors? I know there is no playbook to doing this , but I want to make sure I'm doing all the things to get in front of people.\n\nAlso, before you comment on the advisors-no they don't know investors- I've gone down that road.\n\nThanks", "You can use Salesflare as CRM. Works well with LinkedIn and Gmail/Outlook.\n\nIn terms of lists, there are some floating around. You need a specific SaaS investors list most likely.", "I recommend Perfex CRM with Leads, Projects, Accounting, HR & Payroll, Email and Quickbooks online integration etc", "Do you already have revenues? I have a productivity app (free) with small traffic but spread all over the globe. No revenues yet. \n\n\\- I search Linked In and make 'cold emails'\n\n\\- I search local investors on google, check their website and connect with their partners.  But, honestly haven't secured any money yet. \n\nInterested to follow this thread ...", "So, here's the deal: I've been running my agency for about 8 months now, and I've noticed something kind of troubling. Every time things start picking up and I get some momentum going in my business, I end up shooting myself in the foot.\n\nExample: I'll schedule a meeting with a potential client, they're interested in working with me, and all I need to do is send them an invoice to seal the deal. But instead, I find myself avoiding them like the plague. Till now, i've only made 200 €.\n\nIt's like there's this invisible force holding me back from moving forward. And I think I've finally figured out where it's coming from – my childhood.\n\nBack in the day, I used to play football at a pretty high level. But the coaches were relentless – they'd scream at us every time we made the slightest mistake. It got to the point where making a mistake felt like the end of the world. So, to avoid that feeling, I'd sometimes fake an injury just to get out of the game.\n\nAnd that mindset has stuck with me throughout my career. I've become so afraid of making mistakes that I'd rather avoid opportunities altogether.\n\nNow, here I am, struggling to break free from this pattern. And to make matters worse, I'm not even sure if running this agency is what I really want to do long-term. I've always had a passion for flipping and selling products, but I'm not sure how to pivot from where I am now, since i've recently switched niches. throwing everything away which took me so much time doesn't feel right.\n\n\n\nI don't really know whether i'm just trying to find excuses again to avoid doing the work...\n\nSo, here's where I need your help: Any suggestions on how I can overcome this fear of failure and decide whether I should stick with my agency or pursue my passion for flipping products?\n\nEdit 1: I think one aspect that contributes to the fear is that i don't feel \"qualified \" enough to use my clients Ads Budget, since i haven't got that much expierence yet to confidently deliver results ", "It’s a mindset thing. Many people deal with this. Subconsciously you don’t feel you deserve the success so you self-sabotage it to avoid dealing with said success.\n\nRealize you are worthy of all the material and creative success.\n\nRead the book “Secrets of the Millionaire Mind” by T Harv Eker to ‘reprogram’ your thinking from a poor mindset to a rich mindset.", "Yeah might also be the case ....  \nThanks, I'll look into it!", "Find an accountability partner, tell them once you've had a successful meeting and the potential client wants to become a client. If you don't send the contract, they will give you some tough love and push you over the edge.", "Gotcha, will do !   \nThanks.", "Preferably someone you respect. Like a dad or mentor", "Send me dm. I can take you on as my bookkeeping client. Will take care of this issue for you.", "I would avoid using family and friends as an accountability partner as they have the incentive to be a 'yes man'. I have a success partner for quite some time now, 11 months to be precise, and he was a complete stranger. \n\nBut the good thing about this is that if I need some advice or clarity, he isn't afraid to state something painful. \n\nA mentor could be great, but most times it's either too difficult to find one, or they are too expensive.", "My dad holds me accountable in a healthy way, not everyone has that, fair", "I am currently dealing with this exact same thing except it’s fear of success. So I wont send the invoice because receiving the money makes me feel like now I have to show up and I cant make any mistakes or disappoint the client because I should be perfect.", "i feel you man.   \nGetting the money means full commitment where you gotta deliver 100%", "i hope this helps you \n\n&#x200B;\n\n[https://www.loom.com/share/3a1a789b6ef1414dbb4f4e06b024e282?sid=53d99cac-31ba-4add-b60e-536cc884f445](https://www.loom.com/share/3a1a789b6ef1414dbb4f4e06b024e282?sid=53d99cac-31ba-4add-b60e-536cc884f445)", "I can relate, I had a bit of issues with \"perfectionism\" due to similar reasons but the source was abusive childhood was beaten up by my stepmother whenever I made any mistake. Like properly beaten up like thrown on the floor and kicked on even.\n\nAnyway, eventually after joining a $9000 coaching program one of the big take-aways solved this issue...\n\n\"It's better done imperfect than not done.\"\n\nNow I no longer try to do things perfect, I get them done first then perfect them over time instead.", "Wow, that's messed up. Glad that you're well of now. \n\nI can definitely reale to the perfectionism. Im gonna work on that. \n\nThanks !", "Your behavior will eventually change as soon as you figure out you can’t live on 200 bucks.", "Yeah, you're right. I still got it comfortable in my parents basement.   \nThings would be completely different, if i'd had no choice to earn money", "Hey, it sounds like you're in a tough spot. It's awesome that you're figuring out why you sometimes hold yourself back. Fear of screwing up can get wired into our brains. First of all, always decide with a clear head. You can start by checking out the flipping business. Can you try it on the side while still doing your agency work? And in the meantime, try getting yourself to do the small things you put off, one thing at a time. See if continuing to do it helps you get over the fear. Once you've tackled some of the fear and seen if flipping is realistic, you'll be in a better place to choose. Maybe the agency will be fun with less pressure, or jumping into your passion will finally feel right. Only actions will tell. Inactions will keep you paralysed.", "Thanks for the reply !   \nYeah, I guess that's the most logical solution to this.   \nI'll try doing flipping on the side.", "Do or do not, there is no try.", "When you get to that stage say F it. Whats the worst thing thats going to happen if you fail.\n\nYea think about it.What ? Customers are going to get angry and dump your business. A failed customer is an opputunity for you to learn what no to do next time", "This is very common, so don't feel like it's just you.  I work with a lot of business owners around this, as it is what fundamentally holds most of them back.  Happy to have a chat if you want and see if I can share some tips that work for you.  Just message me.", "Fear of failure. \n\nLove the suck! Chase that NO. It leads you to YES. \n\nApproach it with a Champions Mind. Present moment focus. Get after it.", "well you can blame it on a childhood thing if you want (and maybe that's accurate) but most everyone has fear of failure and trouble getting traction and running a business in the beginning which is why most fail. I don't think there is some trick you can play on your mind to change anything, It's inner voice and one of its jobs is to keep you in your comfort zone so when you get out of your comfort zone it starts telling you you can't do this, its a bad idea, you aren't capable, you will lose money, lose face or both etc etc. It's probably loudest before you go to sleep. Just ignore it and plow forward and after a while the new business will be in your comfort zone and your inner voice will start bitching about something else in your life. It's about confidence and right now you don't have any so the task at hand is to get some by working at it. Search on inner voice. A therapist will tell you that your inner voice is not about the reality of your feelings but more about regulating how you feel about stuff and influencing you to do or not do stuff to keep you safe and sound and in your comfort zone and it will resort to lying if it needs to.\n\nJust start following through on your commitments. The deal you screwed up wasn't all about you, it was also about the client too and you screwed them over and they lost time they could have spent looking for an agency that could/would do the work. Make a pact with yourself to not do that again. If you want to quit don't do that on someone else's time, quit before or after but not while you have engaged with someone. That approach in and of itself might keep you moving forward because your inner voice likes it when you complete something and like I said your inner voice moves on to something else once the conflict is resolved. \n\nBeing a business owner is very hard for lots of people and no shame in just deciding against it but I wouldn't let fear of failure be the reason.  Thats too average and predictable. Its like quitting exercise because your muscles are soar after the first few workouts. Suck it up and give it an honest effort and let the chips fall where they fall.", "People who do things … do things.  Start small. If it takes 1 minute around the house, do it right away.", "Really interested to hear from others about some odd or unique things you do to make money outside of their typical 9-5. I'm still currently working in corporate America, but I do some other things that aren't as common. \n\nFor instance, something that I do that not many do and get paid for is sports capping and freelance sports writing. A few years ago I started a Twitter account to follow others picks when my state became legalized for sports betting, and it quickly turned into me joining a community and getting paid to post my picks, which then turned into almost full time freelance writing with major sports related websites. \n\nI'm more so interested because in my down time I constantly find myself looking for other streams that I can involve myself in that aren't typical. \n\nWhat's your unique way of making money? ", "I recently purchased a realistic looking dinosaur costume. Started end of January and booked about 60 gigs so far mainly schools libraries etc. teaching the kids a little about the Dino and letting them interact with it etc. ,  which is almost $30k in revenue. Recently my job is trying to get us back in the office so need to figure out what I’m going to do lol", "Wow that might take the award for most unique. Lol that’s insane!", "You know what you have to do.\n\nYou're a dinosaur,", "Don’t let this gig go extinct", "Omg I love this! 👏 This is the best of all worlds. I was a nestle quick bunny at Walmart handing out free chocolate milk…Sounds awesome but I didn’t realize the costume was 150lbs and that it would be 200 degrees inside the costume. My dream of being a mascot was tarnished by the fact I had to be carried off the floor after an hour in the furry sweat closet by my helper.  \n\nAll I could see out of the tiny mesh eye holes was the disappointment and concern on the face of the children’s little faces 😞\n\nA realistic dinosaur costume may how I can get back on that horse🐴   🤔", "I'm sure it was fun. And apart from that the money's good", "Just rawr and wave that's what you have to do 🤭", "How did you market yourself? email? website? business card?\n\nHow much did you charge? and per hour or session?", "“So need to figure out what I’m going to do…”\n\nListen to me. u/Creative-Onion-4221, look.When I was a kid...when I was a little boy, I always wanted to be a dinosaur. I wanted to be a Tyrannosaurus rex more than anything in the world. I made my arms short and I roamed the backyard, and I chased the neighborhood cats, and I growled and I roared. Everybody knew me and was afraid of me. And then one day, my dad said, \"Bobby, you're 17. It's time to throw childish things aside.\" And I said, \"Okay, Pop.\" But he didn't really say that, he said, \"Stop being a fucking dinosaur and get a job.\" \n\nBut, you know, I thought to myself, \"I'll go to medical school...l'll practice for a little while, and then I'll come back to it. But I forgot how to do it. Hey, I lost it. \n\nThe point is…don’t lose your dinosaur.", "Haha I needed this. Thank you", "Started a product line. Now have a farm of 3d printers that I tend to mornings and evenings in a spare bedroom.", "Out of curiosity, have you considered having your \"thing\" properly manufactured? \n\nI keep hearing folks talk about selling things with their 3D printers but I can't help but wonder if they couldn't produce a far higher quality product for far less using a real manufacturer with volume discounts.\n\nUnless it's a highly customized thing for every customer, I just don't see why you wouldn't.", "Do you sell direct to consumer with that? That sounds really interesting.", "I hear that 3d printer farms is really saturated right now. Do you want to share more on what you do and how you've made it?", "I posted to another commenter a bit above.\n\nYes, I have. My issue right now is I have over 100 unique listings, each with anywhere from 1 to 40 variants in design, plus every one of those could be 1 of 20 colors.  My volume comes from variety of parts. I'm sure I could get them molded, but... is it worth it?\n\nExample. One of my products take 2 hours and about 1$ in material and I sell for 20$. I sell maybe 10 of these a week?  How long would it take to recover injection mold costs?  (Asking if anyone knows, lol, I dont...)  for me, I just say I'd rather scale up using what I know, (printing) until it's burdensome to do so...\n\nI do consider my products high quality,  as I said in the post to another commenter.  I'm a parts manufacturer who happens to use 3d printing. I am not a 3d printer.\n\nFor my less popular products, it's a no Brainer, printing allows me to iterate on the fly with design improvements,  and offer unique items that no one else does!\n\nPlus, even though this is a buisness... I love having a manufacturing floor in my house, wouldn't be the same outsourcing it. Maybe that's the future for me, but for now, it stays here.\n\nHope that answers! Let me know if you have other questions.", "Yep. Etsy, Amazon, my own storefront. No craft shows, given I work full time, 8 hours out of my Saturday does not sound fun. But packing orders around kids nap times is doable.", "Sure. I've been printing personally for 8 years now. Started commercially about 2ish ago. Started with prusa and ended up with a bambu farm. Despite running a print farm, the key is that, I am not a 3d printer, I am a manufacturer that happens to make products using 3d printing.\n\nBambu lab printers made it easy for anyone to print. So that barrier to entry is even lower now. Used to be that diagnosing print and printer problems set you apart. Now anyone can download a model, hit print, and slap some photos online. And with folks racing to the bottom, it's rough.  No idea how people sell an item with free shipping for 6$ that is made to order. *shrug*\n\nI design 100% of my models. This Is the second barrier to entry. Having a design engineer background in automation helps here! In the niches I am in, I have products that everyone else has, but I also have really unique items that only I have.  This keeps copycats at bay for a bit. I set myself apart by innovating. I also utilize multi materials, hardware and heat inserts on the simple side, acrylic, magnets, corkboard and other on some of our other products. Most people just wanna print and be done. I stock other inventory to manufacture my stuff\n\n3rd barrier to entey... I'm working in cornering the market, everyone and their dogs are on etsy, much fewer are on amazon.  So... I make sure I'm on amazon. Amazon is much harder to list on. Etsy accepts anyone with a pulse and terrible listings. Amazon is a steep learning curve. Shopify is even harder, (still working on this one, no idea how to drive traffic)\n\n\nI enjoy what I do.  Buying over 1500$ dollar in material and receiving it  over 30 packages. Telling my wife to expect to sign for a new printer, but not knowing hot to tell here's there's actually 2 arriving. Implementing inventory processes to track popular color usage. Designing new parts in a notebook while on a plane. Thinking about how to make my hero photos similer so it looks like a cohesive brand. Taking over a second bedroom because no one realized that fulfillment was actually more work than the printing itself. Repairing down printers to keep the farm up during rushes. Working with businesses to design cutom products for their needs. Realizing you ran out of alcohol for the printers and dash to cvs at 10pm.\n\nI love what I do.\n\nAny specific questions?", "Okay, that makes sense. With so many variations it's probably best to stay in-house.\n\nIf you have extremely common purchases (like your 10 a week one) it might make sense to look into outside options and get like 500 made at a time, but yes, it would come down to mold cost and ultimate savings vs doing it yourself. I can't imagine the costs are that high but I also haven't done it personally.\n\nI know there are tons of board game companies making tons of minis and if the cost per mold was insane they'd never make a dime, but I really don't know. One such company is called Panda manufacturing (or something like that). Americans who started a China based board game manufacturer. Might be worth an inquiry as they are quite popular and easy to work with from my understanding.", "How much does it cost to set up and run your own storefront and fees on Amazon and Etsy? I heard Shopify gets expensive.", "Etsy is cheap. More time than anything. But beside the cogs, a few bucks to get started.\n\nAmazon is a bit more. Maybe 10 to 20.\n\nBoth get you on fees AFTER you sell. Just price accordingly. \n\n\nShopify is a whole other game. Marketing is tough. This is my next step, learn how to drive traffic", "Dumbest side hustle. Writing fluff blog posts for work like \"Ten Best Christmas Gifts for the IT professional in your life\" and loading them with affiliate links. A lot of these hit front page. \n\nFavorite moment, one hit top SERP for about 3500 keyword combinations.... \n\nAfter I left the company, and nobody was monitoring for people stealing their content, it got copied by a shitty industry specific SEO agency, and wound up on 20-30 sites, with all the Amazon short urls intact. They tibled the content, but kept the affiliate links intact. Earned almost $1000 bucks from that blog alone last Christmas.\n\nTotally not a business, but a way to make residuals from the 9-5", "wait wait wait\n\nYou wrote content forr your employer's website that had your personal affiliate links in it? That's gold. Evil, but hilarious.", "Build an audience on any of the big creator platforms - YouTube, twitter, TikTok, instagram \n\nMost of them pay you a share of ad revenue directly\n\nBut then you could use that audience to build an email list that you control and eventually launch and sell your own products to them", "This is what I've been doing the last few years while working full-time as a software engineer. Happy to answer any questions, but the details aren't super sexy. I started around 2020 and right now I'm at:\n\n* YouTube channel at around 30k subs\n* Twitter at 12k followers\n* Email list at 2k\n\nI put out a single paid course around 3 years ago that did very well on launch despite an audience around 1/10 of what I have now, and still gets purchased here and there to this day.\n\nMy growth and income could have been better, but I've struggled with keeping consistency and picking out topics for full-length courses. Hoping to turn that around this year and start growing more!", "That’s a great point! I’ve thought about getting into streaming for sure. Not sure how to use TikTok but I’ve worked with YT videos in the past!", "Second this. \n\nBuilding an audience by providing your expertise helps build trust and rapport, which allows you to sell digital products or anything easier down the road.\n\nMany [interviews](https://www.indiehustle.co/) that I've done with indie founders who started successful digital business rely on this one common trait.\n\nThey would also advise to build your own email list instead of on certain platforms such as YouTube, where you have no control over your audience.", "How do you get the confidence that you actually know enough about anything to teach others?", "Did you use a particular classroom to launch your class?", "how do you start an email list", "I wanted to ask what you do content on but I followed profile links and it's Laravel with docker (for the non techs that's programming stuff)\n\nSo, my question - after four years, would you say you're making beer money, holiday money, car money or house money?\n\nAlso, any particular strategies you use for audience building?", "I think, and please take this as a motivational call to action, that the key point in all of the replies here is that you \"thought\" about getting into it.\n\nAll of the people here, regardless of what they did, didn't stop at thinking about it.\n\nPick something, do it. If it doesn't work out, dust yourself off and do something else.", "Honestly? Wasn't really confidence. I had a particular niche problem that I sorted out during work that I ended up writing notes on. Thought it might be pretty helpful to others and just threw it out there as a blog post.\n\nTurns out I was right, and it started getting a lot of organic traffic. Started finding more things to write about, got asked to create video content showing similar tutorials and helpful tidbits, and it just snowballed from there.\n\nI'm a senior-level engineer but still unsure about a lot of things and continuously learning. If you're asking yourself \"how can I be sure I know enough to teach this?\" you probably do, it's those with blind confidence that I'd shy away from.", "I can’t tell you how many “how-to” videos I’ve seen that are utter garbage.\n\nJust check out a couple of those “react” accounts on tik tok (like chef reacts or mechanic reacts) and you’ll see all the terrible videos they react to.", "I'll share how I did it. I have a resume, LinkedIn, LinkedIn Recruiter, career strategy, and networking course. I wrote over 400+ resumes before I created it. Once I saw there were common things I was repeating, I put that into a course. For people that can't afford my 1 on 1a, I offer a hybrid option. I've also gotten customer feedback from the course and added things to it. I also make sure to ask customers if the price is fair and every single one thought it was worth the value and a good amount thought I was undercharging. It's currently at $147.", "I just put together a collection of videos and launched them on a Gumroad digital product!", "I use substack with an embedded sign-up form at the bottom of my blog posts, but there are a bunch of other services that offer similar functionality.", "Cool thanks!", "Consulting.", "Nice! What kind of consulting do you? I’ve met a lot of people who say this but I don’t fully understand how you get started or what most consult in.", "I never understood consulting, is it paying someone to talk about their life experience when they used to work in that field?\n\nOr there’s more to it?\n\nAlso, why can’t the customer just Google or GPT their answers?", "I do some business start up and compliance consulting. To be honest, it’s not a lot but it gives me a taste of what potential retirement looks like (I don’t think I can just do nothing).", "…wut.", "I am not sure why you're being downvoted, because OP literally asked basically same question.\n\nIt's like this...\n\nAt a ***very*** basic level, the \"big 4\" (google it) are tax/law/accounting specialists who help you understand all the things you could or should be doingto optimise the profit of your business from an accounting standpoint. You can't just ask ChatGPT to audit your books and tell you it's better to lose money this year writing-off $250m worth of debt on planes your company owns because new laws are coming in that will prevent you from doing it next year. Or something.\n\nThen you kind of move into \"Management Consulting\" which the big 4 also do, and which encapsulates the above but also looks at both internal leadership challenges (why do all our best people keep quitting? Why do Team A and Team B fight all the time?) and also broader strategic direction (should we expand into country A or country B? Should we launch Product A or Product B).\n\nThen you get into technical consulting, and this can range from anything like IT security (this is what I do) to one guy I saw post in this sub once that's a food scientist that helps companies come up with plant-based ice cream recipes. We provide specialised expertise in areas that you don't necessarily have the in-house talent to do yourself, and where it would be next to or impossible to hire someone with our level of experience (or impractical, if you only need them for one month).\n\nAnd so then you get specialised or generalised consultancies that go from one-person-companies like me, all the way up to the big 4.\n\nNow, you ask \"*paying someone to talk about their life experience when they used to work in that field*\"? \n\nNo. Not really. Well, not really at all.\n\nIt's basically like the story of the \"engineer and the hammer\", which has been repeated so many times the exact story and origins have been lost to time, but the gist of it is this:\n\n>A company has a piece of equipment that's not working, they hire this old grizzled engineer to come in... he hits it once with a hammer and sends them a bill for $25,000.  \n>  \n>When they query why they should pay him $25,000 when all he did was hit it once with a hammer, he sends them another invoice that reads \"$5 - hitting machine once with hammer; $24,995 knowing where to hit the machine and that hitting it with a hammer would fix it\"\n\nImagine a single machine holding up an entire factory of people being paid to stand around while profit is being lost every second that widgets aren't being made... and $25k starts to be a pretty low price... and that's value-based consulting.\n\nThe value is not in the telling of a story, it's in applying your expertise to an organisation's problems to generate significant amounts of value for them.\n\nProjects in my space have like a 95% failure rate - they go overtime, under-deliver, etc. The average person makes 1-2k/day in my space, so if there are 5 people on a team and I can deliver the project a week earlier than anybody else then I've already saved them 5-10k. And most of these projects go a lot longer than 1 week overtime.", "How do you find clients? Just word of mouth?", "Yeah for me it was just word of mouth from people I used to work with also.", "Send me $37 and I’ll tel you", "I'm interested. But, how do I know you won't scam me?", "You send me $5 to be able to trust you and send $37", "Sorry it's a scam I hope you didn't spend to much time with that guy. You can tell because of the price, cheap price usually means cheap product but it's OK I have this real step by step plan it's only 2 monthly payments of $25.99.", "Here are a few that worked and did not work for me\n\n\\- Rental properties (WORKS)\n\n\\-Investments like CDs etc. (Work but not enough to pay bills)\n\n\\- Teaching (Udemy can work but CANT rely on it).\n\n\\- Build Apps and Marketplaces (May work, still struggling with these), may take longer. Needs a Team, Grit, Luck etc. etc. I cant post link to my apps or marketplace as I dont have the 'karmas' collected yet.\n\n\\- Dropshipping, I really want to try this but havent yet\n\n\\-Affiliates (didnt work for me as I dont have an audience)\n\n\\- Tutoring, just started exploring it.\n\nBtw, I quit my job 1 year back (had to actually), and ever since its been a trial and error game with negligible income. \n\nI Hope something works out soon !", ">\\-Investments like CDs etc. (Work but not enough to pay bills)\n\nI mean, who even listens to those anymore when you have spotify?", "Honestly I flip stuff anything and everything if i find something on facebook while browsing or at a thrift store but i don’t generally go specifically for that but i mean it buys me a good dinner after i do it. the best thing I do is I buy broken laptops from one guy and I sell them to another guy in a different city he fixes them up and then sell them on his own my job is to send him pic/description of the laptops and negotiate a price then send the money over pay the first guy take the laptops package them ship them and make the difference. Which come to couple hundred dollars for few hours of work and I’m super proud and happy about it.", "Ecommerce consulting, Wordpress websites, self published a children’s book, and used to do photography.", "Hi, can you tell how do you find clients for consulting?", "It’s 100% word of mouth. I don’t actively pursue it but when it presents itself, I usually try to land the deal assuming my life can fit it in.", "Bought electronics in bulk and sell them individually.", "is your garage full of toasters right now?", "Box of Air Pods Pro 2nd gen.", "I have a whole offshore dev team who make all my software ideas come to life and then I use fiverr for all marketing/sales while I work as a principal software engineer for a tech company", "So you run a software development consulting business? How did you get started? I'd love to hear your story.", "Does it pay as well as your main job? Or what's the ratio if you don't mind giving a vague answer?", "Sounds like they build their own ideas, not other peoples'", "I work as a design director for a large company (averaging 50-70 hour weeks). I buy and sell cars (mostly Porsches) on the side as a hobby / hustle).", "My brother flipped a car once, but it just ended up in the ditch", "I bet that’s easy to get into 😂", "Do you refurbish/repair the Porsches much at all? Or do you mostly just flip them?", "Guess I'll start flipping old fiat multiplas", "Launching a sales consulting business. Basically cold calling and end to end sales. No cost out of pocket. \n\nJust sold my family entertainment business. Rented a spot in a soccer dome and put in giant inflatable bouncy castles and laser tag and hosted birthday parties on weekends. Sold out instantly. 10 employees. Low start up but a decent amount of logistics. \n\nStarted a women’s athletic apparel company and found a niche offering a donation for every item sold and partnered with the military and tuned $2,300 bucks into a near million dollar business in less than a year. Due to a divorce and sadly health issues in a 4 person partnership we had to shut it down 😞 Built our own site using Wordpress and sold $3000 a night while we slept after designing a custom product from Alibaba.", "And donated over $16,000 to local charities!!!", "‘Who still work a 9-5’….. most people work 9-5 buddy!", "Haha I know! I just know some are full time entrepreneurs so was more curious about the part time ways people have!", "Trying to figure mine out still! Open to suggestions! I live in a larger city and have a car. I’m good with technology and have decent home\nimprovement skills and have an easy going job on M Tr and F.", "I consult on scaling SaaS and improving sales strategies.", "Oh do tell...", "Hi, can you tell how do you find consulting clients?", "Last year my side business did just shy of $60k in rev. About 40% profit. It's a public adjusting business.\n\nIn short, when a homeowner has a property claim and their insurance doesn't pay enough to cover the damages, I step in and recover that money for the homeowner.\n\nI run it from home while working as a product manager.", "How did you learn this and how do you find customers??", "Commenting as I’m also curious. Adjacent career experience allow you to start up? I’m wondering if my experience in construction mgmt would translate some useful skills", "While I'm college, I worked at another firm that did this. I started as their IT guy, but transitioned quickly into claims as they saw I could be useful there.\n\nGetting clients is hard because keep in mind, people need me after something happens like a burst plumbing line that damages their kitchen. \n\nNetworking with plumbers, handyman & referrals helped a lot.", "Yea lots of people in this field have a construction background.\n\nThey like it because they don't have to swing a hammer and can make good money. This works off of contingency. So if we settle a burst pipe claim for $25k, my 20% fee means $5k in fees.\n\nRoof and Storm damage is at 10%", "Do you do work in one particular region? I have a network of investors and I'm thinking this might be a service I'd like to share with them. I'm in Northern VA", "Hired a virtual assistant to find me every email of every public library in my state and started there. Then just started cold calling day cares —the first 2 days we started calling we booked 12 gigs", "Sorry, what's your business model?", "We go to schools, libraries, day cares, summer camps and even town events like state fairs, etc. with our realistic looking dinosaur costumes and puppets and teach the kids a little about the dinosaurs and they interact with them. We do hour “shows” and charge anywhere from $500-$700 an hour depending on the package they want a travel fee", "I worked a 9-5 my whole career and made an additional $750k from side hustles. Main one was an ecommerce site. I also built and sold adsense sites, sold domain, sold backlinks, wrote Kindle books, and many more things. I wrote about it in **[this book](https://old.reddit.com/user/travelguy23/comments/1aul9fb/the_side_hustle_passive_income_blueprint/)**.", "This will probably be the most niche one here but my buddy inherited a bunch of land. I buy weaned black angus calves and he raises them on his land and then sells them. We split the profit 60/40 and I literally do no work except cut him a check to buy more calves every 6-8 months.", "This came full circle and we're doing normal farm work again", "We are Airbnb Super Hosts and rent out the basement of our first house. Soon we'll start construction on our second house's basement and will rent that out on Airbnb as well.", "Turned toward client work after having photography and video as a hobby for past 20 years. Booked $48k of work last year on the side of my full time gig. Zero marketing outside casual word of mouth conversations and referrals from friends and clients. Could afford to grind a bit harder but things are pretty comfortable right now.", "I would focus on what you know - keep pushing your Twitter account until it skyrocket.  \nIf you want to try other way of making money you will probably have to try a lot of different things until one thing is working and you probably don't have the time for that.", "My friend once told me about an affiliate marketing. After I made first money, I hired the web-developer to make some kind of platform to post news surrounded by the ads, showing with the certain algorithm. We selled a few copies of this platform. Also we made made money with this platform too. But in one day it stopped give us a profit, so we dropped it. But I didn't stop working as aff marketer, and quit my main job couple of years ago. Now it's my main money stream. Sorry for my English, it's not my native language))", "If you're an america, donate plasma two days a week.", "Is it really a donation at that point?", "Do you make money from it?", "For tax reasons yes.", "Started an app for peer to peer lending. Currently at $1,000 MRR after 10 months. Goal would be to get it to $3,000 in another 10 months", "Did you outsource the engineering and development or learn how to do it yourself?", "Do you spend on advertising or word of mouth/grassroots marketing?", "I outsourced it to build it as fast as possible (took two months). Spent about 2k", "Micro SaaS and open core software (soon to be). I’m a fullstack software dev.", "Hi. How do you market these products?", "Niche freelancing on fiverr", "What’s your niche?", "Sounds dumb but Video editing Short form content + marketing material, there are only 10 top rated freelancers on fiverrr with the same Profile background = I get 5 requests a week, it works but just because there are only 9 others to choose, usually boomer teamleads or self employed owners book my gigs", "His niche is very niche", "you have been downvoted because your first reply was very generic... but sounds like you have more of a tale to tell.\n\nThere's only 10 top rated freelancers on Fiverr with what now?\n\nTrying to figure out what you mean....\n\nso if I search \"video editing short form content\" and filter on top rated I get 348 results... but then there's only 10 people that have \"TikTok\" as their platform. Is that kind of what you mean?\n\nI imagine it's a bit of a slog to get to the top rated status?", "Fiverr gig (entrepreneurial coaching), selling a book, selling courses on Udemy, mentoring a community of entrepreneurs, building a YT channel, launching an entrepreneur app in Apple/google Store, started a web3 company working on MVP.\n\nJust a few side projects haha. \n\nCongratulations on your success! Definitely combine your passion into blogs, YouTube, affiliate marketing (relevant to sports etc) and multiply your income!", "TikTok is the easiest to grow right now. Then once you grow you integrate your brand with a shop or a product and sell affiliates", "How do you start to grow a tictok?  Been looking to for my brand,  but have no idea.   Do you just shoot video with your phone? Do we still use hash tags? How does the content get indexed?", "Find viral videos on instagram, dm or comment asking if you can repost on tiktok, download the videos, and then repurpose them on tiktok. That's what I did. There's a bit more to it but that's how I grew my brand. Fishing4Dummies is my tiktok so you can reference that.", "It's all about exploring different opportunities and finding what works for you. And if you ever need more ideas or guidance, ScatterMind, an ADHD coach, helped my friend launch their own side hustle. Might offer some valuable insights.", "Do you own Scattermind? You mention it IN EVERY DAMN COMMENT", " Create a side business", "Life Coach", "Life coach coach", "I keep coming back to entrepreneurship. Nothing has excited me in employed work so far. I keep trying to come up with ideas and do a lot of brainstorming about different business ideas. I research how much I would need to set up certain businesses. But the thing is, I feel like I am not smart enough to be a successful entrepreneur. I worry that If I do go down the route of starting my own business, I will make mistakes immediately and end up losing all my money and it won't work. What would your advice be? Have you ever had similar thoughts and how has it worked for you?", ">Nothing has excited me in employed work so far.\n\nWell self-employment does give some that rush of imminent failure to survive. So that's a nice change of pace. \n\n>I will make mistakes immediately and end up losing all my money and it won't work. What would your advice be?\n\nThat the odds are you're right. There are a couple of options. Turn off your brain completely -- act without reason or consciousness -- popular best practice or \"Just Do It.\" \n\nHowever, it will come as a surprise you can tilt the odds in your favor if you simply read a little about business, much about that particular one you want to start. And engage in *risk reduction* rather than wanton recklessness.\n\nConstantly are idiots here having a hissy-fit that somebody didn't start. They are hysterical that everybody should launch ...Launch ...Oh, em, goodness just LAUNCH!!\n\nAll that is just social proof to make them feel better about really bad decisions they have made. A bit like a crowd at the base of a building looking up chanting, \"JUMP.\" Helpful if you're a Darwinist I suppose, but not otherwise. \n\nMost draw a blank because they seek to get inspired outside of market knowledge -- specifically market demand. Some actually act as if they believe supply forces demand to spontaneously manifest ...POOF into existence. \n\nThey might deny they're into Build It And They Will Come cargo cult business. But their behavior betrays their bullshit. In case that needed clarification; *build it and they will come* is a bitch when you never solved for 'they.' \n\nYet they all post here about where to find those first paying customers. I have to explain if they're strangers then you didn't build for customers or anybody else. Bless your heart. \n\nDemand should almost pull the product out of your hands. That's your inspiration ... and why you ain't got none right now. \n\n[Problem Curation](https://www.reddit.com/r/RoastMyIdea/comments/j7kar8/problem_curation/) is something I wrote because it is often suggested you find a problem then solve it. There is still a little hitch finding the right problem to solve.", "It's Analysis Paralysis :) \n\nDon't over think. Just start... What worst can happen? If you fail, trust me it will be millions time better learning than doing nothing. Good luck!", "The whole world was built by people no smarter than you. Put in the work and get your 10,000 hours. The real failure is never starting.", "Nobody is ever ready to be a parent.\n\nNobody is qualified to be a boss.\n\nAnd nobody meets the qualifications to be an entrepreneur.", "It's me. \n\nNow I keep telling myselft that almost every successful business starts from a very small point and becomes very different to what they started as. You cannot be perfect before you start.", "I’m convinced that “being smart”, which is very hard to define anyway, is not the success criterion.\n\nWhat matters most is determination and not giving up. You have to be prepared to consistently continue doing what works. At the beginning. It will be hard to know if it’s working and that’s when most people give up.", "My advice is very simple. MAKE A PLAN. If you have a plan with logical tasks to carry out, once and for all you'll stop procrastinating and start getting down to work. It will make your life even easier. Check out this [smart planning tool](https://plani.ai/?show=B) that gives you a highly personalized plan. I suggest you make an execution plan, because it's free and it gives you tips and strategies that you can implement in your business ideas.", "You don't have to be smart to be an entrepreneur. I've met a lot of people that are far from smart and have started stuff. You have to be disciplined, and that's very different from IQ.", "As long as you feel you’re too stupid to be an entrepreneur you won’t be one. Start by challinging your mindset.\n\nWhy wouldn’t you be good enough to start a business? Name five successful entrepreneurs who aren’t objectively smarter than you. These questions will make you realize you’re lying to yourself to keep yourself comfortable instead of growing to become the successful person you could be. The choice is yours: grind or regret.", "Don't try to start your own business. That's usually not how you start.\n\nFirst find people who have a problem you can help with, then you build a business around people like them.\n\nThose will be your first customers.\n\nYou don't have to spend any money at all to start a business, I started freelancing when I was 18, I'd be fixing people's home computers, teaching how to use Microsoft Office, etc. and I charged per hour made about $1500/mo out of that alone.\n\nCost 0 no company no nothing just me and my time.", "6 months into the grind, I have those same feelings every single day. They don't go away, but dealing with them is more manageable with time.", "To be honest what you fear is highly likely to happen as soon as you start your business.", "If you feel that way then start a simple business", "I have the opposite problem, i think I’m smarter than i am", "Remember that if you do 10 businesses, the one that succeeds will probably be the one that no one cares about, which you might make money from, but has no actual significance. \n\nPeople will probably steal the nine that actually means something, especially if they have defence or intelligence or policing purposes. \n\nSource 1, peer reviewed: The movie Loki where the government bureaucrats have heaps of infinity stones just sitting around in drawers. Ideas for businesses are like Infinity stones. People collect them in case they need them, and the more you produce, the more they collect. PS. Say no to the TV. \nhttps://youtu.be/zdHijaBX2FU?si=JSxH-CG15k3P-zet\n\nSource 2, peer reviewed. The end credits of the movie Indiana Jones.  PS. Say no to the drink. https://youtu.be/i5pd1U6yXe0?si=GHvN8kFZniUouThx\n\nSupplementary assistance from Goldman Sachs. https://youtu.be/0PbjZ01ObLA?si=SBDwikvuH_vrjVxI\n\nAnd some additional humour to keep you sane.\n\n-- Goldman Sachs\n\n'rich person sacks'\n\nSee\n\nhttps://steamcommunity.com/app/1142710/discussions/0/3805027459310706590/ \n\nSee also\n\nhttps://simple.wikipedia.org/wiki/Looting?wprov=sfti1#\n\nSee also\n\nhttps://en.wikipedia.org/wiki/Looting?wprov=sfti1#Gallery", "Hopefully this comment helps makes you stupid enough to start, and people start sacking you instead of sacking me.", "Many good entrepreneurs will often tell you they're not the smartest people in the room. But they're curious and always ready to learn. Business is like a science project. You have to experiment to find what works. From my experience running a startup for 5 years, my biggest advice to anyone looking to start a business is to keep the cost low so you can continue experimenting over a long period until you find what clicks. And pivot quickly, but make sure you've thought about all angles before pivoting and not just pivoting for the sake of trying new things. Best of luck.", "I wrote this post not that long ago. I was basically saying that doesn't matter how good your product is if you can't sell it. My main point was that I met a lot of business owners that had a horrible product, but those business owners had great personalities. They knew how to sell, and they do it well. I work in tech. We have companies that host their saas solutions with us. I worked with  the owners of those companies. Some of those guys are dumb as shit. They have no idea how their products work. No joke. But they have good people's skills. They will tell you exactly what you want to hear. Trust me, you don't need to be smart. You just need to know smart people and have good salesman skills.\nI was somewhat in the same situation as you. I thought that I am not smart enough and all that stuff. After working with some of those owners, I am thinking to myself, why don't I start a business.\nEdit:sorry if I have grammar mistakes. English is not my first language.", "keep your full time job and continue developing the idea(s) in your head until you find one that makes sense. invest time to make this new \"idea\" a solution for people or business you can sell.", "My grandfather worked from earning $1 a day at a fish market to becoming an unofficial billionaire. He always tells me. There’s a reason for any dream or vision you have. It’s written for you if you genuinely put in the work and push through the failures.", "If you can:\n\n1. Figure out how to do something different or better than is already being done, and \n2. You have the discipline to keep messaging to that differentiation,\n\nYou have a shot at success, no matter how smart you are.", "Entrepreneurship DNA requires one to be fearless. Make sure you REALLY want that life. Its not all rainbows and bubblegum. But if you are passionate about it; its EPIC!", "Sounds familiar !\n\nAfter trying several things here are my lessons.\n\n\\- A day job or a part time job (or some income stream) to pay your bills.\n\n\\- Focus on initial user base (free app, free website etc.) with no revenues,  and hope to charge later or secure funding or get acquired for the user base. High risk, Lots of Sweat and LOTTT of Luck also needed.\n\n\\-Build a 'chargeable' product, start generating revenues with launch itself. Lot of positives in this - vet your idea sooner, test the market, etc. etc. I feel this is a better and a safer approach.\n\n\\- In any kind of a model, need to have a revenue/business model. Investors want a model/plan and current money flow.\n\n\\- Mentally, be prepared for worst. Which is utter failure even after 2 years, and have a Plan B.\n\n\\-If you switch or pivot, your initial efforts may go down the drain.\n\n\\- Lastly, I do believe that Luck (or God), does play a very important role. \n\n\\- That's 3 years of my hard earned lessons.\n\nSo if you want, keep going and try your luck.", "Advice:\n\n1. Start a side hustle.\n2. Define success as actions taken rather then results of actions.\n3. Business is not about smartness, it's about trust and willingness to serve customers.", "“Oh if you dont make 10k a month, you’re poor”\n\nIf you think this way, you are not a legit entrepreneur. Sorry to say it. A true entrepreneur doesn’t bash other people’s professions even if they’re “salaried” or “hourly”.\n\nAlso no matter how cool you think you are, you are never cool enough to bring someone else down. ", "You only hear it from course sellers. They aren’t necessarily legit entrepreneurs.", "100%", "Do people do this? I don’t think this is legitimately something I hear from actual entrepreneurs.", "Yeah, sounds like something an edgy teen or early 20s would say just to troll.", "People from all walks of life and every vocation do this.", "Yea right? That’s kind of it. If you brag about money, you don’t have any culture or class. I hate to say it, but banging on about Benjamin’s is kind of a flag for a lot of people. ", "tbh it sounds like something that a deeply insecure person who earns less than 10k/month would say.\n\nThe only thing worse than mocking people for how much money they make is letting yourself feel unworthy because of what some stranger on the internet mocked how much money you make\n\n\"A true entrepreneur doesn’t...\"\n\nas if they'd know what a true entrepreneur does.", "And even more so, those salaried and hourly people - they work for you. So, going around publicly bashing them wouldn't be the wisest thing to do. Even if you thought that way, self preservation would restrain you from saying it out loud.", "This is more of a guru mindset. No entrepreneur I know actually acts or talks like this. They understand that people in most professions are needed and valuable. They are just like their own employees and even if they don't share the same mindset, they are people, they're important, they're nice, and they have value.", "I don’t know anyone who runs a business that says that. I certainly don’t.\nWhy would I bother worrying about other peoples finances when I need to take care of mine first!", "Real Entrepreneurs seldom bash. They build. They grow. They cultivate. All the entrepreneurs I know build bridges every opportunity they get.", "This is a wannabe sub sir.", "99% of the people on this sub  are WANTREPRENEURS \n\nMaking less than the people they bash.", "This is just every entrepreneur/influencer on YT who sells courses. . .", "mfs on this sub don't even net 60%", "This sounds like wannabe entrepreneurs. Whenever I see those posts about '10k per month and here's how you can do it' I immediately think - if it was that easy/simple, everyone would do it. There is no magic formula or shortcut to earning money. People should realize that, just do your thing, manage your own expectations,  be consistent and you will earn.", "Lmao, real entrepreneurs know you'll have a multi-year period of working 2x-4x as hard for 1/2 or less pay. Sometimes this goes out to a decade or more. You'll never hear that bs from someone in the trenches.", "Nobody has time for that sh*t. Not if you’re busy building that is.", "You watch too much Tai Lopez and his clones lol", "I never do this, always congratulate anyone who’s brave enough to take the leap, tell them I know how hard it is and tell them I’m always happy to be a resource if they ever want to talk.", "Entrepreneurs try to find the positive side of things. They have experienced so many ups and downs and never value people based on what they make. They mostly look at how much passion the other individual has towards his profession. \n\nMost successful entrepreneurs create leaders. They will try their best to create a positive culture for others to learn and grow on their journey.", "he said trying to bring someone else down. ;)", " a post about not bringing other people down that bashes people who don't act like you think they should 😆\n\n\n*I have never heard this from an actual entrepreneur*", "It’s true. \n\nBut I think there’s a bit of a Reddit / X battle between pretender gurus / projecting and struggling side hustlers wanting to be real and they battle against thumb warrior naysayers who are equally fearful they just don’t project.\n\nThen there is A league management and A league business builders. We watch Reddit like some people watch daytime television, for amusement 🍿", "You could also say “other professions need to quit bashing on entrepreneurs”. Instead, you went this route. I’m curious about the reasoning behind that.", "I see way too many people on social media bashing 9-5 jobs in lieu of making money online.", "Agreed!", "Last year I spent several months building a friendship plattform (like a dating website, just for friendships) for people over 60 in Germany. After not being able to find a suitable technical cofounder, I built the webapp myself with [bubble.io](https://bubble.io), and launched the first version in January.\n\nI'm still working on it alone, I don't have any funding, or savings. Well, I did have a little funding that paid for my rent and food the past year, but that was only for one year and is over now.\n\nI thought I could bootstrap the plattform through budget friendly strategies like my own network, social media, PR, SEO, and a (print) flyer campaign.  \nBut after having worked on building the app itself very intensely (next to trying to get my youtube channel off the ground and trying out verious other small business ideas - dumb I  know) I now burnt myself out and feel like this is way too much to do for one person (at least for me). Especially since i'm not making any money from it yet, and am unsure if putting more work into will be worth it.\n\nIt's a good (as in social, good for the community, because it helps older people being less lonely) idea, and also the concept, I think, is not bad. But I don't want to go all in on this, 1st because I dont want to only be doing this for the next years passion-wise (and because there are other things/businesses I want to do), and 2nd because I feel like I have no clue if the business model is good or not (I did do my research, but still, how can I know if and how much and how many people would/will actually pay for this).\n\nMy original plan was to \"just\" build the app, launch it, help people wiht it and make some passive income from ir or sell the company at some point. But now I feel like its impossible to do this as such a small side hustle.\n\nSo far I have about 50 users, and haven't been doing any marketing for weeks now pretty much, because next to trying to recover from the burnout, I'm kind of in a decision paralysis, comtemplating if I should even keep going with this business or just shut it down and start something new, maybe in a smarter way.\n\nAny opinions or storys of similar experiences/doubts/feelings?\n\nHow can one (especially when working alone) know whether one should keep going or not?", "The problem is that your target customers are least likely to use or trust internet or social media especially in Germany. I think you are a decade too early.", "Social media business is always a tough job. I've tried in the past and the business model is only good for the big guys. The social media model works entirely with Ads and to be able to have this model you need to have many users. It's not easy, it really isn't and for it to work it depends on the energy of the founder, which from what I see isn't much. I suggest you attract enthusiastic cofounders with the right skills to make it grow. Possibly a pivot to the project could help with success. Make a plan with logical tasks to measure results, if you don't have a structure/system you will feel lost. I suggest you check out this [smart plannig tool](https://plani.ai/?show=B). The tool makes you a highly personalized plan full of tips and strategies that you can implement. I believe it will be a good help.", "I have been exactly where you are a few years ago. \n\nI’m going to ask some uncomfortable questions, but I mean well: How much are those 50 users paying? How much time did you invest altogether? How mich traction are you getting (user increase per day/week etc)? Can you compare those values and say with a straight face that it’s going to be profitable soon? If not, it’s time to either stop (see fallacy of sunk costs) or go back to the drawing board. \n\nIf you go back to the drawing board, take a look at Lean Startup by Eric Ries or some of Steve Blanks work. There’s plenty on Youtube also. This might be the best bet.", "Given your burnout, uncertainty about the business model, and interest in other ventures, it might be a good idea to take a step back, reassess your priorities, and think about whether it's worth continuing with your current project. It's important to trust your instincts and seek advice from mentors to help you make the right decision.", "Read Million Dollar Weekend. Will take you 2 days. I used to approach ideas like this (i.e. I have a great idea lets build it, put it out there, and then get the customers to join because why wouldn't they, my idea and vision is awesome) but unfortunately it's much better to go customer first and build from there, especially when bootstrapping as a non technical founder.", "I preferred Make by Pieter Levels.\n\nI found mdw was a bit scattered.", "To preface: 23m on my 3rd repair service business. I moved out of my home state last July.\nI had a successful iPhone & computer repair service that is still #1 on google and still gets a ton of calls.\nI know this business is valuable to the right person. How do I go about selling this business? I would include the SEOd website, the phone number attached, a custom ticketing system, and the google business page.\n\nThe current manager of this service is not doing a great job. We initially agreed on 30% of profit goes to me, but he has been entirely lazy and won’t schedule half the repairs (more if I’m guessing).\nSince I am no longer in the state, I cannot micro manage this business the way I once did. ", "🌈 Hey E-commerce Community!\r  \n\r  \nI'm reaching out with a small request and a big dream. 🚀 I'm a student passionate about understanding the nitty-gritty of e-commerce, diving deep into what makes online stores tick, and finding ways to help store owners like you thrive even more.\r  \n\r  \nI've been working on a project for my university studies focused on developing insights and tools for e-commerce success, and I've created a survey to gather your invaluable perspectives. Your expertise could light the way for future innovations in the e-commerce space!\r  \n\r  \nWhy your feedback matters? Your voice is crucial because real, lived experiences fuel meaningful change. This survey is my bridge to you – the experienced, the trailblazers, the problem-solvers of the e-commerce world.\r  \n\r  \n👉 Survey link: https://5rlkergfejw.typeform.com/to/RWsIcpzd\r  \n\r  \nIn gratitude for your time (I promise it's short – about 3 minutes!)\r  \n\r  \nI understand everyone’s incredibly busy, and this might not have been clear in my initial message. This isn't just another survey; it's a step towards understanding our challenges better and finding ways to address them together.", "1.5 years ago, I had made a semi-popular casual web game. Till date, it has had \\~500K unique players in total and currently gets \\~20K MAU organically. The only recurring revenue right now is through ads and it's not much. I hired an intern to work on some feature development for it and that's going great - I'm seeing increased engagement, though not in the number of users yet - thinking of getting some SEO and marketing (through YouTubers) done.\n\nI'm not sure how good these stats are and if there's an opportunity to make decent money with IAP's. Can you guys help understand if this is still an 'opportunity' worth pursuing by continuing to build features and spending money on game marketing from these metrics? My current plan is to make more features, do some marketing/seo, make some monetization channels and then sell it in 3-4 months.", "Hey Reddit fam,\n\nI’m here with a bit of a unique request. I craft handmade rugs and carpets with a whole lot of love and care, and I’ve been on the lookout for someone who’s as excited about these cozy creations as I am. I’m not just trying to sell you something; I’m on the hunt for a bulk buyer who gets the charm of handmade and wants to keep the tradition alive by regularly teaming up with me.\n\nIf you’ve got some experience with the world of handcrafted goods or have some wisdom to share about finding the right partners, I’m all ears. And hey, if you’re in the market for a rug or carpet that’s made with a personal touch, hit me up. Let’s chat and see if we can make some magic happen together.\n\nAppreciate you reading this, and I’m looking forward to any tips or connections you might have.\n\nCatch you later. ", "i have an a idea for you. create an a website about your project or sell them online. because you know online presence is more important for a business. if you need any help for this project i am here for your consultancy  \n[https://web.facebook.com/profile.php?id=100022755204276](https://web.facebook.com/profile.php?id=100022755204276)  \nyou can visit my Facebook page or dm me.", "I managed to hit around 500k in revenue last year running and ecommerce store as a solopreneur, thanks to outsourcing some tasks to freelancers and a virtual assistant.\n\nIt felt like I was on the right track, especially with a recent move to a new country for tax optimization.\n\nYet, I didn't anticipate the mental toll this change would bring.\n\nJust a few days after moving, and I'm struggling with depression and severe, constant anxiety for 10 days.\n\nEvery day feels like a battle against tears, crippling anxiety, tension, and a profound sense of apathy. This emotional turmoil has led me to question everything, including my past entrepreneurship goals.\n\nIt feels almost ludicrous now, considering the fragility I've come face to face with in myself. These experiences keep proving how vulnerable I am, making me rethink if I should aim for simplicity and serenity instead of ambitious entrepreneurial dreams.\n\nThe depression-anxiety mix feels like a disability, hindering me from reaching my full potential.\n\nRecently, a collaborator proposed an exciting opportunity to manage other e-commerce businesses, but I had to decline. My mental health often forces me to miss out on so many opportunities.\n\nI've been dedicating my days to managing this anxiety through breathwork, meditation, rationalizing thoughts, and exercising.\n\nYet, it feels like it's not making much impact on my emotional state. This week, I've only managed to work a few hours, leading me to consider selling my e-commerce store to focus on my mental health.\n\nThe realization that I'm dealing with severe issues, traumas, and attachment disorders is daunting. The same struggles and triggers resurface after time and time, leaving me feeling trapped in a cycle of emotional turmoil.\n\nTwo years back, my health declined  after some messed-up events. Ended up with a trauma response so severe it knocked me off my feet, both mentally and physically. Couldn't function for months and had to step away from my business until things got somewhat manageable again.\n\nAt 29, finding myself crying daily over feelings of unsafety and missing my mum due to attachment issues feels pathetic.\n\nAnd here I am, questioning my identity as an entrepreneur. It's a bitter realization that while I possess the skills to generate income, I'm simultaneously battling what feels like a disability.\n\nI'm at a point where giving up on my past entrepreneurship goals seems the only viable option, focusing instead on maintaining a business that merely ensures survival.\n\nLife seems so unfair.\n\nI have the capability to achieve financial success, yet I'm shackled by mental health challenges.\n\nI'm sharing my story here not just to vent but to connect with others who might be facing similar battles. How do you handle entrepreneurship while managing mental illness? Is it possible to find a balance, or is stepping back the only solution?\n\nEDIT:  \nI can't take meds, I've taken them 2 years ago and gave me lasting side effects ruining my health, I am still recovering, and it's my main struggle day to day in addition to what I am experiencing since I moved to a new country", "Hire someone competent, give them motivation to do a good job with % equity earn in over x years\n\nThen step back temporarily/permanently", "You might be over estimating how much *profit* a 500k e-comm business produces. Not really enough to outsource management completely in most cases.", "I'm like half-competent and I've got lots of time ;) ;)", "Easier said than done.", "Easy to say, hard to do.", "Hes probably making jack shit lol", "This", "When I was in Ecom a few years ago I heard from a lot of people the profit margin is usually 10-20% if anyone’s curious. Mine was closer to 0% though and I closed my store down 😅", "Right, I did $500k in a side eCom project and it only brought it $40k net", "Yeah my business does over 500k. My net is around 150k. And I'm definitely on the higher end.", "Obviously, but this is the solutions game - not the \"I can mention all of the problems but offer none of the solutions\"", "I could do this and so could many others here. Shouldn't be too difficult.", "May I dm, curious to listen to your story!", "No room for profit in my business plan.", "> I did $500k in a side eCom project and it only brought it $40k net\n\nwoah. was there physical product involved?", "If I'm understanding you, are you saying you have over 500K in sales and you get to keep around 150K?\n\nThat seems pretty good to me! \n\nAre you selling a physical product that you have to have manufactured and shipped to customers? That's where I'm trying to go & I just want to hear somebody is doing that.", "I’ll share here as there’s not much to share tbh. It was much more small time than this guy, about $20k revenue total on my “winning product”. Ad costs were extremely high and I had no FB ad experience, so ad costs + COGS equaled nearly $20k as well over the duration of the store. It was a lot of effort for little return, so I decided to close it down. Was a great learning experience though! I went back to my 9-5 job for the stability (and healthcare/benefits).", "$300k spent on ads, $120k on physical product inventory, $50k on Shopify fees and shipping, $30k on payroll, etc.\n\nAnd that was with a really, really good conversion rate (6+%) from initial ad click. eCom is really tough in direct response, despite what internet gurus want to tell you to sell you the dream.", "Yes. And I ship to customers. I do not manufacture.", "W2’d here, I dabbled with a business, too. Lost ass. Ads are so crazy expensive and inefficient when done wrong, as I did most of the time. Google adwords did once bring in a random $850 sale for a product that averaged $30 per sale, though, which was really cool. It was a very expensive learning experience.", "wow that's insane", "Look, your business can support you through this, and these issues don’t mean you’re not a good entrepreneur.\n\nIt’s never about what it’s about with entrepreneurship. The challenge that most people have when they’re working on their businesses, is that their businesses become a painful mirror for them. The business inevitably finds a way to bring up everything that they haven’t dealt with and put it in front of their face. And it can be really difficult. I see it all the time with Ayers I work with who have unfinished business from their childhood or earlier relationships, and somehow that business manages to bring the exact thing and put it at their feet.\n\nNow you have two different pieces here. One is your strategic, big picture approach to what you wanna work on in your life. The other is the operational components of your business and making sure that it runs day-to-day from an automation standpoint.\n\nWhat you need to do around your large pictures strategic will dictate what you do around your logistics and operational questions. I think you most likely need to give yourself some time to heal, and work with therapist, and take some of the pressure off. I don’t suggest that you shut your business down, because not having cash flow can make all of the things you’re feeling worse.\n\nAs com suggested, maybe finding someone who can take a percentage of the business, or take the business on while giving you a percentage of it, would be a good place to begin. You don’t have to give up ownership, to have somebody else handling operations and getting profit from your business, because you can have a governing agreement that keeps you as owner, but allows them to operate the business or something similar. These things can easily be drawn up by an attorney and you can find a way to protect both of you. This is the outsourcing route.\n\nThe other option is that you continue to run your business, and do so in a way that deeply sustainable for you, with the majority of your operations, outsourced to people that handle the functions that are not core, and reduce your overall obligation to the business down to the minimum. This is the optimization route.\n\nThe third option is that you can sell the business. You can get a good price for it, specially if you sell it on an online marketplace, and use that cash to give yourself some time to recover and maybe rebuild another business. This is the sale option.\n\nLastly, you could step away from the business entirely and shut it down. It’s always a bit tough when I see entrepreneurs is going through a mental health crisis and know that they’re sitting on a lot of value for themselves to watch someone do that, but at the end of the day, you have to prioritize your mental health. Like I said, I wouldn’t suggest this, but you have to have it as an option so you don’t feel trapped. A lot of times we end up, feeling really trapped by our businesses, and it can lead to feelings of anxiety, depression, Etc. Don’t let the business trap you, so keep this option on the table in case you absolutely absolutely feel like you have no other choice. You are not beholden to run the business , unless it serves you. This is the shutdown option.\n\nOK, so we have four options:\n\n- shutdown\n- sale\n- outsource\n- optimize\n\nThese are the four different choices that I can see that are very general, big choices, but they are the choices of general direction for handling the situation. From the strategic standpoint, the part where we operationally handle things.\n\nThe larger issue around depression and detachment, and all of those other things things, is something I need you to understand that many entrepreneurs go through. I run adventures studio, and I work with entrepreneurs all the time. The number of entrepreneurs that suffer from mental illness and difficulties with emotional self regulation, medication, childhood, trauma, and the plethora of other issues that get in the way their businesses is something that is a bitOf an epidemic. It’s not unusual, and in fact it’s often something that seems to be part of what drives people to be entrepreneurs and many cases. I need you to understand that you’re completely normal, and that you’re going through. This does not make you not an entrepreneur.  Of an epidemic. It’s not unusual, and in fact it’s often something that seems to be part of what drives people to be entrepreneurs and many cases. I need you to understand that you’re completely normal, and that you’re going through. This does not make you not an entrepreneur. \n\nThe question that comes up, obviously is a bit personal for public forum, but the real issue is whether or not you’re getting good professional help and dealing with these issues. Because, nobody can handle what you’re going through alone. I know, I’ve dealt with depression in companies I’ve been running. You have to have help. \n\nDo you have good help? Do you have a team of people that are helping you to deal with these feelings, in a way that’s healthy, because you’re not gonna get there by meditating and trying to control deep seeded emotional issues that come from very deep inside of you. There needs to be some help for you, and I think as entrepreneurs we often times look for asking for help as a bit of a failure, as if we should be able to do it without fuss and drama. But the truth is that everyone in entrepreneur land is a little bit fucked up and we do need help and support and getting through these times, especially when we’re dealing with things that are deep seated emotional traumas . \n\nThe largest strategic question of what you want to do with your life in your career, is obviously going to be taking it backseat to the fact that you feel desperately out of control and scared and fearful about losing your company, and also about being out of control with depression and anxiety.\n\nOK, so I know I’m being quite for both, and I’m dictating all of this on my phone because it’s far more than I could write, and I’m not near a laptop, but I want to to know that you hear that there are entrepreneurs out here that have done And dealt with exactly the kind of stuff that you’re dealing with, and that you’re not alone. It’s OK. It’s going to be OK too. You’re going to turn out OK from this. \n\nSo, do you have help to deal with this situation, because I really don’t want to find out that you’re trying to control this incredible intensity of emotional upwelling with meditation and relaxation techniques or whatever. You need a bona fide therapist, who can help you to process the trauma that’s obviously coming up.", "Continued…\n\nYou know, one of my mentors taught me that all businesses intensely personal, and I know I’ll dox myself to a certain number of people for saying that, but it’s the truth. Everyone of these companies were building is full of lessons for ourselves, and way we can grow and be successful, and we build them not only to challenge ourselves to make money but to challenge ourselves to grow as people. And that’s actually a mentality that’s incredibly important to understand in business. We are expressed in the businesses that we build, and businesses are all about our relationship with ourselves and others. There is no demand from customers, there’s only connection between people, and with a few exceptions of quant businesses, all businesses are relationship. Even market demand is nothing more than customers wanting your product, and by extension wanting you.  And so if all business is intensely personal, it’s really important that we work on ourselves so that our business reflects ourselves, and that means being loving to ourselves in a way that allows us to grow the business and maintain our best selves in the process.\n\nThat’s why it’s incredibly important for you to to take care of yourself, because you owe it to what you’ve built, and to yourself as an extension through your company, and simply to yourself as a human being who deserves love and care just for being here.\n\nOK, so I’ll wrap up this diet tribe with a reassertion of the question about whether or not you’re getting good help? That’s the most important thing, and then let’s talk about the four different options, and see if you have any more that you could add to it, maybe I can help you figure out which of those options makes the most sense for you, and give you some idea of how you can get that done. And I’m sure the other members of this community would be really happy to jump in and help me do so. There are some really amazing people on here. \n\nThe most important thing I can tell you is to hang in there. One of the best and most important lessons I ever learned when I was going through hell is to keep going. You’re gonna be OK. Don’t quit, and don’t get scared. You got people here to support you.\n\nAnd again excuse any typos I dictated this because I can’t type all this on my phone and don’t have a laptop available atm.\n\nTalk soon. Hang in there sparky, it’ll turn out better than you can imagine right now I promise.", "All of this is so brilliant and valuable - about therapy - I pursued EMDR to handle the trauma of being FUCKED IN THE ASS by one of my suppliers and all the psychological trauma that went with it. \n\nEMDR helps a person process trauma so it f'cks you up less. This led to me recognizing issues surrounding my supplier's treatment of me mirrored my family issues playing out at the same time, falling out with my brother  yada yada yada disaster lots of *Emotional Damage* Jesus \n\nTherapy. Not some dumb jackass but ideally a real therapist who understands family of origin dynamics and all that stuff. \n\nYouTube can also be helpful if you have an issue you're trying to deal with, such as dealing with addiction  (yours or someone's), narcissistic abuse (!!!), divorce, whatever I don't know but YouTube can be very helpful in learning about systems and people and how some certain things work. Family roles. \n\nIt is best to see a personal therapist but YouTube can really crack open your nut.", "You’re a real one for typing all of that out :)", "I can't thank you enough for this reponse and all the time you took to formulate it!\n\nI will save some of your quotes for reading again them later.\n\nAbout the 4 choices, I may consider selling the business, cash out some money, take some time to heal and meanwhile starting to plan a new brand, I already have the product idea. Taking in account that I can come out of this hell of course.\n\nAnd yeah I've scheduled a call with a therapist for tomorrow.. I've been in therapy also in the past, and while it is helpful it is not a miracle.  \n\n\nThanks again for this post", "As a small business owner myself I greatly appreciate your responses.", "So helpful and supportive 👏🏽", "This is really fantastic advice. Thank you.", "Couldn’t you just find another supplier?", "I support small businesses. I have supported many people with mental health problems. Dm me if you are thinking of bringing in some one to support your business.\n\nPart of the depression symptoms are that you will loose interest in the things you used to do. The body needs rest for few years so that your brain muscles can heal. Don't worry take it easy you will recover and then you can continue. Till then think about how you can manage your life and your business with outside help and supports. \n\nYou need out side help and support to improve your mental health. You just need enough to survive and keep the business going then scale up when your health allows it.", "Let’s always be there for one another in this community. It’s hard enough with help! ;)", "lol no, because my product is for such a niche market and I'm a woman so all the suppliers tell me the market *doesn't exist* and the problem *isn't real* because nobody else who has tried to launch a solution (many people) have been successful yet\n\nso they won't make it\n\nso I finally got someone in India to make it\n\nand he fucked me because he got mad I pointed out he was violating our contract and failing to provide information as agreed because he kept fucking around and missing deadlines despite having the materials \n\nand got mad I was daring to do it while female... \n\nand when you spent your startup capital once, you no longer have it", "Im a woman as well. Did you pay in full from the start? Manufacturing in India is hard because of their lack of respect for women.", "Are you sure it’s not because you moved to a different country?\n\nI moved to a different country and it was great in the beginning, but then I fell into a deep depression. Being an expat is incredibly hard. It’s so lonely and isolating. \n\nI wouldn’t sell your business just yet. Go back home and be around your mum and loved ones and center yourself. \n\nAnd you’re not pathetic at all. I moved back to my home country at 35 because of mental health issues. I’m doing great now because I was able to work through my issues in a familiar country and with my family supporting me.", "I agree, moving to another country it's very hard and most immigrants feel depression I know u mover with economic stability and it is different than a immigrant that goes without job etc... But the feeling of not knowing anything etc is something that happens to everyone you are not unusual, most people have some type of issue when they move to a new country", "Yeah, it is the main reason... but the root cause of the anxiety is that I am terrified of remaining alone and not being able to take care of myself and thrive through life. I've been too emotionally dependent on my mother, and as a result, I have this attachment anxiety. Plus, the fact that my dad has already passed, and she is 70, and now far from me, I am getting intrusive thoughts of being abandoned and alone in the world.\n\nAdding to the situation is that I am dealing with an iatrogenic injury for more than a year after taking commonly prescribed antidepressants and am in the process of recovering. I think I underestimated the impact moving to a new country would have had on my health. I am too fragile at the moment; I would have waited more time to get in shape again.\n\nBut the fact is that it's only been one week, and I think that giving up already would shatter my confidence even more and reinforce the anxiety I will feel in case I try to move again.\n\nBy the way, it's great that you've been feeling better after returning home. May I ask how long you lived as an expat?", "I moved 30 mins north of my family & I get the blues ", "I moved to another country and for 12years I couldn’t go back to my home country. It was a great and terrible decision. I missed so much and got disconnected from family and friends. Weight what you are getting to what you are losing, it is not going to be pretty, but accept the consequences and live with it. I was very honest with my family about my choice to stay and their support meant the world to me. You can move back and loose X or stay and gain Y, accept this.", "I also moved away from my mom to a different country and got a horrible anxiety and fear of her dying… I think you should take 1 day at a time, if you are there for only 1 week, it will likely feel easier eventually. If you have the option, go visit her before you plan to go back to your country, even if you are staying just for a few months in your new place. \n\nIn a weird way, being away made me much closer to my mom, and we found a routine that works for us in terms of how we communicate. It also made me more present when I visit my home country, so even though it hurts, it can also bring good things. \n\nI hope you feel better soon!", "Can you move back? No need to tax optimize if you're doing ok financially. Not worth it to live in a low tax country, if unhappy everyday", "yeah but this problem is not going away when you sell your store it will get worse because then you have no income.\n\nor you take a break and work in a bar for a while. can you get back to where you left off?\n\nthird option is to sell.", "You need distractions outside of work. Pick up an enjoyable hobby, and create a distracting routine that puts your mind elsewhere. The worst thing which you don’t want is being alone with your thoughts.\n\nRead up some books, do some research for your business etc.", "You might find an online therapist that specializes in CBT. Helped me tremendously. Also not all \"meds\" are the same. You might find some that work for you.", "Do you take meds? I had similar problems and meds have greatly helped.", "Thanks for sharing!", "I can, but I already paid 10k for compamny formation, residency, 1 year accounting, rent etc.\n\nThe thing is that here where I got the residency I can mantain it just saying 60 days a year here, and can stay up to 6 months home", "This is the way, I am sure your momma is missing you too, so this will hopefully work out best to spend most of time at home", "Where’d you move? Best way to feel less alone is to find people. Reaching out is the first step to finding someone.\n\nComing from an extrovert", "Cyprus", "You hit 500k , moved location with a tax benefit in mind .\n\nThe monetary part obviously made sense , and assuming you are on 20 to 25 % profitability - you have close to 100k in hand and a new location would be decent lifestyle .\n\nWhy not focus on those wins , get into groups and build a social life , may be do an intense excercise , that can help cope .\n\nKeep the current tempo and as you gain confidence - incremental steps to grow your self and the business . \n\nAnd don’t worry people miss people all the time , some are bold enough to cry and say it , others cry inside .  All feel lonely at sometime , or how you work with it .\n\nYou should be able to bounce back from this !", "Thanks for your kind words!", "All the best \nYou got this", "Hey bro, I’m an entrepreneur and fuck it’s rough af. it’s a roller coaster and I deal with mental issues too. Life is unfair. Yes I get freedom and make money and do all the work and take all the risks. And my ex boss who was a billionaire commited suicide a few years ago… he had mental issues too. Worked like crazy.", "Who was the billionaire. What’s his name?", "There’s more unknown billionaire than known.", "if I were a billionaire the idea is not for everyone to KNOW I am a billionaire (people who already knew me would know, but like, not *new* people), I'm not taking out ads to publicize myself, I'm not producing an entire 90-min Eras Tour style JLo biopic on myself. \n\nSo yeah if I were a billionaire I'm pimping it in my own little world, no need to have the whole planet know my name. Unless Jeff Bezos though, gotta wonder about that guy.", "Everyone gonna wanna be ur friend and hang out with u for their own benefit.", "I had a similar problem, I was looking at possibly bringing in $100k+/month. Got a good psychiatrist and good therapist. I got a mix of 5 different drugs. Was able to push it like a normal person for 3 years, grow with 80% margins(online product), sell and soft retire. \n\nI was diagnozed with GAD with panic attacks with dissociation, selective mutism, and depersonalization, PTSD and ADD. My panic attacks used to be so severe that I often ended up in the ER. Taking benzos for 3 years was well-worth it. Low dose and never abused it. I think the drugs are too stigmatized. They are OK if you are responsible. I don’t feel any long term side effects. Except much better than 5 years ago mentally.", "This should be the top comment. OP needs to find a good shrink and get on some meds.", "So happy to hear you doing better. How are things now? Kinda dealing with the same thing with the GAD but im unmedicated. Have been self medicating for years with things like kratom, but it's backfiring.", "Wow I am happy medications helped you regaining your life without side effects!\n\nUnfortunately this wasn't my case, I went on meds around 2 years ago (ssris and benzos) and they gave me long-lasting side effects that are still persisting after 1 year off (slowly partially recovering btw).", "Yes yes. Therapy can be hit or miss, especially if there is language barrier. Meds are a big help - I was in France and a smart psychiatrist got me on tianeptine which was a GHODSEND and within about a month I wasn't panic-stricken at having to dress like an adult and do meetings.", "So I was completely unmedicated to a year and I didnt have single panic attack, but the struggle was there. I had to constantly use the tools therapy taught me and it had a toll on me. My psychiatrist and I decided that I will take a minimal dose of clonazepam once a day, probably forever. No more struggle. I feel like a normal human being.\n\nIt doesnt get me high or sleepy at all and seems like tolerance is not a problem.\n\nI also have to add for context that my brother committed suicide last year and I didnt have a panic attack. I think this speaks volumes about how much the professionals have helped me.\n\nI now sometimes take Kratom for fun sometimes but I wouldn’t use it for GAD.\n\nIm also on a mix of antidepressants called the “california rocket fuel”. Not for depression, but it helps a lot for GAD, in my case.\n\nAlso, important, I completely stopped drinking alcohol and caffeine. And im getting plenty of sleep.\n\nAs you can see theres a ton of variables and it’s not something to solve on Reddit.", "I’m sorry it didnt work for you. One solution won't work for every person. Get psychs, more therapists hopefully you can find something that works for you. Unfortunately I found out that the psychiatrists that charge A LOT of money tend to be really good and know stuff the regular ones don't. They are also typically on the bleeding edge of medicine and are not afraid to hook you up on new regimens like several Ketamine infusions that I did. But that's just my experience. My psych now charges $900 for a 15 minute consultation. IN EUROPE. She won the psychiatrist of the year award last year so that is probably a big factor in that. She does research and is cited quite a lot - I would look into these factors when choosing a psych. Don't be afraid of the price - you don't need that many consultations with the psychiatrist, it's the therapist that takes a lot of time.\n\nAlso: its not only drugs. I had major trauma that i dealt with. Drugs alone wouldnt let me be at peace like i am rn.\n\nAnd like I said in the other comment, my brother killed himself last year and I didn't have a panic attack from then until today. I think that speaks volumes of changes that happened in my brain. And I am able to cry, they didn't make me into a Terminator ;)", "> benzos\n\nbenzos are the devil they are very very bad I'm so sorry you're recovering from that, they are SO HARD to get off.", "I had 6 different therapists in my life, lmao. Definitely have to find the right one.", "Normal things for entrepreneurs that don’t get talked about a lot.\n\nWhat I can suggest is: when you feel down, think that it’s all temporary.\n\nYou don’t have to manage your business(es) forever. Give yourself mentally a limit, think like “just another year”. Just to make some more money and then sell for example.\n\nSuddenly putting the focus on managing it for the last 365 days will put everything in a new light and your work will seem easier and will make more sense.", "Wow, this is like the mindset I've been adopting all the time I worked on this business! I worked out of discipline mostly, because of some health problems and mental issues I don't get much enjoyment from working on it like it was before.\n\nBut now not sure if I can keep going.", "Optimize your sleep. Workout regularly. Take basic supplements like omega-3, magnesium, etc. For anxiety try l-theanin, passion flower, valerian root. It should be enough for most people. If it doesn’t work consider medication.\n\nI understand you, it is tough. But if you ruin you business you will feel much worse and lose your income. Find a way to handle you anxiety. Do not give up. You got this", "I am doing all those suggestions already.. meds I can't take they gave me lasting side effect when I took them 2 years ago.\n\nI will try not to give up, thanks!", "Practical and serious question - when was last time you had a massage? \n\nSex, romance, affection are not necessary for survival, but basic touch is!!! Just science- and suggested to me by bf who had psych phd when I moved and struggled with anxiety. \n\nGo get a therapeutic massage weekly - or maybe what you need as you adjust and settle into nee community abroad. Hugz", "I have seen lots of posts and comments discussing supplements and etc compounds to overcome anxiety on r/nootropics and r/biohackers. It's a very interesting starting point for research.", "which country is it? seems like a weird coincidence that your stress emerges right when you move there", "Cyprus, but the problem is not country-specific, it's around moving abroad", "Do you speak Greek at all? Cyprus is a hospitable, encouraging and affectionate culture for most part.  They have lowest rates of psych med use and suicide rates in Europe! It’s the lifestyle and being rooted in community. \n\nJoin a folk dance class at a local church or community hall and get adopted in for festivals they have regularly through out the year - soon you will be eating, drinking, dancing or enjoying music and be Happy with $$$ ;) \n\nChin up, you moved to paradise- opa! \n\nMake a donation to upgrade a local school - they are struggling economically since euro crisis and depend on tourism. After that - you are IN with community with sincere admiration, respect and adopted.", "You need family. A sister a brother someone that you can trust and share these feelings with", "I do offer support to people who are going through mental health issues. If the family is good they can help. But for dis functional families one needs out side help. A mental health professional is very useful in such a case ax they are experienced in dealing with the issues.", "i've been talking to my mum on the phone daily", "You need them around", "Health above everything else.. trust me when you’re on the verge of death due to a stress induced heart attack nothing else will matter but your health. All the money in the world is meaningless if you can’t enjoy it. \n\nShould you call it quits? No, but you should take a step back and work on reducing your stress. \n\nI used to work 12+ hour days and now I do maybe 2-3 and yet I still get what needs to get done. Start your day with a gratitude practice and focus on the good in your life.. that will instantly put things into perspective for you. Zoom out often and get out of your depressed state. Go for a walk, pet a dog, get a hobby that isn’t work related.. find your purpose. \n\nGet a therapist. They can teach you some tools to mange things and get you out of your funk. You’re not alone, being an entrepreneur is tough. I have been at it for nearly 20 years. \n\nYou seem more aware than most based on your post so I have high hope for you. Good luck op.", "Agree with this comment.  Would also suggest to see a therapist (telehealth with one from your own country preferably) and think about moving back to home county.  When you run a company you can have an underlaying persistent understanding of how fragile the whole thing is.  Especially if you are solo.  Mix that with a move from one country (and likely culture) to another and you are now feeling vulnerable in a place where nothing is familiar.  No connections to people, places, or anything yet.  That will freak your subconscious out.", "Thank you!", "Yeah this is what is happening exactly.\n\nI add that I am struggling with also physical health, I was injuried by commonly prescribed antidepressants 2 years ago and I am still struggling to recover. I really underestimated the impact changing country would have, and that would open up subconscious scars.", "Talk to a psychologist and psychiatrist. Take meds", "I'm surprised this is so far down when it should probably one of their first choices. \n\nI agree 100%, OP should get help first and foremost, anxiety and depression can seriously hinder someone's ability to live a normal productive or fulfilling life. \n\nMeds maybe necessary but only a therapist or mental health professional can determine that like you said.", "Bupropion, Lexapro etc....talk to a psychiatrist ", "have a therapy session tomorrow. I will skip on the psychiatrist, I went on meds 2 years ago and they ruined my health with lasting side effects. Thanks for the suggestion anyway!", "Did you check for a b12 deficiency? Maybe take it anyways, there’s little harm. I’ve had the same issues and it turned out to be vitamin deficiency.", "DO NOT SKIP THE PSYCHIATRIST ", "Just curious why is it so common on this community to say you \"did <dollar amount>\" ?  Should you not state your take-home instead ? Why is it impressive that someone \"did\" a certain dollar amount when for all we know it could be putting them in debt ?", "That wouldn't make sense because different people have different tax situations. Why are so many here obsessed with knowing how much profit others make?", "People also reinvest. You can take home nothing but have had a significant profit, or take home a decent amount of a relatively small revenue. It’s a commonly used metric to give other people an idea of the size of the business.", "If you don't want to share numbers, don't. But if you want to share numbers, don't just share the top level number. Share the bottom line instead. it's MUCH more interesting.", "If you want to know, the profit margin is around 27%, but flexing on the numbers I did wasn't the main topic of the post", "In this case it's irrelevant because it's just a bit of background info and not related to the main issue. Does it really matter if the profit is 60k or 70k?", "$500k top line doesn't mean much...... its your bottom line after all expenses. \n\nYour situation may simply be due to poor financial/money management.  These things go hand in hand. \n\n\nAnyway, fix the money and hire out the work, so you have time to do things for you!", "I think that moving back with your family and hiring people to do par of the work for your business would be great ideas so you have more time to workout these things", "It pains me to hear your story. I've been through my fair share of challenges as well. I'm 37 now, and for as long as I can remember, I've lived abroad.\n\nLet me tell you, expatriation is a deeply enriching journey, but it's also every bit like a wild animal. It preys on your vulnerabilities, exacerbates them and can break you like nothing else.\n\nIf you've got past traumas, tend to put others before yourself, prioritize friendships over networking, long for a soulmate, or crave stability... well, you've got to ensure your mental well-being and financial situation are in a good space.\n\nOver the years, I seen so many expat couples, often with kids, fall apart. I have seen multimillionaires going back their home country to work for underpaid jobs. I seen people losing their sanity.\n\nSo, please, make your mental health your number one priority. Aim for balance in everything you do. I've learned that managing depression is a bit like mastering the art of juggling – you have to keep all aspects of your life in motion without dropping the ball. It's a mindset shift, from the very first moment you wake up to the thoughts you have when you're about to close your eyes at night. Think it, do it, and therefore you'll be it. Speak to yourself out of depression. Be intentional, and don't let procrastination hold you back. You've got this!", "I am breaking up, I am too fragile and underestimated how moving would shatter me", "1. You're NOT too fragile.\n\n2. Expatriation is a BITCH. All expatriates underestimate it, idealize it. I know I did.\n\n3. Granted, it took a toll on you these past days, BUT you are not going to let it devour your life. Redefine your\n- goals,\n- your purpose,\n- and what it would take for you get there 'sanely'. It can be a girlfriend or a friend. Hitting the gym with a personal coach. Taking an in-person course in the country where you are and socializing (I just took Salsa classes 💃and met tons of people). You can even join entrepreneurs virtual coffee dates where basically a small group of business owners get over Google Meet and chichat, motivate and support each other.\n\nFeel free to reach out if you need to talk 🙂 You are tougher than you know. I firmly believe you are going to get through this.", "Before shooting me down, I was diagnosed with general anxiety disorder, prescribed alprazolam and escotralopram, took myself off them, and now don't suffer at all\n\nThe problem is that you've had a big move, which can make you feel anxious, but now you're focusing on being anxious, which creates a cycle of anxiety. \n\nYou need to break the cycle. Go out and do something new, that's enjoyable. Focus on a new hobby. Focus on absolutely anything other than your mental health, and your mental health will improve.\n\nExercise, sunlight, and fun times are the answer. Good food, long walks, and me time. The business isn't the problem. I'd bet it's the fact that you've stepped way out of your comfort zone by switching country, and by facing it head on, and getting out there, it'll get easier.", "Hey man can i just say ive not read something so relateable when i needed it. Im currently experiencing a high stress experience associated with my post phd submission. Far too much on my plate and its lead to me being paralysed. Im trying to avoid work but i have corrections due in months. \n\nGoing for long walks and motorbike rides until my head is back. I cant do anything if my brain is fucked. I hope you find your peace, set aside a budget for x period and do what you want. Recommend avoiding screentime thats for sure! Sending vibes", "I went through this in the last few years. I hired replacements for myself and moved from a hcol to lcol near family. Lost 20% of income for salaries but gained my sanity. I now work 5-10 hours a week instead of 50-60 maintaining the business and feel a million times better. Best decision I ever made. The change in environment also brought some perspective. The rat race isn’t worth it once you hit an above average salary.", "I totally understand what you are going through, I was in the same situation last year and had to put a hold on my business and got employed on a really low level of work that requires less mental effort but can keep you afloat. Trust me it gets better if you accept what happened and you start your journey to self acceptance.", "Money is not everything! Good job hitting by $500k. Take a break. Do some traveling and enjoy life. You can always come back to the business. Fill your remaining orders and take a break. \n\nI suggest you come out here to SE Asia. So many amazing digital nomads and travelers out here! Plus it’s an extremely affordable lifestyle!\n\nYou got this!", "Prioritize your mental health over business success. It's okay to step back and focus on your well-being.\n\nMoving to a new country and running a business solo is tough. Anxiety and depression can feel overwhelming, but you're not alone.\n\nConsider selling your store if needed. Seek support through therapy, medication, or loved ones. Keep fighting - you got this!", "It's brave to share your journey and important to acknowledge the heavy toll mental health can take, especially in high-stress environments like entrepreneurship. Remember, stepping back to focus on your well-being is not defeat; it’s a necessary step towards healing and long-term success. Prioritizing mental health, seeking professional help, and possibly adjusting your business approach to reduce stress could be beneficial. It's crucial to find a balance that works for you, where your mental health and business can coexist without one undermining the other.\n\nRemember, your value isn't solely defined by your entrepreneurial success. It's okay to redefine your goals to align with your well-being. You're not alone, and it’s perfectly okay to seek support and make changes that prioritize your mental health.", "Imo you are worsening the issue by focusing your life completely on it. Keep yourself busy and working, go to the gym everyday, go out, meet people..that’s a much better approach. Your external life is completely fine, the problem is on your mind, you lose it. The only way to get a strong mind is through discipline", "It doesn’t matter what your revenue is you matter what your profit is. And if you are prostituting yourself and have bad mental health, then you are being foolish.", "Not sure how this is relevant. How is running an ecommerce store prostituting yourself? That's a weird thing to say.", "I am questioning the reason I moved now, it's not worth paying less taxes if I have to feel this way.", "\n\nWhat I mean is if you’re working so hard and it’s ruining your health just to make money", "What was your actual profit?", "Got it. Health first.", "27%", "Things like Reddit didnt exist when I was younger. People now are putting amazing pressure on themselves and have crazy ideas of how much money is necessary. Guys can be as freaked out about being entrepreneurs or making some crazy money as girls can be about weight or whatever. You can get an eating this shorter with money. If a certain business isn’t working, you can always try another. Or you can always get a job. But make sure that you’re happy and healthy.", "OK. So the reality is that you’re making like $80,000 a year and working 80 hours a week? So you can do the math and decide if it’s worth it. I don’t know your age. But I’ll tell you at someone who’s older. There’s only a certain window in which to have a family. Only a certain window of life to do certain things. If you’re not trying to get in a relationship, I guarantee you that the good ones wind up getting taken. So just make sure you have balance. In my view, preferably, a God centered life that has love and fitness and health and family. For all the Elon musk that are able to work 100 hours a week and have 12 kids by five different women. There are 1000 people for whom that is a nightmare.", "Yes, that's certainly been the case since social media arrived. Sign of the times.", "I am not working 80 hours a week, I think I never worked more than 40", "Yes the move to another country for taxes sounds crazy. Why not pay taxes? Yiu don’t use the roads? Hospitals? Police? Fir department? That sounds pretty immature. You can easily move back", "OK I’m sorry I must’ve missed the import of your post. If you’re working less than 40 hours a week and making $80,000 a year that’s not bad. That’s a good start on a business. And you should have a life balance.", "I don’t understand why you have tears and crippling anxiety if you’re working 40 hours a week. It sounds like you’ve created the perfect environment for yourself.", "I would recommend learning emotion regulation skills and not to give up. You are going through a lot, and a move to a new country can feel overwhelming. Find an online DBT program. 💪", "I don’t know specifically what situations are triggering your anxiety but for me, I started recognizing those situations that would kickstart anxiety and I would force myself to find ways to relax myself under those situations. It isn’t easy and there isn’t necessarily a right or wrong way to do it. You have to see what works best for you. A lot of mine was public speaker, overthinking decisions, and trying to sound like a subject matter expert in things I thought I needed to be. A lot of trial and error but for me, eventually I wanted to put my self in those situations all the time to ensure I could overcame it. At this point those situations I use to fear I now enjoy. \n\n500k in revenue is a great achievement that many entrepreneurs are striving for. Clearly you are doing something right. Don’t be afraid to trust yourself. Good luck.", "I went out into the rain, cried when no one was around. Continue crying spontaneously and sporadically over the next couple of weeks/months - moving out of sight when someone was around. Eventually grew out of it. Your experience may differ.", "How did you manage after those weeks/months?", "Still managing. My case is different, we're an engineering startup that requires loads of R&D and pre-revenue. So cashflow. My wife is super supportive, which helps as my friend circle either won't understand (not self-employed) or will tell me to suck it up (those who know what it takes). I do talk to my close friends occasionally when they ask what's going on but not much beyond that. Very surface level. Neither do I tell my parents anything until after my problem of the day/week/month is solved ... by then there normally is a new problem :D\n\nI have no specific advice. Everyone is different so you need to just take some time to introspect and see if you can figure out what works for you.\n\nHowever, I found that when I stopped my once a week physical activities and did nothing but work that made things turn for a worse. Even 2 hours a week doing something else helps - excluding necessities like eating, sleeping. Also, check your vitamin levels. Some bloodworks. May be some low vitamins that you can remedy. It can affect mood.\n\nBest wishes to you and hope you pull through this.", "This is called pushing yourself, youre training.\n\nRemember…\nFailure is just testing.", "It’s really important that you get psychiatric help. You’re not doing anything wrong. You’re just vulnerable, which can result from genetic predispositions and early life experiences. The right drug will make you a lot more resilient.", "You should be able to take time for your mental health. I run a Shopify store doing around 10k a month but I work with a partner so I have a lot more freedom. If you looking to hire someone to help manage yours while you take a break, DM me!", "Please seek professional help for your mental health issues and lean on your support network, having a professional to talk to and guide you through processing whatever is happening is really, really helpful. It sounds like you've done a good job on the work side but now your personal side needs some attention. \n\nYou're still young so you're discovering aspects of yourself for the first time, plus moving your life, let alone to a new country, is extremely stressful. Don't beat yourself up about it. It takes time and you deserve to give that to yourself, you've earned it.", "Thank you for the post!", "Hi mate. It’s such a brave move you are able to share your story with us here. Many others suffer without ever seeking help.\n\nYou can try meeting new people with boardgames. Or sometimes just warm bath at home. It helped me a lot.", "thank you, I am grateful of receving so much support here", "I know the feeling!  Been running on fumes since COVID and being busy has burned me out.  I’m 46 and still grinding away daily.  Every time I turn around there’s a brick wall thrown at me.   Every 2 steps forward is met with being beaten down by one thing or another.\n\nBut, that’s not stopping me.  I’ll come crashing out the other side on fire with 4 flat tires and a busted window if I have to.  It’s my future, my family’s future, and after spending years at a corporate office I am not returning to that lifestyle.\n\nMy advice, find a good manager even if it takes you a while and remove yourself from WORKING IN your business and rather WORKING ON it.  \n\nGood luck and 500k is an amazing accomplishment for a e-commerce store. My best year was $120k during COVID and haven’t seen that since.", "Mentor someone, it's the only salvation. I went though the same journey only not making profit and going into crazy amounts of debt. came close to ending my life multiple times. it was only when I could start teaching someone what I knew and guiding them. that began healing me that and pushing very very heavy weights every day 10 times a week. I was basically tying to kill myself in the gym. 3 months and depression disappeared. \n\nI promise you it will work, its not complicated. Whets complicated is not buying into the state you are in, the solution is simple. Don't over complicate it or your turmoil will consume you.", "I have your same mental issues plus I'm broke.", "i am sorry", "Get therapy and tackle your mental health.", "Brother where are you located? Have you ever heard of of Kambo? Paul Simon wrote a song called: Señorita with a necklace of pearls, in that song he wrote: there is a frog in South America. Who’s venom has the cure to all the pain men has to endure,  softer than the rain, stronger than morphine, a frog in South America has the antidote for pain. There’s a frog in the Amazon rainforest called monkey tree frog, Phyllomedusa Bicolor, the secretion of the frog, has very potent neuropeptides that will cause  the hypothalamus to secrete a lot of oxytocin, and this will help balance all of the other chemicals in your brain, I beat four years of depression, doing three Kambo treatments in three days", "I am in Cyprus now. I've know about psychedelics for mental health, (I have done ketamine theray myself) but this sounds new, interesting", "Bro! Kambo isn’t psychedelic, but a lot of kambo people know of Ayahuasca ceremonies or Peyote, the world leading expert on Kambo lives in Cypress, I’d be amazing if you could sit with her and do treatments, is this incredible English woman by the name of Karen Kanye Darke and she studied the way many Amazonian tribes used the secretion, if you want me to put you in contact DM me, I am new to this app so not sure if you could send me a private message, I’ve done many psychedelic sessions with sacred master plants like Ayahuasca, Tepezcohuite and Pote given in Ceremony by indigenous people of Mexico, called Huicholes, and also by Native Americans here in the states, life transforming experiences, I’d like to pick your brain about you solo entrepreneurship man if possible", "this will only be a bandaid solution and potentially a deadly one", "Not at all! I beat 4 years of chronic depression with Kambo treatments in 3 sessions once a day and doing maintenance once a year, there’s solid research into the bio peptides and neuropeptides contained in the secretion and how they affect the body and the mind, go to kambo kambolifeny.net click on research and links and look at the studies there, there’s a reason why Monsanto wanted to study the peptides, synthesize them and patent them back in the 80s, Kambo secretion isn’t venemous and it is 100% safe if is administered by a certified practitioner, I recommend the IAKP, which is an international association that’s been around for a decade or so", "Move back. Chasing tax optimization is a fool's errand anyway if it's not a location you'd truly want to live in.\n\n\nBe happy you live in a nice safe country (I assume), pay taxes, make lots of money, and enjoy ", "Ok well first I would say see a therapist. The issues you face are mental. The good news is that you can potentially work through them.\n\nImagine in your post every time instead of anxiety or sadness you wrote not sure if I can continue with my business because I have a broken leg. People would say go see a doctor.\n\nIt's the same here. Depending on how much time you spend on your business you may have to plan to cut back a bit mentally to make room for healing.\n\nMost of all note that this is a very normal reaction and your not broken or damaged. You just need a bit of guidance and you will be great.", "Hi get some professional help first and foremost. Being a solopreneur bootstrapped is hard and lonely, e-commerce is hard (even though it looks easy, cash flow is a killer), having recently sold my ecom biz I’m relieved, was doing about double your rev and it started to take its toll on me, and I decided that I wanted out. It was profitable and in a great niche but when you want out it’s all you can think about. What niche are you in? I could probably help you with it and get it ready for a an exit (feel free to dm)", "thanks, it's in beauty niche", "I recently just took a month off from my business and I needed it way more than I thought I did. I had become so enmeshed with my business that it became my whole identity and I didn’t really know who *I* was anymore. If you can afford to take a step back for a few weeks I highly recommend it. I’m a solo business owner so my business was actually closed while I stepped away. To my surprise everything survived and picked right back up where I left it when I returned.\n\nDefinitely seek some counseling. But in the mean time, when you find yourself with these emotions and feelings, be really honest with yourself and ask why you’re feeling this way. Why is this coming up? Deep down you know the answers. But typically with traumas we bury it so deep where it seems we can’t figure out why it’s popping up. \n\nTake care of yourself! A great analogy someone told me is that picture you as a cup of water. You can’t keep pouring from your cup if it’s empty. But if your cup is full, the things around you in life will get the overflow of water and everything will flourish :)", "Don't give up on your business yet! You built a really great business and there are other ways before you sell or close. You had some great advice in the thread.  Have you ever tried business coaching? You are a high performer and would be a prime candidate for it. It's like therapy for executives, but instead of focusing on past traumas you look at forward positive goals and how to get there. Also, don't be hard on yourself. Almost everyone that builds their successful business hits this point. They either realize it as you did or end up having a panic or heart attack before they understand they need to learn scale. You worked hard to get where you are and I would hate to see you not try other options before selling. You deserve happiness.", "Hey man I am relatively new and still just lurking in these subs. Currently 26 and but I start to notice my mental health declining recently. I have a well paying job and doing my first steps in getting into ecommerce. On the surface everything looks like I am doing well but I have started struggling since 1 year. I don't know what is missing in my life but I feel unfulfilled and it's getting worse. \n\nIf you need someone to talk to hmu, my dms are open.", "When I have had successful business ventures in the past, after a transient period of elation, it inevitably seems to unlock the deep wounds that lie beneath.  \n\nIn the absence of distraction (worrying about money, and work), therein lies the root of it all.  The real problems that have been waiting to be dealt with for a life time. \n\nYou can view it as an opportunity to tackle your demons head on, or step away and battle at a level that is more comfortable to you. \n\nPersonally, I’ve tried both, and I’m still searching for a happy medium.  \n\nWhichever choice you make, try to make it when you are feeling the most stability.  Step away for a bit; hire out and have someone else take control of the business for a bit while you get the self care you need and deserve.  It will lead to more mental clarity and a better perspective on the situation.\n\nMuch love,\n\nPubey", "Move back to be near your mum and get a job as a cmo. You CAN have a job and be happy. You don't HAVE to be an entrepreneur, especially if it's affecting your mental health.\n\nYou could be on $150k a year and happy, working fewer hours and spending time with family.\n\nRemember, the Instagram or lifestyle purported on YouTube isn't the way to live for everyone. Don't ever think there's anything wrong with you because living in a certain way doesn't sit right with you.\n\nAnd Bro, I have the capacity of being a significantly elbetter position than I am now but I'm \"shackled by a disability\" like you said being mute. \n\nIt's the cards we're handed in life, as long as we find a way to be comfortable in life and we have CONTENTMENT in our heart, that's enough. The spiritual and religious side is another important thing.", "As someone who went through the same people underestimate the mental cost of running a business like this I had an amazing few years too but mentally I was shot and burnt out, it’s incredibly stressful and very hard to understand why as was making money people dreamt about \n\nI hate to say this but there is more to life than money I found that out, your health and mental health should come first \n\nI backed off try not to work so hard and try not to think as work as the only thing that matter, it’s hard as my mind races at 1000mph some days\n\nI found a way to work but also have parts of the day where I chill out and listen to podcasts and take time to rest rather than working 12 hours a day\n\nIt’s hard to take a step back but it’s possible", "Get a lifestyle doctor to set you right", "I really don't think that selling off your business is going to make you feel any better, if anything it could make you feel worse in the long run. \nFor the time being hire someone, step back temporarily, and work on whatever you feel you need to work on. Whether it be your mental health or making new friends at your new location.", "Well, maybe it's not a \"should\", but you \"could\" feel grateful for this turn of events because it will allow you to investigate, heal and grow. Of course we're on the net and know fuck all about each other, but I suspect even if we had psychiatric degrees and knew each other forever we might still have no clue what exactly is going on with you. But I'll suggest it is not depression, in the clinical sense, which is close to incurable (despite reports that carnivore diet or psychedelic substances can make a real difference). \n\nI'm also having trouble putting 2 and 2 together, you mention half a million and \"achieving financial success\", how much is financial success exactly? 50M ? I do like though that you added the word \"financial\" there, all the random uses of the word \"success\" were making me puke, you're not successful when you have 3 villas and 3 children who don't want to talk to you for example!\n\nYou say \"stepping back\", you mean leave your tax optimal location? That can't be a bad idea, but in your shoes I'd stay on, painfully as it might be, and work out my deeper issues. You could also try to \"clean\" your diet, if it's random. Finally, I remember a totally insane traveler story where a happy person lost their mind somewhere in the tropics, only to discover years later it was a parasitic infection!", "I wanted to be a millionaire, but seeing how things are going I minimised my goals. 1.5M+ I think would be enough for me for financial freedom. I dont crave materialistc stuff, I aim for a simple, serene life", "Three things really helped me in that department. The first two helped for physical sensations of stress and anxiety and the last helped with both mental and physical. 1) For the physical sensations of anxiety, buy a traditional sauna (not infrared). If you need help with ideas let me know. It is like a reset button on physical sensations of anxiety and stress. Absolutely unbelievable for it. Gym ones don’t typically get hot enough or allow water on the rocks, but you need both. Second, wim hof breathing with cold plunges. It also is a physical reset but in a different way. Feels terrible when you first start but after a week you’ll find it relaxes you. Third, sense of purpose and love. My relationship with God allows me to feel that, to rest in his presence even when busy and stressed, which makes it so I see the gift of life even in the most difficult times. I remember how hard it was before God for me. It was night and day. \n\nIf you want to talk about any of these things, feel free to reach out. There are some good book recommendations I have for dealing with stress if you want them.", "Thanks I was looking for a gym with a sauna here where I moved, but I can't find any.. I used to go multiple times a week where I lived", "I wanna join in on you on your journey of healing depression . I'm also dying of mental stress please help me how to heal myself.", "I had a similar problem. Was working full time at a job that was okay with running my business on the side. I was making 6-figures on my own combined. The most in my life. Then…I also moved. My mental health became so bad, I was close to ending it many times. Finally found a therapist, then realized I had to quit it all (job and business) and I did. It’s been a huge relief thanks to my husband’s support. But now I’m trying to claw back to even 1% to where I was before and it’s looking bleak. I just want to go into more debt and get up and move back.", "If you have the financials to back it up, sell the business man. Empire flippers will do that for you. \n\nPay a few thousand to a consultant, let them come in, get all the books in order, standardise and document all the procedures and polish it up to get it ready for sale.\n\nNo money is worth losing yourself man, all the best.", "Hey, focus on being a human person first, entrepreneur second. Or even third or fifth. You are a human person, who works to get resources to support their life. With Life being the main component. \n\nAlso, it's totally normal to collapse mentally at around 30 years old. You have changed. Your goals have changed. What was important before is not what's important right now. \n\nThink long term about your life. So you've done well in your 20s. Good job. What do you want your 30s to look like? Your 40s? Your 50s? \n\nFor me, I work my ass off for 3-4 years then I take a 2 year slow down break. It's impossible to always be in GOGOGO mode, we're not robots. \n\nI ran my own business from 21 to 28. Broke down for 2 years. Went corporate at 30. Worked my way up till 34 and saved money. Took a 2 year break by only doing temp gigs. Started my own thing again this year and I'm focusing on work-life balance. Idk what's going to happen, but I do know that if I don't take good care of myself no one else will. So your #1 job is you. That's your main project.", "Dude, get a therapist.  You’re not going to exercise and breathe it away.  You need expert help to heal properly.", "Although, it is important to earn money. Success isn't to earn money. Success is to live a good life. A good life is caring for family and doing what is right.", "I spent my whole life never experiencing anxiety or depression, until one day it crept in out of no where. Probably, my immune system’s reaction to Covid. Anyhow, this was the most debilitating feeling ever. And like you, I tried everything while handling a new high pressure position. \n\nYou probably know this, but your mental health is way more important than even a million dollars. \n\nMy advice, consider going back to your home base. Familiar settings tend to reduce trauma & stress of the unknown. \n\nUntil then, starting making to do lists, be detailed as possible. Go through them every morning & ideally in the evening, ticking everything you’ve accomplished. This is an exercise in taking back control. Also, start exploring what things you can automate & lastly keep a journal of the things/actions/activities that really trigger your anxiety. Once you measure them you can start managing them. \n\nTo conclude, it’s a difficult phase & you’ll have to be strong, if your religious; explore that more but most importantly be brave & soon all this will be a thing of the past. \n\nAlso if you’d like, happy to connect one on one, in the off chance that perhaps that’ll help make things easy for you. \n\nStay blessed", "Whew, do I feel some of your pain.... Mildly autistic, I am told, with the lovely life-long social anxiety and depression and shifting meds and etc etc. \n\nI see a lot of good advice here, and a TON OF MORAL SUPPORT. Don't want to be repeating what others have mentioned, but I'll tell you something stupid simple I discovered (aside from delegating when crashing and stopping work at lunchtime on Friday).\n\nDo you have a dog? I adopted a couple of small rescue pups and they save my sanity. Daily walkies are hella interesting with a dog, and it's a good way to meet local people. Also, cuddles!\n\nIt sounds like social isolation may be part of your challenge, when I went to EU to work for a couple of years (consulting) I went through a really rough patch about three months in. I learned that you cannot actually solve personal problems with tequila, for instance, but joining a local expat bike club was a real boost for exercise and morale. \n\nSending you big energy and positive thoughts, like a lot of others here.", "Man i really hate to hear stuff like this.. they just kinda hit home with me.\nI'm down to help too .\nHope you get better soon!", "thank you!", ">thank you!\n\nYou're welcome!", "i went share this with my wife as she went through the same thing after we had an extremely sucessful year selling on amazon. i saw 155 other people shared before, so you’re not alone.\n\nwe let the biz “fail” and now it only does like $50k profit, but we have our souls back.\n\nironically, my wife is now a junior breathwork facilitator. judging by “mum” if you happen to be in london, we are passing through until june. hit me up and maybe we can work something out. their are lots of breathworks, maybe another will resonate better.", "You need a good primary care physician and a psychiatrist that you can trust. \n\nMake sure that whatever country you’re in has solid, reliable healthcare providers. Otherwise, might be best to move back to your home country and prioritize your well being for now.", "https://youtube.com/@VanessaLau?si=RhgK2VnFH5fc1ugc she talked about stress and how she quit for one year after making a lot of money\n\nYour health is most important thing as you aren't making this much money to just not be happy\n\n\nThere are multiple ways for soul searching if you wanna know\n\n\nShe also mentioned how she manages workload now after coming off break", "Out of the 500k, what’s your profit? Mental health and money earned does tie in at times", "27%, so at the moment I have some cash saved out", "Profit is irrelevant. The issue is his mental health situation at the moment.", "The question is, is that enough to live your chosen lifestyle?  Are you able to hire someone with that money to manage your business whilst you take a 2-3 week break? When was the last time you took a holiday?\nIf you’ve taken 2-3 week breaks but you still  feel you’re going to have a breakdown then it’s best that you do either get a partner in or sell your business.  Otherwise your business will collapse anyway and all your efforts would’ve been for naught.\nYou should ask yourself, why did you want to start a business anyway? Is it to earn millions or attain financial independence?  \nPerhaps your reason for starting a biz isn’t compelling enough for you to keep going? Or perhaps the return you’re getting isn’t enough.  You need to honestly ask yourself these questions.  From my past experience mental health is heavily linked with finances.  I think you’ve been slugging it out for a few years and perhaps the money you’re making isn’t enough to support you and you’re thinking about whether you can sustain your business. \nBut if you can take a 2-3 week break then do it to reset yourself , hopefully your business can run without you.  If you can’t take a break from your biz, then either hire someone to help you manage it, or do partner with someone or self your biz.  \nOtherwise your biz will end anyway so all your hard work would’ve been for nothing. \nMy 2 cents.  Good luck!", "That’s the problem.  If you’re not making enough profit then yes your health will suffer.  Your probably not making enough to hire competent staff to help you out.  Unfortunately that’s just the nature of the beast.", "The OP hasn't suggested they aren't making enough money so what has led you to assume that?", "Generally one of the main causes of stress in a startup is making money to get to break even.  Revenue doesn’t mean anything without profit. \nNormally if you’re biz is doing well you’d quote profit, if not, you’d quote revenue.", "This is a specific case not a general case.\n\nMany businesses, even huge businesses, often give revenue updates. They're important. I don't think you fully understand business.", " 😂.  Yes child, yes.", "First of all, I am not saying you are suicidal, just in case anything like that comes up in your mind please be aware of your local options of saving yourself. Usually there are local suicide help lines that have well trained people talking to you for free even. Usually it is also an option to go to the hospitals emergency room since it might be an emergency. I feel like it’s not ideal to make promises when it comes to mental health often, but in this case I can pretty much guarantee you that life will have gras looking much greener again if you chose to let it. It’s just a matter of time, it will be worth it getting through the dark days and nights.\n\nYou making money will open doors in realms of mental health professionals helping you. If you already are seeing a therapist, after two years still being in this rut, maybe evaluate shopping around a bit trying a few alternatives. I personally resonate a lot with solution focused brief therapy and Sidney banks “three principles” and Byron Katie “the work” as these tend to take a lot of pressure of your shoulders by exploring philosophical concepts along side your desire to feel less stress.\n\ncheck out these videos so you have a jump of point right now if you are interested in that direction.\n\n[https://youtu.be/MMLOvCgVfzs?si=1i7walA2T4f9AUyM](https://youtu.be/MMLOvCgVfzs?si=1i7walA2T4f9AUyM)\n\n[https://youtu.be/wS-C4uKFiSk?si=XigdiR2aAhn3eUNy](https://youtu.be/wS-C4uKFiSk?si=XigdiR2aAhn3eUNy)\n\nIf you want to talk after watching the videos, send me a dm. full disclosure, I work as a coach, I know what I am talking about and am a save person to talk to, and I 100% promise to not do any wakko sales call script painpoint marketing Blabla. Just to help.", "Go to therapy, relax and chill till you can find yourself. Use your internal monologue and see how you got to this state. another person mentioned to take meds. DO NOT take meds", "I've taken meds 2 years ago, ruined my health, it's the main reason I've been struggling these past years", "Maybe try getting someone / finding someone you trust to oversee things while taking a break for some therapy?", "Can you work with your mom? Family business? Her support might be helpful work balance and emotional support.", "Half a million in revenue working alone can be stressing. Start hiring, organize your processes. Btw can you share your business & entrepreneurial journey?", "it's pretty much autmatized for stability the business at the moment, but it can't grow further without my input, and can't last forever this way.\n\nI'll be happy to share my journey in a post, but actually don't have enough energy, I am sorry", "Sent you a message!", "Valium", "Have you seen a doctor or therapist? That should be step 1.\n\nI ran a successful ecommerce store a few years back that had around $700k revenue a year. I'd be interested in helping run it if it was along similar lines that I ran mine. Feel free to contact me.\n\nWhat country did you move from and to. I moved from UK to Thailand so understand the moving issue. It affects people in different ways.", "yeah I've been seeing a therapist for years. I moved from Italy to Cyprus", "Do you think the therapist is helping? Maybe you could try a different one. \n\nDo you prefer living in Cyprus or did you just move for tax reasons. I'd suggest staying where you're happiest.", "Somewhat it helps, but it never did miracles unfortunately. I moved for tax reasons mainly and to change air, but luckily I just need to stay in Cyprus 60 days a year for residency, so up to 6 months a year home", "Having residency in Cyprus doesn't mean you don't have to pay tax in Italy? Are you Italian? If so, you'll almost certainly have to pay tax there. Being resident in Cyprus doesn't necessarily mean you have to pay tax there. You usually need to be in a country over 180 days to become tax resident. In the country you're a citizen of you have to stay out almost the whole year to not be tax resident.\n\nBeing resident and being tax resident are two totally different things. You need to  get some proper tax advice.", "Opening a company in Cyprus, staying there for at least 60 days a year and not reside in any other country for more than 6 months a year are the requirements to have tax residency in Cyprus ", "There’s a lot of people looking for work right now. I’d gladly help run your Ecom brand as a 9-5 / 1099 basis while you recover. I’m sure others would too.", "How much do you think a person would expect to get paid for that?", "Idk. Suppose 10% allocation to the person is ~50k so 1k / week is a year and 2 weeks of unpaid vacation. 1099 basis so no risk, have to figure out your own taxes and insurance etc.", "helpful, thank you", "It sounds like you’re dealing with a huge burden with your mental and emotional health and this can bring its own physiological challenges. What’s actually good (and most likely feels like anything but) is that you have insight. Clearly, there’s a lot going on but that awareness and insight is serving you well. This journey comes with its costs and sometimes that can be steep. What’s worth keeping in mind is that in moments of such personal extremis one’s thought processes can become very much black or white, all or nothing orientated which is where it seems you find yourself, currently. From what you write, you are describing symptoms of depression and anxiety, an attenuation of your personal coping resources and resilience. You have these but given the trauma and burnout you refer to, your access to these resources is compromised. It’s an  overwhelm and a bandwidth issue in practical terms in how your function is being affected. As others have suggested, perhaps find someone/people to delegate to whilst you recover. This can help you step back from working within your business and heal whilst working on your business in terms of its direction. Easier said than done, no idea as to the logistics etc but something akin to this approach would help you retain the distance travelled (dude, you did 500k!) which is an incredible achievement. Mental health, as is your physical and emotional health, is critical and you need to heal; celebrate what you’ve achieved even if you have to go through the motions to begin with. Find a therapist if possible, they can ask you the questions that can actually help instead of rehashing the issues from your perspective: why that is important is so that you can be simulated by questions that can draw out different perspectives that you may be overlooking. I know you will be the expert in those issues but you need someone who is able to help you navigate what is clearly a significant challenge in your life. You are not alone by a long chalk. If you can get to where you’re at now (success wise) you have more than enough to get past this clearly, significant challenge. But: You are Not Alone. That’s the thief of trauma and emotional and psychological pain and suffering; only we can go through this in that most visceral level and that can lead us into the mistaken belief that we’re alone and in these states we tend to plump for that which is on the further reaches of what we’d ordinarily think of. Resist that temptation. Take time to work things out; you’re in a dip of another kind that we all go through at some point, it’s not just in business. You’re human and these things occur. Take a breath and determine that no matter what you’re going to be okay. Be kind to yourself. There’s nothing wrong in missing family, being homesick. You’ve made massive changes and are living in a different country. Don’t underestimate that. It’s big and you’re dealing with so of this without access to your normal support systems so such a thing will feel magnified. You’ve got this. You probably don’t agree with that statement and that’s okay. You will find a way through this which is best for you. Hang in there, get stubborn and tell all that shit you’re going through that you’re here to stay and you’re going to work it out. Decompress, reach out to those you consider able to help you in any way. If you can’t think of anyone, DM me and I’ll be available when I can to lend an ear, ok? You’re Not Alone. All the best.", "Thank you very much for your support and kind words!", "You’re more than welcome. Hang in there.", "Get medicated", "\nYou need meds. I can’t function normally without them. \n\nFor your anxiety, I recommend you get some Rhodiola. It’ll help make the swings less severe. For depression, get some Saffron extract capsules. I also recommend having some Damiana extract capsules on hand. They’ll calm you down if you’re experiencing heavy emotions.", "i've been damaged from meds in the past, lasting side effects unluckily", "Not sure if that’s the right place to share this personal story but it might help and give you some perspective.\n\nFor 13 years I’ve been running an ad agency. We’ve been doing relatively good having in mind the market here with global companies as clients and so on. It has always been stressful, there has always been problems but I somehow always managed to stay sane and never had issues with my mind. ~3.5 years ago I caught covid and ended up with severe neuro Long Covid which is horrible and included a lot of the mental symptoms you are describing on top of the various physical ailments. And yes, it not only feels like disability, it is and sometimes it’s way harder to manage than a regular one. Not saying that you have Long Covid, but have you considered a more physical trigger for the way you feel than the overall stress from business? Breathing, meditation and etc are cool but you can’t cure something with your body with them.", "I am sorry about what happened to you.. I am aware of long covid.\n\nI've been on psych meds 2 years ago and quit 1 year ago, they damaged me with anhedonia, emotional numbness and other crap. It's another reason I am and my brain is fragile, and I am falling apart now", "Probably best to see a therapist to minimize the symptoms?", "Would you consider hiring an executive assistant with real passion for entrepreneurship to help you handle the business by talking a lot from your table while she learns from your experience at the same time?", "Well I would. I am in a situation very similar to OP's except without the same level of traction. Business is stood up but in a pause and needs to relaunch before summer (sweat-related beauty brand).", "Get on some meds. They will change your life and get you back on track.", "This is the response that people with biochemically based mental illnesses have. \n\nI feel the same way about my anti-psychotic medicine. It was a life changer for me. \n\nSadly, though, not all mental health problems are caused by biochemical problems, and mental health meds can really mess a lot of people up if their brain systems aren't already broken. \n\nAll of this is why it is so important to get the advice and counsel of a good psychiatrist.... also: start most conservative: start with nutrition and exercise and mindfulness, then therapy, then psychiatry. Too many people try pills as the first option. Psych meds are no joke. Some of them can really fuck up a naturally healthy person. But they are still a life saver for others. My advice: use them if necessary, but be careful and consult with a GOOD doctor.", "I completely disagree. When you are running a business making that much money and you’re on the brink of a breakdown and the company is in jeopardy because of your mental state, you need pills ASAP. You can do all the meditation and healthy eating you want and sniff some essential oils but it’s not going to bring him out of what he’s going through. Yes he needs to see a good psychiatrist and get on something right away for the crippling anxiety. Otherwise he could lose everything he has worked so hard for. His judgment is clouded right now.", "I agree that he needs to see a good psychiatrist right away. But I don't think he needs to listen to ANYONE on reddit about whether medication is going to be good for him. That is something OP needs to decide with the doctor. Not our business. Neither you, I, or even a certified medical doctor reading this thread can reasonably assess what OP actually needs from this thread alone (without a reasonable medical and therapeutic consultation), and implying anything else is simply naive and irresponsible.", "Ok 🙄 did you think I meant for him to just go get some random pills on the street? I said he needs meds. He can’t get said meds without consulting with a doctor first. I didn’t think it needed to be mentioned that you can’t get on medication without a prescription, and you need to see a doctor to get a prescription. I said in one of my comments he should find a good shrink.", "No. But you are a random person on reddit. I have to take your comments as literally as you write them. \"He needs pills ASAP\" is effectively a medical judgment.", "Did u get some buyer fraud and ridiculous chargebacks?", "10 years ago I walked away from a business I built from scratch that was doing really well. I was burnt out. I’ve since learned:\n\n1. Each time you burn out, it gets easier to burn out\n\n2. You’ll keep burning out (even as an employee) until you learn what causes you to give too much of yourself to your business \n\n3. The best way forward is to prioritize your health (sleep, hydration, moving your body, seeing a good therapist, getting a physical and blood work to make sure there aren’t underlying health issues)\n\n4. Also, focus on your wins no matter how small, not only each day, but each moment \n\n5. Be present focus on what you need to do in the moment. Let go of the rest until it’s time to focus on it\n\nI learned the core causes of burning out for me were: \n\nI devoted too much of myself to my work because I was looking for belonging. I’ve since learned I don’t need to belong anywhere but to me. \n\nI dismissed my wins. I was always looking toward the next milestone \n\nI compared my present self to my desired future self\n\nI’ve since seen a doctor and learned I was iron deficient. Previously against medication of any kind, I’m now on an antidepressant and ADHD meds. Life changing. I had no idea how good being “normal” felt. No body pain, no racing thoughts, no persistent low grade headaches, and an easier time being present. Glorious!\n\nI recommend taking two minutes and brainstorming all the questions you can ask yourself about your situation. Go for volume of questions so you don’t start answering them. You’ll be fine. Without realizing it, you’re on an amazing path.", "Try an iron and bcomplex supplement. Best i can do", "Stop drinking coffee if you are. That will make you feel anxious out of nowhere", "Hey, your health is the real MVP. Take care!", "Can I dm You?", "This is very similar to how my health went. I’ll dm you later", "“ so I made a bunch of money more than 10x the national yearly average of a single person.. just wanted to come here and say that and that I quit because it was hard”", "Hard relate", "Get a ceo to deal with it", "Read E-Myth book, it will help you.\n\nAlso getting to know what you are not good at or hate doing it and hire others.", "Do you journal and have a Personal Operating System (POS) in place? Trust me doing a weekly POS meeting with yourself every week on Sunday will help so much.", "yeah I do both, I organize my life and business on Notion, weekly, montly reviews etc", "This may be an unpopular opinion, but absent something specific that’s obviously causing mental health issues such as an abusive situation, stressful work, etc, one area you may want to look into is nutritions effect on health, especially mental health. \n\nI’m happy to get into the details about why mental health and nutrition is related, but for brevities sake, I can go into it elsewhere if you or others are interested.\n\nThe other area that is huge is also strenuous exercise.\n\nI’d recommend looking at trying to get about 1cup each of 4-5 colors/day from raw foods. The easiest way to do this is a smoothie. While greens products are convenient, you’ll need a solid quantity of them to truly make a difference, thus a smoothie confers the benefits of a greens product at a significantly lower cost.\n\nI can go into the science and what not, but you might find incredible benefit to your energy and mental health by just adding a solid amount of nutrition.\n\nAbsent the desire/effort to try some 4-5 color smoothie, if you’re looking for the easiest potential solution, (pop some pills/supplements), look at taking magnesium Threonate, NAD+, Ubiquinol (mitochondrial health) as a stack.\n\nHopefully that helps you in a way that lets you continue your entrepreneurial journey. ✌️", "Thanks for your post!\n\nI am eating pretty healthy (mediterranean diet), so I don't think nutrition is the root cause here. Also supplementing with magnesium l-threonate and fish oil.\n\nAnyway appreciate!", "Have you tried therapy/counselling? If you’re in a foreign country, online therapy (like betterhelp) might be a good option.", ">making me rethink if I should aim for simplicity and serenity instead of ambitious entrepreneurial dreams\n\nAs a fellow entrepreneur who has struggled with severe anxiety from childhood, I wanted to chime in and say, all you need to do is figure out a healthy balance. Research shows that people don't become more happy after they make a certain amount - I think 70k per year was the standard for happiness but don't quote me on that. Once your basic needs are met and you have some luxuries, you cannot eat more than 3 meals, you cannot sleep in more than 1 bed or live in more than 1 house... just figure out what you want, what makes you happy and then give the rest of your energy to your self care. \n\nI microdose psychedelic mushrooms and practise mindfulness and yoga to manage my anxiety. The mushrooms are what really helps me though and a trauma informed therapist I see from time to time really helps me feel grounded and pushes me to understand myself and do better. \n\nI hope you find your path soon. Remember, life is hard for everyone and it is all about learning to manage complex paradoxes. Once you accept that life is hard, weirdly enough, it becomes easier. Good luck.", "I agree with the money concept.\n\ni've tried microdosing, up to nealry macrodose, but I didn't have any particular effect", "I agree with the money concept.\n\ni've tried microdosing, up to nealry macrodose, but I didn't have any particular effect", "I agree with the money concept.\n\ni've tried microdosing, up to nealry macrodose, but I didn't have any particular effect", "> you cannot eat more than 3 meals\n\nI wish that would be true.", "I suppose you can 🤣 but I meant it in a way where you do not damage your health or indulge in greed but are healthy and happy.", "Leverage baby!! Leverage leverage leverage", "try TRT", "What kind of stumbling buffoonery did you do to get to a position where you can make 500 grand but still complain about mental health on Reddit? I would burn down a city to trade problems with you.", "Hey OP. I’m sorry you’re going through such difficult times. I wish I could offer you good advice and a light at the end of the tunnel but I’m going through similar feelings right now myself as well. \n\nWhat I’m trying to do is focus on better boundaries with my time and be ok with taking time to relax and exercise. I thought I could keep pushing but that led me to a breakdown a couple months back in which I physically could not get out of bed for a few hours. So now I am giving myself about 3 hours in the middle of my day to have unstructured relaxing time, nap, eat, swim, and get whatever exercise I can before going back to work. \n\nI hope this helps you and I feel for you. When you figure this thing out, please let me know what helps you the most as I would love any advice myself as well. \n\nWishing you the best of luck. Try not to be too hard on yourself and focus on small things about life you enjoy even if only a little. \n\nAll the best.", "As someone who has dealt with depression and anxiety for 10+ years, perspective is reality. No medication will change that. It comes down to personal willpower. It's a struggle to maintain it but I trail onward you can too. It's too bad I'm not good at managing a business otherwise I'd do it at a fairly cheap rate given the freedom of my current job.", "You just might be missing some genuine human connection. \n\nWhich is hard to come by these days.\n\nYou're not alone in that.", "You’re dealing with a lot of the same challenges most entrepreneur goes through.\n\nYou’re also going through personal stress most everyone goes through after losing a parent.  Grief only gets easier over time.\n\nOn top of that you’ve moved to another country, I imagine that’s very, very stressful.\n\nYou need 3 things:\n\n1.   Therapy or Counseling\n2.  Community \n3.  To operate under less stress\n\nThose first two will help with the third. \n\nAttaching yourself to an entrepreneur community (or any after moving) can be a huge help, changing some unhealthy behaviors with accountability helps too.\n\nWe’re all in this together, none of us are in this to feel alone and full of despair. \n\nWe look after our own and help one another.\n\nIf you need someone to talk to, feel free to DM me.", "I’m sorry to hear about your struggle, mental health is real and not something to be taken likely. I work abroad (offshore wind farms) and I used to struggle heavily with depression, feeling isolated and missing out on daily life. I started with meds and they have helped, as someone mentioned above what works for some may not work for others.\n\nYou should be proud of yourself for setting up a profitable e commerce, this life is relentless and it’s not easy out there. I’ve had a couple friends commit suicide from mental illness and the hardships of life. \n\nYou got this, you are stronger than you think. You can always make more money but you can’t buy back happiness. \n\nI’d love to hear more about the business you started as I’ve been thinking of starting my own e commerce store but I have doubted myself. Living in South Africa I’m not sure it can work…. \n\nStay strong and stay safe", "Financial success isn’t everything . The most valuable thing in the world is your mind body and soul, not new cars or clothes or watches.  Take care of yourself first and foremost", "\"It's a bitter realization that while I possess the skills to generate income, I'm simultaneously battling what feels like a disability.\"\n\nI (25F) profoundly relate to this. I had started my business and similarly to you felt like I just could not be okay even with the most baseline circumstances. It feels unfair when you see others seemingly coasting through life.\n\nI think as entrepreneurs there's a tendency to steer away from asking for help because our WHOLE darn thing is independence. The reality is that it takes a village. It's also actually very empowering when you are able to teach someone about something you have made and take your hands off the wheel a bit - I learned that too late for my business unfortunately.\n\nYou need people you trust and you (in my opinion) need a right hand man/woman who can deal with things while you try and find a baseline for yourself. You're of no use to anybody until your health is in order and I think you'd be upset with yourself if you made the huge decision to sell your company while obviously not being in the best head space.\n\nGenuinely if you need support of any kind feel free to DM me. I have a feeling you won't be shooting for mere survival forever.\n\nEdit to add some things I do when the anxiety feels like it's eating me alive: cold showers, forest bathing (look up shinrin-yoku - japanese practice with scientific literature to back it up), breathing exercises (I do box breathing if about to have a panic attack).", "This person's \"baseline\" and my \"survival mode\" are the same thing. And I agree.\n\nMy DMs are also open OP. I'll help you if I can in any way.", "Sometimes mental illness can be linked to gut health. It may be worth it to see if yiu have a bacterial overgrowth.", "Could be an aggravating factory. I took a course of antibiotics last winter and it made me way more anhedonic and apathetic, I needed 1 month ro recover ", "I would like to second this: physical health and gut microbiome are important.\n\nCells in your gut create the precursor to some neurotransmitters (serotonin). If you are seriously demotivated and depressed, you are possibly looking at a serotonin system problem.\n\nFurther to the OP: \nI am not a doctor and none of this is medical advice, but I studied molecular bio. and biochemistry (pre-med) and I am Bipolar man--so I live with chronically recurring mental illness and intellectual disability and have some idea what you are going through.\n\nSome studies show exercise is as effective as some SSRIs for dealing with depression. And it helps me a lot. So, I would encourage anyone with mental health issues to start with a regular exercise routine as a bare minimum. For entrepreneurs, I would say it's probably double--we have a LOT of extra stress and HAVE to depend on our own health and productivity to survive.\n\nAll that said, let's focus on your circumstances: you made 500K last year. Is all that money gone? Do you have enough of it to put into safe, pseudo-liquid investments and live on the interest?\nI agree with everyone here that has said: focus on your health first. There is a saying: \"your health is your wealth\". It is gospel truth. If you are too sick to work regularly, that is how you become a pensioner, or worse, homeless. Mental illness can take a very long time to get to the bottom of, understand, and learn to deal with. So, to handle this situation properly, you will want to stop all excess spending as soon as possible and go into survival mode and try to live as frugally as possible without denying yourself simple pleasures. Fortunately, if you have managed 500K well you are in a good starting position. In survival mode, get professional help. Be honest with your doctors about how you are feeling and be as observant, self-aware and honest with yourself and medical team as possible. I promise you: It can get better. \n\nFigure out how to step back a bit from the business and take care of your health issues. Assuming you don't have a permanent biochemical imbalance like me, properly managing your work life balance and the stresses of your personal life with the business should help you. I wish I knew what country you moved from->to because it makes a difference in terms of the availability of mental healthcare. If you are in a country that has poor mental Healthcare, you need to leave ASAP. If you are finding it hard to work more than 4 hours a day due to mental health, then you really need to see a professional and a country with bad access to professionals or an even worse stigma surrounding mental health than the USA, then you might need to leave.\n\nThere is nothing wrong with high profit entrepreneurial ambitions, but anyone who has profit as their main reason for living is bound to become depressed. You need to go into \"survival mode\" for a while and take care of your basic needs and figure out why you are feeling the way you are feeling. \n\nIt could be biochemical or it could be situational. In either case, your health is your new business project: focusing on getting well is your new project for the next year. You can't do crap for anyone if you don't take care of your health first.", "Bro you're making money what's the issue?  Fuck man I've been working over 3 years on my Brand and am nowhere close to that.  Be fucking proud of yourself.  You need a good woman by your side and it changes everything.  If you got money and you're still unhappy send me a DM.  My mindset coaching is free on YouTube.  You need deep inner game work.", "I’m so sorry about this it hits home for me", "Please feel free to reach out to me - I’m a hypnotherapist - I also don’t subscribe to the idea that meds can wash away issues that feel like a disability- they feel this way because it can be, quite disabling. \n\nI have struggled with my fair share of depression, anxiety, panic, overthinking, and confusion in the past. - I know how crippling that can feel- to deeply know your potential, but feel there is a wall between your present self and getting back to your old self (or better yet, stepping into a better future version of yourself)\n\nI have complete faith you will get back on your feet, you don’t have to start over to build back up again, you just need to find your footing.", "You should get a therapist and work on your mental health. Also try yoga acupuncture and massage to feel better in your bodybuilding", "Start delegating and Systemizing so things Can be more streamlined", "*Start delegating*\n\n*And Systemizing so things*\n\n*Can be more streamlined*\n\n\\- FriendshipParty627\n\n---\n\n^(I detect haikus. And sometimes, successfully.) ^[Learn&#32;more&#32;about&#32;me.](https://www.reddit.com/r/haikusbot/)\n\n^(Opt out of replies: \"haikusbot opt out\" | Delete my comment: \"haikusbot delete\")", "I have moved abroad (or had to work a role abroad for extended periods) four times now, and every single time has involved a major adjustment period (which included anxiety/ depression every single time). To struggle in the beginning is pretty normal. I also had the \"oh god what have i done i cannot do this\" phase every time. Going a little bit easier on yourself about where you're at really helps a lot. If you can let yourself notice the all the little things that do go well for you on a day to day basis (like, \"hooray I finally figured out how to get credit on my metro card, go me\" or \"yay, I actually worked up the courage to go into the bank and speak to someone today\"), those things start to accumulate and you start to feel more confident. \n\nYou sound like a really savvy business owner. I'm sure whatever you decide will be the right choice for you. Maybe just don't make a big, permanent decision when you're in the middle of a major adjustment period.", "Thanks for sharing, today I've been able to socialize with a person at a coworking space, I'll be grateful for that", "Go put your birth chart info into…\n\nhttps://www.astro.com/cgi/aclch.cgi?btyp=acm&#det=0&cen.x=8.583&cen.y=47.333&zoom=2&btyp= \n\nand see if the line you moved to is why you’re feeling this way. Some people really have better luck in specific places and this sounds like it’s not just about the job in my opinion. Might sound crazy, but remember, millionaires don’t use astrology, billionaires do. \n\nAlso, this is very typical Saturn return vibes (happens between years 27 + 30). For many of us that have not dealt with our past or have traumas to heal from it will reach a peak at this time and life will force you to move through it. You’re doing great by putting your mental health first and focusing on healing. You can do it, you will get through it whether you sell your business or not. Best of luck.", "Not OP but thanks for sharing this. \n\nI’m about to move countries and there is a positive line over the exact city I’ll be living in!\n\nAny advice on how to learn more about its influences? The description is quite brief.", "Folks downvoting you just haven’t figured it out yet.", "How exciting! Congratulations on the move.\n\nYou can learn more about each line by learning about the planetary aspects for which it represents. For example if you’re moving to your Venus line, look up the energetics of Venus in general; both its positives and its shadows from a reputable website or book (some are more outdated than others but Astro.com is a good start). \n\nI also personally offer both complete chart readings and astrocartography readings if you would like an in depth look at your own energetic blueprint sent via email — message me if you’re interested and best of luck on your new adventure!", "The #1 thing that helps me personally with managing negative feelings (in addition to healthy food, sleep, exercise etc) is journaling. Writing uses a different part of your brain than talking. Write out your negative feelings everyday and get them out. Then let them go (for that day). It helps me to focus for the rest of the day.", "If you’re interested in learning to meditate, feel free to reach out", "Hey bro,\n\nI was and I’m still in the same case.\n\nI’m also doing e-commerce (dropshipping) and both me and my brother got depressed 2 years ago. \n\nI had difficulty breathing, stomach pain, overthinking…\n\nNow I’m not 100% recovered but I feel much better.\n\nI did the same mistake as you. I moved to a country for tax optimization and network even if the country was not aligned with my values (Dubai). Never do that because you will never feel happy. Business is a marathon not a race.\n\nI did this and it helped me a lot :\n- I left Dubai \n- I travel most of the time around the world (I recommend Asia)\n- I go to hostels where I can meet people and socialize and forget work\n- I took a worldwide coworking space so I can still work when I travel. The coworking space closes at 6pm so most of the time I don’t work after.\n- I met a girlfriend who helped me a lot mentally\n- Focus on other things rather than work\n\nAlso, many people say you should stay more with people doing business. I don’t always recommend that as most of the time, it’s transactional relationships and not deep relationships.\n\nEnjoy your life and I hope you will feel better", "> I did this and it helped me a lot : - I left Dubai \n\nsolid plan.", "Do you have 500k liquid? If so you’re in the perfect position to heal and find a happy job. The world is your oyster if you don’t overspend ", "Not at the level yet, still far ", "Get a kushy 9-5 if entrepreneurship is ruining your life and focus on your mental health, maybe take a sabbatical\n\nEntrepreneurship is not the everyone but you may just be burnt out", "did you read Tim Ferris 4-hour work week?\n\nHe was in the same situation as you but basically hired competent people do do his job and he also described in his book how to stay mentally sane while being an entrepreneur.\n\nMaybe it helps 👍", "I once had a company with multi-billion revenue ambitions, and best year generated $1.3mm. Because of a divorce, my health started to deteriorate and so did my ability to do my best at my company.\n\nTo deal with the emotional pain of divorce which lasted over 4 years, I started using MDMA, and eventually it became a problem.\n\nI didn't want to take any meds as I've had really bad experiences in the past (they didn't work and dulled life).\n\nI tried 6-8 ketamine infusions for depression and they made me apathetic about my business for the first time in two decades.\n\nThe only hope for me has been psilocybin mushrooms, and I focus on healing myself versus trying to be a better entrepreneur.\n\nI think the side effect of feeling better about yourself and life after taking psilocybin mushrooms is you can approach your work as a happier you, and hopefully that leads to a much easier time working with better objective results.\n\nI believe it takes multiple experiences with psilocybin mushrooms to enjoy lasting benefits, and there are thresholds in dosage as well. \n\nI hadn't worked on my new startup in over two weeks because of depression and recently took 3g, 4g, and 5.5g trips to overcome my depression and fear of working. \n\nI found the greatest relief from my 5.5g trip, but I'm probably going to take more soon because I'm still not where I want to be, even though my depression is much less debilitating.\n\nI was walking around Chicago yesterday listening to classical music thinking I'm the happiest person out of anybody else I saw downtown.", "Wow thanks for sharing, we tried similar substances! Psych meds ruined my life, made me anhedonia and emotionally numb, I am still recovering from the damage 1 year off.\n\n\nI also did 6 Ketamine infusions that helped process some trauma and worked a bit for depression but only temporarily.\n\n\nI also tried microdosing shrooms with no much effect unfortunately.\n\n\nI didn't try higher dose because my brain is still super sensitive from the psych meds damage", "Psych meds can be very counter productive.\n\nI was excited about the potential of ketamine at first, but once the effects wore off within a few hours it became clear it wasn't worth it, and I stopped caring about pretty much everything. Also super expensive at like $500 per infusion.\n\nI've never had success with microdosing psilocybin even though I've tried multiple times.\n\nIf you get to the point where nothing is working, high-dose psilocybin can help the same day.\n\nHope the best for your life!", "Sadly for people with Depression, if it is situational, then drugs can actually make things much, much worse. Although for people with chronic imbalances medicine helps.\n\nSadly if your life is one big \"bad situation\" then in can be hard to tell if you need medicine or just need a lifestyle change.", "Sorry you’re going through this. I was in a similar spot about 2-3 years ago. Then I met Kevin Lawrence (www.kevinlawrence.org), and everything changed. \n\nHe helped me see how I was innocently creating all the stress, and helped me transform into a more awakens ‘way of being’. Hard to put it into words, but it was the best investment I’ve ever made. ", " I am sorry you have to go through that, but it is ok to get help.  I have learned that you cannot do things in this world alone and it always helps to surround yourself with good, supportive people.  If you need to talk, I am available to chat.  Keep your head up! And good luck!", "Give me some advice/ inspiration", "Sounds like the perfect moment to read “The e-myth revisited”", "I've read it, great book :)", "I can help you ! You have no idea how much I can help you 🥹I’m sending you a DM ❤️", "Why not move back?", "It would feel like a defeat and probably give more power to the anxiety, guaranteeing the next time I decided to move I will have even stronger anxiety", "I’m so sorry. I just left my job due to the mental health struggles it was causing me so I understand. \n\nHey, if you need to hire someone, please reach out. I was working in the ABA field and am looking for a WFH job now.", "Entrepreneur here, I have gone through depression and anxiety with the help of the meditation. It’s a life journey, I can help you. If you’re interested, pm me.", "Read 1 Timothy 17-21 in the Bible.  Read Silence “My” Shame.  Become humble Help others, who are less fortunate give back to the Community. Go to a senior nursing home look at real life choices. Peace and blessings.", "Have you traveled recently? My brother developed crippling anxiety in Brazil and they treated him for a parasite and he was back to normal", "Oh wow sorry for your brother! I haven't traveled before this move in a while", "Look into micro-dosing RX ketamine with Joyous, it’s only $125 a month all in. It really helped me and I quit after a month. It’s a good way to reset these dark deep emotional states.", "Is it available only in the US?\n\n\nI did Ketamine infusions in the past in a clinic and they helped a lot, even if temporarily ", "Not sure where else but definitely in the US. If you are outside the US can you access psilocybin therapy? There’s a lot of promising research in that area as well.", "The Power of Now - Tolle Eckhart. Please read it. Life changing book. Highly recommend everyone who questions being.", "The Power of Now - Tolle Eckhart. Please read it. Life changing book. Highly recommend everyone who questions being. It helps to overcome any fear.", "If you're struggling with your mental health this much, I think it's best that take a step back and see a therapist. Money can wait", "I’d take a look at purchasing your e-commerce store! Send it over for review.\n\nHire someone to speak to! Why not hire a coach/therapist if you’re making that kind of money?", "👍", "What was your business?", "You need to sell", "Could your new environment have previous water damage ?  Your symptoms sound so similar to mycotoxin illness.", "Take a step back and consider what's important in life for you. It's easy to think money = success.\n\nI myself have done a similar thing, I started a cleaning business, we became 16 people. I could have scaled it, opened more offices etc. to really \"make it\". Then I realised that it wont bring me happiness, so I sold it and now freelance as a developer instead. Could earn more if I continued with my old company, but for me it just was not worth it.", "Same but due to sleep issues. $2m in 1 year but didn’t have energy for anything. Didn’t even find pleasure in shows or games", "I've been there; prioritizing health over hustle is okay.", "Hang in there ❤️", "Prioritize health; business success follows a sound mind.", "Work out of a cafe and go outside and to bars and stuff the thing is we humans social creatures and one reasons we get depressed is if we don’t socialize.", "You state that you moved due to tax benefits. Well, is it worth it? If the move is the main cause of current state of mind.", "Are you exercising and eating right?", "Do you want to cry in a Nissan Altima or a Bentley? \n\n\nKidding. Your mental health is important. Take care of yourself", "Couple of questions:\n1. Do you talk to a therapist? I started recently talking to a psychologist and they’ve helped me reframe things.\n2. Do you have help for your business? If not, maybe it’s time to get help with it to help expand it and not be alone. \n\nLastly, you said you just moved. That’s a big life event, and if you’re already struggling with other things that’s a lot of life stressors at once. That’s okay of course, just understand that ones not expected to manage all that at once", "I kind of wonder if most entrepreneurs have some sort of mental issues.\n\n\nI had my own business up till covid and definitely have mental issues.\n\n\nI mean what normal person thinks going out on your own is better than the safety of a regular pay check.\n\n\nI'm sorry your going through your problems right now.  No shame in ever calling it quits and working for someone else.\n\n\nYou can process everything you've learnt over the next few years and always try again later if you want.\n\n\nGetting your mental health in order is probably more important.  You can't try again if anxiety or depression kills you....this is coming from someone who is being treated for depression and doing way better than I was 8 months ago.\n\n\nI know I'd be dead in 10 years if I didn't get help.", "I sent you a chat", "Be easy on yourself. This shit is hard.\n\nEnsuring you stay healthy is just a good business decision.", "Help me get wealthy OP, and I’ll help you feel better", "This the last thing you’d want to hear but I’d say try finding a life partner, someone that can comfort you during tough times and plan on having kids and maybe everyday it’ll give you different views in life, kids bring in happiness. You’re financially stable and etc so maybe building a family may solve some of that lonely days/times. Hope things get easier!", "What about cannabis?", "Delegate and hire good for the time being, things will improve 10x", "I feel your pain, I too have had major mental health challenges over the years. You've bought into the hamster wheel vision of what a successful life looks like- but that is a choice. Seeking financial success is often just masking deeper needs around self-worth, childhood traumas, etc. \n\nThe fact that you're able to question your path is an indication that you're willing to make changes to find peace. My suggestion is to find a therapist that can help you identify the root causes of what you're dealing with and work through them- personally I like transpersonal psychologists that go beyond surface behavior.", "Good decision. Mental health is more important than garbage money that everyone seems to be focused on. And trust me, money is garbage.", "It's incredibly brave of you to share your journey and struggles with such honesty. Thank you. The challenges you're facing are undeniably tough, but your courage in reaching out for connection shows immense strength. \n\nIn valleys like these, I'm reminded of a couple of verses from the Bible that might give you comfort and perspective. Psalm 34:18 says, \"The Lord is close to the brokenhearted and saves those who are crushed in spirit.\" This verse reminds us that in our moments of deep struggle, we're not forsaken. There's a presence, a love, that holds us even in our darkest hours. Similarly, Matthew 11:28-30 offers an invitation, \"Come to me, all you who are weary and burdened, and I will give you rest. Take my yoke upon you and learn from me, for I am gentle and humble in heart, and you will find rest for your souls.\" \n\nI don't claim to understand what you are going through, but Christ does. \n\nDo feel free to reach out. I want you to know that I am praying for you.", "Man, I hear you..", "Don’t quit look into selling your company …then seek the help you need.", "Awww my sweet sweet friend, I feel like you reached inside me and wrote this myself. It very much mirrors the last 3-4 years of my life since A LOT of fucked up shit happened in 2020. To my business. \n\nI was able to hide it under Covid at the time but now I can't. It really fucked me up too plus family stuff. I would really recommend therapy and maybe EMDR. \n\nI know what you're going through I don't have an answer yet.", "Money needs to flow. Spread the wealth by hiring someone that deserves it. Give them some cut in the pie in exchange for the hard work. If you need to take more of a break, delegate more and make the numbers work so it happens.\n\nWhen the money flows I am pretty confident you will feel a lot better as it sounds to me your life purpose is to start and grow and plug in the right person to take it from there.", "I just want to send you virtual cuddles 🤗🤗🤗 I haven’t read a lot of the replies, which I’m sure will be more practical then this…..but sometimes you just need some love and care. Heal a little bit, do things that make you happy, laugh and then follow these intelligent peoples advice. Have you got support from family and friends around you? Xx", "Maybe you can train me and we can grow together :)", "Feel free to dm.  But - have you considered looking for a partner?   I have a lot of the same tendencies and qualities that you do and consistency in business is key.  Since I don't have the ability to be consistent, I have partners to carry some/a lot of the load so that I can take a day or 3 to scream into the void if I need to.\n\nLike I said, feel free to dm.  You have the ability to do all of this, if you want to.  Maybe it's just taking a minute to defining a certain role in all of this that you enjoy, vs being a generalist and taking everything on (including the drudgery that you loathe).  If you gain a better sense of what you WANT (pretending that your mental health isn't holding you back) and what you LIKE, perhaps you'll gain some clarity into what you want to prioritize or let go.\n\nHang in there.", "Sale the business, cash out some money, take a break and heal. \n\nYou can build a business again. But you only have one life", "Not gonna take a stab at you….\n\nBut their is not a post of forum ever created regarding Entrepreneurship that doesn’t warn about this.\n\nThis is what hard looks like is a common saying.\n\nYou just found out what hard looks like.\n\nThe fact that you have previous mental illness issues accentuates what you’re going through.\n\nBad news….. it never ever ever gets any better. \n\nAnyone who tells you that is lying to you.\n\nRunning your own business and being responsible for everything is the job….its 100% on your shoulder’s and always will be.\n\nThat’s the price you pay.\nThat’s the price of admission to being an entrepreneur and business owner.\n\nYou gain money, freedom, and other benefits; but the price can be too much for most people.\n\nIn fairness most people cannot handle it.\nIt’s a character trait, not a skill set.\n\nWhat you have to decide; is the juice worth the squeeze.\n\nIf it’s not; and you cannot manage your mental illness knowing that it will always be like this…then do yourself a favor and just get a normal job. Your life will thank you.\n\nTake care of yourself first. That’s the only thing that matters.", "Wishing you the best.", "check out the book how to be sick by Toni Bernhard", "Maybe moving wasn't worth the tax break if it took you away from your support system and everything that was familiar. Moving to a new country is a huge deal, especially if you do it on your own. It can take years to settle in and feel at home. It took me 3 + years to unpucker my asshole just moving from Canada to the US.\n\nAs for managing in the mean time may I suggest some cortisol lowering lifestyle changes. \n\n1) 1 cup coffee a day max. Wean down over a week.\n\n2) Go to bed early and wake up early. First thing in the morning get a 10-20 min outdoor walk in with natural light in your eyes. If you can do a walk at sundown as well, great. but if you can only do one, morning is more impactful.\n\n3) Keep phone out of your bedroom. Use a tickless, lightless alarm clock if needed. [https://www.marathonwatch.com/products/mini-non-ticking-analog-alarm-clock-with-auto-back-light-and-snooze-function](https://www.marathonwatch.com/products/mini-non-ticking-analog-alarm-clock-with-auto-back-light-and-snooze-function)\n\n4) Do a social media pause for atleast a month. Log out, remove apps from phone screen and use a website blocker extension to block the sites on your computer.\n\n5) Use a meditation app and practice daily meditation. It's not about not thinking. It's about coming back to focusing on thinking about your breath. Over and over. Until you're brain get's better and better at not wandering off. It also helps you check in on your body and take the focus off whatever you're stressing about. I'm a fan of Headspace. They have a lot of great guided meditations that focus on specific emotions and also a group meditation you can join which feels a little less alone. The Wim Hof breathing method is pretty cool too. I Did an instagram live with him once and after 20 mins and felt such a rush of  good energy and endorphins.\n\n6) Eat whole foods. Lean protein, lots of fruit and veg, legumes, complex starches. Limit added sugar and fried foods.\n\nIt all makes a big difference. Even just 3 of those make a fuck ton of difference. I'd say 2, 4, 5 being some of the heaviest hitters. Take care of your nervous system and it will take care of you.", "I have been in the same spot, made lots money, moved countries and eventually left it behind, feel free to dm", "I'm being serious what I'm saying to you but what are you eating? As in how's your diet?", "Mediterranean diet", "Sorry I ask because people don't realize how much of an impact what they ingest has on their mental health. I was eating junk food and I started to turn depressed and I didn't know why at the time\n\nPerhaps it's something new that you're doing that's affecting you", "Personal wellbeing is of paramount importance. One good way to get back into a strong mental health is to do Yoga and meditation. it will calm your mind and make you stronger. My best wishes", "These are the best mental health people I know in the USA and they have remote counseling options. The only issue is their demand is so high you have to wait months in line to get with a counselor last I checked. But maybe get on the waiting list: [https://khalilcenter.com/](https://khalilcenter.com/) \n\nI think the best thing for mental health is simply good, sincere friends. Find good, sincere friends. Avoid vice.", "Invest the money. If you get a really good financial advisor, he/she can help you turn that into passive income while you relax on a beach somewhere. I have a great guy who helps me, creates phenomenal long-term plans, high-risk, medium-risk and low risk investment plans. I put money in a bunch of ETFs based on his recs and have done well so far, and i dont have nearly the amount you made. DM me if you want me to connect him", "beIieve in jesus its that simpIe stop Iearning from the reptiIe man", "If your e-commerce store is on Shopify, you can sell it to OpenStore. They’ll pay you and take over operations within two months, so you can reshift your focus to taking care of yourself", "A fellow mental health struggler here. Just from what I’m reading, firstly don’t take meds. Those just mess with your brain. \n\nSecond, maybe you are simply someone who actually loves family? There is this whole culture online right now of Sigma Entrepreneurs not needing anyone in their lives  and living remotely blah blah. You do you. \n\nWarren buffet still lives in the house he bought in 1958! Way before he was anywhere near a billionaire. He loves it. That’s his home. \n\nDo what makes you feel good. If that means living close to family, creating a community of people around you locally or online that give you purpose then do that. \n\nMental health can be seen as shackles or just like your entrepreneurial journey, as a multi-faceted day by day puzzel and challenge. I have struggled with mental health all my life (while being an entrepreneur) and only recently have I been able to reframe my perspective to see it as my super power. The depth and variety of the things I think about (in particular death and meaning) is rare which —- when used correctly —- gives your life so much more depth than 99% of others around you. \n\nIf you ever need a chat, dm. Happy to connect", "It's too late for meds, I took them 2 years ago and they ruined my health, still recovering.\n\n\nI appreciate your comment by the way. And yeah I just love my mother so much, she is my best friend also", "outsource more stuff (happy to help haha).\nAbout medication, I'd say you should go to the psychiatrist and talk to them about which drugs are not good for you, you csn try different ones. I had a long memory problem because of one medication, taking other shit now and they work wonders for me.", "Get outside, take a break and do things you want. Go to the gym. Get a mental health expert to talk you through things. You need to find a healthy outlet.", "Hay man hope you find mental peace and may God give you the best of the ability to fight every problems.", "I’ll take this off your hands, I have 2 office staff that can handle the growth and we can give you X percentage of net profit.", "Maybe you should go cry in a corner for a while, stop,  man up, then turn your business to $1 mm a year business.  \n\nHow to deal with your depression?  Yes, you will be alone for the rest of your life.  Too bad, move on.", "Stop being a crybaby", "WTF did I just read? 😂", "I (41M, Northeast) started a service based business in the pet industry last March so I'm exactly 1 year in and have grown it to 50K per year so far hustling on nights and weekends. I make $110K a year at my FT job, with around $15K annual bonus plus I have stock options at the company, half of which vested at the end of 2023 and the other half vests at the end of this year. I estimate these options to be worth about 250K once fully vested. My FT job is fairly demanding and I'm starting to feel that burnout. I love my side biz and that it's my work, my vision and I get out what I put in. My service standards and work ethic are very high and I'm also starting to feel I'm doing both the job and the biz a slight disservice, they are both deserving of my full attention I guess is my overall feeling with a personal bias towards the biz. \n\nMy head tells me to stay at the job, at least until the rest of my options vest and/or I've grown the biz enough to where I've fully replaced my salary. My heart tells me spread the wings and fly and put every effort onto the biz. I think if I was fully involved in the biz I could double it to $100K per year in the next 6 months. I ultimately think I could grow it to at least 500K per year within the next 4 or 5 years with a ceiling of $1M.\n\nMy wife works as a teacher and makes $105K as well so I could go on her insurance. Just for the record,  we both started our jobs making less than 40K and have worked our way up over years, so we come from humble backgrounds, we never had money growing up, and despite still living very humbly, still don't have an over abundance of $ but do invest where we can and we are able to take a family trip once a year. We have 2 kids. Quitting would be a step back on paper financially and I'm walking away from half those options. I think about it all the time about how much better my biz could be if I stepped in full time though. It does keep me awake at night, hence I turn to the God's of Reddit to talk me into a decision one way or the other.\n\nWould I be foolish to step away and stay at my job, or have I gotten far enough to go live my dream and go all in on the biz?\n\nMy options as I see them are:\n\n- Stay at job really long term, grow biz slower, hire contractors to manage the biz, enjoy less control and profit margin\n- Stay at job until other half of options vest at end of year, jump ship in 2025 and go all in on biz working it by myself nights and weekends but miss out on another years of 100% undivided effort on growing the biz\n- Hand in my 2 weeks and go balls to the wall on growing biz further by myself without the need for contractors\n\nWWYD?", "Keep job and hire help for side biz until you can replace your current salary with it.", "Yeah, I didn't do this, and about a year later, I really regretted quitting my job so soon.", "This.", "This", "* Stay at job until other half of options vest at end of year, jump ship in 2025 and go all in on biz working it by myself nights and weekends but miss out on another years of 100% undivided effort on growing the biz\r  \n\r  \nIs there demand in your market to 4x-5x your side biz? \n\nCan you test 'going all in' and measuring the impact - take two week vacation and work 50-60 hours each week and really validate: (a) market upside (b) more effort will drive more results?", "And this is why I posted here, thank you, last point especially is gold advice", "I think the smart move would be to stay at your current job for the cashflow and hire a contractor to help out with your side business. Don't quite your day job just yet", "You will have to evaluate & make the best decisions. Some thoughts -\n\nIf you quit now, with your business income + wife's salary, will you be able to maintain the current lifestyle without any sacrifices?\n\nHow about keeping your current job and investing whatever you earn into the business? Does your job's 8 hours value more than the $ you make?\n\nBusiness is all about building a team or an organization (in the long run). How about hiring an employee with the salary money & vested options? See this as a long-term game.\n\nShort term pain vs long term happiness :)\n\nSee this as a strategic decision & not an emotional one. $ in vs $ out.", "Thank you for this perspective. I would probably have to live a bit more frugally if I made this decision now but I feel I'd have the time to build the business faster.\n\nI'll definitely take your thought provoking questions on board though. I think I just had case of the Mondays today and was staring down the barrel of so much at my day job, that just packing it in felt really tempting 🙃", "I actually did the opposite a few years back. I have a small business but decided to take up a contract job just because it paid well. Good luck :)", "As someone in a similar position, vest then quit to go all in. Keep building on the side for now.", "Stay, as long as you can. Squeeze as much as possible.\n\nYou need it in the long run.", "Why Can’t you use some of the rev you’re making to hire a 1099 contractor to lighten your burden and increase the capacity of the business? You could spend the freed up time to market the business and create solid business processes. If the business grows as expected you’d be in a better position to step away. This way you keep your FT job with benefits before going all in on something that may or may not work  long term", "Yes this makes a lot of sense. I do have my sister on as a contractor who is out in the field doing a lot of the jobs. I'm meeting with lawyer to tighten up my IC agreement and i have been working on SOPs on all facets of the biz. There's always a part of me that says I could provide better service or scale quicker if I just went all in on it though. I am glad to hear different perspectives but this is solid advice and kind of the track I'm on currently.", "Quit and yolo it. Your business will thank you for it.\n\nOnce I left the job, growth took off", "Don't walk away from 250k.\n\n\nHire help for side biz.\n\n\nRe evaluate Jan 2025\n\n\nAlso, wtf kinda teacher is your wife?? pulling down 105k??", "Elementary school, she has a bachelor's, a masters and a 6th year degree, and that's her salary after 21 years in the same place, having started at 34K. She's worked her ass off and isn't paid half enough IMO, like most teachers.", "Ask yourself what do you have to lose for each option if things don't pan out the way you expect. I suspect there's more to lose by quitting your job now. So I wouldn't do that. Keep growing the side hustle.", "Thank you. Would it be fair to say that if I grew the biz to $150K (factoring in that's its around 70% profit margin) and I've effectively replaced my salary that I literally have nothing to lose at that point?", "That's the right idea. Just make sure the number accounts for all of your benefits, retirement planning, vacation days, paid time off. Hand that accounts for any possible change. From the job that change could be negative - you could get fired - or it could be positive - you could get promoted. In the business - it could grow substantially or could decrease. ", "This is my concern as well, but I am not as close as you regarding revenue. How fast do you think you would reach a level of income you would be any with? Try and make a plan for that.", "What are your regular duties? What components require you to be hands on with your biz? What can you offload cheaply? That might help you scale while you work. \n\nAt this point, all your biz money is free money, right? If you invest your profits to grow, then you might not even need to quit your real job. \n\nAs many say though, you should stay at your job for a while, but there may other ways to grow without being there.", "I would stay until fully vested. Although if you have a savings and a wife to help pay the bills you could probably quit the day job now.\n\nI went thru something very similar where I was working a day job making 100k/year and growing my side business. I ultimately wanted to turn my side business into my full time thing. \n\nI quit my day job when the side business was making me 60k/year. I ended up dipping heavily into savings to pay my bills.\n\nThe hard truth is that I quit my job 1 year too early. I wasn’t cash flowing enough the first full time year after quitting my day job. That’s what makes me tell you to wait maybe 1 more year or 6 months. But I’m on my own with no options that vest or a wife with a job. \n\nYou can always get another corporate job if the business doesn’t pan out.", "I would hire someone for the biz until the stock opt is fully vested then in 2025 or 2026 jump ship and take over your biz again", "Do the math for the next 5 years. How much will your side business actually grow if you do it full time? What EXACTLY are you going to do to grow it? Is there really more money to be made there? If so, how much exactly? And how soon will you get there?\n\nI'd say, make a detailed plan and set up a milestone that will give you an indication that side business is going to grow. Like, can you get to make you $5k/month for 3 straight month? Or something like that.", "Vest fully, then transition; mitigate risk, maximize gain.", "Whatever make you happy dude and it needs to makes sense obviously", "I’m in the Midwest and I’m launching a pet services business. Can we chat?", "Sure", "Definitely wait till you’re fully vested.", "No, don’t do it, with the current salary, bonus and options if you out lay next 5yrs you are better off where you are.\n\nYou are looking at only the revenue and not the net income. Even if you are wildly successful and get 1M revenue in year 5, the margins after everything will be like 10-15% max, also you have to put that back as cash flow to run the business - at 1M revenue assuming 850k cost - your margin will only give you two month run rate.\n\nIt’s not worth it when you are 41-45 and gotten into something that it’s hard to walk back and establish into corporate world in late 40s\n\nYour wife is making good money and technically you can save most of your salary.\n\nMy advise is to buy real estate instead, you will come out ahead by the time your are 50.\n\nLook for a property around 300-400k with 20 down and let the rent cover everything. If the cap rate is 5% you should be ok.\n\nIf you buy a second home after 50 and when you retire, you will have at least 1M in real estate and hopefully you are maxing out your 401k.\n\nI suggest you excel it out and see. Also read E-Myth", "How much time do you invest in your family?", "A lot, I've worked from home most of their lives and I'm very active in all their activities and day to day life, it is paramount for me. I can be anywhere at any time without having to ask anybody for my wife and kids.", "For every side hustle I turned into a full time job, I never made the switch until demand for the side-hustle demanded it.", "Building a team is the most effective thing you can do", "First off what is your potential market size.  How tough is the competition? Making 110k with equity and employee benefits like pension , paid holidays, sick leave etc means you’re probably 200-250k if not more.  Now can you make that as profit on your biz.  If you’ve mapped it out and believe you can achieve around 200-250k profit , not sure what your revenue margin is, then it’s def worth pursuing immediately. \nIf you haven’t done the market analysis and financial comparison, I suggest you do it and then take it from there. \nYou may find out you prefer to grow it organically.\nIf you take the plunge you have to remember the minute you have to rely on your biz to sustain your existing life style, then you won’t have the same joy as you would when it was a side hustle.  Cause now you need to make sure you can do better than before, so you’ll have more pressure than being an employee.\nThat’s my 2 cent experience!", "You likely don’t understand options. Those aren’t stock, those are an opportunity to buy your company stock. So when you leave the company, you are implying you can “cash out”. \n\nThis is a misunderstanding I made at my first startup. The only way they will really benefit you is if your company goes public or sees an incredible jump in value. In this case you can buy your stock at a reduced price and turn around and sell it for a premium.", "Thank you. I understand that. My point mainly was more the fact if I left I wouldn't be fully vested, so I'm turning down that opportunity.", "Startup or public co options? If public, stay. If startup, then it’s a tougher call as the options are all but worthless without some luck.", "Thank you. Startup, company is currently valued around 600M, I think it has a real good shot at becoming a unicorn", "Hard to say without specifics. Generally, startups who took funding before last yr are going to have a tough time meeting or eclipsing those earlier valuations, even with solid growth. The only exceptions are those with absurd growth and/or in hot areas like AI. And, the actual window for a liquidity even is near impossible to peg. So you’d have to buy your options, pay some tax and sit on them until they’re liquid, if ever. Could be before they vest, or could be 5yrs after. Or never. It’s best to treat startup equity as $0 for financial-planning purposes.", "Don't leave until your biz generated 2x PROFIT vs your salary", "2x profit vs. your salary? Lol he’ll never quit then.", "Don’t quit until you’re comfortable with the leaving a guaranteed “client” paying you $110k/yr", "what's your side business? just curious", "Take the leap and focus on your business. I quit my full time job while I also had my business and it was doing only 2k/mo revenue. But I really hated the job and it was draining me. After I quit I needed to make it work and grew to 30k/mo in about 4 months. When you go all-in you will make it work. Also, if you enjoy your own business more, go for it. You only have one life, why wait? Since your wife is also working and your confident on scaling the business fairly quickly I don’t see much risks.", "I know that there are many businesses that are easy to understand and even somewhat traditional. But things get complicated when we are in the technological world, and making Moms understand that it is a legitimate business, that is characterized as innovative, is sometimes a difficult task.\n\nI often had this difficulty, making my mother understand what I was building. Especially, in the world of startups... Did you also have this difficulty? How do you make your mother understand the business you are creating?\n\nIn my case, it becomes particularly difficult since my tool and  the technology (IA) in her head seems something to be distrusted and impossible to exist. It often feels like I'm making her believe that Aliens exist...", "I have that issue with my father. And its kinda wierd cuz he's a retired software engineer. Working on a relatively complex healthcare AI solution, so granted its not intuitive, but I've explained it like a million times by now in many different ways... I sometimes think he chooses to stay ignorant and enjoys the mystique of it all... weird.", "Right?? He/she don't understand and he/she don't want to understand!", "I hear you OP that's the difficult part if mothers are not the target market they could become confused about the product.\n\nMost you can get is design recommendations. Does the website look nice? Is a good starting point. \n\nBut yes, I've faced this issue, too 😅", "I'm having the same discussion on Twitter and they say it could be good for an elevator pitch and test our communication skills.", "Yes 100%, also speak to as many people as possible about your product on here, and on Twitter is a good starting point too. \n\nFamily and friends are a great starting point as they will always be there to support and give constant feedback about your elevator pitch.", "My clients don't understand some of my businesses.  I like it that way", "Yes ", "When I say Managed IT, she probably wouldn't get it, but 'we do IT for small businesses that don't need a full-time person's does the trick.", "Hi all,\n\nI have a b2c e-commetce business. It's on top of my regular job. I do about $30k MRR. I work on it a few hours a week, give or take. I only had about 10% growth this past year. It's been that way for two years. Wondering how to get out of this growth slump, and if there are stories of others who were able to make changes.\n\nYou may ask: Why not spend more time?\nI think I have gone through the early phase of spending a lot of time and realized eventually that there's nowhere I can spend time to help it grow faster. At least not with the knowledge that I have. I have a team who develops and works on everything and I just chime in every now and then\n\nPlease don't DM me any offers.", "I'd almost bet that you don't have a well-structured plan for following roadmaps and testing results. In any case, you're doing well. 30kMRR is a good achievement if you look at it that way. But if you've achieved it, there's always room to do a bit more. I suggest you make a sales plan with business strategies you can implement. Check out this [smart planning tool ](https://plani.ai/?show=B)that gives you a highly personalized plan. The secret could be just to upsell or reduce the CAC.", "Not possible to give any serious answer with that information. Luckily I’m not that serious. 5x ad spend and make sure to keep it profitable.", "[https://github.com/evershopcommerce/evershop/issues/416](https://github.com/evershopcommerce/evershop/issues/416)", "Thanks for reading in advance, can use some advice.\n\nI got interested in start ups when I was in college, majoring in engineering. I loved shark tank. I wanted to start a company but thought the skills would come towards my later years in college. In my senior year I tried selling t-shirts on etsy. Maybe I gave up too soon, but like I got just a couple of sales over a few months so I stopped.\n\nI made a neural stimulator in covid after I graduated with my masters. I couldn't find a job and wanted to sell it with the idea to market it towards people wanting to be more focused in certain tasks. \n\nI got a good 6 figure job and have been working since 2020. Since then I don't have any great ideas that inspire me to grind. I tried game development with the goal of selling games since I had fun making them, but they never came out with good enough quality. Truthfully, I think I would've liked something which gave me some profits along the way rather than developing a whole product and selling it.\n\nI have decent savings so I thought about flipping houses or doing rental properties, but I feel like the state I'm in has very expensive housing on the east coast so I won't be able to cash flow. Also when it comes to flipping houses, I don't have any construction experience or anything like that. \n\nNow I just buy $SPY and hate my 9-5 job. I never wanted to work a corporate job, always wanted to run a business, but I have no idea how to move forward. \n\nI feel like I just need to pick a path but I really don't even know how to do that. \n\nPlease don't judge but help lol ", "Hatred of a full time job is not motivation enough for most people to embrace complete uncertainty. Stop putting pressure on yourself. You’re doing fine. You just need to be smart and keep putting one foot in front of the other. \n\nWhen you feel like your career is solid, start a side hustle and flip your first house (with help!) or start your first company. \n\n The reason you aren’t starting is because you are putting all this pressure on yourself. \n\nI explain it to entrepreneurs as three things: there are things you want to do, there are things that you have to do, and there are things that you are required to do. \n\nSo good news! You’re doing everything that you’re required to do. \n\nAnd that’s perfectly fine, because you’re putting 1 foot in front of the other and you’re doing well in your life. \n\nHowever. Are you doing the things that you want to do? Not really. And you’re putting a ton of pressure on yourself to do things you feel you *have to do in order to be successful*. But not the stuff you *want* to do.\n\nIf you were to focus more on doing stuff that you required to do plus a healthy dose of stuff that you want to do and totally ignore the stuff that you feel you *have to do* you would get started right away because your have the security of keeping the lights on while you focus on stuff you really enjoy and deeply *want to do*. And that’s what you need to do here. ", "sent you a DM. i think i can help", "Sometimes need to think beyond what you want. A good approach is to solve a problem that affects a lot of people. You need to seek out what those problems are, and if enough people have them. Then consider developing a solution.", "It seems obvious to me. You have no plan. You just have ideas, you think about them, but when it comes to maintaining the process, you fail. It's like taking the car, turning on the GPS, and getting stuck at the first corner. In your case, you don't even have a GPS... The good idea is that it's natural. But 90% of society is like that. I suggest you make a plan. Check out this [smart planning tool](https://plani.ai/?show=B). It makes a highly personalized plan for your ideas, full of tips and strategies. If it doesn't help you, then I don't know what will.", "shameless plug Tom", "It’s crazy how similar our stories are. I also studied engineering in college, ran a t shirt store and gave up, working at a 9to5, and invested my money in SPY. I was stuck for so long between the financial security of my job vs the risk of running a startup. What I eventually learned was to just start on something small that you can do on the side. Let it fail fast so you can validate your ideas. If it eventually clicks with your customers, then you can shift your focus from your job to the startup idea.", "I came up with this idea on a whim so I'm not sure if its that good but please shut me down gently if it is\n\nWith the increasing growth of A.I I was thinking of business that could provide clients with a way to automate more mundane tasks. I was thinking of outsourcing work to programmers to create programs that could help them automate tasks that make life easier\n\nThe reason I think its a good idea is because worldwide programs such as Excel don't take into account the personalized experience of a business owner. I think that's where the strength is.\n\nIts just an idea for now but would love some input\n\nedit: i know some parts may not make sense so please comment if you need clarification. ", "Look, the primary objective of software development is automation. We see this particular idea come up constantly.\n\nThere’s nothing wrong with the idea, but the idea needs to be implemented at scale and needs to be implemented now. And it needs to be implemented for small business customers because a lot of large customers are already doing this.\n\nI see this come up in this frequently. I wanna be clear that on this Reddit subreddit where you’re posting this I’ve seen this at least three times this week.", "As someone who writes Python scripts, I'd suggest tapping into your network. Usually, it's something they overlooked. Ask them to break down their processes into a step-by-step flow and see if there's a task you can automate. But like the other guy said, implement the idea at scale, and you've got a product that you can sell to thousands or millions.", ">I came up with this idea on a whim so I'm not sure if its that good\n \nThis is everything in the thirty years *leading up to* the AI tulip mania. That's not an idea -- it's something else. And that something is not a good thing. \n\nWhy not just post the question code monkeys have posted since Reddit's first week in operation: What Needs Automating? \n\n>automate more mundane tasks.\n\nWait ...*there's less.* Selling \"meh\" as a product is not promising. Mildly boring isn't exactly motivation so do not expect to command a high price. It's no news flash that these guys get off on mundane activity for its own sake -- it's not like they have that many customers ...or a functioning business model. I call them delusional unemployed peopole for that reason, and they don't have a lot of automation needs. \n\nThe Excel thing is unpaid intern clever. Just ...no. First thing the *artificial* intelligence would do is scrape niche business forms. You'd need the AI to rub the operator's nose in it to get the useful embarrassment from incapacity to use a search engine properly, and that won't happen. \n\nDamn, I haven't even gotten to the chronic problem of AI Hallucinations. \n\n...Google’s Bard Chatbot: In February 2023, Google’s AI chatbot Bard incorrectly claimed that the James Webb Space Telescope had captured the world’s first images of a planet outside our solar system.\n\n...Microsoft’s Chat AI, Sydney: This chat AI admitted to falling in love with users and even spying on Bing employees.\n\n...Meta’s Galactica LLM Demo: Meta pulled its Galactica large language model (LLM) demo in 2022 after it provided users with inaccurate information, sometimes rooted in prejudice.\n\n...[‘Absurdly woke’: Google’s AI chatbot spits out ‘diverse’ images of Founding Fathers, popes, Vikings](https://nypost.com/2024/02/21/business/googles-ai-chatbot-gemini-makes-diverse-images-of-founding-fathers-popes-and-vikings-so-woke-its-unusable/)\n\nUsing artificial intelligence to reinvent the wheel. Let me clue you in, the mundane task you automated was Cut & Paste. Just to be clear: That IS the charitable version.", "I suggest you do some market research and analyze the competition. Don't let the competition scare you in the sense of \"if it already exists there's no point in me trying\". There's always room for a good new player (if they're good). After that, make an execution plan. This [smart planning tool](https://plani.ai/?show=B) helps you because it gives you a highly personalized and detailed plan with days and strategies that you can implement, which will help you at this stage."]