[{"post_title": "NooB Monday! - April 08, 2024", "post_url": "https://www.reddit.com/r/Entrepreneur/comments/1byt5jp/noob_monday_april_08_2024/", "post_main_text": "If you don't have enough comment karma to create your own new posts, you can post your new questions here. You can also answer/add comments to anyone else's posts in the subreddit. \n\n**Everyone starts somewhere and to post in** /r/Entrepreneur **this is the best place. Subscribers please understand these are new posters and not familiar with our sub. Newcomers welcome! Be sure to vote on things that help you. Search the sub a bit before you post. The answers may already be here.**\n\nSince this thread can fill up quickly, consider sorting the comments by \"new\" (instead of \"best\" or \"top\") to see the newest posts.", "post_comments": [{"comment_author": "Whole-Membership-613", "comment_text": "Hello everyone!\n\nI'm new around here and just wanted to drop in and say hi. \n\nLooking forward to engaging with this vibrant community and contributing where I can. Thank you all for making this a welcoming place for beginners like me!"}]}, {"post_title": "30 year old job hopper with no money, in need of advice", "post_url": "https://www.reddit.com/r/Entrepreneur/comments/1bylu6i/30_year_old_job_hopper_with_no_money_in_need_of/", "post_main_text": "Hello everyone, where do I even begin? I am 30 year old woman who can’t keep a dang job to save her life and this has affected my finances tremendously leaving me in a rut and feeling stuck. I’ve always had a feeling that maybe I’m not cut off to working for companies and people. However, in order for me to build wealth I need to find a job to keep for a year or 2 and save money and start a side hustle while working my job. Then open my own business. But I can’t keep a job! I get fired or I quit I’ve done self evaluation and I’ve realized I’m never confident or maybe  I’m a slow learner. My attitude might be an issue as well but so many people get away with such behaviors make it make sense.  The jobs that I had paid okay not the best- plus I’m stingy so I’m not a big spender I drive 2013 car and i currently have an old iPhone XR don’t want to upgrade anything bc that just mean more debt and more monthly payments added to my budget. I’m pursuing college with my degree in business  and I will be finished this  year, also after college I’m thinking of pursuing a comp TIA certification. So I’m not done with education just yet. I don’t know what to do anymore I’ve had all kinds of jobs from dental assistant and court clerk like yes i know roller coaster. Any suggestions ? Please help me with some advice. Thanks.", "post_comments": [{"comment_author": "MIA_Fba", "comment_text": "50 yo M had my own business for 25 years. Try to think about those jobs and think if there was a task , a project , an interaction that made you feel like you were doing great, stimulated, in a flow state. That may be a starting point to zeroing in on where you felt good at a job."}, {"comment_author": "ContributionSuch2655", "comment_text": "Sounds to me like you’re a challenge to work with and be around. No one here can coach you out of that and into success. I’ve been a business owner for almost 20 years and trust me, it sucks to fire people. It’s a hassle, takes time and energy etc etc. in order to get fired you REALLY have to be a challenge. I’ll keep a guy on if he has a good attitude even if he’s terrible at the job. I’ll keep an asshole on and find a spot for him if he’s good at the job. \n\n\nSounds you want to put in minimal effort and get maximal benefit."}, {"comment_author": "sidehustle2025", "comment_text": "Spot on."}, {"comment_author": "skelesan", "comment_text": "100%, its scary that OP is 30 but she has no self-awareness at all."}, {"comment_author": "tipit_smiley_tiger", "comment_text": "Learn to build relationship over money."}, {"comment_author": "Usual_Beginningg", "comment_text": "Build relationships with who?"}, {"comment_author": "tipit_smiley_tiger", "comment_text": "With work, customers, family, & friends; because by good relationships you'll keep your job longer because simply people like you. However, this is in addition to already performing well at your job."}, {"comment_author": "Sensitive-Impact-804", "comment_text": "Whom.."}, {"comment_author": "Usual_Beginningg", "comment_text": "Thanks for the clarification, I actually agree with that."}, {"comment_author": "AnonymousLilly", "comment_text": "Aka: kiss ass to survive."}, {"comment_author": "airforcerawker", "comment_text": "Nah you don't have to kiss ass. \n\nJust having a positive attitude and being personable goes a long way. Being a team player. Being humble. Communicating well. Being considerate of others on the team. All these things take zero effort if you're a professional IMO."}, {"comment_author": "sidehustle2025", "comment_text": "Not about that at all. It's about becoming a person that's reliable, honest, friendly, dependable, hard working, etc. Those types of people are the ones that get success. The slackers get nowhere. There is no need to kiss ass at all to do the above."}, {"comment_author": "AnonymousLilly", "comment_text": "Funny coming from someone in the military. You are literally trained to follow orders and if you are too smart you can't get into the military \n\nSoooo"}, {"comment_author": "airforcerawker", "comment_text": "Tell me you've never served in the military without telling me you've never served in the military. \n\nYes, we're all just robots. Yes. No. On. Off. Kill. Don't kill. Beep boop."}, {"comment_author": "sidehustle2025", "comment_text": "You're just a dumb troll that will get nowhere in life."}, {"comment_author": "Wonderful-Factor-787", "comment_text": "Maybe you aren’t working in places you actually respect.  When I worked really crappy jobs, I had a bad attitude because I didn’t respect the job.  When I started getting more respectable work that was more aligned with what I saw my family do, I treated it with more care \n\nYou maybe need to work hard to skill up and level up and find places you actually respect"}, {"comment_author": "sidehustle2025", "comment_text": "That's a terrible attitude. The way to stand out and get on in life is to be the best you can be in all situations. If someone pay you to do a job that you agree to do, then do your best.\n\nOne day, maybe that employer could have helped but they won't if you did a bad job. These are people you should be building good relationships with. You never know when you might need them even if you think you never will.\n\nIt's not only the employers who notice. Other people will as well. Don't become known asthe person who does a bad job. Be known as the reliable, hard worker that gets the job done. That's when opportunities appear."}, {"comment_author": "Usual_Beginningg", "comment_text": "That’s some good insight. I usually do end up in crappy jobs. Definitely going to evaluate and look more into that."}, {"comment_author": "BigStable3684", "comment_text": "If you're into technology you should get into IT it's great pay and I don't have to work more then 40 hours to make a good living. I started off on the help desk and now I'm in SecOps."}, {"comment_author": "Wonderful-Factor-787", "comment_text": "Maybe a fear of what would happen if you landed in your dream industry?  If you were challenged and had to stretch and grow in new ways?  Of not having all the answers?  Of being a small fish in a big pond?  Etc."}, {"comment_author": "Ghostboi-HTB", "comment_text": "You are pushing yourself and that's great. However, if the problem goes down to your own fundamental flaws, that's what you need to target. Even if you have to grin through your teeth to \"act more professional\", do it. Make your peers like you, out perform those who aren't deemed the job. That's all I could provide as advice. I hope you the best and for CompTIA, get your Security+, it's a baseline certificate and you can easily get a government help desk role with that."}, {"comment_author": "Usual_Beginningg", "comment_text": "Thank you! Believe me I am working on myself and it hasn’t been easy at all. My professors have told me “fake it till you make it” but I find it difficult I guess thats the way things really are."}, {"comment_author": "Ghostboi-HTB", "comment_text": "It definitely can be like that. At some point throughout your journey, you'll find that team, that office, that environment that you love and it'll be the best stepping point in your career. Where I'm at now, it's 1000X better than my previous job. Feel free to message me anytime! You got this!!"}, {"comment_author": "Ok-Cap3172", "comment_text": "Im definitely projecting; but there's some sort of built in survival system of self sabotage.  Some trauma that regulates how long or how well you can do something before you can't deal with it. Gotta fix that or st least understand that before succeeding at anything.  Just a thought."}, {"comment_author": "paris38118", "comment_text": "Can you elaborate on this? I’m 29f who was doing ok in life until recently…decided to leave my nursing job after 6 years in pursuit of a new career. Been in healthcare direct patient care 11 years total and was just mentally drained. Now I’m barely surviving and desperately seeking direction. Idk if I’m headed for something better and just need to get thru this rough spot or if im crazy and self sabotaging and just need to go back to nursing and settle for that…just feel like there’s more out there for me but it’s hard going from a nurse salary to literally nothing…been having a hard time finding just basic jobs because they don’t understand why I’m wanting out of nursing and I’m “overqualified” and can’t find a nursing job because I’m assuming I’m too “cultured” for the area I’m in now (I just moved from Memphis to AZ). Idk what to do and I don’t wanna give up on myself but I feel like I’m crazy."}, {"comment_author": "pleasemilkmeFTL", "comment_text": "Have you considered being in the field but not in the hospital? I push esthetics nursing to so many ppl because there is so much potential, there's travel nursing (I know someone who works hard for 3 months at a time and then takes a few months off), there are cruise ship nurses, or teaching. Nursing income is hard to lose but transitioning can help. Also, if they ask just say its been taking a toll on your body and then they'll understand"}, {"comment_author": "Ok_Economics_4307", "comment_text": "I would agree with some about your attitude being an issue.  \n\nWe don't have a lot of info as far as why you are getting fired.....\n\nWhat details can you give as to how you got fired?  Can you give input as to how your attitude got you fired?"}, {"comment_author": "Ok_Economics_4307", "comment_text": "Can you give more details as to how you got fired?  How did your attitude get you fired?"}, {"comment_author": "Decipher_Str_0000", "comment_text": "I think if you post this on r/money you’ll get far better advice and what ur looking for"}, {"comment_author": "Usual_Beginningg", "comment_text": "Cool I might have to try that"}, {"comment_author": "isthatayeti", "comment_text": "I think that one of the hard truths out there is that people believe they deserve more and therefore end up disgruntled or disinterested because they feel the job is beneath them. The reality is you deserve only what value you bring. If you are a low value prospect, you will end up in low value positions continuously feeling unhappy or like you’re in the wrong place. \n\nYou need to look at yourself honestly and see what your reality really is. I don’t mean this in a bad way I was in a similar spot a few years ago I touted myself as a sales person and a leader and a manager and I could definitely talk the talk, but the truth is I was barely competent at most of the skill sets. Reading or taking a short course gives you a false sense of skill, to become good at something takes time and consistency and commitment. \n\nWhat do you consider yourself to be good at ?"}, {"comment_author": "spezisadick999", "comment_text": "Have you tried hiring a career psychologist ? I used one back in my mid to late 20’s and it was helpful for me to understand myself better at that time in terms of what type of tasks and roles would suit me better. This may help you understand what jobs you would be able to sustain and also what entrepreneurial direction to go in."}, {"comment_author": "resurcher9000", "comment_text": "I am not 100% sure, but the issue here seems like you're struggling to set boundaries. I had that issue as well and then I was putting so much efforts in wrong direction.\n\nMy current rule of thumb to deal with this is; If you're doing something for money, emotions doesn't matter much and if you're doing something for love/people, money doesn't matter much.\n\nHope this help."}, {"comment_author": "zeroperfectionism", "comment_text": "do you think having your own business would satisfy you?"}, {"comment_author": "Kindly_Climate4567", "comment_text": "Sounds like maybe you have undiagnosed ADHD. Your post reminded me of an article I read about how difficult it is to get diagnosed with it as a woman, and some women in the article had the same problem."}, {"comment_author": "pleasemilkmeFTL", "comment_text": "Yup, I just posted the same thing. Ppl will tell you try harder, buckle down, or just do it but they do not understand what executive dysfunction is and how doing something as simple as making a doctor's appointment can be debilitating. Adhd is real."}, {"comment_author": "ApartmentNegative997", "comment_text": "What are the signs of undiagnosed ADHD?"}, {"comment_author": "UnicornPanties", "comment_text": "a super messy room"}, {"comment_author": "Sea-Promotion5494", "comment_text": "start saving, and keep your head up- act like your dream self- attend some courses on maybe pinterest thru ads"}, {"comment_author": "Usual_Beginningg", "comment_text": "How can I save if I can’t keep a job?"}, {"comment_author": "NecessaryReward100", "comment_text": "No one else will ever be able to answer this except you. You will answer with your actions and feet."}, {"comment_author": "Txalarmguy", "comment_text": "I’m here for the replies but it definitely sounds like you need to fix your attitude and stick to something"}, {"comment_author": "Usual_Beginningg", "comment_text": "I am working on fixing my attitude right now, but as far as sticking to something I’ve tried and I get fired."}, {"comment_author": "Enviro_Jobs_Edu", "comment_text": "Start reading books about how to overcome conflict in the workplace, working with different personalities..or any self help type books about things you think you need to work on. \n\nYour local library/worldcat can offer a lot, but you can also use annas-archive.org for harder to find books"}, {"comment_author": "Suburbanturnip", "comment_text": "Have you looked into an ADHD diagnosis yet?"}, {"comment_author": "Txalarmguy", "comment_text": "Why have you been fired? That would be helpful info"}, {"comment_author": "Usual_Beginningg", "comment_text": "Most of the time they say “I’m not a good fit” I can seem standoffish but I’m not. Also, I smile and try to be friendly with people but that’s not enough to keep me. I’ve been told I lack confidence."}, {"comment_author": "cleverkid", "comment_text": "Oof. that's bad. Being continually fired for \"not being a good fit\" means you are not able to fit in with the team and collaborate. It means, you're not catching on fast enough and that it seems like you don't care. Are you interested in the work you do? Are you lackadaisical about your responsibilities? Can you understand your place in a team and function effectively? A lot of most work is fitting in and being \"work friends\" with your co-workers. If you fail this they will push you out very quickly.   \n\n\nIt's not obvious what you are doing by your posts. But I would recommend you figure it out. If you can't be an effective member of a team, trying to start your own thing and LEAD a team is going to be a horrific disaster. I promise you. Figure out what it is you're doing wrong and work on that like it's your job, ... because figuring that out is."}, {"comment_author": "Brando_132", "comment_text": "Here's my 2 cents:\n\n1. It's great you are finishing college but a bachelor's in business is not going to get you where you want to go.\n\n2. Instead of looking for your next job take a step back and think about the industry and or roll that a. You are good at and what would make you the most happy.\n\n3. The key to success in anything is consistency and longevity. You have to find something you like and stick with it. If you love the job or employer that should want to make you want to put in effort. If you are not enthusiastic about it  will show.\n\n4. Work your ass off and stop making excuses to fail."}, {"comment_author": "Moosedadafur", "comment_text": "Nobody ever told us we had to stay at the same job for 25 years this is only one life that we live that we know of might as well enjoy it while we have it there's a whole world out there see as much as you can while you're here"}, {"comment_author": "Ok_Boat772", "comment_text": "From someone coming from the relatively same experience. If you keep getting fired or you quit that's your attitude to work your work ethnic. Ask yourself the question am I disciplined in areas of myself? Do I understand doing things I don't want to do gets me to where I want to be?"}, {"comment_author": "Short-Feedback7849", "comment_text": "Which 2013 car"}, {"comment_author": "ContributionSuch2655", "comment_text": "The real question"}, {"comment_author": "ConstructionThick205", "comment_text": "what fields are you working these jobs in? how has your experience been with your work-colleagues? when you say you are not confident or you are a slow learner, did you actually ever have a proper mentor or just supervisors in your jobs?"}, {"comment_author": "Extension-Life1000", "comment_text": "Sounds like you need to find what you're truly passionate about, as well as learning how to best work with managers and colleagues to provide the most value with the least amount of effort.\n\nWhen you find what you're passionate about, don't be afraid of it, learn it and become a leader in that field, as long as that passion is valuable or you believe in it wholeheartedly  and you can see a path to get there, find the first step you need to take to start that journey, then deal with the problems that come along with it and keep moving forward.\n\nRememeber when you're making these goals to give time for your life admin and relationships. \n\nSome people like to write their passions and their thoughts down as a reminder to how you felt in this moment.\n\nIn regards to working with people, getting along with people is the new leadership. its something that everyone has to work on to some degree."}, {"comment_author": "Invoiced2020", "comment_text": "Be likeable. Idk how it can work for you because it seems like you're not that personable but beinv likeable is half the battle. Read some books about it maybe HOW TO WIN FRIENDS AND INFLUENCE OTHER PEOPLE to start. \n\nAlso being stingy is a bad vibe. I've met stingy people and none of them is successful. There's a difference between stingy and frugal. Frugal people are just good in administrating their money and they see the value of things other than money. The problem with stingy people is they only see monetary value. Not the convenience, not the opportunity cost, not the value of the relationship. Not the long term value of good will. It's hard to learn I think because people really do grow up with different money attachments.\nThere's also a saying - you need to spend money to make money.\n\nGood luck with it all. Surround yourself with good and successful people whether its real people or books or podcasts."}, {"comment_author": "My_Little_Lily", "comment_text": "Maybe try this trick: next time when you succeeded applying for a job, go out and buy a few ballpoint pens (the simple one that you can see the core inside). Buy as many as you like, 10, 20, a box or two,... These pens act like a deal you make toward your company, as long as you have them you're not allowed to quit until the last pen runs out of ink, no matter the circumstances."}, {"comment_author": "Even-Fact1111", "comment_text": "I recommend <The Monk and The Riddle> by Randy Komisar. It helped me a lot when I was also struggling with the career path I'm taking. It gives you lots of insight!"}, {"comment_author": "ApartmentNegative997", "comment_text": "Nice recommendation! The book essentially explains why you have to be connected to your work rather than just pursuing money. I’d also recommend mastery by Robert Greene. What career path did you take if you don’t mind me asking?"}, {"comment_author": "sidehustle2025", "comment_text": ">My attitude might be an issue as well but so many people get away with such behaviors make it make sense.\n\nThis right here probably explains the problem. It sounds like you see other employees behaving badly so you do as well. The way to stand out is to be the best employee you can be. It will get noticed.\n\nIf you can't keep a job, you have pretty much no chance of running a successful business.\n\nMaybe you need a therapist or a coach to figure out why you seem to be self-sabotaging yourself.\n\nApart from the above, I'd suggest getting a joba nd sticking with it even if it's not perfect. You need to build some discipline. Life gets tough sometimes. If you always quit at those times, you'll never succeed. When tough times xome, just suck it up. Think long-term not short-term."}, {"comment_author": "ApartmentNegative997", "comment_text": "“If you’re not a good employee you won’t make a good entrepreneur”. Isn’t that why most people become business owners? Because they can’t handle someone else being in charge of their destiny? My uncle hated working until he became an entrepreneur and now he’s a retired multimillionaire."}, {"comment_author": "UnicornPanties", "comment_text": "> sounds like you see other employees behaving badly so you do as well. The way to stand out is to be the best \n\nthis part"}, {"comment_author": "sidehustle2025", "comment_text": "It's not about someone being in charge. It's about you putting in your best effort and not making excuses to slack off and not care.\n\nI'm also not talking about not liking to work as an employee. There are jobs I didn't like but I still did a good job because that's the standard I hold myself to. If you get in the habit of not doing a job properly because you don't like it, it will spill over into your business life.\n\nIt's a state of mind. Just do good work."}, {"comment_author": "pleasemilkmeFTL", "comment_text": "Have you been evaluated for any neurodivergent conditions? Not a doc but from what I read, definitely showing signs of adhd. Reason why I'd recommend getting tested because 1) you'll know why you are the way that you are 2) once you know you'll be able to work according to your strengths. My favorite quote since learning I have adhd is \"I know I'm not a dilapidated horse but a zebra\". \n\nI became an entrepreneur almost 6 years ago and it's the only job I have enjoyed. In previous jobs I would get bored after 2 years. I'd be great at it but once I reached the highest because I enjoy challenges, I struggled with boredom so I would quit. Now no 2 days are the same. I only work 4 days a week and I can take off when I'm done with my clients, I take vacations as needed (or as much as I can afford lol) and I don't have to do anything I no longer want to do (that's a big one for ppl with adhd). Now I'm transitioning my role to more behind the scenes which is a new and exciting challenge as well so I know this will keep me excited for at least another few years. \n\nYou are someone special, just need to figure out what works for you."}, {"comment_author": "digitaldisgust", "comment_text": "Get fired or quit? Seems like you're just a garbage difficult employee who refuses to improve or do the work lol"}, {"comment_author": "Illustrious-Bug-3781", "comment_text": "What exactly would you do if you had money,  you said you'd start a business. What? If you already know, then you're doing better than most people."}, {"comment_author": "UnicornPanties", "comment_text": "> My attitude might be an issue as well but so many people get away with such behaviors make it make sense. \n\nUm, excuse me? What exactly are you doing? This sentence alone makes me not want to help you.\n\nWhat makes you think you can start a business and stick with it if you can't even keep a job or finish your education?"}, {"comment_author": "Usual_Beginningg", "comment_text": "So you’re saying I should become a sex worker? Oh lord"}, {"comment_author": "Sea-Promotion5494", "comment_text": "uh."}, {"comment_author": "AliceEverdeenVO", "comment_text": "I help lead a 5 hour virtual presentation about general job skills and how to kill it in the workforce. Let me know if this would be if interest to you and I can ask if you'd be and to attend."}, {"comment_author": "UnicornPanties", "comment_text": "> 5 hour\n\nFIVE HOURS!?!?!?"}, {"comment_author": "JCE_6", "comment_text": "Go into the oldest business known to man kind. You know what I’m talking about"}]}, {"post_title": "I'm 19 and I want to start a business doing 3D design ", "post_url": "https://www.reddit.com/r/Entrepreneur/comments/1byoxd0/im_19_and_i_want_to_start_a_business_doing_3d/", "post_main_text": "Back in 2019 I started a fiverr where I would make 3D models and then I learned I had a passion for it. I was learning 3D animation, vfx, game development etc. I know there's money in this field but I'm struggling to get my footing, I don't want fiverr commissions to be all. ", "post_comments": [{"comment_author": "real_serviceloom", "comment_text": "My businesses need 3d designs etc all the time. DM me your portfolio and I'll pay you much higher rates than fiverr if you are really good."}, {"comment_author": "FrozenKyrie", "comment_text": "What kind of business?"}, {"comment_author": "altbhuyam", "comment_text": "I too need 3D models on a regular basis, DM with your portfolio.\n\nI mainly need photorealistic Room interiors"}, {"comment_author": "FrozenKyrie", "comment_text": "I've never done photorealism"}, {"comment_author": "Azrael1981", "comment_text": "start making an amazing portfolio to showcase your talent, take your time and display the best of your work."}, {"comment_author": "FrozenKyrie", "comment_text": "I think this is what to I need, something actually organized"}, {"comment_author": "iamgettingbuckets", "comment_text": "You got a reel or case studies ?"}, {"comment_author": "FrozenKyrie", "comment_text": "I don't know what that is"}, {"comment_author": "Sm00th_syllable", "comment_text": "Learn Blender! Trust me you won’t regret it"}, {"comment_author": "Mechatyronics", "comment_text": "Me too"}, {"comment_author": "Grade-Long", "comment_text": "Start a social media channel that shows you designing things, not just the end product and discuss the skills you’re developing along the way"}, {"comment_author": "Sarvaturi", "comment_text": "This is the best time to start and make mistakes. At this stage you're looking for mistakes to make. First you should focus on a niche. What kind of businesses could benefit from your skills? You can make 3D animations for local businesses, for Saas, for Marketplaces, for advertisements, for construction companies. I don't know, find a niche where you can implement your skills. Try to understand who the target audience is, to create an attractive sales message (USP) so that they realize what they can gain from your skills. Example: \"Increase engagement 5x with customized 3D designs\"... Something like that. \n\nVery important: Make a plan. A plan helps you not to do things randomly and to do things logically in order to measure results. This [Smart Planning Tool](https://plani.ai/) will help you. It gives you a highly personalized plan full of tips and strategies that you can adopt."}, {"comment_author": "FrozenKyrie", "comment_text": "Thanks I needed this it will help"}, {"comment_author": "FewWillingness1081", "comment_text": "Linkedin, Reddit and Dribbble are great places to start.\n\nThis guy may not be your competitor, but check out his success: [https://dribbble.com/milkinside](https://dribbble.com/milkinside)\n\nThey charge big bucks.\n\nAlso don't underestimate in-person events!"}, {"comment_author": "FrozenKyrie", "comment_text": "Oh wow thank you those are amazing"}, {"comment_author": "anieanjalijha", "comment_text": "Kindly share your portfolio with me in the inbox"}, {"comment_author": "FrozenKyrie", "comment_text": "I think I've been missing a professional portfolio"}, {"comment_author": "ChadKnightArtist", "comment_text": "I would recommend learning a Unreal Engine, and offering things specific to that. Ai can already do 2D images and videos, the next step in the process will be 3-D models. Best of luck 🙏"}, {"comment_author": "FrozenKyrie", "comment_text": "I do want to learn it but don't I need to learn coding?"}]}, {"post_title": "How can I make an extra $2,000 per month?", "post_url": "https://www.reddit.com/r/Entrepreneur/comments/1byud7c/how_can_i_make_an_extra_2000_per_month/", "post_main_text": "How can I make an extra $2,000 per month?\n\nI'm interested in entrepreneurship because I refuse to live from paycheck to paycheck anymore. I'm still saving up, working full-time and maybe thinking to start something with E-com.\n\nPeople who are making $2,000 extra per month through some kind of \"sidehustle\", what do you do? Be specific and share as much detail as possible while answering what helped to get you there.\n\nTell me!\n\nThanks in advance.\n\n&#x200B;\n\n&#x200B;", "post_comments": [{"comment_author": "Intrepid_Defiant", "comment_text": "What kind of side hustle have you tried already?"}]}, {"post_title": "Millionaires of Reddit who are Self-Made?", "post_url": "https://www.reddit.com/r/Entrepreneur/comments/1by64h4/millionaires_of_reddit_who_are_selfmade/", "post_main_text": "-you do not come from high class\n-low/middle class upbringing \n-rose from poverty \n\nHow did you become “Self-Made” and how does it feel?\n\nWhat advice would give to your teen age years? ", "post_comments": [{"comment_author": "HelloBello30", "comment_text": "How I did it is a really long story and some of it is not possible to replicate. Sometimes, the details aren't relevant because they can be discouraging. \"ah, you did this thing, which is not possible to me, therefore I am out of luck\". I do not want to convey that sort of sentiment, so I will give some general principles. It can take 10 - 15 years and it's not easy.\n\n1. First, you shouldn't necessarily jump straight into the mentality of becoming rich. It's possible to go straight from poor to rich, but it's far more rare than becoming poor to middle class to rich. Your goal should be financial stability.\n2. Pursue financial stability at all costs. Basically, you need a career that can pay your basic bills, rent, and doesn't eat all your hours. This may involve a trade or a formal education. This isn't glamorous. It shouldn't be something that will consume your life.  There are a lot of such paths.\n3. Invest (even go into debt) in a method to get more disposable income. I converted my basement to a basement apartment. Someone paid me rent and this didn't take more time. Invest any new disposable income into a business. This can be some side hustle that you can do that doesn't consume you.\n4. Now you have a sufficient amount of disposable income to start poking around in online ventures while you continue to work. I say online because online stuff is easier to manage while you simultaneously have  'normal career\". I understand this is extremely broad.\n5. Keep at your online hustles for a long time. It should be big enough for it to safely replace your career before you consider quitting your career. You will be working 2 full time 'jobs' for years and this is exhausting.\n6. Your business has demonstrated growth. Continue growing it. Take all of the profit and re-invest in your business or into a variety of standard investments (real estate, stocks, whatever). Mix it up. Your investments should be high risk, high reward (but calculated, nothing that like gambling). You are doing this with extra profits and therefore this shouldn't break you. You still can't afford luxury. Is there some luck involved at this stage? yes, but that's why you are continuing to invest in different high reward avenues. There is constant research here. Constant networking. Constant exploration of opportunities.\n7. After a few years of #6, you will be a millionaire. High risk stuff doesn't mean low chance. Some of it will work. This seems like a large broad jump, but really, with a career and business for that long, you were only a few 100k off from being a \"millionaire\" anyway. Not that big a leap. At this point, you still aren't done. Start converting your investments to more stable (medium and low risk) investments. Pay off debts like mortgages. Ensure that all of your needs are met passively and you do not need your business to pay for any of your essentials. In other words, 100% of your business profit should be available for more business. You shouldn't need any of it for your car, food, bills, etc.\n8. Snowball. Invest your business profit. Delegate your responsibilities and build more businesses."}, {"comment_author": "TechnoFart42", "comment_text": "I would find it very depressing to find someone that tells themselves that they cant do this, but thank you for putting it in a step by step perspective, because my mind is a big jumble and will try to start at 3 put a little into 6 then go back to thinking about 2 😂"}, {"comment_author": "No_Match8210", "comment_text": "Great advice, thank you."}, {"comment_author": "Even-Fact1111", "comment_text": "Great insight."}, {"comment_author": "Aware_Ad_618", "comment_text": "What a fucking cop out \n\nYou probably come from old money hence the forewarning at the too"}, {"comment_author": "HelloBello30", "comment_text": "why are you so miserable and resentful? \n\nNo, my parents have absolutely nothing to their names. Nothing. They never did. It was insanely difficult for me."}, {"comment_author": "USBCp", "comment_text": "Add resilience to your list."}, {"comment_author": "satish_gaire", "comment_text": "I didn't come from poverty, however.   We were not \"ultra rich\".        I started off my early days when i was 16/17 as affiliate marketer on ClickBank.    \n\n\nBeing able to just spend money without really thinking on whatever i want is a blessing.\n\nCurrently,  I own several SaaS products, High traffic blogs, I have newsletter of over 6M+ subs all combined ,several membership platforms, and  run an agency focusing on CRO/Copy/PPC.    \n\n\nI own multiple homes/commercial but to me, who has tasted how fast i can make money online, it seems \"ehhh\".     I do trade options. \n\n**Advice for teenagers ( and adults ):**  \n\n\n* Software/Digital is where you can make $ fast without much overhead.\n* Learn to interact with people in real life:  Learn to talk to strangers well.\n* Read as much technical /money books as you can.    \n   Ex,  Richest Man in Babylon\n* Do more in your initial days because you don't know what you want to do unless you have explored many things.\n* Use social media to craft your skills,  not fight with strangers, scroll etc.\n\n&#x200B;\n\nIf anyone has specific question, feel free to ask."}, {"comment_author": "leoschen", "comment_text": "More book recommendations?"}, {"comment_author": "Chyinmo", "comment_text": "Yes please I have questions \nI see people all the time saying do digital products it easier business \nBut for me it's hard bc I have no knowledge of software and digital stuff I studied international trade \nI see myself more having like an online store this something I feel I might be good with \nMy question is what do you think about my way of thinking is it right ? Or am I limiting myself??"}, {"comment_author": "Next-Cartographer690", "comment_text": "by software/digital what do you mean by that what can i do online to make money i keep hearing it every where but no one explains what they actually did."}, {"comment_author": "_UX100_", "comment_text": "My question is how do i manage the office for 9 hours and my side business. Office will help me pay my rent and stuff while my business grows but it's getting really difficult to manage both"}, {"comment_author": "laxika", "comment_text": "Let me tell you, getting rich from software is not much easier than from anything else. It is just easier to scale once you hit a certain size, but by then you are a millionare anyways. Out of a 100 software products 99 fails and doing sw is super expensive (hard to get good staff)."}, {"comment_author": "Dalmarite", "comment_text": "Seek the hard challenges. Intentionally put your self thru the hard things in your early life. Teaches you how you’ll react to adversity and stress."}, {"comment_author": "DivBro22", "comment_text": "Exactly, success is never a given and it takes grit, common sense and financial education."}, {"comment_author": "bluedogmilano", "comment_text": "This. I keep telling my children: if you are able to do difficult things, your life will be easy"}, {"comment_author": "Even-Fact1111", "comment_text": "This is great. I think it's important to acknowledge that life is itself a struggle. It gives a great relief which sounds ironic."}, {"comment_author": "MoAsad1", "comment_text": "Are you self made millionaire? What are you doing?"}, {"comment_author": "sk8xnick", "comment_text": "How you fought anxiety to do stuff?   \nHow did you overcome your brain to be indifferent and relentless?"}, {"comment_author": "Karyo_Ten", "comment_text": "Instructions unclear: I'm 40 and still cleaning sewers."}, {"comment_author": "Dalmarite", "comment_text": "Yes, came from lower middle class family. Parents went bankrupt. My wife and I were on food stamps with our first child.\n\nNow we have a multitude of million dollar business along with a large real estate portfolio."}, {"comment_author": "Dalmarite", "comment_text": "Honestly, you just do it.\n\nThere’s no secret.\n\nJust gotta say fuck it and do the work and deal with it. \n\n\nOvertime you begin to realize that it’s just part of the process and you learn to actually enjoy it.\n\nIt’s like working out….if you do it right; being sore is part of it. You hate it at first. Then you release just to accept it as part of the processes. It’s the price you have to pay. \n\nAlso I would say that learning that shit is not as bad as you think is a big part as well. \n\nI was broke and on food stamps before….so failing at a business is not the worse thing that will or has happen to me….so don’t worry about it. \n\nOvertime you develop and indomitable spirit.\n\n\nI also take ice cold showers and do other activities daily that intentionally put me in negative situations that I have to control. I recommend things like this to people"}, {"comment_author": "redladyshalott", "comment_text": "What line are your businesses in?"}, {"comment_author": "hdzdp12", "comment_text": "Ok I want to know about the LMS for martial arts.\n\n\nHow did you get into this and how does it work?\n\n\nI'm an instructional designer and use LMS all the time but I've never thought about catering it to business niches."}, {"comment_author": "Dalmarite", "comment_text": "Started in restaurants and bars. Flipped and sold about 15 of them. \n\nPurchased a small new car dealership in a small town; ended up growing it to a top 25 Revenue dealership in the nation; sold off in 2021.\n\nCreated 2 tech products in the auto industry that we had successful exits.\n\nHad over 10 collision centers and detail centers that we just sold.\n\n\nCurrently  we have:\n\n-technology and ad agency in the auto space \n\n- we build and staff hospitals, imaging centers, and ambulatory surgical centers. \n\n- Learning Management Systems for martial arts \n\n- We also continue to grow our real estate portfolio (over 300 units right now with the goal of over 1,000 by EOY)"}, {"comment_author": "Dalmarite", "comment_text": "My CTO has black belts in a couple  of disciplines. He approached me with the idea of franchising dojos with another person who owns 2. \n\nFrankly I didn’t like the cash flow model and it was not enough profit for the investment time. \n\nWe had been toying with the idea of content delivery systems for different business niches ( we had a failed one in healthcare and then a successful one in healthcare paired with teledoc services for mental health). So I thought this might be a good one try it with.\n\nWe failed initially as we targeted dojo students and beginners around the world. The market was large, but it’s a poor market and the price points weren’t worth the content delivery.\n\nWe pivoted to targeted dojo owners instead. They are a unique demographic in that they have a very focused skill set and that usually translated into bad business skills.\n\nSo we developed LMS systems to deliver business advice,  marketing, sales, etc for dojo owners. Was a hit. And we expanded into multiple countries. It’s not a huge money maker; pulls about $250k month revenue; but has a 72% profit margin. So it cash flows like a beast."}, {"comment_author": "JustInfactsGr", "comment_text": "Not ironic but honest confusion.  \nHow do you go from food stamps to start flipping restaurants? (Unless it was like 20 years of savings or something)  \nI Have a more than decent paying Job My wife has a more than average uk wage paying job we save 45% of our income for the last three years and am nowhere near participating in some decent investment let alone getiing into restaurants! I would love to exchange stories and share how you got there!"}, {"comment_author": "fasurf", "comment_text": "So you’re a multimillionaire… who doesn’t sleep lol congrats on the hard work and taking risk. Couldn’t agree more. The more I take risk the more I realize things aren’t that risky. It’s our own fear than makes us think there is more risk than there is."}, {"comment_author": "Coors_Light_Dad", "comment_text": "Good lord man! Are you hiring?"}, {"comment_author": "redladyshalott", "comment_text": "Bloody hell. That’s brilliant!! 👌🏻"}, {"comment_author": "Dalmarite", "comment_text": "Wife and I got prego during college. Weee in food stamps for over a year as we couldn’t support Pursel’s and college $$$ even with me working 2 jobs and her.\n\nAfter college, I got a job opening 3 restaurants for a group in Texas. Made decent money (this was back in 2006-7) saved a lot and then the deal I thought I had wasn’t worth anything (learned a valuable lesson there about the importance of legal paperwork in deals)\n\nLeft the group and I made a promise that I would never work for anyone again.\n\nFound a restaurant/bar that needed help. Owner was absence. So I bought it with by basically pouring every dime I had and taking over some notes from the the previous owned. \n\nWent 6 months only taking $1,000 month. Pretty much puked a few times a week due to the stress. Was able to turn the place around and started making a lot of money. Flipped it after 6 months and bought a couple of more the same way. And I just kept doing that for a few years"}, {"comment_author": "FukinSpiders", "comment_text": "And for just $149, he can share his secrets with you"}, {"comment_author": "uber_neutrino", "comment_text": "> Left the group and I made a promise that I would never work for anyone again.\n\nI want to highlight this because I think it's an important point.  One you let go of the idea of working for others it clarifies a lot of things."}, {"comment_author": "Ohhhnothing", "comment_text": "The key is exiting after you have built the value. \n\nEach of your ventures has this pattern. I think a lot of people get emotionally attached to their turnaround project and are possibly also too tired or unwilling to start something new.\n\nKudos for having the work ethic, vision and fortitude to ladder up and build those businesses."}, {"comment_author": "Kdowden", "comment_text": "How were you able to turn it around?"}, {"comment_author": "leoschen", "comment_text": "Can you share how you were able to find buyers and exit? How long did that take, and were there any challenges you encountered through the process?"}, {"comment_author": "Dalmarite", "comment_text": "We don’t do that.\n\nGood try though. \n\nPlus, anyone with half a brain will realize that 99% of the knowledge is available for free online.\n\nKnowledge isn’t what is important. Constantly doing the simple things right will get you way farther than anything else."}, {"comment_author": "Dalmarite", "comment_text": "Most people aren’t prepared for the risk vs reward side of things. They been told what to do all of their lives. So many many people cannot handle the initial stress of being the decision maker, Calvary, and everything… buck stops with you. Freedom does have a cost.\n\nBut have so done this for 20 years (was definitely nowhere near overnight) and meeting hundreds of people that have done things similar to me I have come to a biased conclusion that there’s no such things as winners and losers; just winners and quitters"}, {"comment_author": "Dalmarite", "comment_text": "Yep. Pretty simple on paper strategically. Tactically the execution is what gets people; the boring work is where the results are.\n\nFrom a high level \n\nSolve a problem\n\nCreate demand from the solution\n\nMonetize the solution\n\nExit when the current cash flow is lower than the discounted cash flows\n\nEvery niche is different.\n\nBars for instance usually have a 36-48 month self life after rebranding. We usually kept them between 6 months - 1 year when they had maximum cash flow growth. This made them attractive to buyers. \n\nEvery industry is different. Just gotta study them."}, {"comment_author": "Dalmarite", "comment_text": "Fired all of the staff\n\nStaffed with nothing but women bartenders and servers\n\nRebranded \n\nWent to every college and sorority within an hour and gave each president and social chair a free $100 tab weekly. \n\nOffered to host fraternity and sorority parties for a fraction of the cost they could get other places (we broke even and even lost a little money on these)\n\nHad 1 ladies drink free and 1 sorority drink free nights weekly.\n\nPretty much went with the philosophy of get women to want to come to the bar, men will come to be with the women and they will be the big spenders."}, {"comment_author": "Dalmarite", "comment_text": "Business brokers and word of mouth. Once you start doing things in certain areas you will be know for it. Building your reputation is key. \n\nUsually would take 1-2 months to find a buyer, vet, and close.\n\nThere’s always challenges. Every single deal faces challenges. It’s normal and not the end of the world to have hiccups. It’s part of the process, don’t get emotional about it."}, {"comment_author": "djduni", "comment_text": "•What do you define as “the simple things”? \n\n•Girlfriend is a follower of ‘trends’, watches a lot Tiktok, doesn’t take risks. She says she wants to though. She’s seen me build and sell one business for low 6 figures. Thought that would do it. What book or advice do you recommend for someone with the entrepreneurial spirit who wants to ignite that same passion in their spouse/partner? \n\nThank you for your answers by the way."}, {"comment_author": "spilledmind", "comment_text": "“Winners and quitters” thank you for that"}, {"comment_author": "redladyshalott", "comment_text": "Thank you for sharing. It’s really interesting to hear about the different paths people go down to reach their goals 👊🏻"}, {"comment_author": "uber_neutrino", "comment_text": ">Most people aren’t prepared for the risk vs reward side of things.\n\nThis is true.  It's also kind of funny though because if you ain't got nothing you ain't got nothin to lose.\n\n>But have so done this for 20 years (was definitely nowhere near overnight) and meeting hundreds of people that have done things similar to me I have come to a biased conclusion that there’s no such things as winners and losers; just winners and quitters\n\nYup.  I have taken it on the chin MANY times.  You win some, you lose some.  But each one is just a part of a much larger game."}, {"comment_author": "redladyshalott", "comment_text": "Great thinking 👌🏻"}, {"comment_author": "PuttPutt7", "comment_text": "Hey thanks for sharing!\n\nYou said you did this 15 times flipping businesses right?\n\nDid you follow this general strategy for each of those? Or did each one need a unique process/ideas to get it into profitability? \n\nYou have any tips on finding/buying a business. i.e. what to look for, how to spot a deal, ect."}, {"comment_author": "spilledmind", "comment_text": "Genius. Pretty sure this was Mark Cubans first business, a college bar. Although, he got in trouble a few times for underage drinkers (I believe this was on purpose but I could be wrong)."}, {"comment_author": "Dalmarite", "comment_text": "Simple things I would define as the boring parts of business. \n\nMost people try to do new and fancy things.\n\nHowever the best businesses in the world generally do 1-2 things extremely well consistently. \n\nPeople forget the end consumer and their experience… nail that and you will win over time.\n\nFor instance our end consumer in the bars was young males with disposal income. So we created an environment that would attract them. How did we do that? Gave young males what they wanted…. A place full of females. How did we attract the females? We created a safe fun place for women. This includes lighting choices, clean bathrooms, staff that was females, date rape drug detection glasses, coasters etc, security staff that walks females to their vehicle when they leave.\n\nWe just created a place women wanted to go and then our end client would follow due to how societal interactions happen.\n\n\nFor your girlfriend; I’ll be honest,you can make someone want to be an entrepreneur. The entire risk vs reward framework seems to be innate trait in some people and thier tolerance levels are extremely high. \n\nFor someone wants to but just can’t…. Then baby steps. Set up small milestones that have increased risk and reward over time. Think of this as going to the weight room. You don’t start off benching 300 or trying to make someone puke their first visit. They be too sore and they will not enjoy the process. Gradually present her with ever increasing challenges and as she goes thru the process she will gain the confidence she’s needs."}, {"comment_author": "Dalmarite", "comment_text": "We pretty much keep to a standard strategy as it reduces risks and we have operational efficiencies. \n\nEveryone of my failures has been when I exceeded my circle of competence and stretched.\n\nSo we became really disciplined in our endeavors.\n\nFor instance with the bars and restaurants we always looked for low performing businesses where we could bring high value ads via rebranding. We could pick these up under market value. We would rebrand, increase cash flow and then sale immediately when we hit maximum cash flow velocity and the current cash flow was lower than the discounted cash flow of on 4 years (generally the shelf life of these businesses)\n\nIn later years we bought the real estate and when we flipped it, we would keep the real estate and lock new owner in in a 10 year lease."}, {"comment_author": "GladAd7127", "comment_text": "I like the concept of safe space for women. Nice!"}, {"comment_author": "PNW_Uncle_Iroh", "comment_text": "Get an education and learn sales skills."}, {"comment_author": "MoAsad1", "comment_text": "Tell us more about your background and what you did ?"}, {"comment_author": "lesserofthetwo", "comment_text": "I tell all my secrets in a course I wrote for on 99.99."}, {"comment_author": "azoz158", "comment_text": "Following"}, {"comment_author": "MoAsad1", "comment_text": "Hahaha good one… seriously though selling courses does it make you money?"}, {"comment_author": "Key-Demand-2569", "comment_text": "Of course it can. \n\nBut it’s a slightly better odds version of being an author or musician. \n\nLoads of people put out original books and short stories and poetry every year, loads of musicians put out high high quality music every year.\n\nBut most of them (by far) never make a living off of it. \n\nEven in a pure meritocracy people only have so much time, attention, and money."}, {"comment_author": "One_Truth8026", "comment_text": "The Baulig Brothers in Germany basically make 8m a year with that."}, {"comment_author": "Muffin_Most", "comment_text": "I love how Arnold Schwarzenegger always emphasizes he’s not a self-made man. His life is the ultimate example of living the American Dream and he acknowledges many people have helped him on his path.\n\nSteve Jobs once wrote an email to himself with these lines, among others:\n\n“I speak a language did not invent or refine\n\nI did not discover the mathematics I use.\n\nI am moved by music I did not create myself.\n\nI did not invent the transistor, the microprocessor, object oriented programming, or most of the technology I work with.”\n\nThe most successful people are humble enough to admit they’re not self made but standing on the shoulders of giants as well as ordinary people.\n\nGive and take is the short answer."}, {"comment_author": "MoAsad1", "comment_text": "Absolutely, ive realised people with real money are humble however people who get rich with scamming or drugs or dodgy they are massive a holes and showoffs"}, {"comment_author": "BillW87", "comment_text": "This right here. Nobody's truly self-made, and most successful people can rattle off at least a dozen people who played a pivotal role in their success. It might be family members, teachers, mentors, investors who made a leap of faith with them, first customers, whatever...nobody is truly an island and especially not people who have risen up to success. Acknowledging the help that you've gotten along the way doesn't diminish accomplishment, and if anything makes it much more authentic."}, {"comment_author": "OneObtuseOpossum", "comment_text": "The best advice I'd give a teenager is don't to to college just because it's what all your friends are doing, what your parents/society want you to do, or if you don't have something specific you want to study. \n\nIt's the biggest waste of time and money if all you plan on doing is partying for 4 years and coming out 6 figures in debt with a degree you never plan on using or at best that will earn you $50k/year. \n\nAside from a few professions, you can teach yourself almost anything these days. \n\nI'll give one example out of an innumerable amount of options that a teenager can start while still in HS.\n\nTeach yourself multiple programming languages, web development, graphic design, how to build phone apps, whatever interests you. \n\nBecome competent and start freelancing on sites like UpWork.com (start off cheap to build your experience and clientele).\n\nAlong with client work, think of some ideas for your own projects. Work on those in your free time. For every 10 ideas, 9 will probably be shit, but 1 may make you some money. Maybe 1 out of 100 could become something profoundly successful if you get the right idea and execute on it. \n\nAfter several years you'll have an extensive amount of experience, higher paying clients, some money saved away that you can start investing in other projects, possibly a few cool apps or games or software you developed that's generating revenue and that can be sold off for a nice exit...and most importantly, you'll have more money and less debt than all of your peers from HS along with all the adults who thought you'd \"be a loser with no job/money if you don't go to college.\"\n\nOh and also...do something physically active every day. Lift weights, learn how to fight (mma, bjj, boxing, wrestling, all of it), eat healthy, and take care of your body physically as well as mentally. The 2 work synergistically with each other."}, {"comment_author": "skyfeatherstudios", "comment_text": "Find pain, sell hope\n\nNobody cares about the technical aspects, only the outcome of what you do"}, {"comment_author": "MonotonousBeing", "comment_text": ">Find pain, sell hope\n\nStart a cult, become Kenneth Copeland"}, {"comment_author": "Tuplad", "comment_text": "Not a millionaire, but seen some self made men. There's no secret, you just have \"luck\" with some business endeavor and it explodes. Shit just clicks. Yes, they work hard and blablabla, but I've stopped focusing on doing what they do, because they themselves don't know. For one successful project, they have a lot of unsuccessful ones, and nobody is always successful."}, {"comment_author": "mrfansome", "comment_text": "I agree but also disagree. Sometimes the person just has a knack for detail, does loads of research, and knows the market more than others (usually based on their background).\n\nTheir background & “knowing the market” better than others could theoretically be luck though. It could be luck that you stumble across something that needs improvement, but not luck that you decided to improve. Luck that you were born into this time/place, but not luck that you decided to take action.\n\nSome people just are always successful, or at least 90% of the time. They choose & know not to be unsuccessful, based on their knowledge."}, {"comment_author": "LardLad00", "comment_text": "While luck is absolutely a component, it's just one. There are loads of examples of wantrepreneurs who try something new every other day and always fail.\n\n\nYou have to have a knack for identifying where value can be created and how to find and communicate that value to customers. Then you have to scale. It takes a lot of work and that work has to be applied in the right place for that luck to turn it to something."}, {"comment_author": "mdivan", "comment_text": "Luck is when opportunity meets skill"}, {"comment_author": "BatElectrical4711", "comment_text": "Not a surprise - a non millionaire attributing success to luck.\n\nHow hard have you tried? For how long? Did you change and grow from failures? Did you try again? And again? Did you focus on growth and personal development? Did you put in 100 hours a week for as long as it took? \n\nOf course not - you likely took a half hearted swing at something, found out it was hard, quit and then said others got lucky. \n\nAbsolute trash point of view."}, {"comment_author": "OnMy4thAccount", "comment_text": "Are you European? I swear a vast majority of the time I see someone say this, they are from mainland Europe."}, {"comment_author": "lanylover", "comment_text": "This"}, {"comment_author": "Likeatr3b", "comment_text": "Luck literally has roots in belief in some ancient false god. \n\nHowever, real life “luck” is simply preparation met with opportunity."}, {"comment_author": "MoAsad1", "comment_text": "So you can be hard worker, but you need luck? What if you don't have luck?"}, {"comment_author": "uber_neutrino", "comment_text": ">There's no secret, you just have \"luck\" with some business endeavor and it explodes. \n\nYeah no.  This kind of thinking is why you aren't the millionaire.  Not trying to be harsh but..."}, {"comment_author": "Summum", "comment_text": "🤣\n\nI got lucky dozen times in a row now I guess, because I made a million dollar a dozen different ways.\n\nReddit socialists have no idea what it takes to be a real entrepreneur and are making excuses why they’re not succesful. \n\nHint : a lot of sacrifices and incomfort most people aren’t willing to go through. A lot of risk taking too."}, {"comment_author": "Available_Ad4135", "comment_text": "If the striker shoots 10 balls on target and finally scores with the last, is he just lucky?"}, {"comment_author": "Tuplad", "comment_text": "Oh yes for sure, their brain is just wired different and they see opportunities, might be more risk tolerant, ask questions that are not standard etc. etc. Let's call them autistic just for this example. Doesn't mean all people with autism will be millionaires. You can do everything right and still not make it.\n\nSome guys yolo'd on Pepe or bitcoin and are now millionaires, you could argue they're selfmade, but they just had luck."}, {"comment_author": "doke-smoper", "comment_text": "You still need the luck of being born into / raised with certain advantages in order to do those things. Not very many people that live in trailer parks start successful businesses, and it's not because they're all idiots (and if they are, it's more because of the specific culture and lack of access to things like higher education, which ought to be free, like in most civilized countries around the world)."}, {"comment_author": "Tuplad", "comment_text": "Yeah, that's kinda what I said 🫡"}, {"comment_author": "Comfortable-Rice-419", "comment_text": "Watch this with an objective mind -\n\nhttps://m.youtube.com/watch?v=3LopI4YeC4I&t=4s&pp=ygURbHVjayBvciBoYXJkIHdvcms%3D"}, {"comment_author": "Tuplad", "comment_text": "I haven't tried at all, I said I'm not one and I just hung out with some.\n\nAll the things you've mentioned still require some luck. Doing something is obviously better than doing nothing, but it doesn't guarantee success. Putting in 100 hours a week for anything is just bat shit insane mumbo jumbo talk from self help books. Nobody does that. \n\nYou could, of course, offer your not-so-trash take, but you're just here to talk shit I guess?"}, {"comment_author": "Tuplad", "comment_text": "I am 😁🫡"}, {"comment_author": "Tuplad", "comment_text": "Right, nobody said you have to do nothing. You have to actually put in the work."}, {"comment_author": "doke-smoper", "comment_text": "Luck is literally random chance. Everyone who is successful says the same thing, it's not luck, it's hard work, etc etc etc. Which, I run a small pool service business so i know it's a lot of work, but you try being born on the other side then tell me luck isn't a factor."}, {"comment_author": "doke-smoper", "comment_text": "Luck is literally random chance. Everyone who is successful says the same thing, it's not luck, it's hard work, etc etc etc. Which, I run a small pool service business so i know it's a lot of work, but you try being born on the other side then tell me luck isn't a factor. I see very lucky mfs every day who have no idea, they think they got it bad when in reality they've had it made in the shade their entire lives."}, {"comment_author": "GrowFreeFood", "comment_text": "You get eaten by someone who does. "}, {"comment_author": "Tuplad", "comment_text": "Tough shit"}, {"comment_author": "cworxnine", "comment_text": "\"The harder you work, the luckier you get\""}, {"comment_author": "One_Truth8026", "comment_text": "There is one thing that 99% of people are not - consistent. And as long as you didn’t grab a hard core niche that consists of a couple thousand of people, you should always be set. \n\nThere are many indicator but being skilled and what you do, being charismatic, having sales skills AND not being afraid to confront people WILL leave you wealthy."}, {"comment_author": "Tuplad", "comment_text": "You sure? Because I can think of other reasons I'm not one."}, {"comment_author": "Tuplad", "comment_text": "How did a striker get involved with millionaires?"}, {"comment_author": "LardLad00", "comment_text": "That's not how Iinterpreted it at all, obviously."}, {"comment_author": "BatElectrical4711", "comment_text": "For starters, I have long considered myself lucky in two ways - the country I was born in, and the time period I was born in. Those are two things I have absolutely benefited from through no action or doing of my own.\n\nBeyond that, luck is a bell curve. Good thing will happen to everyone, bad things will happen to everyone. Some more than others, but generally all the same.\n\nIf OPs question were posed to billionaires, I’d be more inclined to say luck played a slightly bigger factor, because not every company, idea, or product can have the timing and market share to capture billions in sales.\n\nBut millions? Doesn’t require luck at all - Gary Dahl sold millions of dollars worth of pet rocks, one of the most useless products to ever hit the market…. Was that luck, or did he have and implement the sales and marketing skills to raise the capital and make it happen?"}, {"comment_author": "BatElectrical4711", "comment_text": "Ah, so you consider luck to be the factor, and don’t even try because you’re afraid you won’t get lucky? Or you think if luck is going to come your way it just will or won’t so why bother putting in the effort? \n\nI put in 100 hours a week - often. I still do when the occasion rises. \n\nLet me ask you this, could you agree to luck being defined as a result that is a deviation from expectations? \nBuy a scratch off, what’s the expected result? Lose, maybe win your money back, maybe double what you paid…. However we consider the “luck factor” to be quantified by how far from the expected result was hit… Win $1,000 decently lucky… win a million incredibly lucky.”\n\nNow consider - What is the expected result for someone who spends a decade learning business, finances and personal development, and putting in an excessive amount of work and effort into practicing the things they learn?"}, {"comment_author": "Summum", "comment_text": "You’re so full of shit lmao.\n\nEvery really successful people I know had to do massive sacrifices in their private lives. I’m not talking about someone that bought a bit of real estate and got lucky. I’m talking about people with 8 figure+ net worth. \n\nWe all think about the problems we’re trying to solve 24/7. You might not consider this work but it’s actually what creating a business entails.  At one point it scales and you can afford 250-400k yr VPs to have your back, then you’re free. Before that you take off for a bit and everything gets fucked.\n\nI slept in an unfinished basement where I paid $300 a month in rent while my business was making 7 figures a year. I needed to re invest it. We had a down bad year on the 5th year and if I didn’t do this we would have went under. 10 years later that business was bringing 8 figures a year in profits.\n\nThe founder of a business I invested in slept for 4 months in a row, everyday, without any social activities when they opened a new factory. That business grew from $5m to $100m+ in sales within 18 months. \n\nMy brother slept at least once or twice a week at the office for years, we had a shower installed for him. We sold half that company for 9 figures.\n\nEvery big success I know required an insane amount of risks and sacrifices.\n\nYou organize & allocate ressources in a way that allows you to produce an output you can sell to someone willing to pay a higher price than what it costs you to create/produce."}, {"comment_author": "OnMy4thAccount", "comment_text": "I almost think it's fruitless to argue with the people replying to you then lol. You are effectively having a cultural argument. \n\nAmericans tend to attribute to skill what Europeans attribute to luck. Not even saying that one side is right or wrong. Just a cultural observation I've seen come up a thousand times before."}, {"comment_author": "uber_neutrino", "comment_text": "Well it's certainly not going to help if you come at it from this perspective."}, {"comment_author": "Available_Ad4135", "comment_text": "Having the ability to score and taking the shots means that you ‘get lucky’ when the right opportunity to score opens up.\n\nI made my first million by taking the big opportunities when they presented themselves, and always being prepared to maximise their value, through constituent personal development and growth."}, {"comment_author": "Tuplad", "comment_text": "No worries, thanks for your input, it's helpful 🙏"}, {"comment_author": "MooseBag", "comment_text": "You are simply wrong in that assessment. There's [a well known study](https://arxiv.org/abs/1802.07068) exploring this specific idea. It concludes that the largest impact by far on the success of an individual is luck. There's also a popular book on this very topic called *Success and Luck: Good Fortune and the Myth of Meritocracy*, which comes to the same conclusion: hard work, skill, intelligence etc. matters - it just matters a lot less for a successful outcome than you think.\n\n>luck is a bell curve. Good thing will happen to everyone, bad things will happen to everyone. Some more than others, but generally all the same.\n\nThis isn't true. While luck is random, the outcome isn't going to look like a bell curve. Your resilience against the consequences of bad luck is greatly increased just by starting out lucky in life (like being born in a specific country or time period...) because the *relative magnitude* of your good or bad luck matters. The fact is that most people are just a few unfortunate events away from total bankruptcy, but an already lucky person's \"bad break runway\" will simply be longer than the runway of someone less fortunate. The unlucky ones are more likely to fall off without recovering. That's not a bell curve, it's a pareto distribution."}, {"comment_author": "Tuplad", "comment_text": "I don't try because I'm not smart enough and I have no ideas and nothing to add to this world. I want to earn money to be able to be a digital nomad, bang women all across the world and maybe get a dog or something. Working hard is just not something I'm willing to do, I'm willing to work as little as possible to get as much out of it as I can. 2k usd monthly for a few hours or work a week? I'm game.\n\nNow, for luck. I'm not knocking on hard work, you must absolutely work hard and be good at stuff, but the question was how someone becomes a millionaire, like it's some on/off button. There's no secret, there's hard work and a lot of luck involved. Even millionaires can't replicate their success if they started from scratch.\n\nAbout your question: the expected result is that they will know a lot about stuff, not become millionaires, but their chances might improve."}, {"comment_author": "doke-smoper", "comment_text": "Try doing that while working a minimum wage job or two, with no savings, no support, just struggling to survive on your own. Because millions of people live that way. Oh, or did you use your hard work and determination to choose your parents?"}, {"comment_author": "Tuplad", "comment_text": "Makes sense, yeah. But the argument is in good spirits, don't think we'll come to a conclusion here."}, {"comment_author": "bree_dev", "comment_text": "That's an interesting observation.\n\nI can see the appeal of the American ideal of \"if you work hard and smart then good things will happen\", but it does rather carry with it the unfortunate implication that if you're *not* a millionaire then it must ipso facto be due to some fault in your character, intelligence or work ethic."}, {"comment_author": "Tuplad", "comment_text": "Help what?"}, {"comment_author": "BatElectrical4711", "comment_text": "I disagree with the premise of the study.\n\nWhen looking at the actual literature and methods they used to come to conclusions, they’re looking specifically at talent vs financial distribution….. Which is not the right metric to compare."}, {"comment_author": "BatElectrical4711", "comment_text": "Exactly what information are you basing the notion that “millionaires can’t duplicate their success” on? \nBecause the literature, studies and statistics say exactly the opposite.\n\nYou’d admit their odds increase - why? It’s as if you’ll acknowledge that an understanding of business, money, management and market viability play a roll…. But you seem to think luck plays a more significant factor? Precisely what do you base that on?"}, {"comment_author": "BK5617", "comment_text": "I did.  I'm not a millionaire yet, but I will be within the next 3 years."}, {"comment_author": "BatElectrical4711", "comment_text": "I did do that while working minimum wage and struggling to survive - and provide for a family. \nMy father left the family a whopping $3 (and 200k of bad debt with no assets behind it). My mother worked low end retail. I moved out at 18, after racking up a criminal record and having a child.\n\nI beat the odds by putting in a massive amount of work, not allowing myself any excuses, and focusing on learning what was necessary to get myself to the next level. \n\nFor all of my 20’s I did not drink, smoke, party, watch TV, take vacations or spend money on anything other than basic necessities and reinvesting in either my business, my education or personal development. \n\nStop excusing yourself  - if you want it bad enough you’ll sacrifice to get there…. If you’re unwilling to make those sacrifices, then you don’t really want it, and you’d be doing yourself a favor admitting and accepting it."}, {"comment_author": "Tuplad", "comment_text": "Did you even read my original post? I said none of that, stop strawmanning."}, {"comment_author": "Tuplad", "comment_text": "Oh and show the data, I'm curious."}, {"comment_author": "Tuplad", "comment_text": "The story you've described is close is true for a lot of men, including me. Unfortunately, they're not millionaires. I'm not saying the only reason you got where you are is luck, but I am saying that there's more to it than hard work. Sometimes, you need just a bit of being at the right place at the right time."}, {"comment_author": "BatElectrical4711", "comment_text": "You literally said “even millionaires can’t replicate their success if they started from scratch” \n\nAnd you also literally said “their chances might improve”"}, {"comment_author": "BatElectrical4711", "comment_text": "Happy to - will post a link or two shortly \n\nIs that your admission that you’ve never looked at the data and the opinion you’ve formulated is not based on fact?"}, {"comment_author": "BatElectrical4711", "comment_text": "https://www.embroker.com/blog/startup-statistics/\n\nhttps://www.forbes.com/sites/abdoriani/2019/10/24/11-surprising-and-insightful-statistics-about-startups/\n\nTwo extremely quick sources, and these are talking more about start ups than millionaires, but give them a read and you’ll draw some accurate conclusions.\n\nThings like \n\nPreviously successful start up founders are almost twice as likely to succeed in a subsequent venture. \n\nFounders with mentors have a 3.5 x growth rate.\n\nInvalidating an idea and moving on is the most effective method to a successful launch.\n\nIt’s almost as if the data suggests knowledge, experience and execution are the determining factors of success, not luck."}, {"comment_author": "BatElectrical4711", "comment_text": "Two points.\n\nIt’s not just hard work - it’s the right kind of hard work. \nYou say including you - but how much of your work is dedicated to just making a paycheck? How much of it is dedicated to developing the skills to level up? How much of your work is dedicated to investing? \n\nI know plenty of people who have worked extremely hard their entire lives and end up with nothing …. It’s not due to a lack of effort - it’s due to misplaced, and unintentional effort.\n\nSecondly, as I’ve navigated the business world I’ve found “the right place at the right time” is extremely intentional…… Why did I get a call a few years ago about a franchise opportunity in a new industry? Why didn’t you get that call? I am constantly going to networking events and meeting people, telling them what I do, have done, am looking to do etc etc…. Do you? Is it luck that people I’ve gone out of my way to meet and take an interest in think of and call me when something comes across their plate? Of course not - it’s intentional. You’ll hear people say “the harder I work the luckier I get”…. That’s what they’re referring to."}, {"comment_author": "Tuplad", "comment_text": "You're strawmanning from the first reply. Read my original post. I said there's no secret, you need to work hard and have luck."}, {"comment_author": "Tuplad", "comment_text": "That's an admission to nothing, I'm waiting on the data."}, {"comment_author": "Tuplad", "comment_text": "You said stats and literature? You provided 2 posts which we use in SEO, we call it collab link building, that's when a bunch of dudes get together, pay some Indian a few bucks to write a post with a bunch of links pointing to other sites in hopes they'll link back to them.\n\nCan you now show me data where a millionaire starts from scratch and replicates his success and also show me how many tried and how many failed. For each successful startup, how many are failed?\n\nLet's even take those articles at face value. You're an owner of a successful startup, you're more likely to succeed because you already have money, connections, access to investors and business insights. Now drop all that, start from scratch, replicate your success."}, {"comment_author": "Tuplad", "comment_text": "You gotta stop with the \"do you\", I don't. I'm fine with minimal wage and a thick Booty Latina.\n\nEverything you say makes sense, but again, there's luck involved in all of those things. Yes, you have to show up and be smart etc."}, {"comment_author": "BatElectrical4711", "comment_text": "I’m contending the luck aspect - I don’t think it needs to play a factor at all"}, {"comment_author": "BatElectrical4711", "comment_text": "You’re welcome to provide sources of your own to contend with mine…. I know the results the articles posted are in line with previous research I’ve personally done, and the results concluded by venture capital groups I’m a part of which help determine risk management strategies and metrics to look for when investing in start ups…. One of the key metrics to look for is previous success 👍\n\nBut do please provide me with sources of your own that you base your opinion on, I’m happy to be shown how and why I’m wrong on this."}, {"comment_author": "Tuplad", "comment_text": "I disagree, I think it plays a big role. Guess we won't find middleground here."}, {"comment_author": "Tuplad", "comment_text": "I'll say this the fourth time: you're not reading what I'm saying. You claimed you have data and literature and statistics, but now it's just bought guest posts and \"in my research\"."}, {"comment_author": "BatElectrical4711", "comment_text": "Whelp, only one of us has done it - and I don’t see literally any part anywhere where luck played a factor in my life and success…. Same for the hundreds of other business owners I see and talk to on a regular basis"}, {"comment_author": "BatElectrical4711", "comment_text": "You didn’t bother to actually read them though right? \n\nThere’s links to the sources of the data, and the studies done and methodology behind them …. Again all things I’ve looked into previously - forgive me for giving you the benefit of the doubt that you could click a few links.\n\nBut you’re not interested in learning or coming into new information… You’re going to take issue with anything that doesn’t reinforce your preconceived notions, and that’s ok - it fits the personality of someone with your life’s ambitions, or lack there of"}, {"comment_author": "Tuplad", "comment_text": "The ones I spoke to always said luck played a role, and hard work of course."}, {"comment_author": "Tuplad", "comment_text": "There's like 100 things to look at, what kind of source is that? Show me where it's stated that they can replicate their success from scratch.\n\nI'll send you a link to Wikipedia and ask you to search for yourself then, shit"}, {"comment_author": "BatElectrical4711", "comment_text": "Whelp, the stats, as well as my exponentially more vast anecdote says otherwise \n\nYou’re welcome to continue to believe what you want, rather than what facts present."}, {"comment_author": "BatElectrical4711", "comment_text": "Oh my I’m sorry that reading sources isn’t easy….. Maybe there’s a reason articles like that are written based on the summation of those sources so that people can see the highlights and not have to do the digging themselves"}, {"comment_author": "Tuplad", "comment_text": "You've stated zero facts and brought no evidence. You showed purchased PR articles."}, {"comment_author": "Tuplad", "comment_text": "Those are articles are bought, it's my job to buy articles on these websites. I have a guest post on forbes linking to a Spyware website. Bro, just stop it"}, {"comment_author": "BatElectrical4711", "comment_text": "That have their source data which you didn’t read…. Which is the same as the conclusions of venture capitalists …"}, {"comment_author": "BatElectrical4711", "comment_text": "That’s got fuck all to do with the source data you’re refusing to read 🤦"}, {"comment_author": "Tuplad", "comment_text": "Cool, so you have no data and nothing to back it up, thus your argument is invalid. You're just arguing to argue dude '"}, {"comment_author": "Tuplad", "comment_text": "Because I'm not gonna browse some random compilation of facts written by a teenager to find out what you're talking about. It's probably not even there, you have absolutely no clue whzt you're talking about."}, {"comment_author": "BatElectrical4711", "comment_text": "I do enjoy arguing, it is actually a joy for me….. But you haven’t even stated what your opinion is based on, much less provided a source for it….. and you haven’t even dug into the source data of the articles I’ve provided to find out what you actually disagree with\n\nYour opinion is based on what you want to be true because it justifies the failure that is your life - you don’t have to look in the mirror and ask yourself how you fucked up and what you need to change about you to do better….. you’ll just cling to the notion of luck because you can’t tolerate the idea that your life is your fault"}, {"comment_author": "Tuplad", "comment_text": "I literally did, it's in the post you're replying to, scroll up. You're so dense it's not even funny.\n\nMy life is not at fault, my life is great, I love it. I've achieved exactly what I wanted, and being rich wasn't one of those things. I'm financially well off and barely work."}, {"comment_author": "BatElectrical4711", "comment_text": "“The ones you spoke to” \n\nReally? You’re gonna give me the level of shit you’re giving about reading into source date on the articles I posted….. Meanwhile your source is solely personal anecdotes? \n\nWhat a joke"}, {"comment_author": "Tuplad", "comment_text": "Finally we get to the grand finale where we both realize you're mentally retarded and are strawmanning for the last few hours. You've literally made up arguments, argued about it and only now understand that I haven't said of the things you're claiming I said 🤡\n\nAnd your sources are garbage"}, {"comment_author": "BatElectrical4711", "comment_text": "I don’t think you know what straw man means…. From the get go I’ve been refuting your claim that luck is the driving factor…. Everything I have said and sources provided has been in direct response to that…. I have quoted you very batem multiple times in my responses, yet you disregard it completely.\n\nIf you’re going to refute a source, refute the source with one of your own…. Don’t attack the publisher of the source as a justification of your point - it shows how weak your argument actually is.\n\nDo please provide data and sources of your own that suggest different conclusions than the ones I’ve provided…. If you cannot or do not, I will accept that as your admission of being wrong and I’ll leave it at that.\n\nThank for playing"}, {"comment_author": "GrassyField", "comment_text": "I came from poverty. Put myself through college. Studied accounting. Big 4 then worked for startups, so got paid to learn. Lived way below my means. Started my own thing at 33. Had FU money (barely 8 figures) before 40. Oh and my wife was a stay-at-home mom to our many kids. "}, {"comment_author": "RayolCanadel", "comment_text": "Inspiring. \nWas the first business you started a success?\n\nDid the original startup idea change significantly to the one that actually found market fit?"}, {"comment_author": "MoAsad1", "comment_text": "So you learned in and out of accounting\nWorked at big companies- eventually increasing your salary to six figures\nThen you started your own business?"}, {"comment_author": "GrowFreeFood", "comment_text": "How did you get nutrition for brain development? How did you not succumb to toxic environment? "}, {"comment_author": "GrassyField", "comment_text": "Yes, the first one I started was a success. But I had a few aborted starts—stuff that never got out of ideation. \n\nThe original startup idea didn’t change, but I pivoted a lot along the way in terms of executing the idea. You’ll never know how to execute every aspect, so be ok with figuring that out along the way. \n\nAlso moonlight/bootstrap if at all possible. "}, {"comment_author": "GrassyField", "comment_text": "Yes. But I went from Big 4 to startups. \n\nMy advice for a teen is to enjoy being a kid. \n\nRe school, focus on the learning and the grades will come. Do the best you can and don’t stress too much.  \n\nRe personal development as a kid and beyond, always be working on developing the next good habit. Your life can become almost an autopilot of good habits. "}, {"comment_author": "wantAdvice13", "comment_text": "Big 4 is a big brand name that gave a huge boost to his career. You get in Big 4 by going to target colleges (big school doesn't mean target school) and the rest is efforts and luck. Their roles are mostly client facing, not accounting, so appearance and social skills, ability to talk and connection is helpful.\n\nThere’s a huge gap between the 4th and 5th position. (Grant Thornton). The area of practice also matters. Big 4 does more than accounting: audit, tax, compliance, m&a, advisory (law)… whatever client wants. The partners at Big 4 are essentially self employed, entrepreneurs if you want to call them so.\n\nBig 4 is not a big company. Each of them is a partnership, not LLC or corp. The contracts are just very big. All the S&P 500 companies use one of the big 4. There are lot of complex stuff that they don't want to hire below Big 4, or even 3."}, {"comment_author": "digitaldisgust", "comment_text": "Uh...food? Lol"}, {"comment_author": "Recampb", "comment_text": "Buy real estate as soon as you can."}, {"comment_author": "MoAsad1", "comment_text": "Is “buying cheap” and Auctioned in less developes cities and putting it on rent considered “real estate”"}, {"comment_author": "Girlonascreen_", "comment_text": "Can start with land and building. $7k instead of $300k mortgages etc."}, {"comment_author": "kittenbomber", "comment_text": "I think self made is a relative term. Very few people get far without the help of others so in a strict and literal sense it’s basically non existent. I think what people generally mean is getting there without unusual levels of help, from an average or disadvantaged background. \n\nI grew up poor but largely safe and happy. Dropped out of high school twice and never finished, didn’t go to college. I have started a couple of successful companies at this point though and been in the front row for some other successes along the way. \n\nThe biggest thing I’d tell myself as a teenager is to stop thinking that money and ambition is bad. Poor cultures are terrible with this. They treat money like a zero sum game where if someone is making it then they must be taking it from others. Through that culture they make ambition taboo and hold all the smart and hard working people back. \n\nMoving to America cured me of that. The culture here celebrates success far more than Europe. I married into a successful family who cheered my success instead of avoiding the topic. This was what made the difference to me."}, {"comment_author": "Maximum_Use5854", "comment_text": "Listen to the 4 hour audio book called Richest man in Babylon.  I did the recommended unknowingly and things worked out in my favor."}, {"comment_author": "MoAsad1", "comment_text": "Tell us more? What are you doing now"}, {"comment_author": "Maximum_Use5854", "comment_text": "Providing value to many.  Minding my money.  Investments.  Loving and living my life.  Living beneath my means.  I was never a get rich quick type and still avoid the Ponzi schemes others seem to fall into."}, {"comment_author": "KeniLF", "comment_text": "Got into tech - asked what part of the industry had longevity and did that.  Kept asking the question over time and kept changing my focus.\n\nmiddle class to lower-middle class upbringing.\n\nAdvice I’d give to my teen age self: girl, I told you to leave those boys alone - you need to keep your nose to the grindstone for at least the next 15 years!!!  Also, divert the max to your 401K and Roth.  Go to seminars about investing and work to buy a rental as soon as you can!"}, {"comment_author": "MoAsad1", "comment_text": "Thanks for the advice really useful… how did you network and met people who gave you the answers you needed?"}, {"comment_author": "KeniLF", "comment_text": "Then, the internet as we experience it now was not even a pipedream (IMO). Start with the people you know and don’t be afraid to ask for advice from those who have experience in a role.  Talk to lots of people.\n\nI decided on a financial services company and started/continued with a role that requires interaction with almost all technologies in the stack. My role was in devops, effectively.  When I was helping them solve a problem, I could engage them (where appropriate) and I’d ask people for their opinion and would not play devil’s advocate or do any pushback when they told me their stories/opinions.  Just listen and ask clarifying questions to many people and then use that info to try things out.\n\nI also kept close ties with my fellow college grads in the same city where I started so we could talk about things.  To be honest, the “networking” was regular/organic human interaction."}, {"comment_author": "MoAsad1", "comment_text": "Just think I'm in the wrong country or wrong place I should be in the states lol"}, {"comment_author": "KeniLF", "comment_text": "People are people wherever you go. There are rich and on-the-ladder-to-wealth people in your country, too (whatever that country). I don’t know your age - I do anectdotally see a lot of the Gen Z people express that they feel that talking to people to ask questions is highly uncomfortable.  Not sure if that’s what’s holding you back.  So many people really do want to talk about themselves…."}, {"comment_author": "gary_369", "comment_text": "Wannabe self made 💪"}, {"comment_author": "Girlonascreen_", "comment_text": "Go for it"}, {"comment_author": "kairkasper", "comment_text": "1) Put yourself in a position where you are able to identify a problem that few people understand, but where the solution is potentially worth a lot of money. \n2) Create relationships with people who are able to solve this problem.\n3) Get some experience managing people in a way they want to work for you.\n4) Build credibility so investors would trust you with their money.\n5) Have courage to start a business and be mentally prepared for it to fail, possibly several times.\n\nThe best way to achieve 1-4 is to work 5+ years for a successful company that is small enough that you get a lot of exposure and experience. Ideally a startup after Seed or Series A."}, {"comment_author": "Green_Toe", "comment_text": "There's no such thing as self made. 24 years ago I slept under a bridge. I bootstrapped hustles while working as many jobs as I could get away with for 15 years before I was stable. I've never sought or received financing aside from my mortgage.\n\nEven so, I had access to public school, received mentorship at vital times, had a circle of friends whose moms I could typically count on to get me to at least 1500 calories a day, the bridge I slept under was paid for with state taxes, I broke into the tech industry under advice from temp recruiters back when temp recruiters were actually useful, and I've benefited from a society in which I had access to expertise and resources to fill in the gaps. Get the concept of \"self made\" out of your mind. Humans are functionally worthless as individual units. You're surrounded by resources, human and otherwise, make use of all of them"}, {"comment_author": "HelloBello30", "comment_text": "and yet 99.99% of people would have failed under those same circumstances. You should pat yourself on the back. \"self-made\" obviously isn't completely literal.  Yes we all benefitted from not having e.coli constantly in our water supplies; that doesn't mean you can't give yourself credit for achieving excellence and clawing out of extreme poverty that would swallow others alive."}, {"comment_author": "BatElectrical4711", "comment_text": "The problem is an inconsistent definition of self made.\n\nObviously, there is no way to make money without people…. You need to sell them something, you need to leverage peoples time, experience and expertise to grow…\n\nHowever I think OP is referring to people who didn’t inherit money, or a business, or get some type of leg up."}, {"comment_author": "Plastic_Feedback_417", "comment_text": "Meh you’re going a little overboard. “Self made” is a colloquial term. We all know about public education and bridges paid with taxes. We need people to be proud of accomplishments not embarrassed. We need to encourage more people to achieve the difficult things and excel. Be proud of yourself. People who build something from nothing should be examples we hold up and applaud.\n\nI was homeless in highschool. Lived in my mom’s car with my brother and mom. Got GED, 4 year engineering degree, used student loans to pay for tuition and to buy and flip homes while in college. Kept flipping during my initial engineering job. Learned everything I could and networked my first five years in a big engineering house. Then started my own engineering consulting and manufacturing house with the money I made from real estate. I now employ around 100 engineers and machinists and continue to grow. \n\nMy brother had the same life I had. But he chose the lazy path. No matter how much I tried to drag him up out of poverty with me. He chose to be a victim. If you ask him nothing is his fault. Mindset and persistence is the number one factor of success in my experience. And those are traits we can teach and encourage."}, {"comment_author": "Green_Toe", "comment_text": "I have an absurd ego. I give myself credit but that doesn't change the fact that none of my accomplishments can truly be credited to me alone. The intention of my post was to iterate that all success is a function of utilizing resources available to you. No one has ever done it alone."}, {"comment_author": "Green_Toe", "comment_text": "My point is that I got many leg ups. I once showed up for a temp job interview, went through two hours of training, and was thrown on the phones to patch the lsass exception. That was a massive, unrepeatable leg up. Opportunities always come from outside oneself. Humans are valueless on their own"}, {"comment_author": "HelloBello30", "comment_text": "I feel like this is just semantically challenging the definition of \"self-made\" which isn't really a meaningful. Most people just see it as \"you were once objectively poor, then you were objectively rich\". That's it. EDIT: and it was done without inheritance/lottery :)"}, {"comment_author": "BatElectrical4711", "comment_text": "What part of that is luck?\n\nYou did what was necessary to get the interview, went to it, and then based on your knowledge, experience, charisma, and persona were chosen to be given an opportunity…..\n\nThat doesn’t sound like luck or a leg up at all…. That just sounds like the kind of thing that will happen when a person goes on interviews and can demonstrate their competency at the skills they’ve developed"}, {"comment_author": "Green_Toe", "comment_text": "I'm admittedly salty about the term. Individualist exceptionalism is poison."}, {"comment_author": "Green_Toe", "comment_text": "I did not create those opportunities though. They came from outside. I merely capitalized on them. The day before my \"interview\" for the MS contractor, I was installing gutters as a day laborer. It was pure luck that I walked into the staffing agency on zero day of the largest vulnerability in history at that point. The tech evaluation was essentially \"do you know how to show hidden files and view services? If not, can you recall these instructions as to how?\""}, {"comment_author": "BatElectrical4711", "comment_text": "That’s irrelevant.\n\nNo one “creates” opportunities for themselves - opportunities exist, some people see them and take them, some people let them pass by, some people don’t put in the effort.\n\nYou did. And then you built on top of it…. You didn’t walk into the building looking for a bathroom and they said oh we’re handing out million dollar checks today.\n\nOP is asking about people who didn’t get hand outs - of which you did not"}, {"comment_author": "Green_Toe", "comment_text": "Free milk at school is a handout. Over empathetic middle school teachers with poor boundaries and a thrift store addiction are handouts. Everyone gets handouts. I have a very high opinion of myself. I recognize my individual ability. That individual ability simply would not amount to shit were it not for the plethora of handouts I received. It's the same for everyone"}, {"comment_author": "BatElectrical4711", "comment_text": "OP was asking about handouts of abundance that made becoming a millionaire easy…. Things like a trust fund…. Not milk at school"}, {"comment_author": "Green_Toe", "comment_text": ">-you do not come from high class -low/middle class upbringing -rose from povertyHow did you become “Self-Made” and how does it feel?\nWhat advice would give to your teen age years?\n\nHow did I become self made? I didn't\n\n\nWhat advice would I give to my teen age years?  Get the idea of \"self made\" out of your head. It doesn't exist. You're surrounded by resources, etc\n\nI answered OP from my own experience. Just as they asked."}, {"comment_author": "RizzleP", "comment_text": "Knowledge and information is free. Being an early-adopter helps but isn't a necessity.\n\nIn 2010 I created a business now valued at £m+ from £200 and years of previously self-teaching myself HTML CSS PHP etc through tutorials and trial and error as a teen.\n\nHow? In 2000-2010 e-commerce was considered geeky and niche. Hand work aside, it was a lot less competitive and inexpensive to enter the market. You could build a brand from SEO. It still required complete dedication, this is why enjoying it is so important. I've seen so many people quit after their first year being self-employed.\n\nNow in my 30s I've seen non-entrepreneur types do really well financially by simply being excellent in their field, accountants and so on. They played the long game and won. Probably didn't have half the stress I did.\n\nIn summary: persistence, hard/smart work and a little bit of luck."}, {"comment_author": "hillsfar", "comment_text": "In the mid-1990s, I taught myself web programming from online resources. Everything was still new. People with my skill sets were making 60K. Then he started seeing ads for web programming courses at the local community college.\n\nI would say right now AI is a gold rush and anybody who knows how to use AI to do things can command some ridiculous sums before they start teaching this in community college, and the market gets flooded with commodity workers.\n\nThe trick is to not blow the money or opportunity, but to leverage and move on to more complex and higher level endeavors."}, {"comment_author": "MoAsad1", "comment_text": "Tell us more about your journey of starting a business and how is it going?"}, {"comment_author": "RizzleP", "comment_text": "Own multiple brands. It's going good. Building a business is simply a process of learning from your mistakes. I enjoy it today and take it less seriously.\n\nHonestly, in the beginning the journey was very lonely and arduous. It got better as I began to hire staff. Learning to manage staff is a skill of it's own. There's a reason why good managers can command a good salary.  Build a good team.\n\nI sacrificed a big chunk of my life and it took me to some dark places. Some of the lows were incredibly stressful. You will need to be resilient to stress. \n\nI literally had nothing in my life. I was completely broke and working a shit job at a pub. I didn't even have my own place. Life was not comfortable. This was a big driving force for me. I've achieved what I set out to do which was to own my own home and not feel inferior.\n\nOf course there are many more positives. I get to travel the world on a whim if I choose to. \n\nThere's no secret sauce - find something that works for you and that you enjoy, and scale it.\n\nIf I sound negative it's because I'm suffering from a pretty severe sports injury that's causing me anguish."}, {"comment_author": "MoAsad1", "comment_text": "Hope you get well soon mate… how did you identify the opportunity?"}, {"comment_author": "RizzleP", "comment_text": "I made a website for a running/sportswear shop in my small hometown. It took off and they began to make a lot of money. This shop went from struggling to pay the rent to booming in a matter of months. \n\nThis gave me the confidence and the realisation that you can make money online, even in a deprived market town. This thought stuck with me. \n\nZoom forward a few years. After trying (and failing to be a web designer - I struggle with face to face sales/networking etc) I decided to make an e-commerce site for myself. My girlfriend at the time was struggling to find a certain type of bra online. I sourced this bra as a sample and made a website around it. I didn't expect much to come from it. Why would anyone buy from my website when there are established brands out there?\n\nA few months later sales suddenly began to come in. My SEO efforts had paid off! I had no idea if SEO would work. Firstly a sale, then the next day a few more sales, then suddenly they started coming in. I got more money sales in that third night than I made in a week or working my bar job. Having just checked my inbox after leaving my girlfriend's house and seen lots of sales, I pulled over the side of the road & cried, and have been a business person ever since. \n\nThank you for asking. Describing that has brought back some great emotions. \n\nHere's the lesson:\n- Do not be put off by competition. There will always be competition. Try your best and aim to be the best in whatever you do.\n\nWith regards to identifying an opportunity, I've found you don't necessarily need to reinvent the wheel. Offer quality and market to the correct demographic and you'll make money, from there you'll see other gaps and problems to be solved."}, {"comment_author": "Wise_Cut_2543", "comment_text": "Do you think the SEO stuff still works?  Something makes me think that it does not work the same here 13 years later... I made a common product slightly more interesting and unique and might want my own website one day but I'm doing Amazon right now.  I think online marketplaces will be the strong point in future... Kind of like going to the grocery store where you can see all the MANY products...\n\n\nMy product category is kind of like stationery but I don't necessarily see or sense people flocking to a website like that in masses.... It would kind of be like everybody going to office depots website but still not as good or desirable..."}, {"comment_author": "RizzleP", "comment_text": "SEO will still be beneficial but it is absolutely no way near as effective and cannot really be done without a budget. Think of SEO to complement your business, alongside paid ads. These days the search results are crammed with ads."}, {"comment_author": "Wise_Cut_2543", "comment_text": "Yeah... I'm sorry but I'm pretty sure not even AI is going to be able to solve/sort the onslaught of online data/information.\n\n\nI see people with good material on YouTube and they hardly get views... It's like the platform is intentionally working against them..."}, {"comment_author": "markheroin1", "comment_text": "Keep gambling man \n\ndoesnt matter if you win or lose, one day you'll just wake up with $10m in bitcoins"}, {"comment_author": "_FIRECRACKER_JINX", "comment_text": "Interesting"}, {"comment_author": "Tiny-Lavishness4601", "comment_text": "I'm not a millionaire, but I know some people. \nOne thing that I always noticed is that they have vast network. They do have a lot of connections. So yeah, maybe make a lot of acquaintances and friends."}, {"comment_author": "LardLad00", "comment_text": "Not at all universal. I have actively avoided networking for the sake of networking."}, {"comment_author": "pxrage", "comment_text": "My parents were immigrants from China, worked their butts off, put me through university debt free, started businesses and then bought multiple properties now fully paid off. Took them 24 years.\n\nI'm way ahead of them in every aspect except having a kid."}, {"comment_author": "FewWillingness1081", "comment_text": "Sometimes what you \\[love\\], what you \\[want\\], and what actually \\[makes\\] you money do not align."}, {"comment_author": "Katayanaz", "comment_text": "I've almost solely attributed it to my personality, which is heavily focused on taking risks due to a deep fear of complacency and not wanting others to have power or control over me.\n\nI took big risks quite often to seek things that seemed more interesting. Very impulsive. Traveled a lot as a contractor lived in many 3rd world countries) and learned a lot along the way, until eventually deciding to take what I've learned and settle down to build something.\n\nI always knew I'd either be homeless or rich. Glad it's worked in my favor."}, {"comment_author": "-Nagazaki-", "comment_text": "Can you tell us a bit about the business you have built?"}, {"comment_author": "sachbl", "comment_text": "Getting rich requires leverage. There are 3 types of leverage - money, skills, or people.\n\nMoney leverage means that you use a down payment to buy a larger asset, and expect that larger asset to increase in value faster than the cost of your loan. Real estate is probably the most likely way rich people become rich.\n\nSkill leverage is when you sell your time for higher amounts as your skill level increases. If you are in sales, you sell expensive and higher margin things. If you are a lawyer, you specialize and charge more.\n\nPeople leverage is when you have a team of people and what you build together has more value than what you pay them individually. This can be a restaurant or a tech startup - the concept is the same. This always requires skills on your part, and most times money.\n\nAs a teenager, you should start saving money so you have capital to invest in the future, and you should start developing skills. I would focus on math and science, but keep developing your sales and communication skills.\n\nIf you just want to be rich, finance and real estate are probably your best bets."}, {"comment_author": "hellomyfrients", "comment_text": "honestly, it's not really possible to replicate and will always involve a substantial amount of luck.\n\nthe easiest way to be a millionaire in the US is to go to a top school for law/tech/finance, get your first job somewhere above 100k on status, climb your way up whatever game your are playing to \\~200k, live frugally, and save for 10 years. bonus point if you can do it with a mortgage or property instead of rent. this is pretty much the closest thing to a guaranteed path the US provides.\n\nyou can do that in most fields, too. one trick is not to spend the money you make... most people who make $200k will buy the $90k truck, have 3 or 4 financial decisions that you invest like that compounded over two decades and you are in the millions.\n\nan understanding of opportunity cost and the mathematics behind compounding probably helps. being good at judging and taking risk also helps, but comes at a cost. do you, find your path."}, {"comment_author": "BulletTheDodger", "comment_text": "Loads of people like to claim they're self-made. Almost none actually are."}, {"comment_author": "HelloBello30", "comment_text": "I am"}, {"comment_author": "BatElectrical4711", "comment_text": "Define self made?"}, {"comment_author": "MoAsad1", "comment_text": "Tell us more about your background and how became self made"}, {"comment_author": "MoAsad1", "comment_text": "No rich folks\nNo help from your uncles or anyone\nSystem was against you\nCane from poverty or low or lower middle class"}, {"comment_author": "cybernewtype2", "comment_text": "They have no parents. They simply willed themselves into existence."}, {"comment_author": "BatElectrical4711", "comment_text": "My family didn’t have enough money to eat dinner every night.\nTeachers made other kids share their snacks and lunches with me.\nI was expelled from high school.\nSpent six months at a juvenile academy.\nHad my first child at 16.\nMy father died leaving a whopping $3 to the family.\nMy mother was a retail cashier.\nNo inheritance, not gifts, no handouts  - Ever. \n\nI started my first company when I was 18, and worked 2 full time and 2 part time minimum wage jobs for 9 months to buy the tools, equipment, and insurances necessary to be allowed to bid on projects \n\nToday I’m in my mid 30’s and own a few interesting companies valued into the tens of millions. \n\nPut in the work, put yourself in a position to see, seek and find opportunities, while having the capacity to jump on them. Say yes before you’re ready. Take action and don’t quit. That’s how millionaires come to be starting from nothing. You’ve just got to want it badly enough."}, {"comment_author": "MoAsad1", "comment_text": "Wow… you literally had a tough life my man… you should be super proud of yourself.. I bet your old man is smiling at you and extremely proud. \n\nHow did you start your company? Did you do full time jobs and part time and then start out?"}, {"comment_author": "BatElectrical4711", "comment_text": "Definitely hasn’t been easy and I very proud of how far I’ve come.\n\nThat first company was a construction service business - maintaining foreclosed properties for banks.\n\nI suppose I had set myself up well enough to work into it - having those two full time jobs and two part time jobs made it easy enough to take time off to go and do the work for the bank as it came in…. Especially since I didn’t value the jobs as they were minimum wage and through a temp agency  - very easy to replace.\n\nAnd I kept doing that - take time off as needed to do the bank work - until there was enough work through my business to just do that full time.\n\nIt was good, a lot of work, I made a lot of money, and I made a lot of mistakes - typical things to expect from a teenager/young 20’s…. Got into some other businesses from there….. Lost everyone once, had to go back to jobs to rebuild, then took a clearer more decisive shot a few years later and have been full time business ever since"}, {"comment_author": "Jigan93", "comment_text": "Advice would be to use search button since this question is being asked daily"}, {"comment_author": "MoAsad1", "comment_text": "No most questions are about: \n\nwhat you doing yo make 100000 plus (which I asked once aswell)\n\nI will do this and that for free\n\nMine is specifically for Millionaires, established individuals who escaped the matrix"}, {"comment_author": "Jigan93", "comment_text": "Search “millionaires” in the sub and you will find a lot, one from 4 days ago even lol"}, {"comment_author": "SmoothReddit1", "comment_text": "I wouldn't offer any advice to my younger self because I wouldn't change a thing. Every hard time was needed. Every bit of stress and adversity was worth it."}, {"comment_author": "DCmarvelman", "comment_text": "Does canadian millionaire count?"}, {"comment_author": "MoAsad1", "comment_text": "Hey mate… it's for everyone 🤣"}, {"comment_author": "whoknowzz", "comment_text": "Start investing yesterday"}, {"comment_author": "leggggggggy", "comment_text": "Read or listen to the book think and grow rich. What I got from that book is that there is opportunity all around us.  You need to prepare yourself so you are ready to pounce on opportunities as they present themselves.  \n\nYou prepare yourself by keeping a good attitude and learning as much as you can. Do even the most menial jobs to the best of your ability. Learn about things that interest you and always keep a curious mind. \n\nBe ready.  Keep learning. Everyone's path will be different.  Some fail and some succeed. But you won't have a chance at succeeding unless you are prepared for opportunity when it does present itself."}, {"comment_author": "MoAsad1", "comment_text": "Hey mate… thanks I will add it to my list... But finding opportunity is hard maybe I'm saying this because I don't have a business, but how did you find the opportunity?"}, {"comment_author": "muntaxitome", "comment_text": "Step 1 is having ownership (or significant ownership) in a business. Then a lot comes down to two things you can hardly control: skill and luck. If you don't have money for a team that means your own skill and luck. All the books about running a business are mostly just bullshit. The thing is, if you play it right you can make a lot of attempts running a business and you can often do it while working a regular job making the actual risk close to zero. \n \nKeep going at it. Shrug at the naysayers because it doesn't even matter if a bet works out or not. \n \nI think a lof of the psychological part is making it so that you don't scare yourself into doing nothing. Just keep realizing that it's just a bet and it's fine if it fails. \n \nAs for hard work, it certainly helps but a lot of rich people never worked hard."}, {"comment_author": "MoAsad1", "comment_text": "Thanks for the inspiration mate… do you have your own business?"}, {"comment_author": "whyubb", "comment_text": "Not me but my friends brother was a high paying software engineer was making like 200-300k a year. He saw the opportunity in the Tesla rally in 2020 and kept long it as the asset prices exploded. He supposedly made enough to retire. I don’t know how much but I’m going to guess it was 5-6mm since we live in HCOL area.\n\nAdvice would be get a good paying job so you have capital to seize those once in a life time get free out of work for life cards."}, {"comment_author": "Zenai", "comment_text": "Grew up in poverty (raised by single mom, annual household income of 18-22k, brother mom and I lived in a 550sqft apt majority of my childhood) and hit 1M at 29 years old.\n\nGot a computer science degree from a state school on federal loans and Pell grants, worked at startups for 8 years, got lucky a couple times with exits."}, {"comment_author": "MoAsad1", "comment_text": "Should be proud of yourself mate… Did you work at those startups or founded them?"}, {"comment_author": "Zenai", "comment_text": "First or very early engineer. I just went out on my own as a founder this year."}, {"comment_author": "MoAsad1", "comment_text": "Engineer as a software engineer? What field is your business mate"}, {"comment_author": "Zenai", "comment_text": "yep software engineer, and I'm experimenting with a few ideas, one in consumer lending / fintech - one services business, and one b2b saas / developer tool. will see which one gets the most traction and lean into it more"}, {"comment_author": "Agnia_Barto", "comment_text": "There is a difference between \"making millions\" and \"keeping millions\" as it's super hard to KEEP money. I made over a million dollars, but I don't have a million dollars. Huge respect to people who on top of making money know how to keep and multiply their money."}, {"comment_author": "green_kitten_mittens", "comment_text": "Don’t ever work for a company that doesn’t offer you equity"}, {"comment_author": "MoAsad1", "comment_text": "I'm in UK, my company only gives salary 🥲"}, {"comment_author": "green_kitten_mittens", "comment_text": "Try to find another that does, if you’re not earning equity with your labor you’re hosed"}, {"comment_author": "Girlonascreen_", "comment_text": "To be honest it mainly depended on my alarm clock, discipline and planning. Also, it doesn´t really feel like work because I love it so much. Do something you´re naturally good in. Advice: some people stick around you like parasites, they think they deserve to ´gain for free´ so beware to surround yourself with good friends and have defence prepared."}, {"comment_author": "MoAsad1", "comment_text": "Thanks for the reply… from your advice you sound intellectual…are you self-made? Are you in corporate or have your own business?"}, {"comment_author": "Girlonascreen_", "comment_text": "You´re welcome, I have my own since 12 yrs (marketing) and started b&b with exhusband also 13 yrs ago, still operational."}, {"comment_author": "Satan_and_Communism", "comment_text": "Get the fuck to work is step 1. Stop asking questions if you’re not working.\n\nLearn a skill people pay for ideally getting paid to do it. Learn to manage people with that skill. \n\nCharge people for that skill. Pay people to perform that skill while charging others for it. Tried and true formula.\n\nDuring all of these things work very hard for very long hours. Nobody’s going from poverty to wealth worried massively about their work life balance."}, {"comment_author": "Prestigious_Bag_2242", "comment_text": "1. Get to places where money is prevalent and easy. Ie, New York, Boston, SF there is just a ton of money available to hard workers who are smart. If you’re in rural america or even large cities without as much money, your chances for wealth are much less. And move in your 20s if you have to. It’s much easier taking the lifestyle hit at that time then later with kids. \n\n2. Take bigger risks, but have a plan b if it fails."}, {"comment_author": "MoAsad1", "comment_text": "I'm hitting 30 later this year. In UK, London. Working 9-5 and paying my salary for a project in cybersecurity. It's Scary but I hope it's good"}, {"comment_author": "Biz-Coach", "comment_text": "Focus on what you need to do and just start doing it. Don’t think too much or find reasons to wait. Avoid big risks. Try out your ideas in small ways first. Make sure you have different ways to make money (revenue streams).\n\nThe SEO and website clients are international web agencies and have been outsourcing us the projects from 14+ years now. So long term business relationship is important too."}, {"comment_author": "ApollosSin", "comment_text": "Gonna read this one later 🙏🏾"}, {"comment_author": "Ferr22777888", "comment_text": "Did it in one year prior to that I just did work a 9-5. My best tips? Make a website and pick up the effing phone"}, {"comment_author": "No-One-Important-666", "comment_text": "It really depends on what you see as being rich or wealthy. For some, being rich means just owning a few sculptures, jewellery or fancy-ass portraits."}, {"comment_author": "Henz_1985", "comment_text": "1st generation, parents immigrated from Poland.  Was a bit rough growing up but not poverty level. Real estate did it for me. My first two real estate deals lost me money but I stuck to it and then it clicked. To get started is not easy but it’s a really effective way to multiply your wealth quickly."}, {"comment_author": "boydie", "comment_text": "Persistence and adaptability turned my dreams into reality."}, {"comment_author": "MoAsad1", "comment_text": "Thanks for the reply mate… what do you do?"}, {"comment_author": "2nd_Class_Citizen_", "comment_text": "Honestly, the best advice I ever got from within my circle was to start retirement, investing, early and often. On top of that, get out of debt and stay out of debt.\n\nHere I am, 34 years old with Absolutely zero consumer debt and only approximately 26 months left until I pay off my $420,000 home.\n\nThe advice I would give to anyone else is the exact same advice I would give to my children. Stay out of debt, and if you are already in debt, get out of it. Start investing in your retirement as early as you possibly can with as much as you possibly can. Even $50 a month at the return of the S&P 500 over the course of multiple decades is plentiful."}, {"comment_author": "Last_Inspector2515", "comment_text": "Build value, stay resilient, learn from every failure."}, {"comment_author": "mouseplaycen", "comment_text": "Took student loans out to get an engineering degree. Grinded for an internship at a top aerospace company. Grinded some more to land a 300k at Microsoft. Fast forward 5 more years, debt free, net worth is 1.5 mil. Took 8 years total. \n\nFirst in family to go to college. My dad is a blue collar man without highschool diploma"}, {"comment_author": "Tronbronson", "comment_text": "Weed. It felt really good."}, {"comment_author": "fatWkanye", "comment_text": "Self made through atm glitch"}, {"comment_author": "jhansen858", "comment_text": "There is only one thing: you must be willing to work a little bit harder then everyone else."}, {"comment_author": "Trismegistvss", "comment_text": "R u a melyoner?"}, {"comment_author": "jhansen858", "comment_text": "> melyoner\n\nno, not familiar with that term"}, {"comment_author": "Threeeboysssub", "comment_text": "Honestly man I’m only 19 and haven’t experienced much of life yet but I’ve been around a lot of successful people and have asked enough questions to get rough idea of the “method” to become successful.\n\nFirstly, don’t drop out, I’m starting off with this because I’ve been hearing a lot of people talk about how useless school is and how you can already start a business at 18 which not untrue but counterproductive and risky.\n\nBest thing to do as a teenager is to learn as much as possible, about anything really, doing so will help you figure out what really interests you. The main motivator cannot be money, you’ll be led by it in your decisions and you’ll end up making a mistake. Morgan freeman said and I quote “money is just a side effect”, when you’re passionate and really motivated to do something, you’ll be so focused on the vision and not on measly dollars you can make on this or that deal. You’ll be leading all of your decisions, even if they might be costly, to the greater goal.\n\n\nSo, to resume, you need to go to school, preferably a really good one so I recommend you get your grades up if you haven’t and try to get a scholarship at an Ivy League school; not completely for the education but for the highly motivated and usually wealthy people you will meet there. These people will be your key to success if you aren’t already in that environment. Rich people hang out with rich people, that’s part of the reason they stay rich. They are ahead of most competition by having access to information and resources to make things happen. You NEED to be placed in that environment and only way to do that as a young adult is by either going to a top university or hanging out in those young rich adults groups.\n\nAfter you finished your studies in whatever industry you like, you’ll start working in said industry and specializing yourself, once you understand what you’re good at, you sharpen your skills and try a few different jobs to get an understanding of the industry you’re in. Once you are ready, take a few good acquaintances that are smarter than you in some areas and as ambitious but be careful not to pick someone you’ll have a cock fight with… that’s dangerous for business.\n\nThe idea of a good school is that once you wanna start your business, you’ll have high credibility to find investors that will trust you thanks to your degree because most of the guys that have money are either 40+ (old school) or banks… also old school and they see security in someone that graduated from a great school and has a good professional track record. They would be hesitant in investing into someone that hasn’t had a good education.\n\nI know this is probable not what you want to hear because it’s a slow process, the money will be made through a long and hard process of learning, failing and trying again. There is no quick way of making money without taking enormous risks. You can take that road if you want but you better be damn sure about what you’re doing.\n\nBest of luck"}, {"comment_author": "MoveOverBieber", "comment_text": "What's your definition of a \"millionaire\"? Someone who made 1mil out of \"nothing\" or someone who owns a house that is valued at this amount? These are very different categories."}, {"comment_author": "MoAsad1", "comment_text": "Someone who made made a million dollar or more and they came from poverty/low class background"}, {"comment_author": "Important_Expert_806", "comment_text": "I personally find it underwhelming. I hit the goal of not having to work again and it was this weird feeling of “ok what now”. I don’t want to compare myself to Olympic athletes but I guess they feel the same way after winning big. It wasn’t really as life changing as I would have hoped. I don’t really know how to explain it. On other hand the relief of not having to worry about money is one of the greatest reliefs/feelings I’ve ever felt."}, {"comment_author": "elPibeNoEntendiaNada", "comment_text": "Did you set new personal goals? It must be really healthy to stop worrying about money."}, {"comment_author": "Important_Expert_806", "comment_text": "It took a little while it wasn’t overnight but after time I kind of realized that it wasn’t really that important I guess. Kind of just moved past it. Not going to lie the money part def allowed me to do that. It wasn’t so much setting new goals it was more of realizing that the original goal didn’t matter that much? That a lot of it was kind of this false hype. I’m not saying money doesn’t matter it def does. But for me working towards that goal and thinking it would be some grand plan life altering event then you just wake up the next day and it’s just like any other day."}, {"comment_author": "drteq", "comment_text": "I was in the Web early, obsessed with programming - took college programming classes while I was in middle school.  Failed most of my HS classes.  Went right into the .COM boom, was making 30k as a webmaster - got a call with a job offer for $300k/yr, I was 20.\n\nGrew up low middle class, alcoholic dad - parents worked, I took care of myself and my brother since I was 6.  Started building computers for my neighbors.  Got my first real job filing papers, sold that office 100 new computers 3 weeks later.  I have just always been the underdog fighting my way through bad situations and looking for every angle.  Got to hang around ultra wealthy people, despised them and how easy life was and how seemingly 'not difficult' their 'crises' were.  At 25 I was building their entire companies for them.. I was smarter than they were, just didn't have the connections or family.. so I just kept hustling my way through my social weaknesses by out hustling everyone else.\n\nJust built my career, connections and knowledge since - made a lot of other people wealthy, ran the same plays for myself after awhile.\n\nI am self made - of course I learned a lot from people, but anyone who hired me was for their own selfish reasons - yes I learned from them, some of them gave me advice, but none of them 'helped me'.. not once has anyone helped me.  Weirdly I really enjoy helping people though, I believe in underdogs and I know my kind of people when I meet them."}, {"comment_author": "ConstructionFar8570", "comment_text": "Dad left me $.  I took it farther."}, {"comment_author": "Ghost_Keep", "comment_text": "I befriended an older lady and she left me her inheritance. $10M. I had to have sex with her of course so I feel the money was deserved. Took me 7 years."}, {"comment_author": "Echizen88", "comment_text": "Sounds like a tough gig"}, {"comment_author": "shiroboi", "comment_text": "Here’s a few tips that I think helped along the way\n\n- if you are massively deficient in a certain area, find a partner who complements you. In my case, my wife helped balance me out in a business sense.\n\n- keep learning and improving yourself, and if you make mistakes, learn from them and grow\n\n- If you’re young, take risks and be brave. It’s much easier to recover from a failure when you are young. \n\n- there are always new opportunities in technology, but the Lionshare of the rewards go to the brave and the early movers.  Often, new businesses, with lots of potential, have a narrow window of opportunity. Sometimes you need to take a risk and jump in early.\n\n- If you are too comfortable, you probably aren’t trying hard enough. Getting out of your comfort zone is where growth happens.\n\n- if you are going to fail, fail fast.  Doing the same thing over and over when it’s clear, your business plan isn’t working, is a sure way to burn up your life savings."}, {"comment_author": "674_Fox", "comment_text": "Lots of hard work, living below, your means, saving and investing little by little, into Vanguard funds. It’s not rocket science to become a millionaire.  A lot of the hype advice, isn’t great. The path to wealth is actually pretty simple."}, {"comment_author": "_FIRECRACKER_JINX", "comment_text": "Well. My drug dealer is a multimillionaire and he sells mushrooms and weed."}, {"comment_author": "No-Distribution2547", "comment_text": "Grew up in poverty. \n\nWorked alot, took significant risks many many times over, betting everything I've done on the next idea. \n\nI fucked up a lot to, I'm not that smart, barely graduated highschool. ADHD is a burden but also helps me with making quick decisions and moving on. \n\nWork hard, take some risks, Caution to the wind. \n\nI failed a lot and I'll fail some more. Move on and try again."}, {"comment_author": "onepercentbatman", "comment_text": "How I did it isn’t specifically relevant to you.  We are all nuanced and you have already made a thousand different choices than I did.  What I can speak of is generics.  Start a business that you can be excellent in.  Do the work.  Make your goal to be the best, not to make money.  What you do needs to provide real value, so avoid drop shipping, social media adv/marketing, logo design, seo, anything that people can do on a computer for themselves.  Don’t look for easy things.  Look for what is most difficult.  Do what is difficult excellently, and you will transcend from the bottom to the top.   Be smart, take risks, work hard and make the best quality of good or service.  \n\nAs far as how it feels, that is hard to say.  I’ve still lived more of my life poor than rich.  You never truly feel comfortable despite financial freedom.  If you had nothing, you always feel you could go back to nothing.  Only people born rich feel this is impossible.  It’s kind of why those who do achieve great success never stop.  An analogy I have used in the past is that going from poverty to rich feels like the movie It Follows, where being poor and having nothing is always behind you, following you, and you are just one bad choice, one mistake, one error from it catching you.  You just can’t stop cause there is never a dollar amount which will make you feel safe and insulated."}, {"comment_author": "MoAsad1", "comment_text": "Thanks for the great advice… may I ask what business are you in ?"}, {"comment_author": "willycw08", "comment_text": "I had about as little help from my parents as possible. No savings or income from them. Borrowed $700 from my dad one time to repair my car and I had to pay him back within a month so he could pay his property taxes. That was the most help I got after age 18. \n\n\nAnyway, here's what I did\n\n1.) Got a high paying job. \n\n2.) Invested at least 50% of my income\n\n3.) Applied to new higher paying jobs at least every 3 years to increase income \n\n4.) Continued to invest in winners and asset classes that I understood well\n\n\nIt took time and patience, but with a decently high salary and very high savings, it can be done in less than 10 years."}, {"comment_author": "Wrecklessdriver10", "comment_text": "My path was sales, one you need an engineering degree to sell. Lots of luck and patience along with determination and smart decisions. Mom was school teacher, dad worked at a lumberyard. We were never hunger but shared a room and clothes no vacations sort of childhood. \n\nNo one is self made is my thought. Even poorest of poor people, had many strokes of luck along with people helping along the way. Richer people generally are in those higher chance luck situations more often so they can screw up opportunities and have others. Poor people might get only a few chances in their entire lives. \n\nWould you call lebron James “self made”? \n\nWould you call a jackpot lotto winner self made?\n\nThese are the same thing, lebron extremely lucky in his genetics, other lucky with numbers on a ticket. \n\nIs being born in USA already disqualify you?\n\nIt’s not something to worry about is my point. \n\nWork smart, and hard. Good luck will find you, and you have to capitalize on the opportunities when they come."}, {"comment_author": "tmac_79", "comment_text": "No millionaire is self-made.  They all did it because we have a society and infrastructure around that supported them.  Education system that produced people who could be customers and employees.  Roads to get there, etc. etc.\n\nNow that the rant is over:  If you want to be able to go from lower middle class to financial stability/wealth, you must find something you can do that helps people, and those people must be able/willing to pay for it.  Then you have to be able to communicate what it is you do and why they should pay you."}, {"comment_author": "crappysurfer", "comment_text": "There’s no such thing as self made and recognizing the help you’re getting as help is very very important. For my teenage self, I’d say respect your health over everything, be patient, don’t be afraid of failure and commit more time to education."}, {"comment_author": "Echizen88", "comment_text": "1. Found something that I was really good at, passionate about, and by chance also can make a lot of money\n2. Go all in. Quit my 6 figure job. No income. Was desperate af. Desperation is a key factor in success. You get really creative when “someone points a gun in your head.”\n3. Put in 150% all day, every day. You’re the fucking turtle. Only way the underdog’s gonna catch up is your constant hustle. When everyone’s out there having fun, when they’re sleeping, that’s the best time to catch up/pass them in the marathon of life.  Learn. Do. Fuck up. Repeat. More cycles of this you do, that’s how you level up. \n4. Discipline. If #1 is true, and you’re passionate about what you do. You will be able to survive the ups and downs, the days when you feel it’s you against the world, the nights when you just wanna give up everything. Your mind will fuck you, so you have to stay disciplined. Power through! Remember, you won’t lose unless you quit. \n5. Get lucky 🍀! I was in the right place, right time, doing the right things. No opportunity is a bad opportunity. The more dices you roll, you will eventually get your number. The point is, take action, take risks, don’t listen to naysayers. People that never take that chance in the first place, they will never get lucky. \n\nGood luck 👍"}, {"comment_author": "NucleativeCereal", "comment_text": "tl;dr had a pretty good job very early in my career, used it to buy real estate. Job let me keep growing the real-estate portfolio and made it easy to borrow. Used the two together to grow well past 7 figures by the time I was 30.\n\nUpper-ish middle class background. Parents came from a very middle class family and my dad worked his way up. Because of this I was able to attend private middle and high school and mom was stay-at-home. \n\nI spent most of my childhood messing around with computers. By the time I was in high school I could set up a Win 3.11 network and connect the systems to a file server, so my school hired me and a couple of friends over the summer to set up the school's labs. That led to a ton of \"hire me to set up my computer at home\" kind of gigs as a teenager.\n\nI used to joke with my friends to \"not let school get in the way of your education\" so spent a lot of time just educating myself about things that seemed useful and interesting which for me was strangely Linux, Windows NT and IT security. Straight out of high school I found a job in IT making about 40k (this was 1998) and then used the opportunity to educate myself as fast as possible with tech certifications and developing my soft skills. My salary grew to around 95k over the next few years. This was partly during the dotcom boom which was a strange time in tech and frankly I was making more than I probably should have for someone my age.\n\nI got really good at working with people so at 25 I quit my IT job and started an IT consulting business. My dad gave me nothing except insight on how to network with people, but I acknowledge that the opportunities I had as a kid were crucial to knowing what to do when I started my own business. But I was also stupid and overconfident and lucky too. Within a few months I had replaced my salary and was only going up. \n\nAs my own firm grew, I was able to leverage my increasing income to keep investing in larger real estate projects including apartment buildings in crappy parts of the city. I spent a heck of a lot of my evenings and weekends painting walls and fixing toilets in my shitty apartments. There was a real estate crash around 2008 and I was positioned to buy more.  \n\nLet me tell you that along the way of this path I second guessed myself often and never felt like I'd figured out anything secret whatsoever. I had to - at times - wade through literal shit and even had to get police help to evict druggies from my apartment once. My friends and family thought I was crazy. \n\nDuring all this time, I was reading constantly (some popular stuff like \"Rich Dad Poor Dad\" but also about day trading, finance, entrepreneurship, learning how to do sales, how to manage people, etc) and also seeking advice from other more successful people around me. \n\nA secret that many teens don't understand is that successful business people actually love to talk with teens and share their stories. Too many teens are afraid to pick up the phone or send that email and ask for a meeting even after I tell them this. Steve Jobs has this story where he dialed up the co-founder of HP (Bill Hewlett?) and asked for some computer parts - and that landed him an internship! But don't try to call Tim Cook or Satya Nadella. Figure out who owns that local restaurant chain or local house building company or some other local business guy. You might be surprised that these dudes are often millionaires too. \n\nIf I were to try to make a useful set of suggestions for someone who's a teen today, I'm not sure if my advice would apply. Houses are too expensive, I'm not sure if the FHA 3% down program still applies to quadplexes, IT jobs have a higher bar for entry and they are crowded. Getting to 6 figures in your 20's is probably a lot harder now unless you get lucky with a business idea or aim for a professional field. \n\n1) Pick hobbies and spend your time doing something that will have a future. Building leadership skills, technical skills, sales, problem-solving skills, finance/accounting understanding, developing entrepreneurial projects and trying/failing/trying/failing/trying/failing in a loop until you figure out what the factors of a working business model are.\n\n2) Choose your friends wisely. Hang with the ones who challenge you related to #1 above and don't mind a bit of competition. If the idea of them being more successful than you is a bit scary to you, maybe that's a good start\n\n3) live like a miser in your 20s/30s but maximize your income. DO. NOT. BORROW. MONEY. except for appreciating/income-producing assets. Credit card debt just slows you down. \n\n\nAlso, if some new internet money tech comes along and you can buy thousands of pieces of it for like 20 cents each, DON'T SELL IT WHEN IT GROWS TO BE $2/piece. LOL"}, {"comment_author": "digitaldisgust", "comment_text": "Youd have better luck asking r/fatfire"}, {"comment_author": "kanggorengan", "comment_text": "Gooooo"}, {"comment_author": "TheAtheistGawd", "comment_text": "In 13yrs maybe 🔜🤥"}, {"comment_author": "TheLootGobln", "comment_text": "Adversity builds character. Hustle your ass off and make it a goal to retire by 30, even if you don’t make it, shoot for the moon, if you hit the stars well, close enough."}, {"comment_author": "NPC_HelpMeEscapeSim", "comment_text": "Shooting for the moon and reaching another star is like aim for the million by 30 and reaching billions by 21"}, {"comment_author": "MoAsad1", "comment_text": "Are you Self-Made sir?"}, {"comment_author": "TheLootGobln", "comment_text": "It could easily go both ways."}, {"comment_author": "TheLootGobln", "comment_text": "Got It Out The Mud Good Sir"}, {"comment_author": "packet-zach", "comment_text": "No man is an island. Self made doesn't exist. "}, {"comment_author": "agsqwe", "comment_text": "A million can be earned with a highly paid profession in the right field - tech, law, medicine, etc."}, {"comment_author": "BatElectrical4711", "comment_text": "Work.\n\nThat’s it - put in thousands of hours of work on learning how to make money, how to invest, how to manage people, personal development, networking, sales, accounting, legal… \n\nStudy then implement. Learn from mistakes and failures, study and implement again. \n\nIt takes time, it takes muscling through adversity and hard times, it takes not giving up after a loss. \n\nThe advice I’d give my teenage years - the struggle is worth it, just keep pushing."}, {"comment_author": "CoachObjective1185", "comment_text": "Will be"}]}, {"post_title": "Ideas for new career at 61 - my goal, £10k per month.", "post_url": "https://www.reddit.com/r/Entrepreneur/comments/1byc8qv/ideas_for_new_career_at_61_my_goal_10k_per_month/", "post_main_text": "Long back story, which would take me hours to write here, but during the whole of last week I took a long hard look at my life/work situation (I'm 61, male and really not earning much at all) and decided that my passion for what I first discovered back in the 90's, 3D visualisation, is no longer worth the effort I am prepared to put in (ie the marketing) for the returns I may/may not receive (to date for the past 13+ years I'd been relying on my websites to get me new clients, but that isn't working for me anymore).  So to put it in perspective, were I to spend weeks/months chasing just 100's of pounds (£)...... it's just not worth it.\n\n(for background, I was earning 6 figures at what I do back in the 90's but burned out twice back then, and after a sabbatical for many years, returned to it again only because nothing else rocked my boat - and when I did return to it, I had to start all over again, learning from scratch and from the back/very bottom.... it's been a case of me 'living like a struggling artist' for too long and I'm 'done', I've woken up, I've smelled the coffee.....).\n\nSo I want to do something quite different (maybe completely different).\n\nAnd I've worked out how much I want/would like to earn (ie dreaming) and I've set a target to be £10k/month.\n\nThing is......I have no idea how I'm going to achieve that and doing what?\n\nHow long would I like it before I'm making £10k/month?  Ideally, I'd like it to be immediate (who wouldn't!) but realistically, I guess within a year to 18 months?\n\nSo, a lot of new skills to be learned, and I know I need to change as well.  I'm \\*really\\* up for the challenge.\n\nI've got no savings, and I'll be starting from scratch.  All I have is computer gear, a decent digital camera/lenses, a car, etc etc......\n\n........and a blank canvas (and me!).\n\nI'm not looking for a 'get rich quick scheme' - and I do believe that I have to be passionate and believe in whatever it is that I'm trying to do to be any good at it.\n\nI'm also of the 'opinion' that due to age/health reasons, it would be better if I could get myself into something that didn't involve too much sitting down).\n\nSo I'm looking for ideas.\n\nI do appreciate the rules on this Community and so I'll reiterate that I'm not looking for a get rich scheme.  I'm looking for some ideas (apologies if this isn't the right community for such a post - but I thought it could be a good one because I've been a freelancer for a long time and I would prefer working for myself).\n\nSomeone mentioned Online Coaching, which does kind of sound a possibility for me - but really, I don't think I've got much to offer in that space (plus I don't think I'd look that great in front of a camera).  But it is something I do like the sound of and could see myself doing.\n\nI'm just putting this out there - for ideas.\n\nPlease be gentle with me, I am a sensitive soul and posting this itself is already out of my comfort zone.\n\nThanks for reading.\n\n\\*\\*\\* UPDATE \\*\\*\\*\n\nI just want to say a big thank you to ALL of you for your great suggestions and words of encouragement!\n\nWhat a different response I got on this Community here (compared to another Community I posted this exact same message to).\n\nWow!\n\nI appreciate your positivity like you'll never know.\n\nThank you.\n\n\\*\\*\\* \\*\\*\\*", "post_comments": [{"comment_author": "nonsoarmani", "comment_text": "It's a beautiful thing that you're thinking in this direction. I congratulate you for taking this bold step to ask for ideas.\n\nIf I were to suggest something for you, then it'd be to create a YouTube channel, and start sharing most of what you've learned in your prime. \n\nYou can share about your past failures, past successes, past downtimes, past skills you've acquired, past temptations you've fallen for, lessons, etc. \n\nJust be vulnerable, and trust me, you'd gain people's attention in no time.\n\nYou can name the YouTube channel something like \"second chance\", \"the second journey\" etc.\n\nDon't worry about making fanciful videos. Just make the videos and publish, people will love it because of its originality.\n\nWhen you've gotten 1K subscribers and 4000 watch hours, you can now apply for YouTube monetization.\n\nYou can also monetize by selling materials like ebooks, guides to your audience, or you can easily sell coaching to younger people where you hold them by the hand and teach them about life.\n\nYou can hold clarity sessions too for people and teach them how not to make life mistakes.\n\nIf you put in the work, in 8-12 months, you'd be amazed at the level of progress you would have made.\n\nThis is my 2 cents.\n\nI hope it does help.\n\nI wish you great success."}, {"comment_author": "These-Season-2611", "comment_text": "Agreed. At 61 and having successfully worked for yourself since the 90's you'll have loads of insight that people would value! Coaching and mentoring could be a good idea too."}, {"comment_author": "Bzom", "comment_text": "There's a 95% chance you're current skill set + improved marketing/positioning/mindset will get you to your goals far faster than developing a new skill. \n\nIf you really wanna develop a new skillset, it should be marketing centric using your current business as its new client."}, {"comment_author": "VeryThicknLong", "comment_text": "I’d be interested to hear how a professional navigated the world of marketing and CGI. And your failures, successes, what you enjoyed, what you hated. High points, low points. There’s definitely universal 3D methods to modelling well, and texturing well etc. so anything that spans that sort of territory is all stuff students and newbies could do with learning, the basics."}, {"comment_author": "Real_Project2563", "comment_text": "Ask yourself: what is the thing that you are most competent in and do the absolute best of all things, professionally ? That should be your new career."}, {"comment_author": "Last_Inspector2515", "comment_text": "Consider leveraging your 3D skills in emerging tech markets."}, {"comment_author": "seomonstar", "comment_text": "Congrats on making such a big change. You have loads to offer so dont undersell yourself.\nMaybe you could make a list of your strengths, weaknesses, experience, interests etc. and also the things you dont want to do. This could help you decide. \n\nAs mentioned a youtube channel is a great option but not one to rely on income from initally at least. If it went big you could make plenty on there.\n\n120k per year in 18months is a lofty goal and I dont know what would provide that while being outside as well. Maybe a standup desk is an option!\n\nYou could also apply to jobs where you think your skills fit well. Start on lower money and then move up from there. Good luck"}, {"comment_author": "lumikhateams", "comment_text": "You might find Tim Ferriss' explanation about how to overlay two skills to create a niche for yourself. These are two skills that are disparate but \\*might\\* be complementary, or you could use a skill you have and devote the next year to becoming very knowledgeable in the second. For learning fast you might consult Cal Newport's books and podcast and/or Chris Baily's book, the Productivity Project. \n\nGood luck."}, {"comment_author": "Blarghnog", "comment_text": "500 a day is very doable. Everything else you said is a footnote to that."}, {"comment_author": "Mr_Nice_", "comment_text": "Become an AI implementor for small to medium sized businesses.  Learn how to handle common workflows and charge companies a setup plus residual to create and manage them."}, {"comment_author": "edzorg", "comment_text": "I have a design of a physical product that will sell well in UK with ability to translate and sell internationally. \n\nI've got the manufacturer lined up and seed capital of ~£5k.\n\nRequires a \"base\" in the UK to ship the (small) product to, and be the interface to the post service (you post each order).\n\nI'm interested in a wise partner, you get 40% of the business and 60% of first years profits. You do almost all of the operational side of the business.\n\nIf interested DM me and let's discuss Monday or Tuesday PM."}, {"comment_author": "dafyddtomas", "comment_text": "Willing to chat with other people as well?"}, {"comment_author": "Proud-Ad-928", "comment_text": "How about a base in Canada?"}, {"comment_author": "Turkish_Emperor", "comment_text": "Hi Edzorg,\n\nThanks.\n\nI've sent you a DM."}, {"comment_author": "edzorg", "comment_text": "Sure"}, {"comment_author": "edzorg", "comment_text": "Gotta start with what I know, sorry"}, {"comment_author": "Turkish_Emperor", "comment_text": "I just want to say a big thank you to ALL of you for your suggestions!  \n\nWhat a different response I got on here (compared to another I posted this exact same message to).\n\nWow!  \n  \nI appreciate your positivity like you'll never know.\n\nThank you."}, {"comment_author": "craftylettuce1", "comment_text": "Out of interest, by 3D visualisation do you mean like CGI’s etc?"}, {"comment_author": "Turkish_Emperor", "comment_text": "Yes."}, {"comment_author": "Hdhagagjjdhhajajsh", "comment_text": "So YouTube and Share life experience. "}, {"comment_author": "MoAsad1", "comment_text": "What advice would you give to your 30 year old OP"}, {"comment_author": "Turkish_Emperor", "comment_text": "That's a great question, thank you.  I'm going to dive deep on this one and get back to you."}, {"comment_author": "fatWkanye", "comment_text": "Best of luck"}, {"comment_author": "joesus-christ", "comment_text": "At 61 you've probably picked up some life skills that millions of young adults google \"how do I do this\" - be the guy whose tutorials appear first (videos, blogs, whatever) and you'll be rolling in it. \n\nFailing that; learn a hot tech topic like AI or Blockchain and just become a freelance consultant charging £1k/day."}, {"comment_author": "Apokaliptor", "comment_text": "Lol 1k/day? Is this a delusional response or just ignorance? Even if there are freelancers able to charge this rate do you think they have skills acquired in 18 months?"}, {"comment_author": "joesus-christ", "comment_text": "There's a lot of people out there who charge this. Sometimes they're legitimately experienced experts, sometimes it's just \"knowledgeable enough\" with decent self-selling skills and have worked their way into contact with companies willing to pay it."}, {"comment_author": "Key_Bodybuilder_399", "comment_text": "Bruh you are delusional. "}]}, {"post_title": "Starting with just $2000", "post_url": "https://www.reddit.com/r/Entrepreneur/comments/1byhdaj/starting_with_just_2000/", "post_main_text": "So I have $2000 savings. This is all I have ever had in my savings,I could spend and resave,there has never been a time I do not have upto $2000 since 13months ago,sometimes it could reach 4k/5k but not most times, so this time the hatred for my Job and poverty has grown about 400%. I saved that money to be able to pay my rent and live one month more let's say a calamity befalls me and I lost all sources of income.\n\nPersonally,I don't believe in savings and if not because  I have to pay monthly bills, I wouldn't mind 100% risking my money for anything that makes me happy. \n\nBack to why I am writing this, I have decided to risk all the money in my savings to start two business as its as good as useless in ny account as no calamity has befell me since I started  saving. One if the businesses I plan starting is having my own fashion brand, this is because I struggle with styling as I can only afford Walmart, Zara and cheap stores. The other is Hair Salon/business also because I struggle with braiding my hair,and girl is tired of DIY. I got motivated by a comment here yesterday on reddit and the guy told me to go ahead,so I'm like why not just risk it all instead of living miserably. \n\nSo in the next 6 months, there will be 4 outcomes\n\n1. I HAVE GONE HOMELESS \n\n2. THE BUSINESS FAILS, I still have a job but borrowing money to pay rent with bad credits and minus in my savings\n\n3. The businesses is about to pick up or at least stable \n\n4. The business is doing well and I am finally happy and no longer work and I am my free self\n\nI will update this thread to let you know the outcome. I wish I could document this somewhere,lol. But I will be creating rant posts along the journey. Wish me good luck ", "post_comments": [{"comment_author": "spanchor", "comment_text": "Strongly encourage you to focus on one. Those are two very different businesses, and it doesn’t sound like you know a ton about either one.\n\nGo ahead and take risks, but make them calculated risks."}, {"comment_author": "Blarghnog", "comment_text": "OP, I often tell people that business is gambling when you know you can win (rather than going to Vegas). Whatever motivates you is good, but regaling forums with I must escape or perish for once and all philosophies rarely leads to calculated success.\n\nWe are foxes who build clever things, wolves who hunt what is worth chasing, and honey badgers who will not be beaten and who win because they are too stubborn to lose. We are not escapists who found refuge from our lives in starting companies generally."}, {"comment_author": "Real_Project2563", "comment_text": "Spoiler: Outcome 2."}, {"comment_author": "guccivane", "comment_text": "1&2 combo"}, {"comment_author": "VintageWunmi", "comment_text": "We shall see"}, {"comment_author": "itsAkhilJain", "comment_text": "Good luck."}, {"comment_author": "cgylseth", "comment_text": "Focus on one business. The amount of time, effort and resources required to make it successful compared to the timelines and money you say you have available.\n\nHere’s a few additional thoughts to consider:\nA fashion brand requires testing designs, sampling different kinds of fabric, finding a manufacturer, etc, and it also does not become a brand until it’s well known. A different, yet more affordable approach could be\n1. Create a design in Canva (free)\n2. Set up a Shopify site ($1 first month)\n3. Upload the design to Printful and connect it to your site\n4. Order a shirt for yourself (about $20) and make videos talking about it or wearing it\n5. Upload videos to TokTok\n6. Add item to TikTok shop\n7. Promote on IG and TikTok every day\n8. Increase reach by getting friends and family to buy from you (or give them a shirt in exchange for them making a video)\n9. Rinse and repeat with new designs\n\nThis is an overly simplified overview. However, you can learn the steps required. You can also add paid marketing, though that should either wait until you have a few sales or you need to limit your budget to $200-$300, with about $20 per day, for testing so you don’t burn through your savings.\n\nTo start a salon is not within your budget as that requires a lease, equipment, hair products, and a number of other things. If you know how to do hair you may be able to rent a space within a salon, but unless you know how to get your own clients it can quickly cost more than what you make. Even if the salon brings you clients, expect a slow start as the clients don’t know you yet, so you’ll still need to find your own.\n\nIf your skills are in marketing, organizing, and/or management, and you have friends that are stylists, you could always ask if they want to open up something together with you and share the cost. Then together you can be creative in how you get set up, market yourselves, etc.\n\nIf you want a completely different suggestion, add to your revenue by for example cleaning peoples houses. Depending on where you live, one house could give you $250, and if you use their supplies it’s essentially free to start. You can always hire people as the business grows.\n\nBottom line is that there are options even with limited cash on hand. You just have to be smart about where you spend your time and money."}, {"comment_author": "jabyredd", "comment_text": "Thank you for your optimism and detail. Even though I'm not thinking of a fashion business, your thought process and sharing of available online tools gives meat to my stick figure type ideas."}, {"comment_author": "VintageWunmi", "comment_text": "Thanks for your tips. I love your them. My question is how sustainable is this kind of Tshirt business? I'm also checking the printfull site to see how it works"}, {"comment_author": "shane_sp", "comment_text": "I'm sorry they teach this shit in schools. \n\nI'm sorry that they let you believe that you can start a business on $2k.  Maybe there was a time when that possible, like back in the 1970s, but it's not possible anymore. I not trying to be rude or a dick or anything. It's just not realistic on $2k."}, {"comment_author": "Ordinary-Echidna-894", "comment_text": "Well, that’s not true lol.\n\nWould’ve costed you a ton more in 1970 to start a business because plug and play infrastructures and digital marketing didn’t exist.\n\nIt’s easier than ever to start a business, but also harder than ever to actually capture significant market share.\n\nI do agree that starting a business with 2k is a massive uphill battle tho."}, {"comment_author": "sidehustle2025", "comment_text": "I started an ecommerce business with $0. Literally. I made $500,000 in 3 years.\n\nYou can start a newsletter business with zero. Many make tens of thousand per month.\n\nRead The $100 Startup. Plenty of businesses you can start under $100.\n\nYou can start most online businesses with well under $2,000.\n\nDon't assume that just because you can't do it that others can't. They are already doing what you claim can't be done."}, {"comment_author": "shjandy", "comment_text": "Brother in christ wtf are you talking about?"}, {"comment_author": "shane_sp", "comment_text": "And doubly stupid when you're bordering on homelessness."}, {"comment_author": "brain_tank", "comment_text": "They're wisely telling someone on the verge of homeless not to YOLO their last dollars on two vague \"businesses\". $2k isn't enough for either."}, {"comment_author": "Wovasteen", "comment_text": "Could be if it's the right thing. Buy an ice from Walmart,  buy another from Aldi, mix em. Buy a stroller, cooler. Go sell ice cream, people love it. Boom 1-2 weeks. 148mill in revenue.  All from 2k"}, {"comment_author": "Ordinary-Echidna-894", "comment_text": "I like where your heads at, so buy my $1M/pm snowcone wholesaling course for just $297"}, {"comment_author": "Wovasteen", "comment_text": "Exactly.\n\nFrom seller who made 137Billion last month"}, {"comment_author": "Ordinary-Echidna-894", "comment_text": "I don’t need to sell a course, I just sell one because there’s no competition at the top yet (I tip my landlord 20% in gratuity every month)"}, {"comment_author": "Shazam-7778", "comment_text": "Best of luck to you!"}, {"comment_author": "VintageWunmi", "comment_text": "Thanks"}, {"comment_author": "fatWkanye", "comment_text": "Best of luck"}, {"comment_author": "VintageWunmi", "comment_text": "Thank you"}, {"comment_author": "OD8891", "comment_text": "I’d recommend speaking to a business coach asap before pursuing risking all your savings!"}, {"comment_author": "leoschen", "comment_text": "You can start on $0, what’s most important is that you have money coming in day 1… and it grows fast enough that you can take care of your bills by the time your savings are down to nothing. Not impossible, but very hard to accomplish. Sometimes hatred for a thing and being out on the streets is a strong enough motivator for some.. others, not so much…\n\nGiven your situation I would say that services business is probably your best bet. Or, gigs like as an Uber driver. Otherwise, you might as well be better off yolo’ing it all into the stock market."}, {"comment_author": "VintageWunmi", "comment_text": "Thanks. I don't know anything about stock market,would have loved to"}, {"comment_author": "CodeExtreme00", "comment_text": "Your courage and willingness to act is certainly appreciable.\n\n\n\nBut you are making big mistakes right from the start. Which one?\n\nIf you want to be an entrepreneur you have to be wise with the use of money. \n\nLiquidity is tight, and you already want to split it over two businesses? Each business is its own thing. If the budget is already low for one, what do you plan to do for two?\n\n\n\nYou are starting everything with a gambling approach but without planning.\n\nIn the business world planning and strategy is a MUST. If you want to increase your chances of success.\n\nOtherwise, if you have money to squander you may as well gamble. Your choices.\n\n\n\nA hair salon is a local business, usually has many fixed expenses.\n\nA clothing brand requires big budgets for marketing and Stock.\n\n\n\nPeople will buy primarily to improve themselves, then maybe for you.\n\nSo far you have given motivations that revolve around you and your girlfriend.\n\nYou need to create a business that revolves around the customer and their needs. Not your own.\n\n\n\nIn case you choose to pursue it and it goes wrong, remember that failure brings wealth. Which one? A luggage of information that will enable you to make more accurate choices in the future. Knowledge is the real wealth.\n\n\n\nThat's why I conclude by saying that, with a budget like that ONE of the best choices may be a VALID training course or coaching from someone who has experience in the field you want to pursue.\n\n\n\nGood luck."}, {"comment_author": "fortunate_son_1", "comment_text": "Good luck!"}, {"comment_author": "VintageWunmi", "comment_text": "Thanks"}, {"comment_author": "Last_Inspector2515", "comment_text": "Risk wisely, validate ideas, then scale. Good luck!"}, {"comment_author": "PM_ME_GOOD_WINES", "comment_text": "You gonna be homeless within the first month lmao"}, {"comment_author": "VintageWunmi", "comment_text": "Let's see"}, {"comment_author": "MasterpieceSuch6950", "comment_text": "I think you should not invest all of the money you have as you're playing a very risky gamble that will leave you homeless. Rather I'd recommend you start a service business and advertise it using ads as you have some money."}, {"comment_author": "sidehustle2025", "comment_text": "I give 90% chance to option 1.\n\nThis is no way to start a business."}, {"comment_author": "VintageWunmi", "comment_text": "Yea,I think it's more fun to me now since most people think option 1,thank God we are approaching summer,homelessness won't be too bad but not praying for such"}, {"comment_author": "sidehustle2025", "comment_text": "You're in for a big shock if you think taking the risk of becoming homeless is fun. It's pretty stupid."}, {"comment_author": "VintageWunmi", "comment_text": "Well I will try friends that I can sleep in thier sitting room"}, {"comment_author": "Sarvaturi", "comment_text": "Sometimes dividing our attention into several areas can dictate our failure. Why not focus on just one and put all your energy into it? I suggest you make a plan to avoid doing things randomly and measure specific results. This [Smart Planning Tool](https://plani.ai/) will help you. It gives you a highly personalized plan full of tips and strategies that you can adopt."}, {"comment_author": "WhisperingWoods2310", "comment_text": "Best of luck, hard work always pays off"}, {"comment_author": "VintageWunmi", "comment_text": "Yea,thank you"}, {"comment_author": "PowerUpBook", "comment_text": "Don’t spend your money!! Keep it in a high yield savings account. That is an emergency fund! \n\nI teach my community to start businesses for next to nothing that are low risk! \n\nStart online and build your business around your passion of hairstyling! You can monetize social media or sell digital products etc. \n\nJoin my free entrepreneur community (no paid courses) and we can help you get something going and grow it! \n\nLink is in my bio!"}]}, {"post_title": "Can you succeed by working smarter, not harder?", "post_url": "https://www.reddit.com/r/Entrepreneur/comments/1byepqi/can_you_succeed_by_working_smarter_not_harder/", "post_main_text": "I've always believed in focused, intentional work instead of outgrinding the competition and sacrificing your life. This is pushed by Cal Newport and Tim Ferriss's The 4-Hour Workweek. \n\nMy question to this community: Are there entrepreneurs out there who have found success without letting their work consume their life?\n\nI value my hobbies, relationships, and downtime too much to sacrifice them for success. Yet, it feels like most success stories in business preach the necessity of the grind.\n\nI'm looking stories from those who've launched something successful WHILE balancing life and work, and believe that it's not due to luck. Additionally, if there are public figures who preach similar philosophy and aren't full of shit, I'd love to hear about them too.", "post_comments": [{"comment_author": "Fit_Personality_2191", "comment_text": "Some people have found the book the 4 hour work week to be useful in order to reach precisely that."}, {"comment_author": "Derp_Animal", "comment_text": "All the *truly* successful people I know work like demons... until they no longer need to."}, {"comment_author": "-Woogity-", "comment_text": "Most people work hard. Most successful people work smart. \n\nI don’t know any super successful people, personally, that work harder than me or anyone I know that’s not successful. \n\nThe difference is usually *how* they work. This, sprinkled with chance and opportunity and nepotism."}, {"comment_author": "Echizen88", "comment_text": "Or you can do both. Then it’s really hard to beat."}, {"comment_author": "This-Prompt-9215", "comment_text": "Funny you say that because entrepreneurship is the area where neoptism is the least helpful. Is your comment stemming from experience as an entrepreneur?"}, {"comment_author": "-Woogity-", "comment_text": "Hence sprinkled. Lots of people are successful because of members of their family or connections their family has. At least in my experience. Most of the people I’ve grown up with and know in my life aren’t 100% self-made like the gurus want you to think to buy their courses."}, {"comment_author": "This-Prompt-9215", "comment_text": "Look no one can possibly be self-made. Everyone stands on the shoulder of giants. But someone increasing their wealth by one or two orders of magnitude would be considered pretty damn impressive and what people used to refer to as self-made until the recent campaigning against it. But I did have a question you didn't answer, is your comment stemming from your experience as an entrepreneur?"}, {"comment_author": "-Woogity-", "comment_text": "Your question doesn’t matter unfortunately. It changes nothing regardless what the answer is lmao. \n\nIf you want to argue, go for it, I don’t care. I know a LOT of people that are very successful and they tend to agree that they had a leg up over someone without the same level of connections or opportunities or both. \n\nThink what you want, my original answer stands as the reason entrepreneurs are successful is *how* they work. Of course they work hard. But so do *most* people.\n\nTo add to that, it’s not like there’s not a million variables and grey areas around a success story. Like you said 1-2 orders of magnitude increase to be considered success absolutely can be celebrated and is probably more attainable for most than making $100MM. There’s no one-size-fits-all approach. Some successful people absolutely did not work as hard as others and Vice Versa. No golden formula."}, {"comment_author": "This-Prompt-9215", "comment_text": "Hmm. So your comment rubbed me the wrong way but maybe I am being unfair. You did say sprinkled. \n\nI'm an immigrant so I'm confident 100% of my network advantage was an advantage that I made through competence and built on my own merits. We actually avoided leaning on any relationships and sold straight to strangers. Yeah there's chance and opportunity. But there's always chance and opportunity for everyone. A messaging on luck ignores the part where to be successful it's not that you have to be luckier, it's that you have to try more things until the dice rolls in your favor. Of course wealth helps with that. But an entrepreneur should be trying to reduce the cost of each experiment to maximize the number of experiments they can do. \n\nI guess the way you phrased it, I interpreted it as very r/antiwork. Which, well, if you have a resigned to fate attitude towards it then why the hell even bother with entrepreneurship? And while after re-reading I still think you're discounting the level of work it takes I have to admit that my first reply was biased by the general attitude in Reddit of \"no one can accomplish anything with hard work. It is all liars and con artists\" which encourages a defeatist attitude and undermines the part where business has many learnable skills."}, {"comment_author": "this_lizard_brain", "comment_text": "Yes, I dont understand this grind mentality.\n\nMy business requires a lot of creative energy at every level, if Im constantly 'doing', this leads to burnout.\n\nI can not solve complicated problems when Im burnt out.\n\nMy downtime is extremely valued.\n\nAnd - Life is short."}, {"comment_author": "AgentBD", "comment_text": "There are way too much comparisons that rely on absolutes like if that's how things work!\n\nThere's no such thing as \"letting their work consume their life\", that's a huge myth that only people who are NOT successful talk about.  \nThis fear does not exist when you have success because any successful entrepreneur got there by knowing how and when to delegate and build a team.\n\nSuccess = Money\n\nMoney = Can Afford to Hire People\n\nHire people = Buy Back Time\n\nBuy Back Time = Freedom to take time off and work as many hours as you want\n\n  \nThat's why am saying this crazy idea that being too busy is somehow a problem for successful people is just non-sense.\n\nWhat really happens is that you WANT to spend time on your business. You don't HAVE TO.\n\nThere is a big difference between wanting to do what we love because we want to... and having to do something out of necessity because we need to.\n\n  \nFor example I launched one successful SaaS so if I wanted I could work only 2 hours a day as my team can execute most of the work.\n\nBetter even I could just be travelling around the world every day and simply manage my team when they have questions by replying to them on my phone while I'm on the swimming pool in some sunny place drinking a cocktail.\n\nThe question is.. DO I WANT TO?\n\nNo.\n\nI rather be more involved and make sure my team performs better and better and keep growing the business.\n\nDo I have to keep growing the business?\n\nNo. I could just chill and keep the income levels at the same it is now and do nothing to increase them, just enough to maintain them.\n\nIt's all a choice.\n\nInstead what am I doing?\n\nLaunching a NEW STARTUP. At the same time as running my regular business.\n\nWhy? Because it's fun. Because I missed the excitement of starting from 0 a new venture. And  because I never documented the journey day by day, which I'm doing now. Every day documenting progress.\n\nFor fun. Because I like it.\n\nNot because I have to.\n\nIf someone lets their work ruin their life, that's on them, not because work ruined their life but because they were not organized enough, didn't establish boundaries, live above their possibilities, etc.\n\nThe only way work can consume your life is if you are DESPERATE to make money to pay your bills in the end of the month. Then sure, it's about survival.\n\nOnce you are no longer in survival mode and are making 10x more than you need to pay your bills... it becomes a choice."}, {"comment_author": "This-Prompt-9215", "comment_text": "Alternatively:\n\n>It's not easy to work here (when I interview people I tell them, “You can work long,  \nhard, or smart, but at Amazon.com you can't choose two out of three”), but we are  \nworking to build something important, something that matters to our customers,  \nsomething that we can all tell our grandchildren about. Such things aren't meant to be  \neasy. We are incredibly fortunate to have this group of dedicated employees whose  \nsacrifices and passion build Amazon.com. \n\n[https://media.corporate-ir.net/media\\_files/irol/97/97664/reports/Shareholderletter97.pdf](https://media.corporate-ir.net/media_files/irol/97/97664/reports/Shareholderletter97.pdf)\n\nA sustainable pace is necessary. But the balance you choose and what is ustainable for you is a function of your ambition."}, {"comment_author": "AnonJian", "comment_text": "Most successful people are smart -- they have to compete with other smart people -- therefore they work smarter and harder. \n\nGet onto the public assistance program of your country at your earliest convenience."}, {"comment_author": "Equivalent_Carob_395", "comment_text": "It's all about getting your priorities straight. People often say they tend to work harder, not because they're giving it their all but they're spending too much time on the non-essential activities, who they should be delegating to others. Only thing I really work extremely hard on is finding new clients (sales) cause if I didn't, it's gonna cost my entire business to fall."}, {"comment_author": "fortunate_son_1", "comment_text": "Working harder and smarter for a period will get you farther than either alone"}, {"comment_author": "PowerUpBook", "comment_text": "Yes. I have accomplished this. \n\nI invented a product, started and sold a company, outsourced as much as possible (yes I modeled it after the concepts in the 4 hour work week) disrupted a market, and sold it in a year without using paid ads.\n\nIt was hard. It cost me a ton of money. At first I took no profits. \n\nI balanced a career, wife and 3 children and made time for my favorite hobbies and friends. \n\nI also had to fight depression. Entrepreneurship is not for the feint of heart.\n\nThere are so many ways to work smart instead of hard."}, {"comment_author": "cAR15tel", "comment_text": "It’s the only way to succeed."}, {"comment_author": "hierosir", "comment_text": "Whenever I read questions like this I get a little confused.\n\nThere's too much undefined. What do you mean by succeed?\n\nFinancial earning power? How much is succeed?\n\nDoes financial stability + hobbies = succeed?\n\n---------\n\nYour earning potential (as a careerist or as a business owner) is pretty well governed by the opportunity vehicle you work on. Not how smart you work (which I take to mean efficiency.)\n\nHere's an example. A power washing specialist could work smarter and use chemical treatments to speed their cleaning. They could optimise their routes from job to job each day to get more done. Etc. that person will do better than the less efficient person who doesn't use chemicals and doesn't optimise their routes etc.\n\nBut they're never going to earn as much as the venture capitalist who stands to make $10m off a single transaction. Even if that transaction takes 2 years to close.\n\nAnd the smart working efficient venture capitalist will do better than the inefficient \"more hours\" worked venture capitalist.\n\nBut to maximize entirely, be efficient and working more will yield more. So out of these four options: smart cleaner, grind cleaner, smart VC, grind VC... The most financially well rewarded would be the smart & grinding vc?\n\nThe main bit of leverage isn't really efficient or inefficient working habits. But the opportunity vehicle.\n\nIt doesn't matter how hard you row, if your boat is a leaking and designed like crap.\n\nEdit: but all of this takes out an important piece. Often the only way to really learn to be efficient, and get good at things, and to learn what opportunity vehicles are good vs bad... It takes a lot of trial and error. Which is in its nature inefficient. So grinding through that is usually the only way. And the faster you get through that the better. Almost all successful people go through periods of life where they work like demons. There's value and a time in straight violence of work ethic. And a time to work smarter.\n\nIn recent few years I'm going to go ahead and classify myself as hyper successful. I grinded like a mother fucker for a very long time. 100+ hour weeks for years on end. And now I mostly do 50-60 hours a week with some fits and spurts where I do more."}, {"comment_author": "fatWkanye", "comment_text": "You can....but it's usually a 50 50 split."}, {"comment_author": "Important_Expert_806", "comment_text": "I think what tim is trying to get across is ability to know how to use your time. You can work hard but if they have small impact then it’s not really worth it. Tim’s advice that I love is that you don’t want to be busy. You want to work on things that will have a large impact not doing task that anyone else can do."}, {"comment_author": "Chaise_Renzy", "comment_text": "Absolutely. Do a lot, and then notice which actions produce the most money and best results. The needle movers. Then, hire people smarter than you."}, {"comment_author": "SnowflakeHater96", "comment_text": "Worker smarter not harder has always been my motto but I’ll tell you this to smarter you have to work harder period"}, {"comment_author": "sk8xnick", "comment_text": "Im 35 and all I can say is that number of work hours per day does not change the results. I was a 24/7 worker and 5 hrs 5 days a week worker in my projects. The only thing is when you start from scratch - working as much as you can is worth it as long as it is the work that brings the results. Later on - hire assistants and employees/contractors.."}, {"comment_author": "Sanjeevk93", "comment_text": "Absolutely! Working smarter, not harder, is a real path to success. Check out Gary Vaynerchuk - he advocates building a business you can run without sacrificing your well-being. There are many successful entrepreneurs who prioritize balance!"}, {"comment_author": "sidehustle2025", "comment_text": "Yes, of course you can. Many do it. But it doesn't mean being lazy. You still have to work."}, {"comment_author": "SunRev", "comment_text": "What is the probability that your competitor(s) is smarter than you? What do you need to do to beat them?  \n  \nWhat is the probability that your competitor(s) is harder working  than you? What do you need to do to beat them?"}, {"comment_author": "Real_Project2563", "comment_text": "No. Now get to work. Really."}]}, {"post_title": "Getting to the top on Product Hunt: Detailed and Honest Guide after 3 Failures", "post_url": "https://www.reddit.com/r/Entrepreneur/comments/1byuxal/getting_to_the_top_on_product_hunt_detailed_and/", "post_main_text": "On March 12, we launched Bluedot on Product Hunt, and won **Product of the Da**y 🥈 and P**roduct of the Week🥉**\n\nThis generated us **120+ signups, 3 annual and 6 monthly subscriptions** plus there is still traffic coming in.  \n**I think it would be important to know about our past experiences with PH launches.**  \n  \n1.We launched first time a small side-project (Twiso) in 2021.\n\nIt started at 8AM, and we didn't leave our desks until 3AM. Lots of cold outreach on LI/twitter. Lots of DMs to friends begging for upvotes. All we had was Product #6 for the first half of the day. We thought - \"maybe there is a chance to buy some upvotes?\". I started googling and found 2 guys on Fiverr who promised product #1 for $150, and this dude had over 100 reviews.\n\nIt was a no brainer - and we paid. And guess what? - We got the 1st Place.\n\n2. 6 months later we had a product revamp with new features, and it was time for a new launch. Having such a good experience with buying upvotes, we did it again. But this time we got banned, our upvotes got cut by half, and we went from product #2 to product #9. This is when we realised this shit won’t work anymore.\n\n3. Fast forward to 2023, we started working on the new product called Bluedot.  \nIt was time for a launch, and this time we did some preparation. Our network became bigger so we felt confident about our first 200-300 upvotes. We thought everything else we will get from the community. But we only got product #5. Organic upvotes where not enough for the win.\n\n4. And now it's March 2024, and we are Product of the Week.  \nWe spent 2 months preparing for this launch, and proud of our results. It brought us more traffic than we expected, and still people are signing up.\n\nI have created a complete breakdown of my process in a blog post titled [Getting to the top on Product Hunt: Personal Experience after 4 Failures.](https://www.indiehackers.com/post/getting-to-the-top-on-product-hunt-detailed-and-honest-guide-after-3-failures-60bba547c9)  \nIf you are an early-stage founder, this might be helpful.", "post_comments": [{"comment_author": "Justicekachi", "comment_text": "Big congratulations.. Going over to PH to add my vote too."}]}, {"post_title": "How to find a mentor?", "post_url": "https://www.reddit.com/r/Entrepreneur/comments/1byr8ld/how_to_find_a_mentor/", "post_main_text": "Hello everyone! I’m 19 and I’ve been trying to build a cleaning business for some time now. I can see ways to grow it, but I have concerns about this idea. That’s the reason I’m trying to start a business in some other areas.\n\nI want a business to utilise my skills and that would be enjoyable for me to spend a lot of time working on. But I feel like I lack a lot of experience to even understand what market needs at this moment and which areas are growing, how to utilise my skills while developing new company, etc. \n\nI tried looking online before, but the only posts, books and videos I see are from popularised category, so I’m avoiding them. With amount of this kind of content I just stopped looking online for answers to my questions.\n\nBut I just feel that without any information about this topic I’ll just have to fully rely on luck and big amounts of mistakes that come with experience. I really want to avoid solely relying on luck, if possible. I understand that it’s still gonna be a major part of success, but I want to minimise risks as much as possible.\n\nSo my question is, how do I find a person to learn from? I thought about finding a job and looking at how company grows and what methods they utilise, but the only kind of jobs I can get are part time positions. I’m physics major and I love physics, so changing major to business is option I would like to avoid. Maybe you could tell me a story of how you found your mentor or where you learned about business yourself? If you can give me some kind of advice on this topic, I would really appreciate it. Thank you!", "post_comments": [{"comment_author": "meah_probably", "comment_text": "I found my mentors through my jobs, some were bosses, some were clients, some were b2b partners. You cannot specifically look for a mentor, you must position yourself in such a way that you are surrounded by people better than you at what you want to achieve. \n\nI suggest you try to get a job in a startup as you wear a lot of hats working for a small company and learn a lot on the job. Mentors will eventually come but just as you want them to be interesting, they need to see something in you too before giving you any real guidance."}, {"comment_author": "zipzup1", "comment_text": "Thank you! Now that you mentioned it, I didn’t consider looking for start up at all, but it seems like a great idea honestly. I’ll definitely try this way"}, {"comment_author": "meah_probably", "comment_text": "U r welcome."}, {"comment_author": "Far-Potential3634", "comment_text": "There's a disciple of Dan Kennedy who did really well with a cleaning business, I don't remember his name. Kennedy is a master marketer.   With a little digging you could find the cleaning dude's products, books or whatever."}, {"comment_author": "Mr_Nice_", "comment_text": "The carpet cleaning guy?  I think he is called Joe Polish and has his own info products"}, {"comment_author": "Beginning-Sell7697", "comment_text": "read peter thiel, also books about selling without selling your soul, hyper-capitalize, rough times, but don't be hard on yourself overtly, brute force it, stand out and have good governance, thiel only wrote one book that i know of."}, {"comment_author": "thestevekaplan", "comment_text": "https://growthmentor.com I just joined the program. The mentorship is for the experience and to help people. Steve Kaplan AI happy to help."}, {"comment_author": "Sarvaturi", "comment_text": "Learning about the market you're in is one thing, having a mentor is another. You can benefit from both. To \"avoid mistakes\" as you say, you can talk to professionals in the field. Someone who also owns cleaning companies and can give you some insight. Prepare a set of specific questions, see who the people are, offer them lunch and in that conversation try to clarify everything you want and need. \n\nA mentor could also come from there. If it's a business mentor from outside the area, that's also possible and you'll find them in incubators, communities, etc. It's a constant search, it's unlikely that you'll find a \"one shot\" mentor. You have to be consistent in your search without losing focus on your business. I suggest you make a plan to do things logically and not do things randomly. This [Smart Planning Tool](https://plani.ai/) will give you a strategic plan full of tips and strategies that you can adopt in your business."}, {"comment_author": "FatefulDonkey", "comment_text": "What's wrong with part time? Why not do that and at the same time make your own business? Then you're both learning, getting cash, and possibly getting motivated not to work for others\n\nI'd say get a part time gig in a place that is successful"}, {"comment_author": "Next_Supermarket7310", "comment_text": "One trick I used to do get in touch with mentors are by directly contacting them on LinkedIn and telling them I want to write an article about the company and their founder on my blog. 7 out of 10 times it worked for me. I was to get in touch with ceo, co founder and keep in touch with them for suggestions and mentoring later"}]}, {"post_title": "Finding like minded people", "post_url": "https://www.reddit.com/r/Entrepreneur/comments/1bypu26/finding_like_minded_people/", "post_main_text": "Meet like minded business ppl\nCrypto, ecommerce, branding, marketing etc\n\nThe Goal is to build our own community to learn from each other\n\n\nWe are 215 members deep with safisticated channels dedicated to each type of business to educate each other\n\nIdk, maybe join and let's learn and build\nComment for the discord", "post_comments": [{"comment_author": "lavanteja11", "comment_text": "I would like to join"}, {"comment_author": "noBeansHere", "comment_text": "https://discord.com/invite/MvANYqmm\n\nCheck out our channels\n\nNo fee \nJust community"}, {"comment_author": "Same-Consequence888", "comment_text": "Can i join? Here’s my discord mateo462184"}, {"comment_author": "noBeansHere", "comment_text": "https://discord.com/invite/MvANYqmm\n\nCheck out our channels"}, {"comment_author": "RowSuspicious3789", "comment_text": "I would like to\nJoin"}, {"comment_author": "noBeansHere", "comment_text": "https://discord.com/invite/PgVsgMs4\n\nCome check ut"}, {"comment_author": "e-comfundamentalist", "comment_text": "I would like to join and try out."}, {"comment_author": "noBeansHere", "comment_text": "https://discord.com/invite/wRSrzSxS"}, {"comment_author": "Sarvaturi", "comment_text": "These communities are always very powerful. I myself am involved in one in my nationality with more than 250 people and always with high-resource sharing. For the community, I suggest this [Smart Planning Tool](https://plani.ai/) that helps entrepreneurs to get started, to do things logically to measure results instead of doing things randomly without a logical process. It makes highly personalized strategic plans for businesses and markets full of tips. It came up in the community I'm also involved in and I believe she'll help yours! Good luck to you."}, {"comment_author": "digitaldisgust", "comment_text": "Crypto? Already giving sketchy vibes lol"}]}, {"post_title": "Guys what should I do", "post_url": "https://www.reddit.com/r/Entrepreneur/comments/1byh8bp/guys_what_should_i_do/", "post_main_text": "I used to run a digital marketing and website dev company back in India. I am 23 and all the clients I bought into my company was through digital adds, I was doing good for a year until I was hacked (the hack happened through my laptop as all the saved passwords were saved in my laptop. All the website made by us was hacked all my clients social media and gmail accounts were hacked. I was ranking well on google which I am no more. My company website was hacked to. We fixed it multiple times but no luck the website was constantly getting sql injected. Within a period of a month all the hard work put in my company was gone I was burned up too. I was ashamed of myself letting this happen to my company and clients. Clients who put faith in me and believed me at last I broke them all. Some went with new agency some stuck with me till they understood I can’t do anything.\n\nSeeing this my parents made  decision to send me to Canada to study but I am not able to focus, I never thought when I was successfully running my company I had to go back to college again, I hate it now working a part time job, tried to start everything from scrap but I am not able to. I am lost, I went from feeling proud to living a life that don’t interest me. \n\nI am planning get into construction bizz by first becoming a carpenter but still again it’s a long journey. I am on my knees although I am financially stable but I am not in the mental state to build a company from scratch and learn all the in’s and out’s of this industry. \n\nMy question is should get into the construction bizz or go back to what I was doing. To be honest I am afraid to start again a dev agency because all the stuff that I faced and lost.", "post_comments": [{"comment_author": "wedoitlikethis", "comment_text": "You're obviously good at marketing, since you had customers. You should keep doing that. Just improve your skillset and keep working with computers. Don't do manual labor"}, {"comment_author": "No_Bite6283", "comment_text": "Thanks buddy"}, {"comment_author": "Topsocia", "comment_text": "Start again and 100x over if you have too. It's fine it's a minor setback and you area still very young. I believe you will be able to succeed again and again in this industry.\nYou have more experience and knowledge than anyone out there that wants to start from scratch.\nIt's only a matter of time plus dedication and focus.\nKeep your head up, it's part of the journey."}, {"comment_author": "No_Bite6283", "comment_text": "Thanks buddy"}, {"comment_author": "LostInLife8989", "comment_text": "Getting hacked is just a reality in the digital age. Hard to believe a single hacking experience makes you want to live a life you yourself say you hate rather than just starting a new agency?"}, {"comment_author": "No_Bite6283", "comment_text": "It was not getting hacked dude it was facing the clients who I had built good relations. Seeing them facing consequences because they chose me shattered me."}, {"comment_author": "SubliminalGlue", "comment_text": "Exactly . It’s good you feel this way. Do NOT start another agency . You are not ready. Go get an agency job."}, {"comment_author": "Culinaire_Life", "comment_text": "Ah ok, then you’re best getting and staying out of entrepreneurship. It’s nice that you feel that way but it doesn’t do anyone any good really and you’ll inevitably have to face similar situations as an entrepreneur unfortunately. It seems like it would be best for your own mental health to avoid it. \n\nMaybe can look into something like becoming a tax attorney or CPA where you’re always helping clients win. You’ll likely be much happier and saner, and hopefully that’s what we all want?"}, {"comment_author": "No_Bite6283", "comment_text": "You just slapped me with reality. Might be business is not for me and I should focus doing some regular job and live a life where I don’t face such things. Thank man"}, {"comment_author": "Proud-Ad-928", "comment_text": "Let me know if I be of any help since I am looking for work.lol"}, {"comment_author": "Real_Project2563", "comment_text": "If everybody quit when they failed, there would be no successful people in the world today.  \n  \nStart over the business that you were good at. Build it again, you have the know-how. Try to attract some of your old customers back. Learn from your mistakes."}, {"comment_author": "beenhavingmotionn", "comment_text": "You did it once, you can do it again. It’s just a L that you have to learn from, this was the first one of many and you can only learn from them and get farther every time you try again.\nExpect many losses in your path to become the person you always wanted, don’t give up.\nThis time you failed because you got hacked, okay so learn from this and next time make sure you have somebody working on the security of your website, SQL injections are old af and they shouldn’t be a problem anymore to anyone who knows a little bit about cybersecurity. Good luck!"}, {"comment_author": "No_Bite6283", "comment_text": "Thanks bud u hit the spot"}, {"comment_author": "leoschen", "comment_text": "Take some time to breathe and learn from your mistakes.. what could you have done better and why? What will you do better and how? Then pick yourself back up, and get back in there. You owe it to yourself."}, {"comment_author": "No_Bite6283", "comment_text": "Thanks for commenting bud means a lot to me"}, {"comment_author": "SuperDangerBro", "comment_text": "We might be able to help each other. Check dms"}, {"comment_author": "Itchy_Chemical_2430", "comment_text": "I'm sorry that you're going through this, hopefully it gets better for you.\n\nP.S - how do you get clients with ads?"}, {"comment_author": "andrewclone", "comment_text": "One Sunday, Thomas Edison’s lead assistant showed up to his house and explained that their factory was burning up. Everything they had worked for, decades of research, was burning to the ground. Edison grabbed his eldest son and told him “grab your mother and your sisters. We’re going to the factory. You’re never gonna see a fire with these beautiful colors ever again“.\nThey went and watched the fire. The next day, Edison and his team started rebuilding. If I’m not mistaken, they even had a record year that year.\n\nWhat happened to you was embarrassing and very unfortunate. But we learn more from our losses than our wins, even though these are the hardest lessons. \n\nThis may be your first loss, and it won’t be your last, regardless of which career you choose.\n\nA great book to help you get through this and understand what is happening and why it’s happening is a book called “the obstacle is the way”. That’s where I got the soliloquy about Thomas Edison.\n\nPick yourself up - get back to work, and do what you love. \n\nWishing you the very best,\nJust another entrepreneur."}, {"comment_author": "BookFinderBot", "comment_text": "**The Obstacle is the Way The Ancient Art of Turning Adversity to Advantage** by Ryan Holiday\n\n\n>OVER ONE MILLION COPIES SOLD #1 Wall Street Journal Bestseller 'Follow these precepts and you will revolutionize your life.' Steven Pressfield, author of The War of Art 'A book for the bedside of every future - and current - leader in the world.' - Robert Greene, author of The 48 Laws of Power The Obstacle is the Way has become a cult classic, beloved by men and women around the world who apply its wisdom to become more successful at whatever they do. The book's many fans include a former governor and movie star (Arnold Schwarzenegger), a hip hop icon (LL Cool J), an Irish tennis pro (James McGee), the World Number 1 golfer (Rory McIlroy) and the coaches and players of winning teams like English Rugby National Team, the New England Patriots, Seattle Seahawks and Chicago Cubs.\n>\n>The book draws its inspiration from stoicism, the ancient Greek philosophy of enduring pain or adversity with perseverance and resilience. Stoics focus on the things they can control, let go of everything else, and turn every new obstacle into an opportunity to get better, stronger, tougher. As Marcus Aurelius put it nearly 2000 years ago: \"The impediment to action advances action. What stands in the way becomes the way.\"\n>\n>Ryan Holiday shows us how some of the most successful people in history-from John D. Rockefeller to Amelia Earhart to Ulysses S. Grant to Steve Jobs-have applied stoicism to overcome difficult or even impossible situations. Their embrace of these principles ultimately mattered more than their natural intelligence, talents, or luck. If you're feeling frustrated, demoralized, or stuck in a rut, this book can help you turn your problems into your biggest advantages. And along the way it will inspire you with dozens of true stories of the greats from every age and era.\n\n\n*I'm a bot, built by your friendly reddit developers at* /r/ProgrammingPals. *Reply to any comment with /u/BookFinderBot - I'll reply with book information. Remove me from replies* [here](https://www.reddit.com/user/BookFinderBot/comments/1byh82p/remove_me_from_replies/). *If I have made a mistake, accept my apology.*"}, {"comment_author": "Ok_Rain_3161", "comment_text": "I am in the same boat. But in reverse. I want to open a Facebook page that navigates students from Bangladesh to study in the USA. But I don't know how to start properly. I had an account but my page was deleted accidentally. Seems this market is so saturated. Feeling depressed"}, {"comment_author": "Special_Beefsandwich", "comment_text": "Construction company, keep an open eye to opportunity and takes where it leads you instead of sitting still"}, {"comment_author": "Annimios", "comment_text": "Sorry you had to go though this, but what's holding you back?"}, {"comment_author": "ConstructionThick205", "comment_text": "can you elobaorate more on your path of getting into construction biz by joining first as a carpenter? what are your 5/10 year goals?\n\nhow much ARR were you earning on marketing and dev?\n\nwhats your major in canada?"}, {"comment_author": "ali-hussain", "comment_text": "To be honest you can still do the same business,  just start from scratch. It seems like you never had any good clients that allowed you to use poor practices. You should have never had client passwords. In addition, you should carry people insurances. Here's a list of the proper insurance to look into from my blog https://www.vixul.com/post/insurance-tech-services-companies\n\nTaking security seriously makes you come off as more professional. \n\nYou did it once, you can do it again."}, {"comment_author": "SubliminalGlue", "comment_text": "You sound like you scaled up way too fast. Listen I can’t do what everyone else here is doing. I’m a digital marketer and hearing  how badly those clients got ruined makes me think you may not need to be in charge of any clients.\n\nGo work at an agency. Get a boss and learn."}, {"comment_author": "airforcerawker", "comment_text": "Definitely get back on the horse and start over. \n\nAs others have mentioned you will fail time and time again. It's part of life in general. Not just entrepreneurship or anything specific. We fail as individuals, parents, spouses, friends, employees, etc...to fail is to be human. Resiliency is important! \n\nOther than mental and emotion barriers, what things will make it difficult for you to get back into the game? \n\nWhat are you studying in Canada? Is it related to digital experience or something different? \n\nDo your parents not believe in your ability to get started again or were they trying to help by trying to give you some sort of traction? \n\nGet back on the horse. You can do it! You know you can. You've already succeeded with it. You just have to get your mojo back. 💯"}, {"comment_author": "spezisadick999", "comment_text": "Don’t lose faith in yourself and what you enjoyed. Why not study cyber security so that in addition to web marketing services you can consult on online security in addition to securing your business better ?"}, {"comment_author": "SolidStateStreetWise", "comment_text": "You feel like this because you refuse to learn the real lessons that come from this experience. Stop being a boy dude. You’re an adult why you let your parents send you to college? You learned dev why not a way to mitigate these sql injections. Who was it that hacked you? Sue them or take matters into your your own hands. Stuff like that, man up and make beautiful websites!"}, {"comment_author": "TheSanscripter", "comment_text": "Here's a low-hanging fruit to get the ball rolling: create a course and an ebook on how to build an agency. That should get you somewhere to start building the stuff you care about again. I'd go as far to say that you might benefit from creating a YouTube channel to improve your authority on this subject."}, {"comment_author": "digitaldisgust", "comment_text": "If you cant handle that shit happens then just work for an agency. Seems like youre too emotional to handle this lol"}, {"comment_author": "sidehustle2025", "comment_text": "I would try to build a similar business again but make sure you have strong security. If you got clients once you should be able to get them again. Good luck."}, {"comment_author": "slackunnatural", "comment_text": "You should definitely start a second dev agency, with all the learning from your first.\n\nIf you don't mind -- Was all the client credentials in a spreadsheet or bookmarked in your browser? Were you on Windows?"}, {"comment_author": "Impossible-Barber470", "comment_text": "While it sounds like you're very good at digital marketing having established your own client base, you clearly have browsing habits that led to your work laptop getting infected, which spiralled into your laptop and clients getting hacked.\n\nAnd unless I've misunderstood you, you said something along the lines of you had all the passwords on the laptop which is asking for trouble - how strong were these passwords and why were they all stored on a single device?\n\nSince you mentioned web design I assume most of these hacked websites were WordPress?\n\nWhile it sucks that this happened to you, your laptop with all client data getting hacked is on you. Something you did via browsing, clicking an email link or downloading website plugins led to this breach and you should have had measures in place to protect a laptop with such important and sensitive information on it.\n\nYour approach next time should start with getting your cyber-security infrastructure in place for your laptop, your employees and your client's websites."}, {"comment_author": "ravi_arya009", "comment_text": "I started a web development agency but couldn't get enough clients because I'm noob in marketing. If you can get clients that means you know how to market your services. Fuck ups happen in business and life all the time. If I were you I'd start everything again because I can. Just make sure to increase your security, even basic steps makes attacker's job hard. Also, take lesson and strengthen other aspects of you business too so that you do not have to close everything just because of one incident. All the best."}, {"comment_author": "StrategySad6881", "comment_text": "I think you should focus on the fact that you had a profitable business at 23! You should be proud regardless of what you’re doing now. Moving forward you have 2 options:\n\n1. Reflect on how you could setup the business in a way that would make it very hard to hack. Then start a new dev agency in Canada \n\n2. Take time off, just be a student, and let your mind take its time to think of new entrepreneurial opportunities. Till then, stick with studies and part time jobs.\n\nOverall I would say don’t be afraid of starting again since you’re just 23! You already have entrepreneurial experience that most 30yo don’t have! Good luck"}, {"comment_author": "AlluriousVOLmoleCule", "comment_text": "Just ask your parents for some money"}, {"comment_author": "No_Bite6283", "comment_text": "What will I do with it bro? I don’t need much money to start again a dev agency. I earn good enough on the part time job to get my company going again."}, {"comment_author": "AlluriousVOLmoleCule", "comment_text": "If they can afford to send you abroad when plan A falls through, they can afford unlimited plan B’s."}]}, {"post_title": "Self-Made business owners , how did you start. I really want to make my own business but I never knew where to start", "post_url": "https://www.reddit.com/r/Entrepreneur/comments/1byom3g/selfmade_business_owners_how_did_you_start_i/", "post_main_text": "I’m in university right now and I really want to start making my own business . I never wanna quit university, I just want to have something on the side . I met some potential business partners but never knew where to start . I’m too scared to start as well as if like I can’t really do it . I need to hear your stories ", "post_comments": [{"comment_author": "Citrous_Oyster", "comment_text": "I was an Uber driver for 8 years. I started teaching myself web development in between passengers on a laptop in the front seat of my car. I learned from front end web developer bootcamps on udemy and then built websites as practice for like a year till I got the hang of it. Then I started calling up businesses and selling them websites. It’s been 6 years now. I work from home, have an SEO team, ads guys, designers, copywriters, etc and made a 6 figure business. I remember when I was $16k in credit card debt, living in my car in a Walmart parking lot. Now I have $20k in paid invoices in the last 30 days. It’s just been a whirlwind. I finally have everything I ever wanted. And I never have to do Uber again."}, {"comment_author": "bangfire", "comment_text": "Inspiring! What gave you the motivation to do something so drastic? Was it desperation that drive you into a do-or-die mind set? How can I awaken this mind set within me!"}, {"comment_author": "Citrous_Oyster", "comment_text": "I was a stay at home dad, wife was in the military and hated it, I had no career prospects, and hated working low hourly jobs or office jobs. I needed to do something for myself and after picking up all the programmers in Seattle I decided that that’s what I’m gonna do. And if I can’t make it work, then I’ll never be more than an Uber driver. I’ll never make more than I am now. And I’ll never be happy or fulfilled in what I do. There was no other option. It was either succeed or concede. I’m glad I never gave up."}, {"comment_author": "WorkRemote", "comment_text": "**craigslist** — In this context, it's sort of like the digital version of knocking on doors. Whether you're trying to start a landscaping business, web design business, or everything in-between, you can probably find someone that needs help with it on craigslist.\n\n**Handshakes** — If what you're trying to do applies to local businesses, you might consider calling, emailing, or actually meeting various business owners in-person to see if they have any interest in what you're offering. In the early years, I focused heavily on local businesses to get the ball rolling and it worked for me."}, {"comment_author": "sidehustle2025", "comment_text": "Just experiment with some side hustles. Don't overthink it. Just start. There are thousands of options. Just do a Google search and pick something that resonates with you."}, {"comment_author": "Sarvaturi", "comment_text": "We're all afraid (or have been). It's often said that \"everything you want is on the other side of fear\". The best way to get started is to think of a niche market, for example \"Backpacks for motorcyclists\"... Then understand what the public needs, what their needs are. Empathy interviews are good for understanding your audience's needs. That's first and foremost. Have a plan. A plan means that you don't just do things randomly, but that you do them logically and to measure results.  This [Smart Planning Tool](https://plani.ai/) will help you. It gives you a highly personalized plan full of tips and strategies that you can adopt."}, {"comment_author": "catyseventeen", "comment_text": "Remind Me! 4 hours"}, {"comment_author": "RemindMeBot", "comment_text": "I will be messaging you in 4 hours on [**2024-04-08 13:26:15 UTC**](http://www.wolframalpha.com/input/?i=2024-04-08%2013:26:15%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/Entrepreneur/comments/1byom3g/selfmade_business_owners_how_did_you_start_i/kylfst6/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2FEntrepreneur%2Fcomments%2F1byom3g%2Fselfmade_business_owners_how_did_you_start_i%2Fkylfst6%2F%5D%0A%0ARemindMe%21%202024-04-08%2013%3A26%3A15%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201byom3g)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|"}, {"comment_author": "TheSnortdog", "comment_text": "Just host some stable diffusion models on AWS and let users use them via a website for a monthly fee. It’s basically free money right now IMO. No idea how long the market for it will last though with how fast-paced AI is moving."}, {"comment_author": "GrindPilled", "comment_text": "Lol tell me you know nothing about 3d modeling without tellinng me you know nothing. Stable difusión or any ai 3d crap has a terrible topology that makes it unusable bruh"}]}, {"post_title": "This guy wants to find the right job for him and needs your suggestions", "post_url": "https://www.reddit.com/r/Entrepreneur/comments/1bys3ow/this_guy_wants_to_find_the_right_job_for_him_and/", "post_main_text": "I need suggestions for side-hustle type jobs that I can do as person with health issues that cause fatigue. Physically demanding jobs or those that require constant interaction with customers are off the table. The area where I live has a lot of tourism, some luxury tourism and spas, is near a lake and the mountains. The towns are small and so are most businesses. I speak two foreign languages that are in demand, am generally good with the internet and am flexible in my working hours.\n\nI'm not looking to make much money, or doing so consistently, but to make money in a way that's relatively well paid for the amount of time spent and doesn't require taking financial risks. \n\nAny suggestions?\n\n&#x200B;\n\n&#x200B;", "post_comments": [{"comment_author": "VeterinarianNo3903", "comment_text": "Website design is good and there are a ton of small businesses between social media sites that don’t have any"}, {"comment_author": "sidehustle2025", "comment_text": "They don't have any because they neither need them nor want them."}]}, {"post_title": "Sales Career", "post_url": "https://www.reddit.com/r/Entrepreneur/comments/1bys04r/sales_career/", "post_main_text": "Hey Guys,\n\nI’m currently 23 yrs old looking to transition from the logistics industry to remote sales. I’ve been listening to a lot of sales podcasts and YouTube videos while also researching some courses online.\n\nI’ve come across some online sales gurus, took calls with 5 different ones. The courses we discussed ranged from $97 all the way up to $20k. I noticed they all have the same process ( buy a course> sell the course to other warm leads with a 20% commission ), and if I can get a industry standard close rate of 20%  they’ll let me start closing for other business they’re connected with in different niches (fitness, Ecom, solar etc). \n\nThis seems like a pyramid scheme to me but at the same time it would be a good opportunity to get some sales experience before I start working a real sales job for local companies in my city\n\nDoes anyone have any thoughts on this? \n\nCheers", "post_comments": [{"comment_author": "CAWorldTraveller", "comment_text": "Almost all of “gurus” is all a scam. You either go learn it from someone for free (internship) or you learn as you go. Real gurus will have a scholar journal or publications."}, {"comment_author": "sicilia91", "comment_text": "Figure out what your preferred industry is, reach out to a few companies in your area and see if they’re hiring or will be interested in hiring you (ideally paid but I know how hard that might be so potentially unpaid). Work your ass off by learning from your colleagues and being a sponge by absorbing all of the knowledge you can. \n\nSales is all about confidence. Make sure you’re confident in yourself and you’ll be be fine."}]}, {"post_title": "How do I properly monetize my skill?", "post_url": "https://www.reddit.com/r/Entrepreneur/comments/1bymsft/how_do_i_properly_monetize_my_skill/", "post_main_text": "I'm really good at making organic short form videos for YouTube shorts/Instagram and I really want to turn it into a business. I've been helping some friends grow their accounts for free for about three years now, just for fun, and am ready to properly monetize this. \n\nFor some context I made a brand new Instagram about photography last week for fun and got it to 230,000 views and 1,000 followers in 6 days. Im not saying this to brag, just to show what I can do. \n\nMost people told me I should do a done-for-you type agency but I ran into one big issue, I'm only one person with a specific personality. So it would be extremely difficult to create for a host of brands and vary my style between them. Would there be a better way to do this?\n\nI've also heard of doing the consulting route, which most people ask for when they here what I can do, but the big issue with that is I'm 18 so most people write me off super quickly because I'm so young. \n\nWhat should I do? ", "post_comments": [{"comment_author": "MisterBilau", "comment_text": "You should be a youtuber / instagramer. Duh. That pays. If you can get those numbers, what are you doing here instead of just making content, getting millions of views, and making money that way?"}, {"comment_author": "cssblazer", "comment_text": "Can you elaborate on specific personality making it extremely difficult to create for a host of brands? Is this a hurdle for delivering content or is it a hurdle for working with different types? Depending on the answer to that there would be different options I would think."}, {"comment_author": "Connect_Tomato6303", "comment_text": "Mainly the hurdle of working with different types of brands, because I would assume it wouldn’t be good for a variety of brands to have the same “personality” "}, {"comment_author": "VforVenreddit", "comment_text": "What’s your hourly rate? I’ve been looking for someone to help with social accounts, if you’re open to figuring out strategies for app growth DM me"}, {"comment_author": "AriCatalyx", "comment_text": "My best advice is to just put something out there, see if anyone pays you, and iterate from there.\n\nIt seems counterintuitive, but with a new business, there are so many variables that you'll often learn faster just by trying something and iterating. This is coming from someone who likes to be super analytical and plan everything out.\n\nYou might find that these brands don't mind changing their corporate tone or voice. Or perhaps you'll find that there are some brands that you can't work with, but there are enough that you can.\n\nPlus, as you talk to potential customers or get paid your first few dollars by a new customer, you'll be able to find out new needs, since you're going to be close to their business. The client might even tell you their additional needs like \"Hey Mr. Tomato, you did a great job with X, but we're also struggling with Y, do you think you can help in this way\"?"}, {"comment_author": "realwealthyman", "comment_text": "Do for yourself what you have been doing for your friends. Results speak louder than what other people think. Stay consistent and give it time. \n\nNow... GET GOING!!😊"}]}, {"post_title": "I'm leaving my job as product designer to start my own business focused on SaaS product design", "post_url": "https://www.reddit.com/r/Entrepreneur/comments/1byv7ko/im_leaving_my_job_as_product_designer_to_start_my/", "post_main_text": "Hi everyone! I'm 22 and making a big move—I'm leaving my job as product designer to start my own business focused on SaaS product design. My goal is to create user-friendly interfaces that make SaaS products shine. But here’s where I need your insight:\r  \n\r  \nBuilding the Business: What are the first steps to structurally setting up a SaaS design studio? Any must-dos or pitfalls to avoid?\r  \nFinding Clients: How can I attract my first clients? If you have strategies or channels that worked well for you, I’d love to hear.\r  \nCreating Value: In your experience, what makes a SaaS design truly outstanding to clients?\r  \nI'm here to learn from the best - you! Any advice, big or small, would be incredibly appreciated as I embark on this journey. Thanks in advance for helping a dreamer out! 🚀", "post_comments": []}, {"post_title": "How to deal with a competitor", "post_url": "https://www.reddit.com/r/Entrepreneur/comments/1byv353/how_to_deal_with_a_competitor/", "post_main_text": "Hello, what are some things i can do to deal with a bigger competitor in my field? Move where it's not present....? ", "post_comments": [{"comment_author": "Guilty_Advantage_300", "comment_text": "You need an edge,use your brain "}]}, {"post_title": "Hop on a consultation call, get a free optimized blog article–no strings attached", "post_url": "https://www.reddit.com/r/Entrepreneur/comments/1byv1oh/hop_on_a_consultation_call_get_a_free_optimized/", "post_main_text": "Hello r/Entrepreneur community! I'm long overdue for some networking and I'd love to learn more about your businesses. That's why I'm throwing it back to 2018 (that's the last time I made this offer) and offering a free optimized blog article (750+ words, optimized for search engines, with images) to business operators who hop on a video call with me to talk strategy–no strings attached.\n\nBesides the networking aspect, I'm doing this to increase our portfolio size for different industries. We already work with clients in the financial, cannabis, and local services spaces (have case studies, currently working on publishing more).\n\nFeel free to send me a DM or [book a consultation](https://calendly.com/louis-joseph-levey/30min) if you're interested.  \nThis isn't a self-promotion as I'm not looking to make money.", "post_comments": []}, {"post_title": "Robert Kiyosaki's debt method", "post_url": "https://www.reddit.com/r/Entrepreneur/comments/1byusoe/robert_kiyosakis_debt_method/", "post_main_text": "Thoughts on Robert Kiyosaki's method of becoming rich by debt? ", "post_comments": [{"comment_author": "viknesh101", "comment_text": "I still have a doubt that he is legit or not?"}]}]