[{"post_title": "BEGINNER'S HUB - New to writing fantasy? Read this first!", "post_url": "https://www.reddit.com/r/fantasywriters/comments/19cyxbe/beginners_hub_new_to_writing_fantasy_read_this/", "post_main_text": "Hello, and welcome to r/FantasyWriters!\n\nAs the title suggests, this thread is aimed at those of you who are new to writing, or to the fantasy genre. Be sure to read the [Rules](https://www.reddit.com/r/fantasywriters/wiki/index/#wiki_rules_.26amp.3B_guidelines_for_writers_seeking_critiques) before submitting because we will remove any post that does not adhere to them.\n\nIf you are looking for a community that shares your love of the fantasy genre, where you can meet with like-minded writers of all skill levels, you can join our Discord at the following link: [https://discord.gg/yXYmFaUFb6](https://discord.gg/yXYmFaUFb6)\n\nYou may also wish to check out our Solstice 2023 writing contest. It's well under way, but hurry up! The deadline for this contest is February 3rd! You can read more [here](https://www.reddit.com/r/fantasywriters/comments/18nxvo8/official_december_solstice_2023_writing_contest/)\n\nNow that the housekeeping is done, we’ve set this post up so that you have a place to ask anything that is on your mind.\n\n# **Intermediates and experts!** Do you have wisdom to offer? Do you have experience that you feel may help new writers? Pop your head in and share it with us.\n\nWe like to encourage the use of Google Docs to share work on FantasyWriters. For those of you who are unsure how to use it, we have put together a [guide to using Google Docs](https://docs.google.com/document/d/1aZfWMJe07XQsNRXCd9m_wmwhBMrs6c0hPRExgnzJT3Q/edit?usp=sharing). \n\nIt is strongly recommended that you use Google Docs when sharing longer texts. \n\nTo begin with, we have dedicated a section of the Wiki for new authors, which you can find by clicking [here](https://www.reddit.com/r/fantasywriters/wiki/index/a\\_beginners\\_guide\\_to\\_writing\\_fantasy\\_fiction/#wiki\\_introduction)\n\nThis wiki entry will compile any and all information we encounter on this sub that can make your life easier, and we encourage you to check it out. Most importantly, the [FAQ](https://www.reddit.com/r/fantasywriters/wiki/index/a\\_beginners\\_guide\\_to\\_writing\\_fantasy\\_fiction/#wiki\\_frequently\\_asked\\_questions) section will collect all the questions this sub sees regularly, that otherwise relate to the fundamental aspects of writing fantasy.\n\nPlease browse the Beginner Hub for access to the [FantasyWriter's Big List](https://www.reddit.com/r/fantasywriters/wiki/index/a\\_beginners\\_guide\\_to\\_writing\\_fantasy\\_fiction/#wiki\\_the\\_fantasywriters\\_big\\_list)\n\n# r/FantasyWriters Beginner Friendly FAQ\n\n[Can I do X? Am I allowed to do Y? Is it okay to do Z?](https://www.reddit.com/r/fantasywriters/wiki/index/a_beginners_guide_to_writing_fantasy_fiction/#wiki_can_i_do_x.3F_am_i_allowed_to_do_y.3F_is_it_okay_to_do_z.3F)\n\n[Is my Idea interesting enough?](https://www.reddit.com/r/fantasywriters/wiki/index/a_beginners_guide_to_writing_fantasy_fiction/#wiki_is_my_idea_interesting_enough.3F)\n\n[Should I change my MC's name?](https://www.reddit.com/r/fantasywriters/wiki/index/a_beginners_guide_to_writing_fantasy_fiction/#wiki_should_i_change_my_mc.2019s_name.3F)\n\n[How do you come up with names for your characters?](https://www.reddit.com/r/fantasywriters/wiki/index/a\\_beginners\\_guide\\_to\\_writing\\_fantasy\\_fiction/#wiki\\_how\\_do\\_you\\_come\\_up\\_with\\_names\\_for\\_your\\_characters.3F])\n\n[Is X trope overdone/overused?](https://www.reddit.com/r/fantasywriters/wiki/index/a\\_beginners\\_guide\\_to\\_writing\\_fantasy\\_fiction/#wiki\\_is\\_x\\_trope\\_overdone.2Foverused.3F)\n\n[What tools and resources should I use?](https://www.reddit.com/r/fantasywriters/wiki/index/a_beginners_guide_to_writing_fantasy_fiction/#wiki_what_tools_and_resources_should_i_use.3F)\n\n[How/when do I actually start writing?](https://www.reddit.com/r/fantasywriters/wiki/index/a\\_beginners\\_guide\\_to\\_writing\\_fantasy\\_fiction/#wiki\\_how.2Fwhen\\_do\\_i\\_actually\\_start\\_writing.3F)\n\n[What is Worldbuilding Paralysis?](https://www.reddit.com/r/fantasywriters/wiki/index/a\\_beginners\\_guide\\_to\\_writing\\_fantasy\\_fiction/#wiki\\_what\\_is\\_worldbuilding\\_paralysis.3F)\n\n[How do you define your world for your reader?](https://www.reddit.com/r/fantasywriters/wiki/index/a\\_beginners\\_guide\\_to\\_writing\\_fantasy\\_fiction/#wiki\\_how\\_do\\_you\\_define\\_your\\_world\\_for\\_your\\_reader.3F)\n\n[What does it mean to 'find the right word'?](https://www.reddit.com/r/fantasywriters/wiki/index/a\\_beginners\\_guide\\_to\\_writing\\_fantasy\\_fiction/#wiki\\_what\\_does\\_it\\_mean\\_to\\_.27find\\_the\\_right\\_word.27.3F)\n\n[How long should my novel be?](https://www.reddit.com/r/fantasywriters/wiki/index/a_beginners_guide_to_writing_fantasy_fiction/#wiki_how_long_should_my_novel_be.3F)\n\n[How do I describe simple movements?](https://www.reddit.com/r/fantasywriters/wiki/index/a_beginners_guide_to_writing_fantasy_fiction/#wiki_how_do_i_describe_simple_movements.3F)\n\n[Is it better to write a standalone or a series?](https://www.reddit.com/r/fantasywriters/wiki/index/a_beginners_guide_to_writing_fantasy_fiction/#wiki_is_it_better_to_write_a_standalone_or_a_series.3F)\n\n[How do I create a language for my story?](https://www.reddit.com/r/fantasywriters/wiki/index/a\\_beginners\\_guide\\_to\\_writing\\_fantasy\\_fiction/#wiki\\_how\\_can\\_i\\_create\\_a\\_language\\_for\\_my\\_own\\_story.3F)\n\n[As a man, how do I write from a woman's POV? (And vice versa)](https://www.reddit.com/r/fantasywriters/wiki/index/a\\_beginners\\_guide\\_to\\_writing\\_fantasy\\_fiction/#wiki\\_how\\_can\\_i\\_create\\_a\\_language\\_for\\_my\\_own\\_story.3F)\n\nYou may not recognise a question of this nature when it occurs to you, and that’s fine too. Please be aware the question may be removed, and you may instead be redirected to a Beginner’s Hub thread. As far as you are able, if you are new to the sub or the genre, please search for these threads before posting.\n\nWriting fantasy fiction is a daunting prospect. Our aim is not to isolate you, but to make sure the information best able to help you is readily available and visible.\n\nHappy writing!", "post_comments": [{"comment_author": "prejackpot", "comment_text": "These are great resources! I'm also going to share my own post from last year on how to name characters by leveraging preexisting associations readers have with sounds:\nhttps://www.reddit.com/r/fantasywriters/comments/x5xj4j/naming_fantasy_characters/"}, {"comment_author": "FreakishPeach", "comment_text": "These seems like a great addition, thank you! I'll add it to the hub :)."}, {"comment_author": "prejackpot", "comment_text": "Thanks, hope folks find it helpful!"}, {"comment_author": "Foxblade", "comment_text": "This should probably even be stickied to the top of the subreddit if possible!"}, {"comment_author": "FreakishPeach", "comment_text": "We have a lot of posts that benefit from being stickied unfortunately. We are still trying to optimise the rotation up there :'D Though I do agree, in lieu of that we have this post scheduled once a week."}, {"comment_author": "corpseofhope", "comment_text": "Just starting to plan out what will be my first time attempting at write a book. Very glad I found this subreddit, thank you guys."}, {"comment_author": "PrometheusHasFallen", "comment_text": "Saving this post. Thank you!"}]}, {"post_title": "Official March Equinox 2024 Writing Contest", "post_url": "https://www.reddit.com/r/fantasywriters/comments/1binqpz/official_march_equinox_2024_writing_contest/", "post_main_text": "# [Submit Your Story Here](https://forms.gle/yaCQfTfktQYLZ9c5A)  \n**Deadline: 30 April 2024**\n\n***\n\nGood morning fantasy authors! I’ve got another fantasy authoring contest for you.\n\nThis is our second quarterly writing contest, which begins on each solstice and equinox. To check out the first contest, [here’s our winners announcement](https://www.reddit.com/r/fantasywriters/comments/1bftnf7/official_december_solstice_2023_writing_contest/)! A few minor adjustments have been made to the format and rules of the competition, which I’ll get to very soon. But first… the prompt!\n\n# Write a story about a “Sabotutor” (a Mentor who intentionally trains their student(s) incorrectly) whose scheme could be spoiled after their poor guidance leads to an unexpected discovery.\n\nAdditional Optional Prompts:\n\n- Include an animal companion. \n- Write a sentence at least five words long where every word starts with the same letter.\n- Make your POV character trip and fall.\n\n# Rules\n\nThere is a slight change here: **We are reducing the required word count to 2,000-3,000 words.** This is to make the contest easier for both the authors and judges to meet their deadlines. \n\n- The submission must be a Google Doc. 12pt Georgia, 1-inch margins, 1.5-spaced, left-aligned. The title should be in the center-top with the author's name directly below. No fancy type-setting embellishments. The only thing that should stand out is the content of your story. [Example.](https://i.imgur.com/2aPL5Ve.png)\n- Word count should be **between 2,000 and 3,000 words.**\n- The genre must be speculative fiction. (e.g., fantasy, sci-fi, magical realism, etc.)\n- Keep it PG-13. (e.g., no graphic descriptions of violence or sex, etc.)\n- **No plagiarism. No A.I.-generated content.** If found in violation of this rule, you will be immediately disqualified and banned from participating in future contests.\n\n# Your Rights\n\nAll submissions to this contest belong to their respective authors. You are free to share your story however you like whenever you like, before or after the submission deadline. We’re literally just a subreddit and will not be taking any action against you for distributing your story how you want to.\n\nWith that said, by submitting your story to our contest, you are giving us permission to also share, distribute, and judge the content, with all credit to you.\n\nYou also have the right to use your Reddit username or a pseudonym as the \"Author\" if you don’t want to share your real name on the anonymous internet.\n\n# Judging\n\nThis section will also be modified with a less strict rubric for judging. Rather than giving a numerical rating scale for each story’s concept, prose, plot, and characters, judges will instead choose their top four entries and be asked to give justifications. Again, this makes the judging process much simpler. \n\nIf you're interested in being judge (and you are not planning to participate) you must be a member of our [Discord server](https://discord.gg/7nu2Zz8StN), and you should DM me at @Page2000 with a request.\n\nLike last time, we will have a Reader’s Choice Thread. However, the comment section will be unlocked this time so that people can give comments/critiques on the stories they've read. I originally had the thread locked to enable more unbiased reads, but several participants from the previous contest asked if there could be a way to receive feedback, and this seemed like an obvious solution that would also encourage engagement. \n\nThe awards will be as follows:\n\n- First Place: A special yellow flair.\n- Reader’s Choice: A special green flair.\n- Runners-up (3): A special blue flair.\n\nIf the same author wins multiple awards, their flare color will be by order of the following priority: yellow, green, then blue. This goes without saying, but if you choose to participate in the competition, there is a chance you may not win anything at all. Please don’t take this too personally, and feel free to try next time!\n\nTimeline: (Subject to change)\n\n- 19 March 2024: Submissions Open\n- 30 April 2024: Submissions Close / Reader’s Choice Thread\n- 1 June 2024: Winners Announced\n- 20 June 2024: Next Contest Begins\n\n# [Submit Your Story Here](https://forms.gle/yaCQfTfktQYLZ9c5A)\n\nTo submit, you must include the following:\n\n1. Title of the story\n2. Your Reddit username\n3. A one-sentence blurb\n4. A Google Doc with your story\n\nTo share your Google Doc, press “Share” on the top right, under “General Access” select “Anyone with a link,” make sure the role is set to “Viewer,” and then press “Copy Link.” Paste the link into the submission form.\n\n***\n\nIf you haven't already, join our [official Discord server](https://discord.gg/7nu2Zz8StN) where you can participate in word sprints, find beta readers, and brainstorm ideas for your entries.\n\nI also apologize for the delayed activity and response from me over the past few months. Life has been a lot and my brain has been a little, so I'm pushing through the best I can. Thank you for your patience and enthusiasm, it's been super encouraging!\n\nHappy storytelling!", "post_comments": [{"comment_author": "KTLazarus", "comment_text": "2-3k words, huh? \n\nSo... you're saying I *shouldn't* accidentally write a 12,000 word novelette and hack'n'slash edit it down to size again?\n\nXD\n\nThanks Page!"}, {"comment_author": "upallday_allen", "comment_text": "Again? Oh no..."}, {"comment_author": "HitSquadOfGod", "comment_text": "I think you *should* if it makes something as good as that last one."}, {"comment_author": "sparklyspooky", "comment_text": "Whatever works, I loved yours."}, {"comment_author": "wholesomefantasy", "comment_text": "Lol, relatable. I chopped off about 3k something words for the last contest. \n\nOr you can capitalize by writing 12k words and hack'n'slashing them into six fabulous shorts. '*Writers hate them for this one neat trick!'*"}, {"comment_author": "KTLazarus", "comment_text": "aw, thank you"}, {"comment_author": "octogana", "comment_text": "Your username makes me happy"}, {"comment_author": "octogana", "comment_text": "Wooooo, round 2 y'all!! I have a busy spring ahead of me so I may just be a judge this time, but I'm so excited to see what everyone creates!"}, {"comment_author": "A_Random_Person9790", "comment_text": "I apologize in advance to the judges. Edit: Does it have to be 2,000-3,000 words, or can it be longer?"}, {"comment_author": "upallday_allen", "comment_text": "If it's not *too much* longer, I'll let it slide. (Shhh don't tell anyone)."}]}, {"post_title": "Give me your plot hook and I’ll rate it", "post_url": "https://www.reddit.com/r/fantasywriters/comments/1byhkgr/give_me_your_plot_hook_and_ill_rate_it/", "post_main_text": "I want to know what part of the plot and premise is meant to draw the reader in the most, whether it be a complex political intrigue or a one of a kind protagonist. I will then with my arbitrary and biased decision making give that hook a score based on my own personal tastes. Keep it concise but not too short, and make sure to tell me the genre and overall theme of the story. The more I know what you are going for the more accurately I can give a rating. \n\nAnd don’t worry if I give you a low score it’s just personal taste, the ", "post_comments": [{"comment_author": "cahir013", "comment_text": "**PREMISE:** Caide, a former war hero, must battle through his injury to stop the world from burning around him.\n\n**DESIGNING PRINCIPLE:** The story of how a man deals with the fallout of his heroism a decade after the war has been won.\n\n**BLURB:** *You never really consider how fragile you are until you're down to five fingers.* Caide, a crippled veteran, finally has enough gold to get himself a magical arm. Things go south, however, when his efforts at making himself whole again puts him in the path of a fire-starting demigod. Will he force himself to single-handedly face his problems? Or will he learn to let others lend him a hand? Friendships, the fate of a city, and Caide's left arm hang in the balance until he can come to terms with who he's meant to be."}, {"comment_author": "Princess_Juggs", "comment_text": "Gotta hand it to you, I think you know how to handle a good hook."}, {"comment_author": "Substantial_Laugh_45", "comment_text": "Love the reference to \"single-handedly\" after saying he only has five fingers, pretty funny. Great blurb, 5/7 would read"}, {"comment_author": "BackgroundEstate2629", "comment_text": "I like it. I like it a lot."}, {"comment_author": "Policlasto", "comment_text": "Someone read a little bit of john truby"}, {"comment_author": "Wihoka_THE_goose", "comment_text": "main guy just wants to drink, two angels stuck in his head force him to be a better person."}, {"comment_author": "StygianFuhrer", "comment_text": "Man just keeps reliving that 9th grade Pythagoras problem huh? 📐"}, {"comment_author": "Vanilla-Enthusiast", "comment_text": "I'd definitely read a story that are this confident in presenting itself"}, {"comment_author": "GroundbreakingYam236", "comment_text": "This sounds so good. I would read"}, {"comment_author": "Wihoka_THE_goose", "comment_text": "I can spell ;("}, {"comment_author": "Dr_Doodle_Phd", "comment_text": "A mad scientist devoted to making monsters to conquer the world suddenly dies, leaving behind his creations who now feel like they’ve lost their purpose in life. The people of the village want to exterminate them, believing them to be dangerous, mindless beasts. But one monster in particular believes that he and his fellows can evolve beyond their origins as evil minions, and integrate into human society. Making better lives for themselves. Obviously facing challenges and forming bonds along the way.\n\n\nThe genre is a slice of life comedy, with mild horror theming. The overall message being that it doesn’t matter where you came from or who made you, only you decide what your life is for. And you can make something beautiful with it."}, {"comment_author": "RobotCatCo", "comment_text": "I feel like this is missing some details that would really grab someone's attention.  For example, what kind of monster the MC is.  A cool or unique monster would help hook readers.   Also you mention bonds.  Does the MC form a bond with a human character?  If so I'd highly recommend putting it in your blurb, especially if its a deep bond.  Like a blood brother blond between a monster and a warrior or a romance between the MC and a human.  Or anything really that pops a bit more.\n\nAlso you mention the genre is a slice of life comedy, but nothing in your blurb really showcases that.  Like look at the Monster's Inc blurb:\n\n\"In order to power the city, monsters have to scare children so that they scream. However, the children are toxic to the monsters, and after a child gets through, two monsters realize things may not be what they think.\"\n\nThis tells the reader to expect a comedy and also a mystery.  Your blurb doesn't really tell the reader what kind of book they should be expecting."}, {"comment_author": "Not_a_vampiree", "comment_text": "Had me until you said slice of life comedy, the hook and the genre seem to be clashing a bit as the premise doesn’t sound all that funny or particularly endearing. 4/10"}, {"comment_author": "Famous_Plant_486", "comment_text": "Not OP, but this sounds lovely! Let me know if you decide to publish and want a reader :p"}, {"comment_author": "ThePhantomIronTroupe", "comment_text": "Huh caught my interest for sure!"}, {"comment_author": "Dr_Doodle_Phd", "comment_text": "I’m new to the whole blurb thing so this is actually really helpful!"}, {"comment_author": "Dr_Doodle_Phd", "comment_text": "Well the comedy would come from these frightening beasts made for battle trying to adapt to domestic situations and fit in with normal people. Maybe I could’ve done a better job of describing that though. My B"}, {"comment_author": "Dr_Doodle_Phd", "comment_text": "Thanks!"}, {"comment_author": "eldestreyne0901", "comment_text": "**Kingdom Come**\n\nGenre: mixed/unsure (draws from several such as steampunk, sci-fi, and ordinary western medieval.)\n\nGirl and her brother join an international organization that seeks to stabilize the planet (which is in imminent danger of falling apart) and quell rebellions. They and their team travel the world carrying out missions while coming closer to a dark secret."}, {"comment_author": "RobotCatCo", "comment_text": "Feels like you need to have something from your setting in our blurb.  Like an airship or something if they're travelling around the world to solve problems.\n\nAlso quelling rebellions is generally considered villain work in fantasy.  A huge number of fantasy protagonists start/join rebellions, so if that's the case you need to play up that aspect more.  Ie, they get called when a kingdom needs to put down a hero led rebellion.  That's just where my mind went when you mentioned that.   However if your story is different then you need a few more details in your blurb regarding what kind of adventures they're going to have."}, {"comment_author": "Not_a_vampiree", "comment_text": "Seems a bit uncoordinated but it’s definitely interesting so I would give it a 7/10"}, {"comment_author": "eldestreyne0901", "comment_text": "I wanted the “quelling rebellion” to develop into some conflicts later on. Thank you very much, I now know what I need to do. "}, {"comment_author": "T_Lawliet", "comment_text": "Annalise, the Chosen One, aims for no less than to banish evil across the continent! Of course, fighting righteous wars requires manpower, and resources. The city of Markway has both. But to take control of the city, she's going to have to get through her brother first.\n\nDareon is hardly a hero of prophecy. He's self-centered, irreverent and utterly ruthless. But he also loves his city, and he'll be damned if he'll let his sister drain its lifeblood through her Endless War. He will never back down. Not even in the face of destiny.\n\n\\*\\*\\*\n\nEssentially, a morally grey protagonist facing off against a morally white antagonist, both on opposite sides of a moral conflict with no clear answer. How many lives are you willing to throw away to save the world? There's magic, gunpowder, democratic golems and a whole lot of wine-tasting. You interested?"}, {"comment_author": "RobotCatCo", "comment_text": "Definitely interesting and well crafted blurb."}, {"comment_author": "dizzy_pandas5", "comment_text": "Omg, didn't expect to see my name scrolling through here (and spelled correctly?!) 😂 can't tell you the confidence boost I got living vicariously in your plot 🤣"}, {"comment_author": "Famous_Plant_486", "comment_text": "Not OP, but this sounds great! I love a good Chosen One. Let me know if you decide to publish and want a reader :D"}, {"comment_author": "T_Lawliet", "comment_text": "I think I wrote a chapter or two for this work a while back, actually!\n\n[Godstrike - Chapter One](https://docs.google.com/document/d/1trT3Up9KXOilr6uFK-6xiXzOmlgTN9vdoBgQNU0UjQo/edit)"}, {"comment_author": "Famous_Plant_486", "comment_text": "Thank you! I'll check this out soon"}, {"comment_author": "External-Presence204", "comment_text": "Genre is run-of-the-mill medieval fantasy. The two main themes are “power corrupts… or does it?” and “individualism vs. social conformity and cohesion.”\n\nIn a nutshell, “magic” is just another ability man has though, of course, those with more ability are still venerated for that. The most venerated are the battle mages who are force multipliers against the “demons” who periodically invade this world. They can draw additional power from the environment or even other living beings. The most reviled are those battle mages who can draw power not just from other beings, but from their blood. The trade-off is that this corrupts the mage’s mind and shortens his life. \n\nIn fact, this blood magic ability is so dangerous that children are tested for this ability from an early age and put to death if they exhibit it. Unless, of course, someone in power can game the system and make it look like the child has no such ability. Enter the protagonist who, during a battle gone horribly wrong, discovers that he is a blood mage. The shining beacon of might and honor is now the most feared being on the planet. Will he succumb to the madness? Will he be killed before he can? Will he continue to fight for the same things as before? Will those who gamed the system benefit or suffer from what they’ve unleashed?"}, {"comment_author": "RobotCatCo", "comment_text": "I think you can leave out the themes in your blurb, almost every other fantasy/sci fi book have these kind of themes so they're kind of expected for the genre.   I'd also avoid saying run-of-the-mill medieval fantasy.  Authors generally want to show that their world is unique in some way to entice readers, saying your world is run-of-the-mill is a huge turnoff for a lot of readers.\n\nAlso, don't start off with magic.  Majority of fantasy readers expect magic to be in their stories.   I'd instead start with your MC.  Give us a name.  Tell the reader why he's a beacon of might and honor for the humans.  Did he singlehandedly turn the tide against the invading demons?   Once you set him up in your first paragraph, then drop the hammer with the blood magic reveal and tell us how much he's fallen.   Maximus goes from General of the Roman Legions to a slave with his family crucified.   What does your MC lose when its revealed he's a blood mage?   Then tell the reader his options.  He could either live out the rest of his life an exile looking over his shoulders, or he can embrace the blood magic and hope to take revenge before he becomes a madman."}, {"comment_author": "External-Presence204", "comment_text": "Yeah, I’m just responding to OP’s prompt, not talking to an agent or publisher."}, {"comment_author": "MyLordHuzzah", "comment_text": "I feel like who you're responding to is just trying to offer sound advice. You knew the whole point of this post was to be judged, and so the other person responded with that context in mind. \n\nThe point being ..  if you were talking to a publisher, consider the aforementioned tips, which are very agreeable."}, {"comment_author": "Big-Commission-4911", "comment_text": "Aspiring celestial ecologist Felika Shain reaches adulthood, and thus she receives both the gift of magical abilities and the curse of required military service. She gets caught up in an effort to stop the 'leader' of the enemy race, Kalosmi, from creating a superweapon of unknown nature. After he succeeds, she follows him into his escape portal, which leads both of them far away from home into the Outlands. Despite being enemies, they must depend on each other in their quest to return home and Felika starts to question her deeply held racist beliefs. But little do they know that all their efforts are under the machinations of their own genes, which have been evolving against their personal wishes for over a billion years. Will they be able to overcome their own biology?"}, {"comment_author": "RobotCatCo", "comment_text": "Wait...is this about racist...genes?  Definitely peaked my interest.  I think you should condense the part before the portal.  The part about the MC coming of age and getting magic + military service is unnecessary.  In fact, I'd play up the racism more via more descriptive language (make the blurb from Felika's PoV) to make the 2nd part more effective."}, {"comment_author": "Big-Commission-4911", "comment_text": "Yes. It is LITERALLY about racist genes. Ok well not exaaaaactly. Basically, magic runs this ecosystem and is created by harvesting human wrath. So, the ecosystem has evolved to make humans racist so that they get all mad at each other (or at leas tthat is the local strategy used by the ecosystem where Felika lives). Humans evolutionarily benefit from this too, so their genes are \"in on it\" too. \n\n>The part about the MC coming of age and getting magic + military service is unnecessary. \n\nFelika very much so needs magic for this story. Military service isn't necessarily necesary but I need some way to get her involved with this campaign against Kalosmi. \n\n> I'd play up the racism more via more descriptive language (make the blurb from Felika's PoV) to make the 2nd part more effective.\n\nIndeed, this racism is the primary theme of the story. There is more to this arc that I haven't gotten into yet. Originally the story was going to be from racist Felika's POV all the way through, never giving her a change of heart. I was going to optimize the story to make her and her racism look good. But now I am giving her a change of heart, then a change of heart back to racism, then a final change of heart away from it.\n\n> I think you should condense the part before the portal.\n\nIndeed, the part before the portal is only the first act. Since you asked for the story's \"hook\" I figured I would stay towards the beginning."}, {"comment_author": "RobotCatCo", "comment_text": "I'm not saying you should get rid of it for your story.  I mean you don't need that info for your blurb/pitch.  The blurb doesn't need to start where your story starts (it should be close though).   \n\n\nThe coming of age/forced military service part might be the beginning of your story but it doesn't feel like it adds anything to your blurb pitch right now.  "}, {"comment_author": "Big-Commission-4911", "comment_text": "Oh I didn't know this was supposed to litterally be my blurb. I was just kinda yapping."}, {"comment_author": "_doomslug_", "comment_text": "A young girl discovers that during periods of intense emotion, she has the ability to create temporarily sentient shadows. Neglected and emotionally abused by her parents and overlooked at school, she doesn't have anyone to confide in. So when she creates a shadow creature so strong that it does not fade, but instead remains with her, she does't know what to do -- and it doesn't help that the creature finally offers the connection she so desperately craves."}, {"comment_author": "EllakeAuthor", "comment_text": "I'd read this. Love it."}, {"comment_author": "_doomslug_", "comment_text": "thank you. :)"}, {"comment_author": "november_raindeer", "comment_text": "I read first ”Give me your plot hole and I’ll rate it” and was like, this is going to be interesting"}, {"comment_author": "Norm_Bleac", "comment_text": "I read your comment first as 'Give me your plot hole and I'll fill it'"}, {"comment_author": "november_raindeer", "comment_text": "Please someone make that post"}, {"comment_author": "Measurement-Solid", "comment_text": "My story is a weird mix of Roman, Celtic, and Norse with the weapons, government, and how everything is styled. The story is a high fantasy epic that follows a man whose absolute first priority is his loyalty to his family, and how the kidnapping of his sisters followed by the loss of his twin leads him to make a deal with a demon to protect what's left of his family"}, {"comment_author": "Youareaharrywizard", "comment_text": "A rune arcanist keeping his sickly wife alive by the skin of her teeth works endlessly to find a solution to her illness. \n\nAfter commissioning several nonspecific runes for a wealthy archmage, he begins to suspect the archmage’s plans may not be as they were presented. He finds himself inadvertently in the midst of a conspiracy that not only threatens all that he holds dear, but also raises more questions about the magic that is so intrinsic to their world."}, {"comment_author": "blaze92x45", "comment_text": "Special forces team goes behind enemy lines to rescue a \"high value individual\" \n\nTurns out an eldrich God may be returning and our young team leader might be the key for that God returning to the mortal realms."}, {"comment_author": "RobotCatCo", "comment_text": "Feel like there's a bit of a disconnect between your two lines.  How is the high value individual related to the MC finding out he's the key to reviving the eldritch god?   Like, do they get to the target only to find out there's no target?  And its a trap just to use the MC as the key?  \n\nAlso now that the MC knows this is the case, what his he going to do?  A specific call to action let's readers know what kind of story beats they should expect, at least initially."}, {"comment_author": "blaze92x45", "comment_text": "The high value individual is a defector who has critical information. That information is that the orcs are in league with this eldrich God power in exchange for reviving it. \n\nMy main character unbeknownst to him contains the last shard of this eldrich God's soul bonded to his own (an unknown bloodline curse). \n\nI guess I left some stuff out though. \n\nThe story is set during a war (obviously) about two weeks prior all communications around the frontline ceased abruptly like someone flipped an off switch, satellite went offline radars malfunctioned and radios were nothing but static. \n\nThen a distress signal went out from another special force team came out from this area indicating they had a high value individual secured and they were needing extraction. This team is lead by our main characters (biological but not legal) father so he has some personal stake in the mission. The MC and his team are to go behind enemy lines extracte the HVI and other team if possible and report back what happened. \n\n\nAs they go further behind enemy lines they encounter more and more eldrich monsters and are actively hunted by an elite orc military unit. \n\n\nThe main character is plagued by nightmares of being devoured by various eldrich monsters under a \"dead sky\" which is related to this eldrich God. \n\n\nHopefully that all makes sense."}, {"comment_author": "RobotCatCo", "comment_text": "I think a lot of these details would help a lot in your summary.  Especially the complete communications blackout.  That's a interesting call to action for the MC and it provides a mystery for the reader to ponder.   Starting with that helps get someone reading your blurb more invested.   I don't think you need to reveal the MC is the key to the revival of the eldritch god unless you plan on using that as a call to action in your blurb.   Just the lines about his nightmares and maybe finding clues of a ritual would be enough."}, {"comment_author": "blaze92x45", "comment_text": "Yeah probably should have led in with that part.\n\nThe mc isn't going to figure out he is related to bring thing God back for a long time I kinda skipped ahead for context but his first pov is a reoccurring nightmare that I described. \n\nThroughout the story I'm going to have the readers believe the monsters and orcs are hunting the HVI. It's going to be a twist to reveal the MC is who they're really after."}, {"comment_author": "Ratat0sk42", "comment_text": "Full disclosure, I got the idea from an old Tumblr post that wormed its way into my head, I'm not even a tumblr user, one of my friends showed it to me like 3 years ago and I started writing in September. I've changed bits here and there, but the basic \"cowboy, thief, samurai and pirate team up\" premise is from there.\n\nA drunken cowboy, a British thief with a narcissism problem, a samurai with severe rage issues and an aged Jamaican pirate who's well past his prime are forcefully employed by the British East India company to stop a Chinese mercenary who's obsessed with finding an artifact that can bring the dead back to life (as zombieish creatures) under the user's control, to bring back his own family, killed by the British East India company.\n\nThe group have to navigate learning to work together, getting over their problems together, stopping the warlord, preventing the East India company from getting such a dangerous artifact either, and a host of other problems, all while stumbling, fighting and arguing their way through several locales including San Francisco, London and Cairo.\n\nIt's like a humourous adventure novel, hopefully with some heart. Some of my big inspirations are Indiana Jones and First Law, though I don't want to go quite as bleak as Abercrombie does."}, {"comment_author": "SebGM", "comment_text": "Genre: Medieval Fantasy (what I would like to coin as Revolutionary Fantasy)\n\nA former mercenary needs to save a friend from going to a prison camp that means certain death. He has become a PTSD riddled slob of a guy, violent and unclean, living off stolen loot from his dead general and former mentor. He is aided by his friends/comrades and a boy he took in as his perceived pathway to redemption.\n\nMagic is entirely gatekept by the nobility as a tool of oppression and superiority. The protagonist is rumored to be in knowledge of his former general's secrets that are a threat to the ruling classes and commoners aren't allowed to learn in any way. In a growing cast of new allies, small acts of defiance (befriending an enslaved, freeing him from prison, peasants who revolt against their liege and petty banditry) will grow into a revolution."}, {"comment_author": "ASellswordwithadog", "comment_text": "Sci-fi hero degraded into a villain over the course of the story in order to save a star spanning empire modeled after the Ancient Rome of earth. He starts as a simple legionnaire and gradually gains power and influence by navigating the cut throat politics of the Imperium, as well as conquering, or participating in the conquering of alien worlds. In the beginning the loss of life and oppression didn’t sit well with him. But he eventually unleashes massive death and destruction on the Imperiums own world with its own legions. Whole thing is told from the perspective of his daughter to an Imperial historian. Idk i don’t have anything written for it yet but a prologue 🤷🏼‍♂️"}, {"comment_author": "kjexclamation", "comment_text": "There’s this boy on a farm see…"}, {"comment_author": "Policlasto", "comment_text": "... and he is happy but the king of star-nosed moles decides to strike and destroy the farm..."}, {"comment_author": "LapHom", "comment_text": "In a world where light is given by a line of incandescence that traverses the sky, a herder with a passion for cartography is traveling far towards where the light emerges to feed her family's herd. In studying her surroundings and the sky, she is the first to realize the line appears to have an ever so slight arc, begging the question of if it converges somewhere. Around this time, an artisan has been having dreams of feeling beckoned towards the light, dreams that sound similar to those that led the small collection of clans to their new home over a century ago. Individually, these events may have been dismissed or put off, but at the meeting of clans it's decided to organize an expedition to see what can be found."}, {"comment_author": "CraZinventorIRL", "comment_text": "(set in 1979) Mark Estrada is a struggling grocery store attendant who's real dream is to be a professional artist but he just can't seem to catch a break. One night as he is walking home from work he encounters and is nearly eaten by an eldritch being, the Mantibek, but saved by a man named Sylwester Opiekun. Through a series of seemingly impossible events, Mark becomes the target for a cult that worships 'the thing in every mirror'. \n\nSylwester Opiekun is the self proclaimed \"Keeper of the Supernatural and Strange\", a magician both on stage and in the magical sense. He uses both to help anyone he can, human or not. He promises to help Mark to learn what the cult wants with him while also finding a cure for the slow acting Mantibek infection that will kill Mark if left unchecked. Very quickly, Mark is swept into a secret world of magic and the strange and he has to relearn how the world works while also navigating his growing romantic feelings toward his mysterious rescuer.\n\nHonestly, this one is still in early stages and I hadn't really thought about this, but I'd love to know what you think so far. My intended genres are urban fantasy and supernatural horror."}, {"comment_author": "RobotCatCo", "comment_text": "Setup kind of reminds me of Cirque The Freak.  I'm not a big fan of urban fantasy so its hard for me to critique the setup, but I think the framework can definitely work, and its different enough from the work I mentioned to not be an issue.  \n\nThe major thing that's missing from this blurb is some kind of agency for your MC.   Throughout your entire blurb Mark doesn't actually choose anything, everything happens to him and he's sort of just along for the ride.  I think what would interest me more is if you tie Mark's dream of being an artist with the curse.  Like, he made a pact (unknowingly because he doesn't think the supernatural is real) that marks him, so the curse will kill him eventually (or make him the vessel for the eldritch god or whatever), but in the meantime his artist skills become amazing and he's starts to get noticed (which is how the cultists find out about him).   So this creates a personal dilemma for the protagonist, he can fulfill his dream and end up in a horrible fate or live out the rest of his life amounting to nothing.\n\nI'd also tie his magic abilities to his art too, which doubles the complication because if he's cured he loses his connection with magic too.  Perhaps he thinks that if he is cured Sywester Opiekun would no longer be around because he'd be too busy saving other people, and if he's in love with him that'd really spice things up."}, {"comment_author": "Policlasto", "comment_text": "Seems pretty cool"}, {"comment_author": "Vexonte", "comment_text": "I have 2 that are being worked on when I get inspiration.\n\n1st is an iseaki protagonist larping as a white hat cowboy in a fantasy world that does everything it can to upset his moral compass. He also has the power of gun.\n\n2nd, Brother sister pair of sentient mimics quest to solve the murder of a harpy acts as a vehicle to explore the sociological and exotic implications of dozens of different races cohabitating with eachother in a city with 1920s technology."}, {"comment_author": "Winesday_addams", "comment_text": "I am not op but lmk if you need a beta reader for number 1 it sounds cool!!!"}, {"comment_author": "RobotCatCo", "comment_text": "These are definitely interesting hooks.  A big rough but you're off to a great start."}, {"comment_author": "Vexonte", "comment_text": "I'll get back to you when I finish the draft in 15 years."}, {"comment_author": "Winesday_addams", "comment_text": "Fair enough! Good luck to you!!"}, {"comment_author": "AndroidwithAnxiety", "comment_text": "Set in a high-fantasy world post reality altering apocalypse, a humble traveler pokes their nose into all sorts of business regardless of how unwise it is, and ends up in varying amounts of danger because of it. In fact, they seem particularly drawn to the more dangerous mysteries - especially ones connected to the pre-apocalypse world and what went wrong.... which they know a suspicious amount about, while knowing suspiciously little about the current state of things.\n\nThere's monsters, cryptic dreams, political maneuvering, double-crossing, a lot of skeletons under beds, and a whole lot of trying to survive hostile environments.\n\nThe genre is survival-mystery with touches of horror, and the theme is along the lines of letting go, acceptance, and learning how to live afterwards."}, {"comment_author": "tennysonpaints", "comment_text": "Very generic fantasy adventuring party story with some spins of familiar features. If I'm successful, one of those spins will break your heart, another will shatter it completely."}, {"comment_author": "Alarrian", "comment_text": "Set on a planet called Alarr, A talented but meek young girl goes on a quest for power to avenge her murdered family at the hands of a psychotic general and unite 2 rebel factions to take down an army ruled by a god who resides over an infinite source of power called the Godstream."}, {"comment_author": "AFKaptain", "comment_text": "***Answer Abyss***\n\nGenre: adventure fantasy\n\nThe story: After his banishment from the universe thousands of years ago, there are signs that Nihlrung, the Prince of Ashes' return is imminent, and with him the the dark tide of the Abyss. Although there are varying ideas about what needs to be done to prepare for his return, there are some who are aware that the deity Dinayru has been forging a \"weapon\" to destroy the Abyss... but not all who are aware of this oppose Nihlrung. Action must be taken, both to find this \"weapon\" and to prepare a world in conflict for a war greater than any seen in eons.\n\nThe hook: I'm aiming to appeal with my world-building (exploring places like the underground city of Ost Nuin and the Mad King Xeph's Puzzle Tower of Reva Tirazom, encountering peoples like the *kiruku* dwarves and their whalewolves in the far south, etc.), characters that feel human (capturing the little things like mannerisms and whatnot that make characters relatable, inspired by what Studio Ghibli accomplishes with their animations), and a plot that is constantly building toward satisfying payoffs (my natural habit is to come up with endings first and build everything else afterwards, so plot twists and conclusions should feel like all the pieces are there in the build-up).\n\nThe story might seem a tad generic in its premise (\"the Dark Lord is coming back and we need to find the one thing that can stop him\"), but twists and revelations abound that flesh out or straight up change the perception of the world and what is happening. Some of the biggest examples:\n\n* Dinayru isn't actually a deity; it is the collective consciousness of all of the aether in the universe, a collective desire to simply *exist*.\n* Nihlrung's goal is a bit deeper than simply destroying the universe. The Abyss revealed to him The Star as It Once Was, a paradoxical state of \"being-without-being\" before Dinayru's aether spread existence to every corner of the universe. There was no here or there, happiness or sadness, satisfaction or pain, purpose or irrelevance. Due to horrifying traumatic events, Nihlrung sought to wield the power of the Abyss to return the world to what it was (whether this goal is altruistic or selfish is the line he toes as a villain).\n* The \"weapon\" that Dinayru is forging is an individual, who is being filled with \"weaponized aether\" that will be used to destroy the Abyss once and for all. But who has this aether, and what it will do to them, begins in uncertainty.\n\nThe themes: There are many themes I look forward to exploring throughout the story, such as self-acceptance, necessary evil, sacrifice, change, etc. But the main theme that will become central to the story is a sort of \"giving up vs persisting\" examination of suicide; Nihlrung wants to effectively end the world as we know it to run from misery, while Shiya (a young *kiruku* dwarf boy who is one of the main characters) will represent persistence, innocent love, and the desire to preserve the good (even in the face of much loss, as Nihlrung attempts to break his spirit)."}, {"comment_author": "Slight-Ad-5442", "comment_text": "A boy who grew into a man who joined an ancient order of protectors only to realise too late that their past glories are behind them now wants to leave but tells himself he needs a reason. He is sent to escort a governor's daughter back to his city unaware that this awkward girl is spying for his group's enemies in return for them finding her missing sister. Awkward enough to believe seducing a man is the best way to learn the information needed, she might just become his reason to leave. At the same time, the sudden re-emergence of the mortal enemies of the ancient order on three fronts might just become his reason to stay. \n\nIt's a low fantasy with gunpowder and magic having faded to little more than fortune tellers thanks to a war 500 years ago between two powerful sorceresses."}, {"comment_author": "MaryKateHarmon", "comment_text": "Alien shapeshifting robot spy disguises as a fantasy/superhero police department's prototype robot detective in order to infiltrate the planet's intergalactic introduction in order to kidnap his planet's current leader and close assistants. The spy's master plans to then brainwash them to be under his control, have a war started between his people and the planet's people, then use the resulting confusion to have himself placed back into power.\n\nHowever, the spy starts caring about his coworkers."}, {"comment_author": "BakaDQ", "comment_text": "The world has gone through two crises, changing the way magic works, upsetting many powerful figures. Those born after the crisis have a chance to be \"blessed\", a tattoo-like mark indicating their potential. The old mages, infuriated, seek them to steal their powers, or just eliminate a possible threat to their ascension. Conflicts and cruelty are pretty common outside empires and kingdoms. \nThe protagonist, your \"average\" joe from Earth, is kidnapped (as he says) into this world after reading a book. It doesn't feel good when you wake up somewhere completely unknown, especially when you are hurt and someone tries to kill you for no apparent reason. Fortunately, magic is a thing now (even though most of his privileges have been stolen by the guy who attempted to kill him). Unfortunately, people don't like when you dabble in forbidden magic like Decay, Corruption, and other forms of interesting and fun magic. Why can't he have some fun discovering unknown forms of magic and obtaining awesome powers? Wasn't he kidnapped to this world for no reason? People are just too damn sensitive and selfish. \nIt's fantasy focused extremely on magic, with action and drama to complement. Inspiration mostly comes from works like Supreme Magus, Lord of Mysteries and Shadow Slave."}, {"comment_author": "Delicious-Chipmunk-7", "comment_text": "A girl reunites with her long lost surrogate family, only to discover the magical world she left had only succumbed to a post apocalypse and nothing is as she remembers. Now as she fights to protect her friends and family from a higher, more powerful entity, she comes down with a mysterious sickness.\n\nThis genre is like a dark/epic fantasy, coming of age kind of story."}, {"comment_author": "ThePhantomIronTroupe", "comment_text": "Oh boy how do I even phrase all this? \n\nGenre: uh Romantasy I guess is the word for this? portal Fantasy Romance?\n\nThe plot hook I guess is that the main protagonists knew each other in a past life and its why one desperately tries to find the other. Thing is they ended up in different worlds, the main hero Bruce is in a world much like ours and the reincarnation of his wife, Randi, is in a world very much not, dominated by dwarves and sorcery and all sorts of fun pre-modern weaponry. Randi has been devoted if not obsessively trying to find a way to bring Bruce to her world, and only successful when the goddess of death, who is a sucker for long lost loves, helps her. Reason being the goddess is also one of travel…and uh Bruce is hinted at trying to take his own life. When he is sorta right there in her domain if you will when the moon is full and the veil is thin between their worlds, she goes for it.\n\nThroughout the story its meant to reveal why Randi has such a vested interest in Bruce and why Bruce has such a hard time giving into his new life. For someone like him, who escaped into histories and fantasies to deal with the frustrations and lonliness he felt growing up, who was dealing with loss in his family with more on the way, it should be a dream come true. But he feels like he does not deserve it, that he is not worthy of a woman willing for years to reach out to what are ancient eldritch forces to find him again. For a decade straight Randi performed the same ceremony over and over in private only getting glimpses of who her husband in their past life got reincarnated as. To love him and only him no matter what he looked like now and be able to love her and live a happier life, even if its being outcasts with her and the rest of the cast. \n\nFor her, its because the gods seem to be cruel in making her an outcast in her new life. The ineligible heir to a major power, able to use two different magics in a time when its looked down upon, and with bittersweet memories of her past life that make people think she is a tad mad. For her, finding Bruce again is to right a wrong of the past and give them a brighter future. To live a life and have a family with the person she loved in her past life and finds out she still does in the next. Its supposed to really explore the concept of soulmates, the sorta lonliness you can feel knowing deep down you do have a specific one, and that romance can be timeless. \n\nWhile the story does focus on the romance and turbulence of navigating such feelings or adjusting to such a situation, do you love the person for who they were, who they are, or all of them, there is a bit more to it. For one its a way to sorta figure out the world in a less…intense?…format. If its a fantasy romance set in a few islands of an archipelago nation, it allows me to figure out the culture and language and politicking and martial and sacral and artisanal and…artistic aspects. \n\nThe world itself is a bit…insane to be blunt. The setting proper is their equivalent of the Isle of Man, in a region* a weird mix of the British Isles, Japanese Isles, and well Hyrule thinking about it.  Sorcery is divided among five generic elements: Greye, Redde, Blewe, Yelwe, and Grene. By specifically drawing and mixing together these generic elements within themselves, a Sorcerer will utilize a specific one, sometimes two. It could be the Might of the Rivers or Levins, or both! For the main heroine Randi she can utilize both the Mights of Lumen and Vapor. To some she is thus a beacon of light and can heal people. To others she is painted as a literal Dark Lord, who can emerge from shadows, send lurking in the night monsters after people, and melt her enemies’ faced off. \n\nI probably handled this all horribly and confusingly, but hopefully ya’ll enjoyed the wild ride"}, {"comment_author": "Ethrandira", "comment_text": "A school trip to a fantasy world goes wrong when Charles (MC) is separated from the rest of the class upon arrival, and finds himself hunted by the local dragon celebrity Lazaar and a much more ancient and powerful species.\n\nThe main thing I'm going for is world-building and sightseeing, but other themes such as sense of belonging and growing out of your shell also exists. Genre is portal fantasy with the main age group borderlining between MG and YA, but hopefully written so that adults of all ages can enjoy as well."}, {"comment_author": "Euroversett", "comment_text": "In a world with with low level magic and Napoleonic level of technology there's this Princess from one of the main powers/Kingdoms in the continent.\n\n\nThe Princess/MC has a incurable disease and is estimated to not have many more years left, at best 2, at worse 1.\n\n\nSo she decides to go in a 1 year trip through the continent passing as the daughter of a merchant. Her family, not having a political use for her agrees with it.\n\n\nShe brings her favorite Lady-in-Waiting with her and her mother sends their personal talented Priestess to the trip too, to continue the Princess' religious studies; and her brother the King sends their body-guards: a Knight of the King's Guard and the Princess' sworn shield; a loyal foreigner who's skilled in magic and guns; as well as a loyal female ex-pirate - she was pardoned - who would be able to follow and protect the Princess even in places men can't enter.\n\n\nNot knowing the Princess is dying soon, her companions follow her in their journey throughout the continent, meeting and interacting with every different people, culture and local problem possible, bonding along the way."}, {"comment_author": "RobotCatCo", "comment_text": "This sounds right up my alley.  I think you might want need give the princess a few potentially internal conflicts.  I can already see a few arising from the fact that she's hiding her condition from her companions.  She's basically lying to them and has to come clean, but she knows revealing the truth will destroy the group dynamic that has been built up.    Also maybe she there is some romantic development between her and one of her companions.  She does want to experience mutual love before she dies but feels its unfair to develop the relationship any further because she feels like she'd do them a great harm in doing so given her situation.  "}, {"comment_author": "dinopokemon", "comment_text": "After a war a soldier volunteers to help the losing side rebuild who has a new chief who has to learn the ropes"}, {"comment_author": "BackgroundEstate2629", "comment_text": "Is this contemporary or historical? I’m finding it interesting either way though."}, {"comment_author": "dinopokemon", "comment_text": "It’s fantasy but I’m inspired by post ww2 Japan"}, {"comment_author": "BackgroundEstate2629", "comment_text": "How far along are you? If you don’t mind me asking."}, {"comment_author": "dinopokemon", "comment_text": "I haven’t started I’m pretty new to writing so working on smaller projects before I start novel"}, {"comment_author": "HopefulSprinkles6361", "comment_text": "Genre is Medieval Fantasy but no humans, elves, other stuff. Overall theme is about greed and how freedom and prosperity is often achieved at the expense of others.\n\nThe Pirates of Liora had been plundering ships for years. That is until one day, when a group of pirates plundered a treasure fleet heading to a dragon king. Now a new order has been created. The Knights Thalassen have only one mission, to fight the pirates. Now our plucky young protagonist Korli must survive this new order of knights as she begins her career as a pirate."}, {"comment_author": "BackgroundEstate2629", "comment_text": "I like it. Weird question. Have you or are you planning to read certain books to help with exposure to pirate lore and stories? I am planning a pirates themed book after this one I’m writing and not sure where to start."}, {"comment_author": "HopefulSprinkles6361", "comment_text": "So the pirates I have in mind are inspired by the Victual Brothers. There’s not a lot of stories with pirates like that so I am looking into history.\n\nThere is a pirate AU fanfiction that I plan to read. There’s also some movies and TV shows on my list. All of them are Golden Age Carribean Pirates but I’m looking for variety in tones so I can figure out what works and what doesn’t. Also funnily enough Assassin’s Creed 4 Black Flag and Sid Meier’s Pirates are places where I am drawing inspirations from.\n\nI’m sure there might be stories about Wakko Pirates or Madagascar Pirates. I haven’t found those stories yet.\n\nMy best recommendation for deciding where to start. Determine the setting itself and what brand of pirates you want. Also determine what the opposition is even if it’s supernatural. After that, figure out the work culture on the ship. That will determine how the main characters interact with each other."}, {"comment_author": "MachineGreene98", "comment_text": "My main character is a prince, who is accused of a crime he didn't commit, is sent away for a while.  When he returns he has to fight the war that started in the wake of his supposed crime and confront the ancient evil that started it to begin with."}, {"comment_author": "Sad-Perspective4702", "comment_text": "For eons, a society called the Aestora have silently observed the universe, traveling to every habitable world on the backs of their Ord: great space-beasts capable of leaping across the cosmos. \n\nTheir primary charge: “To know the heavens.” Anti-interventionist by creed, they hide away in their observatories and peacefully document their findings - until their leader makes a discovery that may threaten the existence of the Aestora. \n\nNow, he faces an impossible decision: adhere to their tradition of passivity, or forever alter the landscape of the galaxy?"}, {"comment_author": "TradCath_Writer", "comment_text": "The life of a simple farmer is changed forever when one of his closest friends is murdered in the farmer's home village. In spite of his best efforts to bring the killer to justice, his own childhood friend betrays him in an attempt to gain favor with a conspiracy that threatens to overthrow the king. He vows to exact his revenge, but he is convinced by a mysterious spirit to put aside his personal grudges for a greater cause. He is nudged along by this divine intervention to endure many trials and tribulations in his world travels to gather allies, and find the truth. All this so he may save his country, and be reunited with his weeping mother, his only surviving relative.\n\nThe genre is traditional fantasy. There are multiple themes explored in the story. The biggest ones are of humility and mercy. It emphasizes the importance of forgiveness, but also in standing up for the truth. It shows that humility is the foundation to all virtue."}, {"comment_author": "TreeStoneWriter13", "comment_text": "An epic, high fantasy series involving powerful monsters, gods, and a complex magic system that requires the user to understand themselves. \n\nThe primordial mother god of the world has died beneath the greed of humans, leaving her as a wandering soul. With her existence waning rapidly, she calls upon anyone who can see her and begs for their aid. But how can someone save their world from the implacable father god if they cannot even save themselves? \n\nFollow any group of reluctantly chosen ‘heroes’ as they seek self actualization, fight against powerful foes and natural forces, and struggle against their own mental health. Human or not, no one person can support the weight of the world upon their shoulders. No matter how strong they may seem…\n\n(I apologize in advance for my childish blurb.)"}, {"comment_author": "PigPriestDoesThings", "comment_text": "Prodigy sorcerer grew up insanely powerful and now that he is a full commissioned sorcerer he is very emotionless and doesn't understand people well, he gets a mission to capture a rogue that traveled into another dimension illegally, and after confrontation he realized he couldn't leave that dimension, and so they end up needing to work together. The story starts at just before he leaves for his mission and it's really a story exploring these two characters, one being very emotionless and logical, while the other allows emotion to control him and also they are fighting against the MC's old organization because they broke the rules."}, {"comment_author": "AGuyLikeThat", "comment_text": "The Tower in the Tangle - Dark Fantasy\n\nGilander, the milk-soft son of a cruel nobleman, finds himself banished to the frontier colonies, where blood and treachery leads him to the gallows.\n\nFreed and recruited by a mysterious man known only as the Warden, Gil joins a gang of criminals on a journey into an everchanging forest at the edge of the known world.\n\nIn search of his heritage, in hope of redemption, can Gil find a place among these desperate outlaws?\n\nDeep in the Tangle, an ancient power waits."}, {"comment_author": "FleshCosmicWater", "comment_text": "My main cast are ultra rich and powerful people that belong to the Elite class while my main villains are all poor people. Basically what if the underdogs are villains and the heroes are overpowered beings. The villains fight using underhanded techniques while the heroes fight using proper tactics and strategies. My villains have plot armour while my heroes don't have one. This is a story where the people who belong to the higher class and are superior in terms of physical strength, magical prowess, connections, resources and privileges while the underdog villains are very poor but have very high amount of luck. My heroes symbolizes traditions, authority, religion, egalitarianism and nobles while my villains symbolizes anarchy, gullible peoples, violence and everything wrong with society.\n\nMy first chapter describes my main protagonist who beats the generic 5 man band anime party with ease cause my main protagonist doesn't monologue, doesn't explain their powers, doesn't wait like in RPG games and always go 100% even against weak opponents."}, {"comment_author": "MillieBirdie", "comment_text": "A gunslinging holy knight from a weird west world is flung to a fantasy world, which is actually where she was born, and must track down the cult that sent her here before they can unleash a terrible plague on this world."}, {"comment_author": "NotAudreyHepburn", "comment_text": "A socially awkward arrogant teenager gets reincarnated as a tribal woman from a peripheral land in a time of modernizing empires. Unfortunately for him, the tribal woman isn't dead either, and she wants her body back. The two have to work together to navigate their new reality as Imperial subjects, confronting questions of identity, modernity, and making social change."}, {"comment_author": "RobotCatCo", "comment_text": "This setup feels like it works better as a comedy.  It's one thing to have a man reincarnate into a women's body, but to have the original owner still be fighting for control just sounds like it'll lead to a bunch of wacky situations.  Like if they're both straight, relationships with others characters would be awkward as hell.  Even if he's gay that would still lead to a bunch of awkward scenarios when they're basically sharing a guy in bed.\n\n\nLike I've only seen this setup used in comedy before so I'm wondering how you are planning to deal with these issues."}, {"comment_author": "AverageLiberalJoe", "comment_text": "A young princess of a hermit Kingdom is trying to discover the mystery behind the assasination attempt of her father which leads unfolds in to a larger conspiracy concerning the cause of the recent apocalypse, the origins of magic, and the thousand year absence of the one true God."}, {"comment_author": "StygianFuhrer", "comment_text": "MC is descended from Satan-equivalent who was actually the one who created humans. Satan changes his mind as they are on the brink of an ‘Industrial Revolution’-equivalent (spacefaring), realising they are destined to destroy the stars themselves and the End of Days looms as Satan sets out to undo his work and destroy humanity. MC battles to finally destroy Satan and in doing so unlocks the secrets of space travel, and as the centuries turn, realises Satan has a point. MC now must destroy humanity before they destroy the universe."}, {"comment_author": "GeoffreyEditsFiction", "comment_text": "MC a porter for a trading house in a fantasy city state newly formed. He is selected, despite his desire to settle down, to accompany a diplomatic delegation across war-torn non-human lands to return a heiress and her party to their final destination. \n\nThe heiress is based around the Mary Sue female heroine trope with a fawning gaggle of unnaturally attractive men plucked straight out of a wattpad fantasy.\n\nThere is magic in this universe but it's barely understood by its practitioners as it acts more like a living part of nature rather than something understandable. Part of the reason the MC is selected cause the mentor of the classic Mary sue party recognised the MC genetic ability to see magic. The MC had no special powers he has this power so it's easier for me to describe when magic is being flung around.\n\nMC leads the caravan with a co-worker, another citystate citizen named Hair (he is completely hairless). They have to lead a wagon loaded with provisions and expensive diplomatic gifts behind the heroines party. They face all different sorts of adversities, bandits, desperate refugees, and marauding cultists (leftovers from a holy genocidal war led by a non human race)\n\nMc deals with the awkward 'co-workers that don't get on well' relationship with his fellow porter. And a demanding and blame throwing boss of one of the heiresses love triangle sycophants. \nAfter a particularly determined attack from a mad wizard lord. The caravan is split up and the vaunted untouchable Mary sue is stuck with the two common porters who all barely survive escaping their pursuer after her head as a rallying cry for a follow up genocidal war.\n\nSome of the themes are the perspective of the common man of the world, not a leader, not a hero, just a traveller. Also there are themes of devastation and the unstable feeling during the clean up of a major disaster. I.e mass famine, poverty, lack of required resources. (For example the city state lacks the equipment to make and press coinage so they use tokens of promise and an elementary credit system giving physical coins a high value.)\n\n\nIt's mostly planning but there's a shit ton of world building and context you'll need to understand this."}, {"comment_author": "NinjaEagle210", "comment_text": "**The Legacy of Aubrey Saylem**. This story is set across multiple parts, each following a different protagonist with the same name, who are part of the same bloodline. In this world, those who can use magic/alchemy have a rune-like birthmark on their body. Magic users can change the properties of anything they touch, and can even slightly alter or power up whichever body part their birthmark is on. Despite that, their mark can also serve as a weak point. Most magic users in the country, despite being open about using magic or being marked, tend to wear clothes that hide the location of their mark, seeing it as revealing a weakness or showing all your cards.\n\nPart one: Aubrey Saylem I, who has a magical birthmark on his face. As such, he is confident and doesn’t care about appearances, and has lived a quiet life. But one day, he gets swept up into taking down crime leaders who use alchemy for evil.\n\nPart two: Aubrey Saylem II, who has a mark on his chest, is the son of Aubrey. He is an incredibly intelligent prodigy scholar learning how to master alchemy, practicing by hunting for ancient artifacts. He is very reserved and secretive. While studying alchemy, he learns how to open up to others about where his mark, or weak point, is, and about having pride in being transgender.\n\nPart three: Aubrey Saylem III, who goes by Toby, is the daughter of Junior. She is a newly graduated doctor who uses her incredibly powerful magic to heal those in need. She is extremely unwavering in her beliefs, to not harm others with alchemy, and to help anyone regardless of how evil they may be. As she journeys on, her stubborn beliefs get challenged over and over. All the while, she helps explore the new continent, including its flora, fauna, and the remnants of bygone explorers."}, {"comment_author": "Pine_Lemon", "comment_text": "Rowena, a sister of the covent devoted to the Angel, is dreading the day she must take her vows to become a priestess and swear her life to the goddess. However, shortly before the ritual, she is chosen to be the Champion of a Harbinger, one of the creatures that gives the world magic. \n\nShe goes on the run as phantoms, undead monsters, slaughter her monastery, and she joins the other Champions in their battle against the monsters to avenge her sisters and defend the land. Throughout the story, it is revealed that the phantoms were created by a vengeful sorceress, and Rowena has the chance to save a corrupted prince, who was manipulated into joining the sorceress in her evil schemes. \n\nYeah, there's a bit more going on, but that's the jist :)"}, {"comment_author": "Uberbuttons", "comment_text": "A confusing and disorienting achronological journey of 3 adventurers set out to Restore the Usurped Throne, featuring a young wizard who is a Prince and heir who wants to infiltrate the walled kingdom and confront his aunt who killed his parents with his hired escapologist/body guard and elf companion, along with a playful, but wise hobbit bard. The 3 endure danger, loss, madness, frustration, terror, and despair as they trek through a complicated and confusing labyrinth, possibly even losing themselves along the way. Will they restore the throne? It may take much longer than any of them anticipated, and the outcome is far from what they expected. \n\nJoin your three adventuring friends in a contradictory and baffling 5 Act  story of love, terror, friendship, tragedy, comedy, betrayal, and mystery."}, {"comment_author": "Illustrious-Camel432", "comment_text": "A woman constantly can see spirits in her peripheral vision and shares this secret with no one. A man who falls in love with her notices her seeing something and begins to question her about it. Her powers grow stronger and she starts to astral project in her dreams and sees spirits and demons in her full vision and learns how to experience it without anxiety attacks. \nIs her gift a mental illness or real? You decide."}, {"comment_author": "MarsFromSaturn", "comment_text": "A priest from a religion of music is tasked with finding the latest reincarnation of their holy leader (think Dalai Lama), and to return him to the City of Songs. When the priest finds the child, he discovers a girl, the first female incarnation in the lineage. He must convince her family to let her go, and convince his brothers she is the rightful heir to the religion.\n\nArabic High Fantasy"}, {"comment_author": "Unlucky-Reward-5381", "comment_text": "A young troublemaker, Laras, is forcefully apprenticed to a Raider, an organization of men that polices the Caebol, sorcerers who are on probation after crimes committed long ago. Magic is tracked by it's faint scent it leaves behind, detectable only to highly trained Raiders. When a horrific mass murder is committed, within the light of day, Laras's master must train him quickly, because the murderer is very elusive, and many Raiders need to help with the case. But little does Laras's master know, he was born without smell, and he is forced to secretly use unconventional methods..."}, {"comment_author": "bunker_man", "comment_text": "My wife's mom is like REALLY terrible. Like, if you saw a 2008 asian parent meme it wouldn't be accurate enough to convey just how terrible of a person she is. Once her mom almost let her dad die because she didn't want to pay for an ambulance to take him to the hospital. (They are rich and have extremely good insurance).\n\nThe story is just this, but as a metaphor. Also there is cyberpunk and gnosticism. But instead of corporations there is an evil Asian demiurge who is a metaphor for Asian Americans dealing with abusive parents. So the antagonist is just a large snake that really likes child abuse. It is second world fantasy, so \"america\" is called fusang.\n\nIt has an ensemble cast, so while there is a \"main\" character, who is loosely based on my wife, there are also  a lot of side stories, some of which don't really have much connection to the main plot, they just take place in the same world. The side characters are more often based on me, and based on my own existential terrors.\n\nThe story of the world is treated a bit secondary to the emotional flow of the characters. And it's meant to be more about overpowering emotion. The story isn't linear, and bits and pieces are added and spiral all directions. Surrealism is also a big focus. Fish swim in the sky. There are hologram ghosts. There's a guy who charges a small sun he keeps in his attic with the power of nudity. Everything has bisexual lighting because synthwave colors are the best colors.\n\nTo give an example, one of the side stories is about a kid who has to be frozen for 17 years and can only come out six months before going back under. And what it would be like to live like this. From his perspective everyone he knows will be dead in only a few years. At first he is in denial about this until they actually start dying."}, {"comment_author": "RasThavas1214", "comment_text": "Four little people, a wizard, two regular humans, a dwarf, and an elf have to go on a quest to destroy a ring so it can't be used to do evil stuff or something."}, {"comment_author": "Policlasto", "comment_text": "Yeh but why don't they fly tho"}, {"comment_author": "Xannin", "comment_text": "A newly sired vampire is mentored by an ancient vampire who was unfortunately turned as a baby. The ancient baby shows this new, 40-year-old realtor vampire the ropes of the mythical underworld while the realtor helps the ancient baby purchase property. It all comes to a head when mysterious acquaintances from the ancient baby's past try to sue him for sire support."}, {"comment_author": "RobotCatCo", "comment_text": "Not my reading preference but there's definitely a big market for this kind of story.  The idea is definitely fresh.  I think you just need to flesh out the conflict a bit more in the pitch.    Like what kind of problems do these ancient acquaintances cause and why is the MC affected by it?  "}, {"comment_author": "TransitTycoonDeznutz", "comment_text": "A sprawling continent is claimed primarily by a large republic. It is so large and unchallengeable compared to its neighbors, mostly nebulous tribes, that it no longer makes concerted efforts to settle new regions. Instead, people settle where they please, but this attitude comes with consequences.\n\nAt the peak of the nation's largest festival, news begins to reach the capital that entire cities are disappearing in the northwest, razed to ashes with no survivors. The identity of the culprits is debated by the leadership of the Repulic until suspicions are abruptly and violently confirmed...\n\nNo longer can the Republic remain uninvolved, the only retribution will come through war.\n\ncontext : the first ~120 pages are set in the first major city to be razed with a slow and unsettling build to the initial conflict. It's a protracted tragedy that serves to set the scene before moving to the first chapters of the body of the plot.\n\nThe plot follows two main threads, which are supplemented by disconnected short stories for world building. The moral comes down to \"There is no black and white, only shades of grey.\" Even the 'good guys' aren't so great."}, {"comment_author": "abe_the_babe_", "comment_text": "A war between the continent's two main superpowers is brewing. The war is centered around an exiled king who's fighting for his throne with the help of his country's oldest enemy. The war leads to devastation, and the masses rise up to oppose the monarchy as an institution in the world's first major political revolution. \n\nAt the same time, a group of intrepid archeologists are traveling across the land in search of places described in an ancient book. Along the way, they uncover long forgotten secrets that could change the course of history.\n\nThe story is meant to explore a society's relationship with its own history, and the way in which that history clashes with the futures that various groups are working for."}, {"comment_author": "Inven13", "comment_text": "Nearly 500 years ago the little kingdom of Kevilter faced total destruction by the three lost kingdoms. Facing the possibility of destruction ten regular sorcerers made a deal with the entities/demons of the outerfell on which these entities/demons will grant them immortality and power over the Divine until Kevilter was safe but when the lost kingdoms disappeared the entities/demons twisted the deal and determined that as long as other nations existed Kevilter wouldn't be safe so a worldwide conquest began.\n\n473 years later the conquest has ended with Kevilter Empire and the world becoming the same, the deal with the outerfell entities has ended and with it the pact of immortality of the Ten Emperors, within five years all emperors will die and the Divine power will leave the planet.\n\nFacing these news the noble houses of Kevilter began a mortal and deadly game of alliances and treasons, a brutal power struggle with a deadline and which result will determine the new emperor of the Kevilter or the end of the empire.\n\nI tried but couldn't summarize it more if I wanted to give enough context for the story. This is more like a game of thrones-ish story, it's more about politics and intrigue than magic itself but sorcery is still a main focus.\n\nThe story follows four houses, each with their own protagonist, as each one fights to secure their future in Kevilter before facing the inevitable chaos that will come when the Ten Emperors die. There will be a clear winner, two survivors and a clear loser, I don't like those endings where someone how everyone gets to survive.\n\nThe story is called Withering Thrones and I'm not sure if it will be a duology or a trilogy."}, {"comment_author": "ToaruHousekienjoyer", "comment_text": "A shadow war amongst several occult groups all across the globe which lasted for two centuries nearly drove the other races into extinction which led them going into hiding. The other races being vampires, werewolves, fairies, spirits, etc. An especially powerful occult group quickly rose to power in the end of the war and managed to subsume most of the fractured groups, bringing some stability and peace for the other races. Dimitri, a budding workaholic archeologist and also a freak of nature created out of a mad scientist lab, is simply trying to live the best of his life as he tries to find his place in the world while struggling with his identity as a monster under human skin. \n\nName: A Gathering of Sinners \n\nGenre: Fantasy, Horror, Romance, Sci-fi"}, {"comment_author": "AlarmingSpirit", "comment_text": "extremely devout royal messenger accidentally becomes involved in a plot to assassinate the entire royal family (who are worshipped like/are gods) because the bodyguard he fell in love turns out to be the king's secret bastard who wants to usurp the throne due to raging daddy issues  \nheavy on the mythological/religious themes & character-driven conflict. characters are very much morally gray"}, {"comment_author": "DizzyCaidy", "comment_text": "A mystical carnival that only appears every few years shows up, and no one but the main character has any idea it’s evil. When her best friend gets kidnapped by the carnival, it’s up to her and a group of classmates she doesn’t get along with to go in, fight their way through the carnival employees tricks, lift the magical veil, find their friend, and hopefully stop it at its source- the evil ringmaster. \n\nIts a YA, light fantasy, with a mixture of real life"}, {"comment_author": "RobotCatCo", "comment_text": "I feel like for the YA audience, you'd want to have the 'group of classmates she doesn't get along with' be her bullies.   Bullying a widespread issue in the YA audience's age range and its something that they can immediately identify with.\n\nI think a interesting character conflict would be whether the MC wants to work with her bullies to save her friend, or use them as pawns and sacrifice them along the way."}, {"comment_author": "DizzyCaidy", "comment_text": "That’s fair, I was thinking of having one of the classmates be a possible love interest that she doesn’t know how to handle, and another be an ex friend so there’s some animosity there?"}, {"comment_author": "torolf_212", "comment_text": "MC swaps locations with a powerful wizard in a magical world, he's a hard-core video game and movie nerd, getting magical powers is basically his dream come true, except he's exceptionally unlucky.  He does himself no favours, behaving in the world how he would act in a game, feeling he has plot armour to get himself through every situation. He causes more problems than he solves, and he solves a lot of problems."}, {"comment_author": "Darkzterroid", "comment_text": "Preken grows up as an outcast for being magicless in a world that is built for the people who can use magic, until one day he's met by a spirit who tells him to use his hidden gift under the veil of being magicless. That gift is the dark power that can suck all life out of living things to gain vitality among other powers such as super-strength, speed and inflicting torture, all those meant to hurt his victims, but Preken refuses to use it completely, even if he faces severe adversity. Until he has to when the world collapses due to an interstellar alien invasion that forces him to use his dark powers to survive. In his quest to find another home, he discovers that he's already involved in a divine conflict, and the gods want him on their side. But Preken chooses neither."}, {"comment_author": "XBlueXFire", "comment_text": "A wizard, a ghost, a hitman and a journalist who are alternate versions of each other, get plucked from their worlds and flung around the multiverse by some unkown power. Wherever they end up, theres another counterpart of theirs in need of help."}, {"comment_author": "Princess_Juggs", "comment_text": "GENRE: Low-Stakes Industrial Fantasy, or something like that\n\nBLURB: Since the death of their father Abgaer, a gun inventor of turbulent finances, Treifr and Imaesin have been struggling to run the Abgaerskin Gunsmith in Munhalm. When their mother too passes, the siblings\ntravel out to her old family manor to say farewell, where Treifr discovers an old wine bottle in the cellar. Imaesin immediately recognizes it as the bottle their family's former indentured servant, Gillander Vykkers, had been saving for the day he went free. For her, it brings back joyful childhood memories of 'Uncle' Vyk regaling them with the fantastical adventures of his youth as an arms dealer. But for Treifr, the older one, it brings back memories of his mistrust and confusion over Vykkers' relationships to their mother and father. When Imaesin convinces her brother they must find him and return the bottle, the two crank up their rusty motor-carriage and set out to track Vykkers down by questioning the people mentioned in his stories. Spanning the whole of the Bograk-Rulvois Empire, their search sheds light not only on the truth of Vykkers' misdeeds, but also on the blood magic behind their family's murky past."}, {"comment_author": "Spartan1088", "comment_text": "Space fantasy with an overall theme of ‘chosen one’ and ‘friends are family’.\n(Note: I was making a new blurb but ran out of time so I just kind of threw a few of mine together.)\n\nAfter failing at distancing himself from a cruel world, the bird-brained space pilot, Frank,  has been given a chance by the divines to be the hidden spear in a universe-ending war with a dark entity- so long as he makes friends.\n\nWe calls upon five unlikely heroes: a self-proclaimed dashing smuggler now a distant god’s last hope, an Irish thief with anger issues, a stubby reptilian assassin that regrets his life choices, a religiously-compulsive starchild with divine vision, and a mad scientist keen on saving Earth through trans-dimensional technology. Together they will have to confront the liars of Frank’s past, fight the living puppets of darkness, escape from the magical violence of the Law, and stop entire planets from collapsing into darkness.\n\nDarkness is closing in on the universe and nobody sees it coming. It’s manipulative, secret, and unrelenting in it’s conquest- using the bodies of others to get what it wants. Frank and the others need to uncover the truth to have a chance at stopping it. Will they put their trust in science to stop the coming threat, or will they put his faith in the gods to save them from annihilation?"}, {"comment_author": "Kibali_T", "comment_text": "Genre: Sci-Fi Mystery, Theme: Identity in a Digital Age.\n\nHook: You wake up in a virtual world, a perfect copy of your life. Everyone acts the same, your memories feel real... except for a faint echo of something different.  Is this a utopia or a prison?  Uncovering the truth means risking everything, even your own existence.  Your score will determine how much the mystery of your true reality and the stakes involved intrigue you."}, {"comment_author": "RobotCatCo", "comment_text": "\nYour description can fit any number of Black Mirror episodes, as well as the recent movie 'Don't Worry Darling'.   So you need to present more concrete details on how your work stands out because the basic premise is a bit overdone at this point."}, {"comment_author": "TeaMancer", "comment_text": "Werewolves! Egyptian Gods! Canadians?\r\nAfter a tragic event at the natural History Museum in London sees fifteen year Old Aaron Conners whole life turned upside down.\nTransformed into a werewolf and dragged to Canada, Aaron must learn to adapt to his changes with the help of new friends, his new guardians and discover a secret world where the Egyptian Gods are still alive, hiding on an island, protecting the human world from monsters. He’ll discover the origins of werecreatures and secrets of a parent he never knew.\r\nBut there are dark forces growing, searching for a means to release a long imprisoned Goddess that could mean the destruction of everything and only Aaron can stop them."}, {"comment_author": "RobotCatCo", "comment_text": "This reads like Percy Jackson but with the Egyptian Patheon instead of Greek and Canada instead of America.  There's definitely been people who have been asking for something like that so there's probably a market you can tap into.\n\nHowever you need to show what your MC will DO.  Like, what is he going to do to stop the release of an imprisoned goddess?  Percy Jackson in the first book was accused of stealing Zeus' lightning bolt and undertakes a quest to the underworld to try to find and return it within 10 days, or the Gods will go to war against each other.   That's a plot hook.  Right now you have the setting, but missing a plot hook."}, {"comment_author": "OtherwiseStudy1252", "comment_text": "The Eliphan Republic is all that remains. Its legions are many, its enemies are few. But its claws are marred, set deep into a myriad fracturing domains as it rots from within.  \n\nFrom the defeated east, Jhoturah has been taken away from everything - his family, his home, his kingdom. Once a prince, he was moulded in the courts of the Republic to be a youth of unfaltering loyalty; and in the field, he was forged into an unquestioning soldier. But as peace returns after a decade of civil war, his mind begins to fray.\n\n\nAnd to the south, crisis broils. \n\nWithin the depths of the continent of Saneris, a lone bastion stands against the coming tides of war. Within the gilded walls of Mossaz’khar, Jhoturah must marshal its crumbling defences; he must fight fast and fight hard. But with the shifting sands of alliances, new players enter the fray: the grizzled renegade Khansara and his mercenary score, and the encroaching armies of the Jade Karash, ruthless, undefeated, thirsting for domination. \n\nNo matter what, Mossaz'khar must not fall.\n\nBut as a tyrant rises, it is the Republic itself that faces destruction."}, {"comment_author": "DrDoritosMD", "comment_text": "Premise: A special forces team explores a dnd-esque fantasy world through a portal, a la Stargate.   \n\nGenre: military sci fi, fantasy  \n\nBlurb: In the clandestine depths of Area 51, Captain Henry Donnager and his team step into Gaerra — a realm where swords and sorcery reign. Their arrival disrupts the fragile balance between the Sonaran Federation and the Nobian Empire, casting them into a mire of geopolitical intrigue. As tensions escalate, Alpha Team finds themselves both mediators and potential catalysts of conflict. In a world teetering on the brink of war, every decision could be pivotal. Will they tip the scales towards peace or set the sparks of war alight?"}, {"comment_author": "RobotCatCo", "comment_text": "How can you mention this setup without alluding to using Apaches vs Dragons, or how well wizard can block bullets?  The people who are looking for this kind of story definitely want to know if you're going to be featuring these kind of things so throw them a bone in your blurb.  \n\nAlso you should describe one of the catalysts of conflict the team gets into in the blurb."}, {"comment_author": "EitherCaterpillar949", "comment_text": "An embittered, socially isolated guild apprentice in the fantasy equivalent of the early 1800’s returning from his time in the Earl’s retinue learning about cannon and ballistics comes across a charter promising immense riches for someone who can build a vessel that can travel into the Heavens. He spends twenty years scraping together everything he can to design and build an artisanal space rocket, while coming to accept himself for who he is and fall in love with the alchemist across the road who agrees to help him in his insane dream."}, {"comment_author": "RobotCatCo", "comment_text": "If you didn't have the fantasy stuff this blurb would almost sound like the biopic of some famous inventor.  Unfortunately since this person isn't real you can't capitalize on their fame to help sell the story.  \n\nRight now I can't really tell what this story is supposed to be about.  This setup could be for a rom com or romance drama.  Or it could be the setup for a fantasy historical drama detailing how this guild apprentice builds up a industrial empire over the period of 20 years.   You need more indicators on what kind of story you're trying to tell because right now I don't really know what to expect from your story."}, {"comment_author": "EitherCaterpillar949", "comment_text": "There’s two tracks running through it, one being the main character’s struggle to get his project off the ground given his background and status and the other being the very-much-dramatic romance, with both characters having a lot of baggage they work through together, with the main character having to get over his baked-in issues around resentment and the alchemist struggling to get out from under the thumb of his family, who want to use him as part of a political game of horse trading, arranged marriage, and graft."}, {"comment_author": "RobotCatCo", "comment_text": "Sounds like an empire building political drama, which is pretty rare in fantasy, but more common in historical fiction.  Definitely play up the empire building political aspect in your blurb, as there are a lot of readers looking for that sub-genre as its pretty under represented.  \n\nAlso nothing you've said so far indicates how the fantasy aspect will play into your story."}, {"comment_author": "EitherCaterpillar949", "comment_text": "The fantasy element is very much not my primary focus, it manifests mostly in the background. The protagonists and many side characters are Elves, Hares, Dwarves, a dragon (restricted by treaty to graze on one allotted mountain), things of this nature, and magic is mostly a cultural phenomenon. What the fantasy setting as opposed to fixing it in real history allowed me to do was take more control of the context, and sculpt the world to get out what I was trying to achieve. I don’t know if I can fairly call it historical fiction if it’s about a setting that is entirely of my own creation, and which has a lot of fantasy trappings in it."}, {"comment_author": "Policlasto", "comment_text": "In a world where humans coexist with a race of giant animals who are able to use magic called gods, society has advanced to the point where there exists the shadow of equality.\n\n\nThe main character, a political refugee that ends up in the aristocracy, thrives for political power to try to change his people's conditions. \n\n\nThere will be a great focus on the social dynamics of an obviously stronger race of gods and the humans, who claw their way into having rights. Epic and social fantasy"}, {"comment_author": "ColdServedDish", "comment_text": "Two young sisters save each other and then the world."}, {"comment_author": "bzno", "comment_text": "A thousand years after the God-King, the greatest human that has ever lived, goes on a crusade against the devourer, to never return, an aimless adventurer and his group finds themselves in a position to shape the future of the world \n\nThe history is a High Fantasy, set in a somewhat first Industrial Revolution, while the two main religious powers wage war"}, {"comment_author": "VulKhalec", "comment_text": "Cynn is a teenager with anger issues - and those anger issues have gotten himself and his family killed. Worse still, the thing that killed them is Grimaldr, a magical sword that possesses its wielder and is hell-bent on plunging the world into war. Reborn as a revenant, a ghost with powers based on his manner of death, Cynn knows that he and his family can't pass on until their murders are avenged. Together with the blacksmith and the witch who created Grimaldr, Cynn sets off in pursuit of the sword. It soon becomes apparent that they need help, so they form the Revenant Guard - a group of four troubled ghosts wielding powers born from the heart of their trauma. As their quest hurls them into conflict with warriors, witches, monsters and gods, the question becomes: can they hold themselves together long enough to do the job they were reborn to do?"}, {"comment_author": "PickledDildosSourSex", "comment_text": "A reddit poster asks authors to share their plot hooks so he can rate them, only to only provide 2 ratings before mysteriously vanishing--while the plot hooks remain open for anyone to take."}, {"comment_author": "dontrike", "comment_text": "Genre - Fantasy  \nTheme - Recovering from trauma and how to live\n\nOne night the moon cracks open sending meteors down onto the angel nation of Hedron. A man, later named Mick, appears out of one of the meteors with no memories other than his family and vaguely of the previous nation that once stood in this country. Now he searches for his family and learn of the new land while working/living on a farm. That's not all that comes from the meteors, \"facets\" of Mick's personality also appear, all with the goal of living the life he couldn't and wouldn't live or kill him so they never return to the hell that is him. All the while the country is on high alert as the Queen oddly smells ash when she looks at the damaged moon and the alcoholic princess, Charlotte, believes him to be a great evil and searches for him to put him down before he does anything else."}, {"comment_author": "I-eat-boats", "comment_text": "So im not completely finished with outlining the plot yet but here:\n\nSet in victorian france, the son of a rich (and important) librarian, finds out his father secretly is plotting against the city to destroy it (diff version of france) and he runs away, for two reasons, the one i just said and that he is gay. Him and another boy run away but come back and try to stop it. \n\nPls dont judge if its bad, im not finished with the plot completely yet. Im open for ideas!"}, {"comment_author": "Better-Silver7900", "comment_text": "Nice try, but if you want my ideas, i need money."}, {"comment_author": "c0c0nutt", "comment_text": "Genre: Fantasy \nA halfblooded noble Girl runs away from her family and enters the imperial academy to be free but happens to find out the church is doing human experiments/sacrifices using the students to fundamentally corrupt all magic."}, {"comment_author": "murrimabutterfly", "comment_text": "After her family is slaughtered in front of her, the protagonist seeks justice for their murders. She half literally runs into the arms of a mysterious tavern owner, who seems to have a complicated and painful past of his own. He promises to help her overthrow the corrupt king that initiated the genocide of her people.  \nShortly after her arrival and his promise, it's revealed he's the manifestation of the Sin of Wrath--a human cosmically punished and essentially cursed for the destruction he wrought in a moment of anguish and grief.  \nThe book explores the tales of the other six Sins and how their own desperate decisions led them to horrible actions, attempting to delineate between bad choices and cruel actions. Grief and loss are running themes, as are found family and the importance of accountability.  \nThe king, however, is objectively evil and is used as true black on the moral greyness spectrum.   \n  \nBasically, I wanted an excuse to write/show how trauma shapes and changes us, and how choices made in essentially life and death situations can't be a gauge of a person's moral aptitude. The Sins are all humans who unbalanced the semi-sentient magical life force that fuels all people in this world. It's mid-fantasy: magic exists, but is suppressed by the king; there are magic creatures, but they're rare; and the world operates on loosely 1600-1800s technology."}, {"comment_author": "Aurum_Sword", "comment_text": "isekai novel where the protagonist makes a magic school (that uses an alternative way of magic) to prepare his kingdom for a war.\n\n  \nTHE HOOK: the Mc is actually the villain that used to be the author of the novel and wants to prevent the good guy (antagonistic sorcerer) from stopping the war, because he's too prideful to accept any change on his work and sees everyone in this world as puppets that must obey him."}]}, {"post_title": "After a bit of a rewrite, I present the new first page of The Last Philosopher, with the question as before. Would you keep reading?", "post_url": "https://i.redd.it/mdg2yq2ogusc1.png", "post_main_text": "", "post_comments": [{"comment_author": "Logisticks", "comment_text": "**Page 1 feedback:**\n\nYou're not boring, and know how to write with an interesting voice, which is one of the most important parts of writing fiction. I would read page 2 to see if the \"interesting voice\" eventually becomes an \"endearing, funny\" voice.  And regardless, I think that if you keep writing, you will eventually develop that voice.\n\nThat being said, this is one of these first pages that will get me to turn the page, but if I reach the end of the first chapter and discover that *all* of the pages are like this, I'm not going to keep reading. At the end of page 1, I am still waiting for the action to start.\n\n---\n\n**Chapter 1 feedback:**\n\nThis is beyond the scope of what you asked for.  But your excerpt got me curious to look up your story and keep reading, and after reading a few more pages, it turns out that all of the pages in the chapter *are* like this.  I decided not to keep reading.\n\nPart of what sapped my desire to continue was when I read the fourth sentence of direct thought and realized that *every single line of direct thought* had an exclamation point.  It's like the writing equivalent of trying to make your record \"louder\" and eliminating any sense of dynamic range, or putting the \"URGENT\" label on every single email that you send.  If you're telling me that every! single! line! of direct thought has emphasis, then practically speaking, *none* of them have emphasis. You seem incapable of writing direct thought without exclamation points, sometimes three times in a single paragraph.  I realize it seems like a small thing to harp on, but it's one of many things that can undermine my faith in an author. \n\nApart from that, most of the first chapter was summary, rather than scene.  I kept waiting for the story to start. And waiting, and waiting, and then I got to the end and still it felt as if nothing had happened.\n\nMy comment at the end of page 1 was \"it feels like I am still waiting for the action to start.\"  My comment at the end of chapter 1 is  that it *still* feels like I am waiting for the action to start.  This chapter didn't fill me with any desire to continue reading about the continued adventures of the celestial Dick.  I don't care about the \"character,\" and I don't care to continue reading a story that feels more like a narrator talking at me than something that is going to allow me to become immersed in a scene."}, {"comment_author": "BlazedBeard95", "comment_text": "I hope the op reads this comment, this kind of feedback is absolutely invaluable."}, {"comment_author": "NatashOverWorld", "comment_text": "Ouch, I'm sorry bud, but I'm going to say no. \n\nIt's very Pratchett-ian to me, with some Douglas Adams mixed in, so it makes me naturally compare it to their stories.\n\nAnd it's an unfavourable comparison, because STP essentially dominates this kind of humour.\n\nThere's nothing per se with anything, but that's my first impression.\n\nHope it's useful."}]}, {"post_title": "What Made 80s Fantasy What it Was?", "post_url": "https://www.reddit.com/r/fantasywriters/comments/1bym9z8/what_made_80s_fantasy_what_it_was/", "post_main_text": "I’ve been fiddling with my current narrative and got to thinking about the books I was reading in the 80s. Besides discovering classic writers such as Leiber, Howard, and Moorcock, series like Amber, Dragonlance, Thomas Covenant, Thieves World, and The Black Company took up a lot of time (as did reading and rereading my D&D and Traveller books) and I got to thinking about what made 80s Fantasy what it was.\n\r\nI tend to think of quests dominating the plots with relatively easy prose but that may be selective memory. \r\n\nWhat, in your collective opinions, makes 80s Fantasy?\n\r\nPS, I’m not a fan of this 100-word minimum. A laconic question/post can be as impactful as a verbose one.\r\n", "post_comments": [{"comment_author": "WilliamArgyle", "comment_text": "When I think of 80’s fantasy, I think about what I was reading in the 80’s: Feist, Eddings, Tolkien, etc.\n\nThey had a common theme—good against evil.  There were no ironic villains or anti-heroes.\n\nMorally, it was a more straightforward time.  I think fantasy harkened to the pre-Kennedy WWII days, and eschewed the moral relativism of the post-assassination/Vietnam era.\n\nThere are obvious exceptions, but I wasn’t reading or looking for that as a young teenager."}, {"comment_author": "Infinite-Ad359", "comment_text": "I think honestly its the \"cliche\". Fantasy in the 80's created a lot of the cliches we tend to shy away from today but they were excellent at the time because they were fresh and fun. The bandit/thief with a heart of gold, the sharp tongued wise-guy who just might save the day, the  princess who can swash buckle with the best of them. They're overdone now because they were so fun to begin with.\n\nThey also tended to be simpler in structure & theme. I don't remember reading many 80's fantasy novels with a lot of character switching, C,D,E and so on plots. They were based on a universal or widely understandable theme and they explored that theme with fewer characters and more depth."}, {"comment_author": "Akhevan", "comment_text": "> The bandit/thief with a heart of gold, the sharp tongued wise-guy who just might save the day, the princess who can swash buckle with the best of them\n\nSounds like a plot of an epic Bylina from the 1300s alright."}, {"comment_author": "rdhight", "comment_text": "I think a lot of it had to do with the era and background of those doing the writing. You had a limited window where Tolkien had happened, but the '60s and Vietnam had not. And most of the guys writing fantasy in the '80s had their formative years in that window. It led to a characteristic style, where good and evil and epic quests coexisted with detailed characters and strong worldbuilding."}, {"comment_author": "RAConteur76", "comment_text": "I think u/WilliamArgyle probably hit on the key point.  It was a very different time, coming off some of exceedingly murky years.  Vietnam still lingered in the popular consciousness (think about the number of TV shows who had Vietnam vets as lead characters during the 80s).  Nixon and Watergate was equally fresh in the culture, with Carter and the disaster of Operation Eagle Claw a fresher incident.  It was a time that didn't seem to have any good guys, much less outright heroes.\n\nThose books were likely written during those dingy years, with the heroes those writers weren't finding in the real world, and when they were finally published, they socketed into the culture of the 80s almost perfectly."}, {"comment_author": "dr_set", "comment_text": "The party was the main character. Each member of the party had clear strengths and weaknesses and they complemented each other. Together they made a full supra-entity, the party, that was perfect and could take on any challenge. The Companions in the Dragonlance books are the perfect example.\n\nThese days you have a \"one man army\" main characters that are insufferably perfect, jack-of-all-trades and masters of all like Kvothe in The Kingkiller Chronicle or Kaladin in The Way of Kings. They are the wizard, the warrior, the healer, the bard, they are good with women, good at planning, good with people, good at everything.\n\nInstead of 5 or 6 very flawed members coming together like Voltron to form a stronger entity, the party, growing stronger together slowly by overcoming progressively harder challenges,  you have one guy that is killing dragons all alone right from the start."}, {"comment_author": "Akhevan", "comment_text": "> These days you have a \"one man army\" main characters that are insufferably perfect, jack-of-all-trades and masters of all\n\nI don't think this is widespread to any significant degree among the trad published works. Fan fiction and self-pub? Sure, but that's just a world with much lower standards of writing.  \n\n>  like Kvothe  \n\nWho had been, and still is, the laughing stock for all fantasy readers who aren't die hard Rothfuss fanboys.   \n\n> Kaladin in The Way of Kings  \n\nThe main complaint people usually have with Kaladin is that he is one-dimensional and that his character growth is a flat circle that had been going on for four books now.    \n\nI guess you do have a point in the sense that traditional setups with quests and parties of unlikely companions have fallen out of favor in the last couple of decades, but that's not because of the prevalence of may sue characters who can do everything by themselves. That's a reaction to the previous era of stories clearly inspired by Dungeons and Dragons game conventions."}, {"comment_author": "Bubblesnaily", "comment_text": "A lot more women actually got published and became commercially successful. There have been a handful famous ones in the 70s and earlier, but in the 80s, you needed more than your fingers to count the successful female fantasy writers."}, {"comment_author": "Lou_Ven", "comment_text": ">I tend to think of quests dominating the plots with relatively easy prose but that may be selective memory.\n\nDefinitely selective memory if you've included Covenant in that list. Donaldson is the only fantasy writer who has ever had me feeling I should reach for a dictionary.\n\nI do recall a lot of quests, though."}, {"comment_author": "Mejiro84", "comment_text": "In practical terms, there was no internet, so even \"series\" books were often possible to read on their own - the _Dragonriders of Pern_ books, for example, had an internal order, but weren't \"Pern 1\", \"Pern 2, \"Pern 3\" etc., because it was a lot harder for readers to get whatever books they wanted, and presuming that they'd be able to get all the prequels was impractical.  So a series was often a set of hooked-together standalones that would re-state the basic set-up each time, and often be read out-of-order.  There was also a lot less books out, so more people would have at least a broad awareness of the \"big hits\"; even if they hadn't read them all themselves, they'd probably be aware of them by reputation.  An SF&F nerd could plausibly be reading most of the big releases each year, which is far harder these days (especially if you try and keep up with indy-pub as well)\n\nPhysically smaller books as well - it wasn't until _Wheel of Time_ that the tendency for fantasy doorstoppers started getting established.  There was a lot of fantasy clocking in at \"large novella\" size - like a lot of Leiber or Moorcock novels come in at maybe 50k, 60k words, while a \"standard\" fantasy novel these days is around 100k, with \"epic\" being 150k+.  \n\nArtwork covers - a lot of covers these days are symbolic or more icon-based (like the _ASoIaF_ or some of the _Witcher_ covers, with just a symbol on a basic color background), but older ones used to be a lot more eye-catching, with full characters doing stuff, that was sometimes even actually a scene from the book (and sometimes just general fantasy _stuff_, or nekkid lady, regardless of a lack of naked ladies in the book)"}, {"comment_author": "Logisticks", "comment_text": "The other main category of \"80's fantasy\" aside from the *The Sword of Shannara* style of \"Tolkien-like\" was the sword and sorcery genre, classically associated with Conan the Barbarian, and carried in the 80's series by Michael Moorcock's *Elric of Melnibone* series.  This is also where you see more authors explore the \"dark fantasy\" genre,  with works like *The Black Company* and *The Chronicles of Thomas Covenant* where you have main characters that, if not \"anti-heroes,\" are at least very straightforwardly not \"good guys.\"\n\nBut from what I understand, in the publishing world, the 1980's was actually considered a *low point* for the epic fantasy subgenre: there was basically a \"Tolkien clone bubble.\"  You had a lot of stuff like *The Sword of Shannara* and *Riftwar Saga* that were just very straightforwardly trying to follow in the footsteps of Tolkien with very straightforward high fantasy tales about good and evil.  You might also put *Belgariad* in that category.  This is in contrast to the 1990's, when  you saw the epic fantasy dominated by authors who were doing things that were considered relatively new and experimental at the time, like George R.R. Martin's *A Song of Ice and Fire* (an epic fantasy that was more political and less straightforwardly a tale of good vs evil), and Robert Jordan's *The Wheel of Time* (which was the start of a push toward more \"hard magic\" systems, with Jordan slowly leading his audience further in that direction over the course of the series.\n\nSo, if you're ignoring \"Tolkien-clones\" as a genre and focusing on the sort of works you mentioned, I guess the 80's is a place where you saw the start of dark fantasy that, unlike a lot of fantasy published in the past 25 years, *wasn't* trying to follow in the mold of *A Song of Ice and Fire*, and was instead telling stories on a much smaller scale with a relatively small cast of characters."}, {"comment_author": "J_C_F_N", "comment_text": "Drugs, most likelly."}, {"comment_author": "bizoticallyyours83", "comment_text": "Okay, this cracked me up 😆 "}, {"comment_author": "bizoticallyyours83", "comment_text": "Genuine passion for the genre. Knowing that fantasy wasn't only sugar n spice, n everything nice. Epic fights and the magic is mysteriously cool. For movies, they didn't overstay their runtime and a lot of the special fx are well done. "}, {"comment_author": "SpartAl412", "comment_text": "For one thing you had writers who cared a lot less about people's sensitivities. Like is this racist, sexist or ableist or whatever other things  that just get in the way"}, {"comment_author": "MikeFM78", "comment_text": "The culture was insensitive, conflicted, and crazy. Everything lacked polish and things weren’t designed by committees to the point where they were technically perfect but completely lacking in soul. He-Man and She-Ra were acceptable role models for children and Dee Snider could stroll into Congress and call Tipper Gore out for having a dirty mind."}]}, {"post_title": "So... apparently it's a bad idea to have a lot of POVs", "post_url": "https://www.reddit.com/r/fantasywriters/comments/1by9oc5/so_apparently_its_a_bad_idea_to_have_a_lot_of_povs/", "post_main_text": "Is this true? If so, that kinda sucks. I have an important main character, of course, but I also have a very relevant set of side characters that I often switch the POV to.\n\nI even swap to the POV of some of the villains at certain points. When I write a chapter, I just take the POV of whoever is near the action that I need to show the reader. Instead of jumping through hoops to get the reader to learn things that the main character shouldn't know, I just swap POV to whoever is best suited for the scene.\n\nThis ends up with me having probably 30+ characters that have a chapter told through their eyes. The main character still has the largest quantity of chapters, of course, and they drive the story forwards. But should I be worried that I've put way too many POVs into my story?\n\n(Oh, and to clarify, these POVs are spread across multiple books, not just a single one)", "post_comments": [{"comment_author": "Pratius", "comment_text": "30+ POV characters is a *lot*. It's been done successfully before, but almost always by very strong writers with decades of experience. I don't know how many books you've written or your publishing history—but if you're working on your first or second book and you've never gone through professional edits, it's likely that you're looking at a VERY uphill battle to make it work, much less be good enough for readers to care about *that* many different POV characters."}, {"comment_author": "ForeignLandWanderer", "comment_text": "30+ is insane. I was reading the OP's post and thinking he was talking about around 5 or so POVs, because that's already considered a lot by most standards. I fail to see how the OP is going to make us care about his main characters when there's 30+ side characters taking time away from them..."}, {"comment_author": "Dramatic-Soup-445", "comment_text": "Please share some examples of where it's been done successfully. Thank you."}, {"comment_author": "Mejiro84", "comment_text": "in practical terms, a 100k book might have 30-40 chapters, if they're each about 2k-4k words.  So that's a new PoV character most chapters!  At that stage, you don't have \"main characters\", you have a mass ensemble cast, some of whom get a whole _two_ PoV chapters.  Something like Wheel of Time will have more PoV characters... but that's cumulatively, over a load of books.  In the first few, it's maybe half-a-dozen mains, and some occasional side characters.  If this is a trilogy, for example, that's still only about 6 chapters per person, which isn't much to get \"into\" them.  (or you're swapping mid-chapter, but that's less popular / thought poorly of these days, as \"head-hopping\")"}, {"comment_author": "Pratius", "comment_text": "I’d point toward some of the really epic, doorstopper series like WoT or ASoIaF or Malazan. And even those have plenty of detractors among readers, specifically for the sheer scope."}, {"comment_author": "Dramatic-Soup-445", "comment_text": "I've read WoT (and got frustrated waiting for Matt to show up as he was my favourite) and ASoIaF too (and there definitely wasn't enough of Arya). Haven't read Malazan. \nI thought you meant books where there are +/- 30 POVs in addition to the main character POV.\nThe again WoT feels like 30+ but IaF doesn't really (at least to me)."}, {"comment_author": "laughingtraveler", "comment_text": "Can you expand those acronyms for those of us unfamiliar?"}, {"comment_author": "Pratius", "comment_text": "I mean this is one of the reasons why someone trying to do it in their first book isn’t gonna work. Those series didn’t started off with 30 POVs in book 1. (Well, *Gardens of the Moon* has a lot, but that’s also a VERY flawed book in large part due to that—and I don’t even know if *that* hit 30). \n\nGood authors sink you into a small or relatively small number of POVs first, then expand from there. They don’t waterboard you with characters."}, {"comment_author": "Pratius", "comment_text": "*The Wheel of Time* by Robert Jordan and *A Song of Ice and Fire* by George R. R. Martin"}, {"comment_author": "Dramatic-Soup-445", "comment_text": "Yes, I see what you mean. Thanks"}, {"comment_author": "BoneCrusherLove", "comment_text": "I think the problem with a lot of pov, especially for the reason you've listed (being close to the action) has it's drawbacks. It's considered a little lazy to just go to the convenient pov and not have to do any narrative heavy lifting (in that aspect) but you're also making it much harder for a reader to connect to that many characters.\nYou're also making more work for yourself. That's a lot of characterisation and character voice to perfect.\nWith multiple pov, a reader needs to be able to open to a page and know from the way it's written which character it is, throwing 30 odd characters into the mix might be overwhelming, even over multiple manuscripts\n\nThat said, there's no reason why you can't. Many people will probably list great authors who have huge works with multiple pov, but I tend not to compare myself to somone with that much mot experience.\nI would ask yourself how necessary it is to have that many pov, and if any can be condensed or removed to a character with more page time?\n\nAt the end of the day, you've got to write what makes you happy. Leave making other people happy for editing :)\n\nI wish you luck!"}, {"comment_author": "Uberbuttons", "comment_text": "Yeah I was thinking about voice cadence and flow as well. Should be different between characters. \nI can't even keep track of 30 friends lol "}, {"comment_author": "Three-Headed-Freak", "comment_text": "I’d say Tad Williams does well at doing multiple POVs in his works, especially in his Osten Ard books."}, {"comment_author": "M00n_Slippers", "comment_text": "Another thing is people tend to latch on to one or two characters and when you are constantly switching it feels like a chore to constantly be waiting to read from that one character you like. Not to mention, it derails the pacing because you usually leave in the middle of action to read something slower until it builds to action and then you switch again. It's really frustrating to read."}, {"comment_author": "BoneCrusherLove", "comment_text": "That would be my biggest hurdle with that many POV"}, {"comment_author": "BoneCrusherLove", "comment_text": "Many people have done it brilliantly :)\nI'm definitely not saying it can't be done, just that it's harder to get right and takes more care than a two to three pov manuscript might."}, {"comment_author": "liminal_reality", "comment_text": "Some people won't like it but I personally think the multi-POV epic is the best feature of the Fantasy genre."}, {"comment_author": "VokN", "comment_text": "until you keep getting blue balled by swaps during the prelude to a huge set piece\n\nits also a fine line between multiple perspectives and \"oh yeah nothing is moving forward what the fuck is this\" as you grow the number, stormlight does well in shoving those excess povs into the interludes"}, {"comment_author": "MythicAcrobat", "comment_text": "I think there’s no problem with it the longer the book is. My only issue is when you’re given multiple all at once. I kid you not, I started a book that intrigued me and read 8 chapters. Each chapter was a new character and POV. It pissed me off because now I felt like I was cramming for a test to recall all the details."}, {"comment_author": "Akhevan", "comment_text": "> stormlight   \n\nIs quite ironic to bring up when your main complaint is  \n\n>  \"oh yeah nothing is moving forward what the fuck is this\"  \n\nBooks 3 and 4 anyone?"}, {"comment_author": "M00n_Slippers", "comment_text": "The Wheel of Time is the King of this bullshit \"change POV 8 times yet nothing happens in 1000 pages\" style."}, {"comment_author": "QuickQuirk", "comment_text": "stormlight interludes were one of the few times I enjoyed multiple PoVs. I really liked this little side stories about characters who only ever appeared in the interludes. Palettes cleansers, almost. Some of those characters I *really* liked, and was happy when they got their own short books later.\n\nPoV done right, at least in my opinion."}, {"comment_author": "liminal_reality", "comment_text": "well yeah, anything can be done badly"}, {"comment_author": "jand999", "comment_text": ">oh yeah nothing is moving forward what the fuck is this\"\n\nYeah you gotta keep the pace up. You can't have 6 PoVs and they all have slow chapters in a row."}, {"comment_author": "liminal_reality", "comment_text": "To what degree people want multi-POVs does vary.\n\nPersonally, I like Robin McKinley's writing which lets you know what everyone is thinking per scene and I think she pulls it off very well (she's won a number of Newberry awards so I have to assume I'm not alone). \n\nI also enjoyed *Vellum*, though, as an example of how extreme my \"I want **all** the POVs\" goes. That book changes between POV and first/second/third person *per sentence* by the end. Granted the work is meant to be experimental and it is used to show book's reality literally breaking apart and I definitely wouldn't want every book written that way. \n\nBut I still had a good time."}, {"comment_author": "Princess_Juggs", "comment_text": "Yeah I feel like this can only work well when you do it like GRRM did in A Game of Thrones. Even though we're introduced to 6 new POVs before we even return to one of them, most of those characters are in the same location and already know each other, which is also true of the 3 new POVs we're introduced to soon after. It's not like we're jumping into a new location with a new cast every time."}, {"comment_author": "VokN", "comment_text": "I never made it past the first 5 chapters of book 3 tbf, I felt it jumped the shark with the dumbass flying in the air finale stuff vs when lashing was used in buildings it was really interesting"}, {"comment_author": "VokN", "comment_text": "And then completely drops half those threads through book 8 lol"}, {"comment_author": "VokN", "comment_text": "Yeah it’s just not ideal for newbie authors to add more to their plate is more my point, strong story and character development and now you want to juggle 3+ different povs potentially telling different stories? Seems like a lot lol"}, {"comment_author": "VokN", "comment_text": "Yeah it’s a very difficult juggling act to preplan every single narrative arc that each separately interact or don’t to have rising tension that sync up in a way that maintains interest, not even mentioning writing yourself into a corner (grrm) or just forgetting important side plot threads because you just gotta get on with the story (wot)"}, {"comment_author": "M00n_Slippers", "comment_text": "Agreed, the single-POV that manages to imply what everyone is thinking, or leaves it a bit mysterious is definitely preferred for me."}, {"comment_author": "MythicAcrobat", "comment_text": "I’m sure there are times where it works. The example I gave was where the first 8 chapters was someone new, the scenes were also in different locations. It was just frustrating vs enjoyable. What sucked is the premise was intriguing. I wanted to know what was next with multiple characters but then it became way too much too early."}, {"comment_author": "liminal_reality", "comment_text": "different view on beginning I guess, multi-POV is a skill in itself but if it is what you want to write then you'll need to practice it. Your first few books will have a lot of issues, anytime you 'add' something then whatever you're new at will have issues, may as well do what interests you and get good at that"}, {"comment_author": "-RichardCranium-", "comment_text": "I don't think I'd recommend writing full symphonies to someone getting into musical composition.\n\nNot all learning is good learning"}, {"comment_author": "liminal_reality", "comment_text": "The OP never says how experienced they are or aren't and tbh I don't think writing is really all that analogous to musical composition but I wouldn't know because I can write and I can't compose. Still, they were worried about it being \"bad\" to have \"lots of POVs\" and not about whether or not they are experienced enough to handle lots of POVs. I, personally, like multi-POV epics so having lots of POVs is not bad imho. \n\nIn any case, I doubt it's a one-size-fits-all matter."}, {"comment_author": "Edili27", "comment_text": "I mean, multi-pov isn’t bad, but above 2 POVs (two POVs is a sweet spot that actually can speed up pacing, rather than slow it down) it just makes it much, much harder to pace well. It also leads to a lot of “okay why this scene from this character’s POV” questions.\n\nSo it’s not inherently bad. I love Oathbringer, that’s got 27 POVs in it! But that’s the third book in a mega popular epic fantasy by a writer with a proven track record who also has a bunch of structural choices to mitigate this very pacing problem. It can be done. It just can’t really be done well by most of us"}, {"comment_author": "GregFirehawk", "comment_text": "I don't know if that 27 number is accurate as I don't really pay attention to those kind of details, but I never felt like there were more than a handful of POVs at any given time on that series. You had roughly 3 or so main characters at any given time, and then there would be one or two relevant side characters that might take over to help establish things as needed. For any given... I guess you'd call it a story arc, or maybe a scene, or an act, I'm not sure. The point is for every such instance there were typically only around 5 or so POVs, and it's only when the book transitioned to a new event that it would start to switch around the POVs to more relevant characters. This is how I remember feeling when I read it anyway. Also that series is extremely long, and all the characters were well set up in advance. Most of the new POVs that were introduced were from key supporting characters being promoted to a main character role after several chapters of characterization"}, {"comment_author": "thestephenwatkins", "comment_text": "I wouldn't call it a hard and fast \"rule\", per se, but I'll concur with others here that 30 is quite a lot of POVs. If most of those are basically throwaways - you meet them, get in their head, and mostly never see them again all after that one scene - maybe it's fine. On the other hand, are you sure there's not a better way to convey the information necessary than by introducing a new POV? It may be that there's not a better way. (I can't say for sure; I don't have a full view of your story.) But often there are other ways of telling the story. \n\nSomeone above brought up Wheel of Time, and a common criticism of this series (which I mostly love) is that there's significant POV bloat. There are literally dozens of throwaway characters who appear for only a single scene (and dozens more side characters who get their own occasional POVs). Most of those throwaway characters are completely forgettable. I even forget half the more significant side characters names. There's even, infamously, a whole book that's literally mostly side character reactions to the major climactic event in the prior book. It sometimes makes for a confusing reading experience, and I don't think WoT is necessarily better for it."}, {"comment_author": "TurquoiseHareToday", "comment_text": "Can you write 30+ POVs if you want to? Yes, of course you can! Are you making it harder for yourself to write effectively? Also yes. 30 POV characters is a lot of people to keep track of and give distinctive voices and personalities. Maybe in the edit it’s worth thinking about how you could reduce the number of POVs to, let’s say 5-6."}, {"comment_author": "NatashOverWorld", "comment_text": "It's not a good idea. But if you're going to do it anyway, you had better make each POV character very obvious and distinct, so you don't have readers going, \"who's this again, what's their part in all this\".\n\nRobert Jordan had that character bloat issue which made the plot drag imo, and because it could be years between books you almost always had to go back and read the older books to remember who this character is,  and their side quests."}, {"comment_author": "Wendigo_Bob", "comment_text": "Robert Jordan is the one who killed multi-perspective narratives for me."}, {"comment_author": "NatashOverWorld", "comment_text": "I liked the story but just couldn't get past book 9. This giant ass book, but because of character bloat it was pretty much the equivalent of _one day_ of events!"}, {"comment_author": "Infinite_T05", "comment_text": "Okay I want to thank you all in advance for the responses. They've definitely widened my perspective. I am more aware of needing to be careful about distinguishing each character, but I'm also satisfied with how I've been doing it thus far and I will continue to do so.\n\nTo add some context that might alleviate the issues, book 1 will be focused around the main character, his two companions, and the one villain that wants him dead. There will be side characters introduced, but these are the only characters that receive a POV. Out of the 30 chapters, the main character receives about 25, the villain about 2 and the deutaragonists 3. This establishes who our main cast is before we bombard them with new characters.\n\nBook 1 introduced around 8-10 side characters that do receive love, and most of which continue to show up consistently for the rest of the story. They begin getting POVs in book 2, though the main character still has about half the chapters.\n\nMy story doesn't really dismiss characters very often. If I introduce someone, odds are they're here to stay. So you won't see random POVs from characters we'll never see again. They will always be characters that we've already been introduced to, and we will rarely be learning about them through their first POV. \n\nAnother thing I should bring up is that I absolutely love all of my characters. I know there's a lot, but of the 30+ there's only a couple that I haven't really connected with. My main character is obviously important, but so are my side characters. The vast majority of them have their own stories, conflicts, emotions and relationships that undergo development across the story. That's why I have so many POVs. If there's anything I pride myself on, it's how alive my cast feels. And that means that they all contribute towards the overarching story with their individual developments. That's why I won't zero in on just a handful of POVs. So when it comes to what I want to write, I think the multiple POVs of relevant characters is okay. Removing some will remove their character.\n\nHowever I do understand that the reader won't feel the same way. If and when I do another draft, I will absolutely consider trimming down the quantity of POVs, and more importantly, I'll make sure they all sound different. They sound distinct in my head, but I cant confirm that others will agree. It definitely would be dull to have the same voice describing dozens of different characters.\n\nSo yeah, thank you all for the feedback. I appreciate it"}, {"comment_author": "ofBlufftonTown", "comment_text": "When I hear this I always want to say, have you thought of third person omniscient? Even third person limited omniscient? You have zero constraints on saying what’s in the minds of multiple characters even in the same scene, forget the same chapter. You’re under no obligation to say everything—your characters can keep as many secrets as you like. You can keep your focus on one person as long as you like. You simply have total control over revealing everyone’s motivations or reactions to the readers. I don’t know why people are so opposed to it; it’s obviously easier than anything else. It’s also particularly suited to high fantasy. Do you want people to know what *fifty* characters are thinking? Go for it, you’re an omnipotent, all seeing god and the characters now before your throne."}, {"comment_author": "Stardust-Musings", "comment_text": "When you describe it like this, introducing them properly before they step up to be POV characters, it feels a lot less daunting for the reader. Obviously, you can't make everyone happy but I think fans of the fantasy genre are more open to reading multiple POVs so it's probably not as big of a problem.\n\nThat said, once you've got your first drafts down be prepared to sacrifice a few of the POVs to the Kill Your Darlings chopping block to streamline the story and trim a few chunks of fat. Only keep those that are really truly necessary. If there are a bunch of stories with those side characters that you just love but don't add much to the main plot you don't have to delete them- just maybe put them in a short story collection or write a companion novella or something."}, {"comment_author": "Recom_Quaritch", "comment_text": "I think because newbies are warned against it. It is hard to write, demands a good narrative voice, and is extremely prone to devolve into head hopping. The moment someone head hops I close a story and move on. There aren't that many writers I trust with that pov out of the gate."}, {"comment_author": "Euroversett", "comment_text": "I definitely don't like it, switching POVs to get the perspective you want.\n\n\nIf I'm reading a multi-POV story I'd expect every single POV character to have their own full fleshed story instead of existing for the sake of being the eyes in a given scene.\n\n\nIt'd have to be something like ASOIAF. I wouldn't come close to a story that switches POVs for the sake of having eyes in a given scene and nothing else, but who knows maybe others think differently."}, {"comment_author": "albenraph", "comment_text": "It’s not bad, it’s just harder to do well. For each pov, you have to fill us in on who this character is, what’s going on where they are, and make the reader care, all without getting boring. That’s way more difficult than establishing one or two povs"}, {"comment_author": "may_june_july", "comment_text": "30 is a lot, but it's not unheard of. Have you read Wheel of Time or Malazan? These are both popular series with many POVs, and might serve as examples on how to do frequent POV switches well"}, {"comment_author": "hoopsterben", "comment_text": "Not anything is always bad when writing. Want to tell a story of 100 people doing one small thing to come together and accomplish a task? Sure. Why not? \n\nAs long as it’s the story you want to write, give it hell."}, {"comment_author": "greenscarfliver", "comment_text": "https://wot.fandom.com/wiki/Statistical_analysis\n\n> The Wheel of Time main series consists of fourteen books and a prequel. The books are written from different points of view (POVs). The series has 147 unique POVs and 1,379 total POVs\n\nThe main (5) characters account for only about 50% of the total pov chapters.\n\nNow, keep in mind this is *Robert Jordan*, a fantastic writer, and even he needed a very strong editor, appendices, and a companion book to pull it off. And even with all of that the series is still plagued throughout by some character arcs becoming stagnant, and a few pacing issues. It's not easy to do."}, {"comment_author": "Mejiro84", "comment_text": "quite a few of those PoVs are one-offs as well - I think the prelude of every book is one or more never-seen-before randos, so that's probably 30+ of those PoVs."}, {"comment_author": "WandererTau", "comment_text": "Sure you multi-PoV can be done well if you show restraing and...  \n\n\n>30+ characters that have a chapter told through their eyes\n\nRIP"}, {"comment_author": "Akhevan", "comment_text": "> Is this true? If so, that kinda sucks  \n\nI'm not trying to insult you specifically, OP. But have you actually read any fantasy? Epic fantasy for instance? Large, sprawling series that typically feature.. a lot of POVs? Hundreds of them at times?   \n\n> Instead of jumping through hoops to get the reader to learn things that the main character shouldn't know, I just swap POV to whoever is best suited for the scene.  \n\nThat's 101 of writing, even novels that are limited in scope will often resort to this technique.   \n\n> This ends up with me having probably 30+ characters that have a chapter told through their eyes  \n\nOver how many pages is the question here. That sounds excessive for a reasonably short novel. For something on the scale of Malazan or Game of Thrones? That's positively conservative."}, {"comment_author": "Ryinth", "comment_text": "I use a lot of POVs across my series, but try to do so judiciously, and in a way that won't confuse the reader.\n\nSo for book #1, it's primarily two POVs, except for two short chapters when both those POVs are unconscious/injured. These two additional POVs are both characters we've spent at least a couple of chapters with, and are just sort of a... bonus peek into them, I guess?\n\nFor #2, #3 and beyond, we open it up a bit more, as the reader is getting more and more familiar with the characters (both in their POV and outside of it), so it becomes natural that character X, Y or Z is the right choice for that moment in time."}, {"comment_author": "LadySandry88", "comment_text": "There's nothing wrong with having lots of POVs if you're good at indicating whose POV is whose--not just through explicit 'chapter title: name', but with them having different 'character voices' and viewpoints and such.\n\nThe problem comes when you switch POV within the scene and it's not easy to tell."}, {"comment_author": "KristenStieffel", "comment_text": "Editor here. Readers get attached to characters. The more you switch the viewpoint, the more you fracture the reader attachment to each character.\n\nIf you really believe it's critical to your story to show what each of these 30+ characters is thinking and feeling, that's an appropriate reason to use omniscient viewpoint instead. An omniscient narrator puts distance between the character and the reader, but since you're in the narrator's head all the time, you're not breaking the viewpoint every time you put the focus on a different character. The distinctive voice of the narrator will give the narrative greater cohesion and lessen the effect of all the switching."}, {"comment_author": "GregFirehawk", "comment_text": "I think you might just want to narrate the book in third person at this point lol. Multiple POVs is fine but this is beyond excessive. Pick a handful of anchor characters and limit the POV exclusively to them. Even 3 POV characters is a lot, so 5 should be plenty. You seem to be choosing character POVs like they are camera angles, and unless you are writing a screenplay that isn't going to work.\n\nThere are some authors who have done it successfully, but there is a lot of leg work that goes into making a character suitable for a POV, and every POV character needs to be treated especially delicately with how they are utilized. If you really want good feedback you should find someone to actually read your book, and they'll probably tell you within 400 pages whether your use of multiple perspectives is constructive or just diluting. I understand it can be difficult to judge as the author as your own insights and attachments will significantly differ from a readers given that you are the world builder"}, {"comment_author": "mig_mit", "comment_text": "I've recently read a book with a couple of dozen POVs, and couldn't shake a feeling that several of those were there just for the sake of being there. They could've been summarized in one sentence from some other character's POV.\n\nSo, go ahead, but remember to ask yourself: is this part really necessary?"}, {"comment_author": "KYO297", "comment_text": "Is it a \"bad\" idea? I couldn't tell you. With multiple POVs, I very often end up choosing my favourite one, and rushing through (or even outright skipping) (some of) the other ones to get to the \"good part(s)\". \n\nUnless *ALL* the parts are the good parts. I haven't read many multi-POV stories, but there was one like this. But there also was one in which whenever a non-MC POV came up I immediately went into \"alright, time to read every 10th sentence to make sure nothing important is happening\" mode."}, {"comment_author": "nathpallas", "comment_text": "Personally, I enjoy multi-POV stories, but it has its drawbacks, and I have read some books where the character switching made the narrative worse as a whole.\n\nEarly on, many switches means that it’s harder to connect with the main cast. Sometimes, I’ll only have one character I’m interested in so the rest feel like they’re drawing attention away from the more exciting parts. That could be more of a pacing issue in some cases though.\n\nThere’s also the dilemma that if a character’s POV has gone dormant for a while, it’s hard to remember what their arc was even about. I’ve flipped to a chapter and gone, “Wait, who is this guy again?” And that’s never fun.\n\nOne-off POV switches also kinda irk me. If the narrative switches to a character and then that person is never seen or heard from again, it feels like a waste to me. I’d rather the story progress all of the people I’ve been invested in so I learn more about how *they* see the world, not Conveniently Placed NPC E.\n\nBut on the other hand, multi-POV is an incredibly effective method to paint a grey world with lots of moving parts and ambitions. When done well, it’s a fantastic way to experience a story. I can fully understand, though, people shying away from them because there’s also a high chance of it being mishandled."}, {"comment_author": "jubilant-barter", "comment_text": "I'm not going to say whether it's \"true\" or not.\n\nMy personal opinion is that you make whatever choice you need to make that's right for the story that you're telling.\n\nBut. My experience is that readers have a limit to their emotional, and empathetic agility. They can struggle to bounce between personalities and perspectives if it happens too fast and too often. I've found that limit in myself, although I consider my patience for POV swaps to be fairly high - just not unlimited.\n\nReaders'll get overwhelmed if you throw too much at them. Most can't handle twenty POVs. Many can't handle 6. Some may struggle with two. And that limits your potential audience.\n\nSo if you can get away with fewer jumps, try to. But otherwise, the story is the story is the story. And you're not going to carry every reader anyway. Make allowances. Make smart choices. But remember the old adage: a story that's for everybody is a story for nobody."}, {"comment_author": "AFKaptain", "comment_text": "Multiple POV can totally work (*see: The Expanse*). But it can also be lazy."}, {"comment_author": "obax17", "comment_text": "It's neither a bad idea nor a good one. The key is execution. Do it well and it makes for an interesting and varied narrative. Do it poorly and it makes for a choppy and disconnected narrative."}, {"comment_author": "malpasplace", "comment_text": "No one can know about you work in particular because they haven't read it.\n\nWhat I notice is that you have concerns, and don't appear to feel confident about the choices made, because otherwise why write this post?\n\nHow much of these books have you actually written vs planned? The reason is if you have written it out  and you are content as you appear to be with how the story is told, having a beta reader or two read it would give tons of critical advice that you aren't going to get in the abstract.\n\nIf the work is more in the planning stages, then I would really have a whole lot less sureness that it is \"best suited\" vs what appears to be a good idea. Most fantasy books I've read, even ones with lots of POVs like GRRM, JRRT, Robert Jordan, seem to use them with great care and planning.\n\nFor the record, I think the number of possible POVs is almost endless.But that often multiple POV by being popular today, tend to be a poorly used tool that most writers don't know how to use that focus. Is it a bad idea to use a lot of POVs, nope. But it is a bad idea to think that it is just generically cool and worth applying to any story and that it can be lazy and show an inability to find the through-lines of the story. Instead of purposeful focus, it is a muddled mess.\n\nIt depends on the work."}, {"comment_author": "whentheworldquiets", "comment_text": "It's not a question of how many PoV you are using, it's a question of *why*.\n\nYou say you have a main character. So you know that main character's story has to make sense in its own right, because it's the one they are living and reacting to. It has to be thrilling, intriguing, engaging, emotional.\n\nSo what are all these digressions *for*? How are they supporting and enriching *that story*?\n\nFor instance (speaking in generic fantasy tropes), if you are showing an assassin passing through a town your hero has visited, asking folk about them, that can be great. You're creating tension, you're hinting at a bigger picture, and you can plant clues for the reader to look out for - can they spot the assassin before the hero does?\n\nIf someone is ordering the siege of a city the hero is headed for, again, potentially great. Will the hero get there first? Be stuck inside - or outside? What are the attackers after? Might it be what the hero is after? Or something else? You could tell that mini-chapter from the perspective of literally anyone in the chain of command - or from a villager who loses his home to the invading army and sees them marching on the capital. Big Stuff Is Happening - but what *matters* is that the reader can appreciate its impending impact on the MC's storyline. Then, y'know, the hero unwittingly takes the prince the army was coming to kill hostage and escapes with him and it's all SO much worse than the reader expected.\n\nOnce you've pulled that off a few times, you can start being a bit more coy, leaving the significance of a side-scene temporarily ambiguous. Your reader will trust you at that point and understand that it's a teaser.\n\nBut if you are just leaping around telling the reader things they don't actually *need* to know yet, the lack of connective tissue is going to have a diluting rather than reinforcing effect. You run the risk of your reader thinking: \"This is all very nice, but I don't know *why* you are telling me. I can't join the dots.\""}, {"comment_author": "fejobelo", "comment_text": "The problem is not multiple POVs, the problem is poor execution. Well executed narrative can swap POVs without issue.\n\nThe two most important pitfalls to avoid are:\n\na) confusing the readers in terms of jumping from head to head without a clear transition. Golden rule here is one chapter, one POV. You need a lot of skill to make different POV in a chapter work.\n\nb) Writing about things that current POV character hasn't learned yet, or about feeling or thoughts of other characters."}, {"comment_author": "RobotCatCo", "comment_text": "You can definitely do it with 3rd person omniscient (Lord of the Rings does this) and even with 3rd person limited with a few tricks.  People who like to read 1st person PoV do not enjoy constant PoV changes."}, {"comment_author": "VenusianBug", "comment_text": "There are lots of excellent books that have multiple POVs. There are some genres where it's very rare, and readers don't expect it and may not like it. \n\nI write multiple points of view, but the issues I have when reading multiple POVs are:\n* head hopping, where the author jumps around within the same scene - drives me bonkers. Pick a POV for that scene and stick with it. \n* when it's not clear whose POV the new scene is in - I suggest writing the paragraph in such a way that you make it clear early on in the scene, like first few sentences early."}, {"comment_author": "BloodyPaleMoonlight", "comment_text": "Harry Turtledove has never had a problem with it."}, {"comment_author": "Jonlevy93", "comment_text": "GRRM: *chuckles* I’m in danger"}, {"comment_author": "dragonofthesouth1", "comment_text": "Probably too many, but it can be done well. My recent favorite example is The Heroes by Joe Abercrombie."}, {"comment_author": "a-corner-of-hell", "comment_text": "In my opinion, I think 30+ POVs throughout the course of a story is just exhausting, with the exception of a short/simple story that *hinges* on the idea of multiple perspectives. If it’s longer than short story length, it just gets confusing and/or frustrating for the reader. Switching POVs between characters to show different perspectives of the same plot can be interesting, but try to ask yourself “does the reader absolutely need these POVs and story details, or have they already been told elsewhere?”"}, {"comment_author": "azaza34", "comment_text": "There is no way you have 30 interesting characters. I literally don’t believe it"}, {"comment_author": "azmiir", "comment_text": "This must be a troll post. There’s no way you genuinely think 30+ POV is a good or enjoyable thing."}, {"comment_author": "Dramatic-Soup-445", "comment_text": "Sounds like laziness actually. Instead of doing the work to show how a character progresses from one scene to the next you just introduce a new character at a new scene.\nSounds like a shortcut but now you have 30 short stories that need resolution.\nI'd be interested in seeing how such a work works. Good luck to you."}, {"comment_author": "Party-Ad8832", "comment_text": "The average reader is likely able to follow a couple. I have a total of 3 POV characters and two extras that appear in singular chapters in a series of 4 books and I never really counted all my characters but it is a 3-digit number.\n\nAlthough you are certainly able to churn a 12-volume series with +1000 pages each with that many POV's."}, {"comment_author": "ALX23z", "comment_text": "First, you are confusing between having a secondary character with frequent POVs and interlude-like chapters from the POV of some random guy. I'd expect the former to have multiple POV chapters, some describing their past and worldview.\n\nImagine you have a 25-chapter book - and each POV takes at least a chapter. How many external POV chapters can you have without severely disturbing the flow and pace of the story?"}, {"comment_author": "Material-Status-8667", "comment_text": "If you write it coherently then there should be no issues,  but lots of head jumping can be confusing. Normally a chapter should have very few characters of focus, and any others should be clearly defined and relevant. You can also express how a minor character is feeling through language and demeanor instead of hearing their direct thoughts. Sometimes its better to let the reader fill in the emotional blanks"}, {"comment_author": "UWan2fight", "comment_text": "I have to ask, it seems like these POVs are just in a few-off \"Interlude\" type chapters? Or are they like, proper POVs. \n\nA few chapters from another character's perspective (side character or part of the main cast) can be great. It seems like that's what you have here, but if they are full-on proper many chapter POVs, it could get a little confusing."}, {"comment_author": "TheHardcoreCarnivore", "comment_text": "I keep seeing these, nearly daily, and I wonder why not just go third person omniscient? Being inside everyone’s head all the time works out to the same effect without all the confusion."}, {"comment_author": "JaffyD", "comment_text": "Its not bad, but if you have no idea what you doing (and new writters 90% dont) a how to handle it properly, your work would be crippled..."}, {"comment_author": "Schmaylor", "comment_text": "Make your decisions with intent. Know what you're doing, why you're doing it, what it adds, what it communicates to your reader, and how it compares/contrasts/relates with other chapters in the story.\n\n30+ characters is a lot, but if I can put the book down and say \"Okay, I understand why they did this,\" then it doesn't really matter if it breaks convention."}, {"comment_author": "riquelm", "comment_text": "It's not a bad idea because of number of characters, plot and such, but because it's super hard to pull off writing it, especially for someone who doesn't have 10+ written books already. You need to evoke empathy for every POV character, give them distinct voice, character arc, characterization etc. I won't be trying it any time soon, maybe in 10 years  "}, {"comment_author": "DazzyD1987", "comment_text": "I don't think about the number of POVs when I read or write. If it works then it works."}, {"comment_author": "Assiniboia", "comment_text": "Depends. If the execution is good, not an issue.\n\nSome series require a large cast of necessary povs (Malazan, etc). Some have a large cast of povs but not all of those povs are necessary (aSoIaF); some characters may be stronger without the internal monologue (Cersi; Sansa). Some series have a limited cast of povs but occasionally pop into a secondary or tertiary pov to create an effect (WoT) which is what this sounds like.\n\nThe largest risk is to the story. Story is not plot. So if you’re jumping into secondary characters just to show a reader something, that something needs to be necessary. Secondly, if you’re jumping into other povs with regularity those characters need their own stories, plot-lines, and development to feel valid. Otherwise they exist solely as a camera and that feels cheap.\n\nWhat this means is consistency. If you’re using consistent characters to show other angles, those characters need development to be valuable. You could, otherwise, not use the same secondary povs. That might be kind of interesting, asides to the main story. You should, still, develop those povs but it would be a neat challenge.\n\nThe other option is to use Third Omniscient as your pov, so the camera is everyone and anyone and the narrative is allowed information your main character doesn’t know. Your camera mainly follows them, but if you use your page structure well you can show a reader when you’re changing to another character. Omniscient is not “in style” these days, but was popular in the earlier decades of the 1900s up until the 70s or so, depending on genre.\n\nThe other consideration is: why do you think the reader needs to know those things? Keeping information withheld is a huge way to increase tension and put the reader under stress, so to speak. The audience doesn’t need, and is not entitled, to know everything.\n\nGood writing, arguably, is lying to your readers but doing it so that they enjoy the effect."}, {"comment_author": "NoZookeepergame8306", "comment_text": "So any time you do something that causes friction with a reader, like switch POV, you need to have a darn good reason for it.  And you need to work that much harder to justify it.\n\nMalazan is never going to have the popular readership of a Sanderson novel.  And that’s okay!  Erikson knows that he’s writing in a way that makes his books difficult to follow but that complexity is rewarded because he’s a damn good writer.\n\nI did not finish Gardens of the Moon.  If that tells you anything.\n\nGame of Thrones had wide acceptance by a huge readership… but it also had crazy buzz and word of mouth (as well as a hit TV show) to get readers excited about sticking with it.  Martin is also brilliant at anchoring the reader in the character’s idiosyncratic pov.  \n\nSo, you’ve got your work cut out for you!  Stick to your guns if you really believe in your method.  But honestly I’d take a look at the POVs you have and see if you can whittle them down a much as you can.  Really justify them.  For example, do we need to understand the villain more than what we can infer from their actions on the plot as understood by our heroes? Like, Saron and the White Walkers don’t get POVs for a reason!"}, {"comment_author": "Mindless_Reveal_6508", "comment_text": "As stated frequently, 30 sounds like a bit much. Especially for fantasy. It's been my experience for multiple povs, I use characters who are \"locked\" in a significant location as well as providing pov character name and location as part of the chapter title header. Example:\n\nThe Corinor Disaster\n\nKing Thomas, Hugeland Summer Castle \n\nDuring this character's intro, his failing health was described as \"on his deathbed.\" His point of view voice is made unique because all his new info comes from different advisors whom he holds in varying degrees of trust and disdain. The actual advisors really don't need much more than a title to be announced before entry into the King's chambers. Their voices are more like reports, most of the time.\n\nUsing a fixed, unique to that pov voice, location helps readers to quickly remember who is talking to them.\n\nUsing different voices is a must but readers may have a problem distinguishing between them. A good example is a Scottish Highland accent when written looks similar to an Irish Coastal, although they actually are clearly different when heard. This means you need more extensive backgrounds for these pov characters so their life experience can show in the way they describe events, who they like, dislike, or are ambivalent towards. To prevent these voices from feeling one dimensional to the reader I find myself including minor character arcs into the overall story/mc arcs.\n\nDone well is not lazy, it's a lot of extra work both before and during story development and writing. And don't get me started about dealing with beta readers, agents, editors and publishers. WORK, WORK, WORK!\n\nBut never forget, it is your story to tell. Tell it the way you hear it in your head, you will probably always wind up changing/fixing things for the 2nd, 3rd, ... drafts anyway. That's the publishing part of being a successful author.\n\nBe you, write for you!"}, {"comment_author": "dragonsandvamps", "comment_text": "Well... like with anything, it depends.\n\nIf executed well, it works. But 30 povs is significantly harder to execute well than having 1-4 povs. You have to consider whether having that many povs means that you are losing momentum with each separate storyline. You have to consider whether having 30 povs means readers feel like they need to take notes on who's who in your book in order to understand the plot. Do they get a headache and DNF at that point? Could you tell the same story just as effectively by keeping to 6 povs or fewer and relating what happens to those side characters, keeping them side characters?"}, {"comment_author": "Mysterious_Cheshire", "comment_text": "There are lots of stories which have lot of povs and it's completely fine. Can be confusing at times, yes but it's fine.\n\nI, for example, have read \"Zero\" and listened to the audiobook \"Blackout\" by Marc Elseberg. Or how I like to call him: the master of vivid and many characters.\n\nIt has been very confusing for me to read Zero after listening to Blackout (because the audiobook used different voice actors etc, so it was fairly easy to keep track.) Reading Zero was more confusing, because while you noticed you jumped somewhere in the povs you don't always know where you jumped to.\n\nBut it's still a great book. Both are great books, I love them (paranoia definitely kicked in with both but yeah). So, yeah, it's not necessarily bad. But so is any other rule in writing. These are all more guidelines. You can technically do anything, if you do it properly :3"}, {"comment_author": "FaebyenTheFairy", "comment_text": "It takes great skill to do certain things well. Multiple POVs is one of them. But you'll never get better without trying"}, {"comment_author": "Tuga_Lissabon", "comment_text": "OP, I like the multi-POV. It gives you sort of a depth to the world, and you can present different events that the MC doesn't see - and maybe even the same event happening in different parts of the battlefield, for example."}, {"comment_author": "2bbygan", "comment_text": "I can kinda see what you’re trying to do here. I think the Stormlight Archive and ASOIAF are the closest things to the type of organizational structure you’re describing.\n\nGenerally, I find that with “bonus” POVs, you have to balance them with word count and the amount of time you’re giving your main POV. In fantasy, a main POV should be getting 60,000 to 120,000 words in a book, either directly or indirectly, as long as they’re on screen. Then, for each “main” POV, you can have up to five side POVs. Each main POV is effectively a book on their own. \n\nSo if I were to write a standalone with one main character, it could be 100,000 with four side POVs at 10k each. That’s reasonable. At the same time, if I wanna write a massive doorstopper, I can have four main characters, with 300,000 words between them, with 100,000 for the 20 side POVs I throw in.\n\n30 POVs in total is still crazy. You’d have to write around 6 main POVs at 100,000 each to satisfy that. That at least 800,000 words. Which is more than reasonable for an epic fantasy series, but still.\n\nAlso, I would avoid having an 800,000 word series with only one main character. It’s not that you can’t do such a thing… but I don’t think it would be very fun to write."}, {"comment_author": "sewing-enby", "comment_text": "If it's done well, it can be good.\nBut.\nIt can quickly get confusing. Think about WHY you need that character's POV. If it's just because they're closest to the action, consider a third person narrative that 'floats' between characters.\n\nThink something like \n'Flynn crept up towards the guards. One of them sneezed. Startled, Flynn dived behind the nearest thing which happened to be a large glass case.\nSilently, he created himself for being so stupid'\n\ninstead of\n\n'I crept up towards the guards. One of them sneezed. I dived for the nearest thing, a glass case. God I'm so stupid sometimes.'"}, {"comment_author": "zethren117", "comment_text": "It’s not that having a lot of POVs is inherently bad, it’s that most people will struggle to effectively write a story that contains many POVs. It’s a lot to juggle, even for a seasoned author. Most will probably tell you to stick to one, two at the most. If you don’t nail each of the POVs, and effectively weave them all together into one story, it will be pretty rough and very obvious."}, {"comment_author": "9for9", "comment_text": "I'm not a fan of it myself, but I have to ask if it's just to let the readers in on stuff the MC wouldn't be privy to what are some other ways to do that instead? \n\n* can the MC have or work with spies who could share some info\n* magic spying glass so the MC can watch their enemies\n* maybe 5 POV characters so the most important stuff is scene\n* maybe a spymaster who is able to get a lot of information and disseminate it as they see fit\n* does the reader need to know everything? forgive the language but could you be blowing your load too soon this way? mystery keeps the story interesting."}, {"comment_author": "joymasauthor", "comment_text": "If it's in third person, I don't see any reason this couldn't be a successful strategy to keep readers near the action and give them insight into different parts of the world, and I don't think it's inherently confusing or complicated as a reader.  It's a strategy that's been used before and it's not for every reader, but nothing is. \n\nMy only real thought is that you need to embrace the idea for what it is.  If you're using it as a shortcut in any sense, then I don't think it will work.  It won't save you any work, and it will make more work.  It's not a lazy strategy to get near the action... unless you're lazy about it.  But if you commit in full then it should be pretty exciting."}, {"comment_author": "NightDragon250", "comment_text": "Way too many POVs.\n\nI prefer following the MC and finding stuff out as they do.\nKnowing what's going on from the BBEGs POV just makes me feel the MC is an idiot for not seeing what I know at that point."}, {"comment_author": "MythicAcrobat", "comment_text": "My opinion as a reader/consumer. I think multiple is fine. More POVs work better in longer novels, if short, it’s easier to have too many.\n\nMy pet peeve is when I’m bombarded with several new characters/multiple names and POVs upon starting the book. Starting a book is disorienting enough. So I think MERGING in new characters and POV AFTER the reader’s had ample opportunity to familiarize themselves with the main 1 or 2 characters is best. Again, my opinion as a reader, not some writing professor (I think the reader’s opinion counts for more in this case because they’re the ones you want to keep turning pages. I will quit turning pages if too many characters to keep track of are introduced, especially before I’ve been given any reason to give a shit about them)."}, {"comment_author": "draigonalley", "comment_text": "If you think it’s bad, read *The Stand: Complete and Uncut Edition* by Stephen King. Monster of a book. Must be about twenty to forty different POVs in total, but the story mainly juggles just about ten or so."}, {"comment_author": "BookishBonnieJean", "comment_text": "As with anything, it can be done if executed well. But, it's harder to do well. \n\nMany readers become bored when they're reading the POV of a character that isn't the one they're most invested in (should be the protagonist). This makes POV switches seem like side quests. For some, it's just confusing to reorient themselves in a new head when the switches happen. \n\nOf course, it's been done with great success but I'd be lying if I said I enjoyed *all* the POVs in GOT for example."}, {"comment_author": "0MysticMemories", "comment_text": "The amount of people I’ve met who simply cannot comprehend a book with more than one POV is shocking. I’ve met people that get to a pov change and then just don’t understand what going on anymore because the pov changed. People that will basically get mental dialup noises and forgetting the entire story they’ve read after a pov change.\n\nIt’s not everyone but it absolutely amazes me that it happens to people. \n\nI personally enjoy changing povs and multiple povs."}, {"comment_author": "MysteriousLabyrinth", "comment_text": "I personally like reading POV writing. It just give me feeling of closer connection to the charaters from different perspectives."}, {"comment_author": "Zealousideal_Stay796", "comment_text": "I think it’s only ‘bad’ if the POVs are in first person. I can’t stand when a book is written in first person and it swaps POVs consistently. With third person I don’t actually think it’s a problem at all. There are some very well regarded books and series that have heaps off POVs without an issue, though if you make some characters more interesting than others people may want to skip through certain parts to get back to the characters they like."}, {"comment_author": "4n0m4nd", "comment_text": "The Malazan Book of the Fallen has 234 POV characters over 10 books."}, {"comment_author": "Lou_Ven", "comment_text": "I like multiple POV characters (as long as you're writing in 3rd person). My favourite fantasy series has anywhere between 33 and 141 POV characters, depending on which of the 10 books you're talking about."}, {"comment_author": "Nonzeromist", "comment_text": "Unless you're george rr martin, it can be rough and even then for him it's rough. Dude hasn't even finished his shit yet."}, {"comment_author": "axord", "comment_text": "[Relevant thread from a reader sub](https://www.reddit.com/r/Fantasy/comments/1amsun3/malazans_pov_count_and_the_resulting_narrative/)."}, {"comment_author": "FuujinSama", "comment_text": "I think there's a distinction that's often not made between main characters with a PoV and sporadic PoVs. For example, if you're writing a novel mostly from the PoV of a main character, but you often change POV to look at a given scene from the perspective of an enemy or a side-character so we can better understand how the MC is perceived by others? I don't think that matters too much in terms of pacing, getting \"blue-balled\", having to care for the new PoV or any of the many reasons why multiple povs can be tricky to manage.\n\nIt's very easy to get to 30+ PoVs if you enjoy switching to \"red shirt #5\" to describe how your MC is tearing through an army like a force of nature. The key thing is that in those types of PoVs, the protagonist for the chapter is still *the main character*, we just switched to a non-protagonistic PoV for a bit. Honestly, if those fit most of your 30 POVs, I don't think there's anything wrong with your novel. \n\nHowever, if you're having a lot of PoVs where the PoV person *is* the protagonist for the chapter, then you'll need to be more careful. The readers need to care about that person and they need to not resent you for switching PoVs when some place else seemed more interesting. You also need to have this mini-arc with this different PoV be just as satisfying and captivating as your main story-arc. That's hard as fuck to do."}, {"comment_author": "BlackCatLuna", "comment_text": "I wouldn't say that there are \"hard and fast\" rules when it comes to writing but rather there are ways to make your writing simpler or harder to follow. Having a large cast with many POVs is one of the things that risks making your story harder. \n\n>Instead of jumping through hoops to get the reader to learn things that the main character shouldn't know, I just swap POV to whoever is best suited for the scene.\n\nLet me ask you a blunt question here. Why does the reader need to know something your protagonist doesn't? The term for this situation is dramatic irony and it's not called that for nothing. It can be clever when done right but if it's overdone there's no sense of surprise for the reader.\n\nI worry that you're preoccupied with making every scene exciting. Slow moments are like salt in bread baking. If you put too much salt into bread dough you'll kill the yeast before it goes in the oven, but if you don't put any your bread will taste bland."}, {"comment_author": "CoffeeB4Dawn", "comment_text": "You should write the story your own way, but realize many readers may skip it."}, {"comment_author": "ThirteenLifeLegion", "comment_text": "It all depends on why that character is the right one for the POV.\n\nThe story I write, for example, has a lot of POVs, but the main reason is because the main character is a tricky schemer and being in her head all the time would give everything away, so it is a bad idea even if she's in most scenes. And about half my extra POVs are from characters who the reader can tell are either being tricked by her or about to die at her hands, often both.\n\nThe first question you have to ask yourself is if, narratively speaking, switching to the other POVs provides a better flow for your readers.\n\nAnd the second question you have to ask is how many of your extra POVs are recurring characters. One-offs for a specific purpose provide a lot less mental load to your readers than recurring POVs."}, {"comment_author": "QuickQuirk", "comment_text": "As a reader, I feel disconnected every time I switch from one PoV to another, and it takes me a bit of time to 'reconnect' to the narrative of the new PoV.\n\nI dislike even two PoVs, and hate it when there are many. It feels like I'm switching between books, and breaks me out of the story.\n\nHow do you feel about books that switch from PoV to PoV? Do you enjoy it? Is there a limit? What book can you think of where it *added* to the story, rather than distracted?"}, {"comment_author": "Cael_NaMaor", "comment_text": "Yeh... GoT sure was trash with all those... and Wheel of Time... and.... /s\n\nJust write your story."}, {"comment_author": "Unhappy_Pilot9971", "comment_text": "I don't like books with 30 characters to keep up with let alone 30 POVs. In my opinion it dilutes the main story and is a sign the author is stuck so let's throw in another character to expand the word count. I've run into this in fantasy romance when new couples keep getting added instead of moving the actual plot, and I like a good romance. Can you combine some of your POVs into fewer characters?"}, {"comment_author": "raendrop", "comment_text": "You can do anything you like as long as you do it well. You just need to clearly make the switches and avoid \"head-hopping\".\n\nRead Faulkner's \"As I Lay Dying\"."}, {"comment_author": "Wendigo_Bob", "comment_text": "I'll admit I'm not a fan of multi-perspective narratives anymore (and I'm somewhat salty about it). Its the big narratives like wheel of time that killed these for me. Here's my two cents:\n\n1-Multiple perspectives (if in alternating chapters) break flow. Nothing I hate more that enjoying a story, then having to pause it for a while to see the story of someone I dislike or am indifferent towards. This becomes especially problematic if the story that interests you disappears for most of the book (or entirely, to be payed off in some future hypothetical book) for no clear reason.\n\n2-Very few authors can really pay it off. Seriously, if you've got multiple perspectives, they've got to come together at the end of your writings (ideally, the book itself) and then there needs to be some kind of payoff for having these multiple perspectives. If the end state would make as much sense following just one perspective, then the rest is at best a distraction.\n\n3-Narratives become scattered. When you've got those multiple perspective, it can get frustrating if they're too distant from one another because it can be hard to grasp the point of it all. This is especially problematic with longer books, where there can be dozens to hundreds of pages between sections with the same characters.\n\nAnyways, this is what's made me dislike multi-perspective narratives as a reader. I actively avoid very long books (or continuous book series) for those very reasons these days. And look, younger me had more tolerance for that. But you're asking your readers to keep track of a lot of different things, so if there isnt a consistent throughline (like, for example, the perspective character always being near the main character) some people will get lost.\n\nI write solely single-perspective now. If I need to deal with multiple perspectives, I write distinct texts that I keep separate from each-other."}, {"comment_author": "Paid-Not-Payed-Bot", "comment_text": "> to be *paid* off in\n\nFTFY.\n\nAlthough *payed* exists (the reason why autocorrection didn't help you), it is only correct in:\n\n * Nautical context, when it means to paint a surface, or to cover with something like tar or resin in order to make it waterproof or corrosion-resistant. *The deck is yet to be payed.*\n\n * *Payed out* when letting strings, cables or ropes out, by slacking them. *The rope is payed out! You can pull now.*\n\nUnfortunately, I was unable to find nautical or rope-related words in your comment.\n\n*Beep, boop, I'm a bot*"}, {"comment_author": "K_808", "comment_text": "Huh? Plenty of fantasy novels have many POVs\n\nEdit: 30+ might be too many"}, {"comment_author": "Kiki-Y", "comment_text": "30+ is *excessive* imo. I feel like a series I enjoy a lot, Green Rider, gets a bit excessive with the POV shifts and that's probably 10 or fewer characters per book. (I haven't counted.)"}, {"comment_author": "rdhight", "comment_text": "I think it would help if:\n\n1. It was half the main character and half everyone else put together, and\n\n2. It was clear that most of the other POVs were narratively disposable. Like many of their chapters end with them dying, or they get left behind by the spotlight, so it's clear we're not supposed to track the inner thoughts and feelings of these 30+ people across hundreds of pages."}, {"comment_author": "StubMC", "comment_text": "I would say it comes down to stakes. Are the stakes of your plot big enough to support that number of POV characters? Baseline is having a single Main Character going through a tough and transformative story arc, and overcoming huge obstacles to achieve their story goal(s). After that, does the addition of separate POVs add to or dilute the story? Magnify or lessen the stakes? The destruction of the world, or the fate of the kingdom for the next thousand years are the kind of stakes that can support a large number of viewpoints. One person's search for their purpose in life probably doesn't need any POV beyond the MC.\n\nThe other factor is the scale of your story. If the entire thing is set in a country village, far fewer POVs will be needed or will even seem relevant, but if the story involves the clash of nation-states and the machinations of powerful groups, it would be hard to provide the needed scope without a lot more POVs.\n\nThe real danger is always that your extra POVs are diminishing the main plot. Side plots can slow the main story, or side characters can diminish the intensity of the rivalry between protagonist and antagonist. The most important thing is to be brutally honest with yourself about the *need* for a different POV versus the *desire* to show a side character that ultimately your reader might find distracting or boring.\n\nGetting an outside opinion of whether extra POVs help or hinder your story might be your best bet, either through an alpha/beta reader or an editor.\n\nGood luck."}, {"comment_author": "Hydra-Mentality", "comment_text": "Brandon Sanderson Disagrees"}, {"comment_author": "FourtKnight", "comment_text": "you can pretty much use Sanderson as a model for what not to do. absolute hack."}, {"comment_author": "Hydra-Mentality", "comment_text": "Honestly I like his idea of the cosmere, multiple books having an interconnected magic system while remaining different, why do you think he's a hack?"}, {"comment_author": "TXSlugThrower", "comment_text": "30 is way too many. Even with the MC getting more, that's a lot of investment the reader has to spread around.\n\nI find 3-4 is about the max, even then, 1 or 2 should be the primary."}, {"comment_author": "Eventhorrizon", "comment_text": "I have seen it done well and I have seen it done badly. Harry Potter often opened with a different characters POV, Lord of the Rings had multiple POV, Game of Thrones has tons of POV, clearly it can work well.\n\nYou should ask yourself why you are using multiple POVs before you do so, what is the effect you are tring to achieve? If you have a good reason, go for it."}, {"comment_author": "T_Lawliet", "comment_text": "30+ POV characters, even throughout a series  is George R.R. Martin level shit. And George R.R. Martin was the *GOAT* when it comes to POV characters. Most writers won't be able to scratch that level of skill, and even with him the large amount of POVs is a big criticism.\n\nSometimes you do have to jump through hoops to tell your main character important info. But sometimes jumping through hoops leads to a better performance. Sometimes you'll realize you won't need to jump at all."}, {"comment_author": "Productivitytzar", "comment_text": "The problem I have with switching POV’s is momentum. \n\nIf there are four separate storylines, all taking place miles from each other, with long-ish chapters (20-30 pages), and switching every chapter on principle, it’s going to take me four days to get back to the first POV. \n\nI felt this a lot when reading Kingdom Of Ash and the Red Queen series. \n\nHowever, if the chapters are shorter, or a few of the POV’s take place in the same location with the same characters, I don’t have that problem. I once read a book that religiously switched pov every chapter, but the chapters were like 2-5 pages each, and I blew through that series so fast. There are some parts of the King of Scars duology where it switches between two character’s POV’s regularly but they’re in the same location, so it was easier to keep going. \n\nI know not everyone feels this way, but my husband can relate to this and I imagine there are plenty of others like me out there. In the end, do what you want to do and write what you’d want to read."}, {"comment_author": "InVerum", "comment_text": "I'll be honest, this sounds awful.\n\nI read a book recently that did this and it almost made me DNF. It wasn't as bad as you're describing. \n\nIf the only way you can get us the info we need is by head-hopping—that's lazy writing. \n\nThe point of a story is character development. You can't grow 30 characters, we won't even remember them.\n\nI absolutely wouldn't read a story that did this."}, {"comment_author": "ABCanadianTriad", "comment_text": "Strange, almost all the most popular and imho best written fantasy have large numbers of povs. For a bad idea it sure works great"}, {"comment_author": "Mejiro84", "comment_text": "a lot of them don't have that many at once - _Wheel of Time_ has hundreds over the course of the series, but 50%+ of the books are from the same handful of main characters, and a lot of the PoVs are in the prologue of each book, that skips through a couple of randos, bloating the count up.  There's a breakdown here: https://library.tarvalon.net/index.php?title=Point_of_View_List_-_By_Chapter, and you see the same names a LOT, with each book typically having just 3 or 4 central ones, and it's not until pretty deep into the series you get more than that.  \n\nThere's maybe 30-ish long-running ones... over the course of 14 books.  Trying to do that in a single book means they get maybe a chapter each - at that point, you don't have a main character, but a lot of side characters all swapping in and out.  Doing that even in a trilogy still means you're not spending much time with the \"mains\", you're endlessly hopping into side-characters for a bit and then away (or hopping mid-chapter, but that's not liked these days).  If you have that many PoV characters, then an editor is likely to ask \"why?\" and if you can have merge some of them into the same character, so readers aren't continually getting jerked around and asked to be in yet _another_ head."}]}, {"post_title": "Short chapters?", "post_url": "https://www.reddit.com/r/fantasywriters/comments/1bypb4z/short_chapters/", "post_main_text": "Okay, this is probably not a *huge* deal. But it's making me worry some. I'm currently working on a new project that I may or may not publish one day, but I'm starting to worry if my chapters are two short. Most of my chapters are at the 1500 to 2000 word count. I suppose those are only the first few ones, but still I wonder if that will turn people off. My fantasy book is not a very complicated one, at least not this specific world. It's mostly just set in Cuba but with sea monsters and such, so I don't have much world building to add. Is this gonna be an issue?", "post_comments": [{"comment_author": "ofBlufftonTown", "comment_text": "My feeling is that those are fine lengths, as long as there’s some punch at the start of the new chapter. And even if a reader were surprised at the first break, they would get used to it fast. Go with god, my child"}, {"comment_author": "Omnipolis", "comment_text": "If you think about it, that’s really like 4-6 pages. That’s ok. The advice I would give to someone with short chapters is that you still need to have “read-on prompts” at the end and start of your chapters. Hooks, nudges to the reader to keep them interested."}, {"comment_author": "Lou_Ven", "comment_text": "I have a bit of an issue with chapter length as well. My current project is divided into chapters that feel massively long (chapter 1 is nearly 14,000 words) but are split into several scenes (around 1,000 to 3,000 words) with scene breaks in between. I've been wondering about abandoning the chapters entirely and numbering the scenes, so they're kind of treated as chapters but they don't start on a new page each time."}, {"comment_author": "Logisticks", "comment_text": ">Most of my chapters are at the 1500 to 2000 word count.\n\nThis is *more* than okay for a single-POV story. In fact, thrillers are sometimes paced even faster than that.  For example, take *The Da Vinci Code* by Dan Brown, which is a single-POV story where the average chapter length is 1350 words, and due to the short chapter length, the book is 103 chapters long in total.\n\nThe thing about a single POV story is that, if the reader feels like your chapters are \"too short,\" they can just read another chapter.  In fact, that is sort of intentional in the case of Dan Brown's novels; they're paced quickly to make them more addictive and give you the appetite to read just one more chapter before going to bed.\n\nThe main place where short chapters become a \"problem\" is when you never get the chance to spend much time with the same character. And even then, ~2000 word chapters are fine: *Jurassic Park* hops around a lot, and it still averages just under 2000 words per chapter.\n\nIt's common for chapters to be longer in the fantasy genre, because they tend to have stories that are paced slower than a typical thriller, and will sometimes spend more time dwelling on the setting and describing details to give the reader a greater sense of immersion.  But as you note, your story doesn't require a ton of \"worldbuilding,\" it sounds like your premise is sort of like Jurassic Park in the sense that it's \"like the real world with a few things changed.  There's no reason your fantasy story can't be paced like a thriller."}]}, {"post_title": "The Kindling Pyres - Embers of Mourning Excerpt [Flintlock Fantasy, 1615 WC]", "post_url": "https://www.reddit.com/r/fantasywriters/comments/1byoea0/the_kindling_pyres_embers_of_mourning_excerpt/", "post_main_text": "Looking for general feedback, impressions of writing style, and weaknesses. I've gotten very good feedback from this sub in the past and am hoping to receive more! If you only read this far, thank you.\n\nThis excerpt is a small character motivation section from one the main view point characters. Comments on technique, pacing, and interest would be appreciated!\n\n[https://docs.google.com/document/d/1uYKM9ZCUa8nQhqUZo2akUonBovl2Cfta2PgJcf73qUg/edit?usp=sharing](https://docs.google.com/document/d/1uYKM9ZCUa8nQhqUZo2akUonBovl2Cfta2PgJcf73qUg/edit?usp=sharing)\n\nOther geewizz context/Ramblings:\n\n* This is not the opening chapter.\n* Setting is essentially a colonial fantasy where soul magic, called Pyromancy in universe, has been weaponized by a large standing kingdom to assert dominance over the world. In this world, the soul is visible. Spark like embers emit from living things when they die, leading to the massive perception that souls are fire-like. They are referred to as Pyres hence the series name: The Kindling Pyres. Essentially instead of a horrifying navy, the British empire developed suits which turn their armies into super soldiers in various ways using Pyromancy. Though the comparison grows weaker ends out of summary. This is core conflict of the series and the main characters are all involved in it in some fashion.\n* Callus is one of the main protagonists of the series. He is a lumberman who works in the Maw. A huge chasm with trees that grow upward from the cliffside like snaggled teeth. Think Made in Abyss levels of scale, if we have any anime lovers here. His journey relunctly takes him to its depths in hopes for a cure for his daughter's ailment. But is he playing into some grander scheme or just pushing himself towards his own swift end?\n* This is a fantasy series I am trying to finish, but will likely table once I am done for a bit. I have been writing it for a long time and I have progressed a lot as a writer. This is one of my older excerpts cleaned up to my modern style. Though I found revision like this leans me back into worse habits. I don't revise old work anymore. Not until I am finished. I just did it for this post as I was feeling adventurous. I have Books 1-6 relatively planned out, but I know chances of series publication are not great. I am working on a standalone novel which has potential for serialization but is not needed. That is a historical fantasy set in the late 1800'ss where everything past from the Louisana Purchase onward is a primative America. Elevator pitch is the Witcher meets Dances with Wolves.\n\nThank you!", "post_comments": []}, {"post_title": "Ideas for an illusion-based magic system entirely based on manipulating the minds of others...", "post_url": "https://www.reddit.com/r/fantasywriters/comments/1byqhht/ideas_for_an_illusionbased_magic_system_entirely/", "post_main_text": "Say you could use some sort of illusion magic to tamper with someone's mind, but too much tampering drives the victim to madness. What might propel that madness to spread from victim to victim (or between magic users and victims alike) \n\nAnd what type of world might fit this magic system? \n\nI would imagine a world in which madness spreads like a plague (the one I am trying to build for my fantasy) would be apocalyptic? \n\nAny ideas are appreciated!", "post_comments": [{"comment_author": "rdhight", "comment_text": "I would think it would be a world where reality doesn't always trump belief.\n\nIn our world, reality dictates. It doesn't matter if I totally believe a chair is there to sit in; if reality doesn't agree, my butt is hitting the floor. There is no discussion.\n\nIn this world, there will be a certain... negotiation... between belief and reality. If enough people think their army is stronger, it probably will be. If enough people think eating Red Dye No. 5 will kill you, it probably will. The universe kind of harmonizes things behind the scenes. \n\nIllusion magic short-circuits this natural process by forcing false beliefs into existence. Force your illusions on enough people, and reality is forced to yield some points in the debate. It's unnatural and wrong.\n\nYou should read the Coldfire books; they have a similar setup."}, {"comment_author": "aspiringwriter2001", "comment_text": "Thank you very much for this. I'll have to look into those books. :)"}, {"comment_author": "Akhevan", "comment_text": "> I would think it would be a world where reality doesn't always trump belief.\n\nBah, that's just our own world. In a complex society you have to go through quite a few layers of fictions and abstractions before reality checks you.    \n\n> In this world, there will be a certain... negotiation... between belief and reality. If enough people think their army is stronger, it probably will be. If enough people think eating Red Dye No. 5 will kill you, it probably will.  \n\nThis is a trope known as plastic or consensual reality and I don't think that this is what the OP is going for. After all, it's based not on illusions but on the power of belief actually effecting tangible, physical change in the world.  \n\nBy the way, have you ever seen a purple orc?   \n\n> You should read the Coldfire books; they have a similar setup.  \n\nManifest Delusions is another good example - but then again, this seems to be an example of something different than what the OP is going for."}, {"comment_author": "OkDistribution990", "comment_text": "Sounds like manifesting x1000"}, {"comment_author": "Akhevan", "comment_text": "TBH the first thing that comes to mind on hearing \"illusion magic\" is not \"system\". By itself this kind of power seems to be highly subjective, esoteric and imprecise. Do you really want to put it into the rigid confines of something that can be labeled a system?  \n\n> What might propel that madness to spread from victim to victim (or between magic users and victims alike)   \n\nSupernatural bullshittery. No, really, that's it. While the meme of \"infectious madness\" is somewhat known in fiction and even real life, it's usually simply a metaphor referring to the spread of dangerous ideologies like fascism, nazism, religious fundamentalism and so on.   \n\n> And what type of world might fit this magic system?   \n\nI find that to be a backwards question because the world is usually a greater and more all-encompassing element than the magic system, so it sounds like the tail wagging the dog. But anyways, ideas that immediately come mind are either traditional depictions of the Fair Folk or something like urban fantasy with masquerade. Otherwise you might want to sit down and think it through. How would rampant and uncontrollable use of mind-altering illusion magic affect humanity? Not in any positive way I'd imagine.  \n\n> I would imagine a world in which madness spreads like a plague (the one I am trying to build for my fantasy) would be apocalyptic?   \n\nSure, it would be pretty apocalyptic. I guess the survivors would need to practice rigid mental or magical hygiene to stave off the cascading effects of exposure to those kinds of magics. Perhaps people will resort to something that is a natural counterpoint to epidemiology: reduction in globalization, large population centers, trade etc."}]}, {"post_title": "Tips on choosing names for fantasy characters?", "post_url": "https://www.reddit.com/r/fantasywriters/comments/1bylpo1/tips_on_choosing_names_for_fantasy_characters/", "post_main_text": " At the moment, all of my characters are named either 'Unnamed' or 'WIP' lol. I'm also torn between choosing 'normal' names that a person could have in our world or delving deep into fantasy and choosing more unique names. How did you all choose your own character names? I'd say my world leans more towards high fantasy than low fantasy, if that helps. Thank you so much!! ", "post_comments": [{"comment_author": "SagebrushandSeafoam", "comment_text": "As to whether you want to use \"normal\" names or not, that's mostly a tonal thing. Commonly fantasy authors (e.g., Tolkien and Martin) use occasional normal names to inject a hint of normalcy into the otherwise fantastical setting. But you can go all in either way.\n\nI would begin by thinking about the cultures/peoples depicted in your story: Is everyone of the same background? If not, then it makes sense to have names sound different depending on where the characters are from. For example, in *The Lord of the Rings*, the names of hobbits generally sound traditionally British; the names of the people of Rohan are all Anglo-Saxon; the names of the dwarves are all Norse; the names of the elves and of the people of Gondor are in Tolkien's invented Elvish; the names of orcs and such are in the Black Speech; and various other cultures have their own sorts of names—for example, Ghân-buri-Ghân.\n\nComing up with distinct sounds for different peoples/cultures is not only realistic, but helpful to readers, because it helps them keep straight who is from where, and it gives a feeling of the cultures being represented. After you've thought that through, you can just start making things up! I recommend avoiding certain clichés, like overuse of apostrophes or the letters x and z."}, {"comment_author": "averylovesyouu", "comment_text": "This is the most helpful thing I've heard about this online so far, thank you so much!!"}, {"comment_author": "rdhight", "comment_text": "Long and strange names are a valuable resource that shouldn't be wasted.\n\nI prefer short and simple names for main characters, with difficult or unusual ones deployed as signals that something is foreign, ancient, or important. When \"Menzoberranzan\" or \"Tel-aran-rhiod\" comes up, it's another way of getting attention. \"In Amber Clad\" pretty clearly suggests this is an important ship, in a way that \"Skimmer\" or \"C-57D\" might not. But if every name already looks like you facerolled your keyboard, a useful tool is lost."}, {"comment_author": "Dimeolas7", "comment_text": "I look at where mine is set, is it similar to a culture of old. Like ancient norse. Then i can find a dictionary online. By either looking up English words that might describe that person, like sword or honor or such. Or I browse down the list of the Norse words and get creative. i like them to sound good, sound like my impression of that person or place. I might also mesh two words together.\n\nI might also take a word based on its concept. Like Tsuba is the sword guard so might be a good name for a warrior of an eastern style culture. \n\nYou can also dig up names from ancient history."}, {"comment_author": "obax17", "comment_text": "Some of mine just come to me, but I also use the Behind the Name website a lot. It's got an extensive database of names from all over the world and through time and mythologies.\n\nhttps://www.behindthename.com/"}, {"comment_author": "METABLUNTZ", "comment_text": "I tend to have a mix of normal and fantasy style names depending on the character and their background. For my protagonist specifically, I always tend to keep the name relatively normal. (Or at least kept to 1-2 syllables) Considering that name will be repeated numerous times throughout the book. \n\nTypically in a fantasy setting you will have some characters that are really unusual or exotic. Having absurd powers or backgrounds. Those are the ones I like to give fantasy style names. Or if you like a little comedy, do the complete opposite and name your dragon Tom. Lol."}, {"comment_author": "HidaTetsuko", "comment_text": "I pick themes for my names as I have a number of different cultures in my world. One is Roman inspired, one is French, one is kinda Greek but most characters have Welsh or Celtic names, especially “ae” for women like “Maera” or “Caera”"}, {"comment_author": "aithendodge", "comment_text": "When I’m having difficulty coming up with a name I head on over to google translate. I punch in characteristics or traits associated with the character, and try it in different languages until I find something that rings in my ears. I will sometimes tweak it from there to get it just right. "}, {"comment_author": "Kendota_Tanassian", "comment_text": "At the very least, use short placeholder names that you can replace later, like Bob and Sam, & Mary and Jane.\n\nThey may not be suitable for your characters, but they keep dialogue distinct, and are really easy to do \"search & replace\" on once you have decided on a name.\n\nBesides, you might find you enjoy using a nice, short name for your character.\n\nAnd you can always change the names a letter at a time, to find something you like.\n\nMary>Sary, say, or Sam>Tam, for example, give you names that are still short & sweet, but have that slight \"elsewhere\" feel to them."}, {"comment_author": "Lou_Ven", "comment_text": "I created a partial language - rules for letter combinations and word structure, but not grammar rules - used a word generator to spit out words that follow the language rules and picked ones that I like for names."}]}, {"post_title": "alternating 1st person povs", "post_url": "https://www.reddit.com/r/fantasywriters/comments/1byjtlg/alternating_1st_person_povs/", "post_main_text": "I've seen a couple threads on this, but I wanted some thoughts on it, is it possible to do alternating povs in 1st person and not make it horribly confusing? Could you just put a characters name under each chapter? For example:\n\nChapter Name | Character Name\n\nWould that make it easier for the reader?", "post_comments": [{"comment_author": "liminal_reality", "comment_text": "I think you have to be *really* good at character \"voice\" to pull this off. I hated *The Necessity of Rain* because every single POV was written in the melodramatic Beautiful Sadness \"voice\". Even with the character names at the head of each chapter it was sometimes confusing and I had to flip back to see whose head I was in. \n\nOf course, if you like the style and you aren't sure if you have the ability it is still worth pursuing and then testing against beta readers to see if they find each voice distinct and if the format is confusing."}, {"comment_author": "Acceptable-Cow6446", "comment_text": "Pierce Brown’s Red Rising does it in the second trilogy. Sci-fi more than fantasy, but still. He does pull it off."}, {"comment_author": "OkAcanthocephala2225", "comment_text": "Think about Star Wars. (If you know it)  The names are very unique. Search about how they got the actor's names and that should help you."}, {"comment_author": "Lou_Ven", "comment_text": "It's possible, but I generally don't like it as a reader. It has to be done extremely well and few writers manage it."}]}, {"post_title": "Familiar Blood [gothic fantasy, 1000wc]", "post_url": "https://www.reddit.com/r/fantasywriters/comments/1byhi98/familiar_blood_gothic_fantasy_1000wc/", "post_main_text": " \n\nTIA for any feedback. I've never put my work out for reddit to read and I'm nervous.\n\nOn a scale of 1-5, one being too slow and descriptive, 5 being too fast, what speed does my writing feel?\n\nAm I using proper names vs pronouns correctly? Sometimes I feel like I type out the full character name too often?\n\n\\~\\~CONTEXT for scene: Delphene is a necromancer down on her luck who is trying to siphon magic from sirens in a bog. She and her faithful accountant, Sigero, are riding on the back of a Kelpie in the early hours of the night. She brought jewelry to entice them close enough to trick. She is wearing a ruby imbued with the power to safe guard her own magic from being sucked away by the sirens who think she is the prey.\n\nThis is the second scene from my rough draft about 1,600 words deep into my first pages.\n\nDelphy brought her lantern. Sigero had brought an even larger one.\n\nThe ancient twisted trees encroached on the narrow path. Each branch sent shadows across the moonlight until only a trickle of starlight reached the darkness of the forest floor. Even in the day, the mushrooms and moss lived in stagnant shadow, but at night, the dark gash of the path they rode upon might as well be a black velvet shroud that hid the very air in front of one’s eyes. The light of their lanterns, as it hit the fungus covered trees, felt like a shrinking room.\n\nHer arm grew tired of holding the lantern high. The kelpie below them seemed unbothered by the darkness and more bothered by their light, which reflected pink iridescence from the bean shaped pupils of the beast. It loved the green water of the bog, and it would take them to the wettest part of the forest with little guidance.\n\nSoon enough, the air grew thick with the smell of wet moss and still water. The green stench came with buzzing little pests. Moths and night beetles all made their way to the hundreds of mouths they heard croaking and screeching. The song of frogs swelled until they could no longer hear the kelpie’s hooves squelch through the saturated duvet of moss and algae.\n\nDelphene’s eyelids could not be wide enough to see past their limited halo of lantern glow. The range of her vision gave just enough time to dip under a hanging tapestry of tree moss or dodge the occasional shelf mushroom that invaded the narrow wake of the kelpie.\n\nDelphy and Sigero hissed together when the ground gave way to bog and the kelpie happily waded shoulder deep into the muck, leaving a cold slurry of mud and duckweed to wash over the stirrups, up to the edge of their riding boots. She lifted her knees, hoping they would not swim any deeper.\n\n“There!” Sigero whispered urgently in her ear. “A strong one. And do you feel the weaker ones? They’ve sensed you for certain.”\n\nDelphy handed her lantern to Sigero. She pulled the kelpie to a stop. It sunk deep enough to let mud into Sigero’s boots. He clucked a disappointed tongue at her. The incessant wall of frog-calls came to a sudden silence. She shushed him and they both strained their ears to listen to the darkness; the huffs of the kelpie breathing, the moths bouncing off the lantern glass, the drips of condensation from the branches to the bog like a gentle rain.\n\nA cold slimy hand shot from the still surface and grabbed the crook of her knee.\n\nThe kelpie bayed.\n\nSigero hiss a cursed through a sharp inhale. Delphene fought to swallow her scream and remain composed.\n\nSlick purplish skin stretched over an elegant, feminine figure. Her hair carried the same green as the duckweed within it. As her head rose slowly from under the surface, her wide-set eyes batted their lashes and her pupils contracted. The siren's eyes had the same iridescence as the kelpie’s. Delphene hid the lanterns behind her to dim the glow then straightened her posture and calmed the kelpie.\n\nThe siren pet Delphene’s leg and rested her gaunt, periwinkle cheek on her knee, leaving wet prints wherever she touched her. She stayed neutral through her annoyance. Sirens had no sense of personal boundaries and manners.\n\n“*The* Delphene Moriah. What a pleasure. What brings you to our bog this fine night?” Her voice was coarse and gargled with saliva.\n\nJust as she predicted, the sirens were all drooling at the thought of devouring two weakened witches. She fought the urge to clutch her ruby pendant. She hoped Sigero had brought his own defenses.\n\nSirens were naked but never without a neck full of jewels. This siren’s hand had an eclectic mixture of rings on every finger. Delphy hoped she brought her taste. She held the satchel tight and lifted from it her first enticement, a heavy ring encrusted with opals and pearls. The siren licked her lips.\n\nDelphene tried not to sense Sigero’s silent judgment behind her. He must think her genius plan was pawning her belongings. This was why she wanted to go alone.\n\nThough she was not as inept at measuring the power within other magical creatures as Sigero, she could feel the raw magic inside this siren emanating like the reverberation of the ground before a stampede.\n\nHow lucky.\n\nSigero cocked his head to the side. “What is your name? You have a body full of magic to spend tonight. How did a siren gather so much power?”\n\nThe siren gave him one sideways glance, “My name is Uma.\", then turned back to Delphene. \"What else did you bring?”\n\n“Answer him.” Delphy scraped a speck of power and placed it into her command.\n\nUma flinched and removed her hand from Delphene’s thigh.\n\n“I’ve been busy. Lucky really. I met a vampire. A young thing from the Absalom clan. He took a liking to me, invited me into his castle to swim in his pool. When he took me to bed, I thought he would drink me, but I drank him. Drank my fill of his magic until I could not bear another drop. It was glorious! He gave no care, he felt almost no drain, and he sent me on my way. All he wanted was a pint of blood and a quick seduction. The magic inside me lay untouched. Stronger than ever.”\n\nDelphene had rarely crossed paths with vampires. Vampires, though sustained on magic same as anyone, sought blood, not the power within it as she did. Their needs were primal, almost natural, like that of any beast or any human. Did humans not hunt to survive, to consume flesh and waste the blood? She avoided the politics of vampires the way she avoided Eden and the clergy who turned their noses at her Coven.", "post_comments": [{"comment_author": "Sorry_Plankton", "comment_text": "Overall, I really like this. 8 of 10, if I had to put it on scale. I do not give it lightly either. I genuinely think this is some great stuff.\n\n>The light of their lanterns, as it hit the fungus covered trees, felt like a shrinking room.\n\nNothing bad here. This is just a great punchy line to me. You could rework it to be punchier but it paints such a vivid scene. And that is just one line. Your strongest aspect is certainly your fantastic descriptions. The page is just painted with them. And your characters are fun! You display a lot with so little in the beginning. Siergo gives off this turt, sassy vibe as the situation befalls them, but valuable as he is the first to point out the Siren's lair.\n\nThe only reason I am not rating this higher is some of your descriptions, while beautiful, take over action. I've been listening to the Essence of Writing a Novel lately and I highly recommend the episode on scene. There are times where your scenes are becoming summary. Salt grain given, fantasy does has a higher tolerance for immersive language. But in the beginning, we start losing scene and moving into summary.\n\n>Her arm grew tired....hoping they would not swim any deeper.\n\nThe painting you are making is beautiful, but it really lacks action and conflict. We tend to set up our scenes to knock the reader down, but it isn't necessary all the time. We don't get action until \"There!\" Granted, this isn't a lot of text, but I have an instinct that you tend towards the worldbuilding a lot. It works for you. What I would suggest is to look over some of your passages and see if the text could be re-worked to to add in forward momentum you may be losing. Emphasis on may. Simple things can do that. Here's a rough example:\n\n\"It loved the green water of the bog, and it would take them to the wettest part of the forest with little guidance. Delphene braced herself. The thickness of wet moss and dank water painted the air and draped over her eyelids. Their quarter loved to make station in the durge of the swamp. Where pests buzzed in the ear and night beetles fed the hungry hundreds of croaking toads. Each one baled a deafening song that drowned out the Kelpies's hooves and almost pushed out all of Delphene's thoughts. But she would not be detered. She would make her mark.\"\n\nNot every passage needs this, of course. But you keep the momentum of your scenery by filtering it through your characters or showing why it is necessary.\n\nOutside of that, your dialogue could use some sharpening. It may just be weaker as compared to your descriptions though:\n\n>Sigero cocked his head to the side. “What is your name? You have a body full of magic to spend tonight. How did a siren gather so much power?”\n\nFor example, the above reads a bit odd. Maybe it is the vibe you are going for but it seems you are just trying to convey its power to the reader. Something like this might work:\n\n\"Delphy,\" Sigero hushed. \"This thing is *filled* to the brim with magic. I've never seen a Siren this strong.\"\n\n>“I’ve been busy. Lucky really. I met a vampire. A young thing from the Absalom clan. He took a liking to me, invited me into his castle to swim in his pool. When he took me to bed, I thought he would drink me, but I drank him. Drank my fill of his magic until I could not bear another drop. It was glorious! He gave no care, he felt almost no drain, and he sent me on my way. All he wanted was a pint of blood and a quick seduction. The magic inside me lay untouched. Stronger than ever.”\n\nThis passage in particular felt a bit cheesy. I wasn't sure if it was intended or not. The following passage seems to indicate it might be. I think this could be fixed with a less is more approach. In relation to the previous rec I made:\n\n\"Oh you noticed?\" She touched her gems as though complimented. \"I've been *so* busy. I tempted a young vampire from the Absalom clan. I swam in his pool and his sheets. I drained him of *everything* before he could sink his fangs into me. He was so weak in the knees he didn't even ask for any blood. Just gave me a spank and sent me on my way!\"\n\n\"Enough. What's your name?\" Delphy scraped a speck of power and placed it into her command.\n\nThe siren hissed, pulling its hand away. \"Uma.\"\n\nJust some examples. Take it as you will. Again, great stuff!"}, {"comment_author": "Purple_Explanation25", "comment_text": "Thank you so much for the amazing advice. I will definitely check out that episode on writing scenes. I love your dialog rework ideas. Can't thank you enough for taking the time."}]}, {"post_title": "Warrior Demigods (working title) Chapter 1, Version 3 [3,787 Words]", "post_url": "https://www.reddit.com/r/fantasywriters/comments/1byhis8/warrior_demigods_working_title_chapter_1_version/", "post_main_text": "Edit: I made an error in the title. The subgenre is Epic Fantasy.\n\n[Chapter 1 Link](https://docs.google.com/document/d/1FPhAWL9OVu8g6D9QQxvVWeaili-nwxwPsewt4wX98Ks/edit?usp=sharing)\n\nI've posted earlier versions of this for critique before and they really helped me re-imagine my main character, her motivations, and the way I set forth the exposition. If you've read the earlier versions, this is a complete rewrite. Callie is now the princess of her entire kingdom, not just the daughter of a powerful lord. She's not getting married yet, but an engagement she does not want is looming on the horizon.\n\nI'm looking for feedback about my pacing, showing rather than telling, and realistic dialogue.\n\nFirst 300 words:\n\nCallie dug her gloved hands into the soft, fertilized soil of the raised garden bed. She turned it over, readying it for new life to be planted. From a bucket, she grasped a handful of marigold seeds and began to spread them over the soil several inches apart. She pressed each seed gently into the dirt. Finally, she lifted her watering can and sprinkled the potential flowers, careful not to disturb their placement.\n\nShe anticipated her ritual of planting new seeds as each winter turned to spring. When the birds began to chirp and the trees began to regrow their leaves, Callie’s heart thrummed with the excitement of renewal and the symphony of life as it emerged all around her. Today marked two weeks since the last spring frost, and she breathed in the scent of the warming air as she prepared her garden to bloom brightly throughout the next few months.\n\nCallie’s peace was disturbed as she heard her mother call for her from the door that led to her garden. She turned her head expectantly.\n\n“Darling, your father has asked for you to join him in the throne room,” her mother stated apprehensively.\n\nCallie sighed. “What does he need me for?”\n\n“He didn’t say, but he asked that I send for you at once.” The queen consort’s face tightened in awareness of Callie’s frustration.\n\n“Ask him to give me twenty minutes.”\n\nCallie pulled off her thick leather gloves, noticing the layer of dirt that had traveled up her arms and toward her elbows. She closed her eyes, willing her body to once again fill with the stillness that had heightened her senses and lowered her anxiety just moments before. She acknowledged that the effort was futile, but longed for that calm nonetheless.", "post_comments": [{"comment_author": "apham2021114", "comment_text": "Hey, I remember this! I left some comments, but they're really subjective to my taste. Keep what works for you and what you prefer to read.\n\n\\~\\~\\~\n\nThe beginning is missing a hook, a catchy line or idea to get the reader to buy into the garden bit. In a crime/thriller it might be \"Three shots went off and my father fell to the ground;\" or in a isekai it might be \"I went outside and greeted my best friend, Truck-kun;\" and etc. It could transform the opening paragraph into something more than her tending to the garden. Callie seemed to like nature, so maybe your hook could be theme around that. Or you could center it around her longing for peace and freedom for a contrast with what happens later on.\n\nI left an example in the comments on dialogue. Basically, try not to point something out and then do it. Just do it. The pacing is faster, and the action commands the reader's attention. While we're on dialogue, on the next revision I would go through and try to get rid of most if not all adverbs in a dialogue tag.\n\n>“Darling, your father has asked for you to join him in the throne room,” her mother stated apprehensively.\n\nYou want to move that apprehensiveness into the dialogue. Make it so that we can tell her mom's mental state by dialogue alone. And if you find yourself getting blocked here, then add the adverb and come back later.\n\nThere were quite a few characters in this chapter. I felt like the king was the most memorable by role, because he's the king. The others not so much. It's a problem with introducing so many characters in one chapter, but I would try to give them a defining trait or role.\n\nCallie had some zeist, but quickly felt inactive, especially in the throne scene where I felt like she's barely a pov. Her status elevates her to the royal family but she's no different from any of the other suitable cameras that could be installed there. There's a distinct lack of want and reaction coming from Callie, she feels like she has little drive to the scene. This is evident when she went to the throne room and the focal immediately goes to the king. Prior to this, she was running it. You'll have to find a way to spice her up so that she stays relevant and interesting in the confines and restraints of her character and social status.\n\nIt's only after when she had a 1-on-1 with her father that it felt like she was the pov again. This could be what was intended, to show her helplessness in the face of social power, but then immediately after she had the balls to speak her mind, so no this couldn't be it. That throne scene felt the most problematic in terms of Callie being a pov.\n\nDialogue overall felt much better than the previous draft. Sometimes it is exposition, but it's properly inserted and made sense given the context. I didn't have a problem with the dialogue itself with any characters, but the dialogue tags could get a bit eh at some points. I left some comments on parts where it felt iffy.\n\nThere were many times where you'd point at something (tell) and then proceeded to show it. You could just skip the tell and show it.\n\nPacing felt a bit iffy. Probably because of the above. I was onboard with the chapter before the throne scene. I wasn't exactly sure what the opening was building up to, but Callie had a rebellious nature and I found that fun. But then the throne scene lasted for quite a long time in a ratio that I felt wasn't properly built for it. It was a necessity that needed more support before the scene occur to make me want it more.\n\nThe scene with Jane was my favorite of the scenes. Where everyone just seems like cookie-cutter representation of their roles (princess, prince, king, queen), Jane appeared grounded. She actually seemed like a friend with the right priorities.\n\nOverall this was a drastic change from the previous iteration. I much prefer this direction!"}]}, {"post_title": "Spellblades [Grim Epic Fantasy - 3032]", "post_url": "https://www.reddit.com/r/fantasywriters/comments/1byggqu/spellblades_grim_epic_fantasy_3032/", "post_main_text": "[Spellblades Short Story](https://docs.google.com/document/d/1hy09hsen1ugt43Y7dZacKoCITTjrbxFsyidPyObD8IU/edit?usp=drivesdk)\n\nGreetings fellow writers! Spellblades is an action-focused short story about a knight fighting for the freedom of his nation in a contest of champions. I wrote this short story to tease out elements of a magic system I am working on called Gemcasting. Gemcasting allows a person to channel elemental power contained in gemstones by using metal. Often gemstones are encrusted in armor and weapons, then used to channel their corresponding element. I take inspiration or this system from Brandon Sanderson's cosmere systems and Avatar the Last Airbender. I'm an amature in every sense of the word so I look forward to reading your critiques on: \n\n* Your general impression of the story\n* How the magic system and action read. Are they confusing? Is it easy to follow?\n* Whether this particular work could be used as a prologue for a longer story following Tyce", "post_comments": [{"comment_author": "Fickle_Welcome_8603", "comment_text": "Might get more readers if you share a link that doesn’t require sign in"}, {"comment_author": "prismatic_raze", "comment_text": "Update, the link should allow anyone to comment without signing in! Thanks for catching this"}, {"comment_author": "prismatic_raze", "comment_text": "Hmm didn't realize it had that restriction. I'll look into it!"}, {"comment_author": "prismatic_raze", "comment_text": "Flaired NSFW for: Blood/Violence\n\nI take inspiration from grim fantasy such as Attack on Titan"}]}, {"post_title": "The Wastes/prose critique, short story [Dark fantasy, 457]", "post_url": "https://www.reddit.com/r/fantasywriters/comments/1bybhr9/the_wastesprose_critique_short_story_dark_fantasy/", "post_main_text": "I'm hoping to get feedback on the strength of my prose to see what I can work on, but any and all critique/advice is welcome! If you need some critique/advice too for your own work, I'm more than happy. Thanks for your time!\n\n&#x200B;\n\nEmbers danced among the firelight in the still wind - their form the only trace of movement against the ashen plains. The Man sat entranced by their dance as they trailed upwards out of sight. He began to wonder how high they could go, what could they see? Could they see the fractured earth, where it splintered and uprooted from itself? Perhaps they might see the wicker trees, lifeless and stale, warped into a twisted state of an inbred grove. If they made it high enough, they could see far past the plains, where the land bordered by ash gave way to green.\n\nHe grew sullen of their departure and freedom, a fortnight had passed since he came to the Waste in self-exile - or had it been longer? Three weeks, four? It was hard to keep track when each day of monotony was the same as the last, and each passing night - with no one but himself for company - his thoughts clouded and sank like dregs to the back of his mind.\n\nA low ruffle from the long grass perked his ears and the Man snapped to attention like a dog on guard; perfectly still. A long moment passed and the brush didn’t move. He tried to convince himself that it was the wind, that there was little likelihood of any vile creatures - besides himself - wandering about; but there was that little nag, again. A small feeling that even out there, where all creatures went to die, there was something watching. \n\nThe cold sweat running down his neck helped ease him back into the moment and he returned his attention to the fire. Though his knee refused to stop fidgeting, his eyes kept darting back to the source of sound, and his breath ran rapid. He willed himself to stop but his body worked to the rhythm of his paranoia.\n\nThe tempo of his twitching limbs ran their course and soon the crackle of fire grounded his senses, and… the smell of burning? The skewers erupted in flames, he cursed and swiped them from the fire before blowing them out on his meal. With his food now charred the Man sighed and sat back down. It wasn’t a complete loss, the food couldn’t be made worse. He examined the cockroaches that lined the skewers and brought his feast in and began to eat. Once a piece broke off he pulled away, cringing as he took each slow bite. The first bite was always the hardest. How the crunch reverberated through his mouth to the back of the head. \n\nAnother bite, then another.\n\nHe cringed less and less with each chunk but still hesitated every offer he brought to himself. Another bite, followed by a hushed curse this time.", "post_comments": [{"comment_author": "realityiscanceled", "comment_text": "Hi OP!\n\n  \nI really like your prose. I consider myself a lyrical writer and I'd say the same for you. It feels like your natural voice, which makes it flow well. I think you've painted me a picture with your rhetoric and I can see what the man sees, which is always the goal in prose.. I am also physically disgusted by the idea of him eating cooked cockroaches and you were so descriptive that I felt ill. That's not a criticism, despite the gross factor it's still well-written. Too well-written...have you eaten cockroaches before?"}, {"comment_author": "longjohngilmore", "comment_text": "Surprisingly I haven’t, it’s not the type of research I’m too keen on aha. Thank you for taking the time to read this and giving me such kind feedback. I’ve been pretty anxious about the quality of my prose for some time. I really appreciate it, you’ve made my day!"}]}, {"post_title": "Do you find writing folk songs and poems in a Fantasy setting difficult?", "post_url": "https://www.reddit.com/r/fantasywriters/comments/1by1xqs/do_you_find_writing_folk_songs_and_poems_in_a/", "post_main_text": "\"Oh, you can search far and wide! You can drink the whole town dry! But you'll never find a beer so brown!\"\n\nTolkien was just pure genius and extremely genuine when it came to his writing. Songs and dances were given the most thought out details. Every song and tale has a deeper meaning to them at least. Some more than others...\n\nBut do you find writing songs and folk tales difficult to write in a Fantasy setting or do you quite enjoy making them?\n\nI came up with a couple but most are meant for deeper meanings and whatnot.\n\nPlease share your thoughts!", "post_comments": [{"comment_author": "mig_mit", "comment_text": "I usually feel that a song in the middle of a story makes the plot come to a screeching halt, which is very annoying."}, {"comment_author": "Boukish", "comment_text": "You phrased that a lot kinder than the fart sniffing metaphor I was gonna whip out.\n\nUnless you literally are Tolkien and designing conlangs and doing academic poetic analysis, save your poems and song lyrics for the \"lore\" book you put out after you already have a success on your hands. At best, throw a short except of poetry/lyric in as a chapter heading."}, {"comment_author": "theginger99", "comment_text": "Tolkien was a professor of languages and studied various poems and songs professionally. His essays on Beowulf are still considered pillars of the study of the poem, as just one example. Of course he wrote songs and poems well. \n\nI usually don’t bother writing songs or poems for my work. Frankly, I don’t really feel it’s necessary to actually write them out, usually just mentioning them is more than enough. As a reader I would much rather read “snatches of music floated to me from the open door of the hall. I recognized the tune of *Baldorian’s Big Butt Remix* even from here”. Then I would read seven stanzas of a song slapped right into the middle of a story. I find reading poetry and songs in fiction usually kills the momentum of the story. It can be quite jarring, I personally feel like it’s more trouble than it’s worth. \n\nBy all means, do it if you want to, but I don’t think it’s integral to writing good fantasy."}, {"comment_author": "dresshistorynerd", "comment_text": "I'm not practiced at all in poetry, so I find them very difficult. I've tried writing folk poems into my fantasy world with little success. I want to some day get into poetry more and practice is because I do find it very interesting and I am planning a fantasy story that relies on them a lot so I kinda need to learn poetry to make that work lol"}, {"comment_author": "HumbleKnight14", "comment_text": "I see. I made officially one in my story but that's about it."}, {"comment_author": "evasandor", "comment_text": "Oh no. Quite the opposite. I love writing songs and I have to grit my teeth and *not* include too many of them in my books. \n\nI mean, I give myself my own earworms with these. I’ll think up a song, go around singing it for weeks, and then eventually it goes in the notes and is never heard again by anyone. I did, however, actually record one and make a video for it. (I’ll put a link if someone asks but otherwise I think it’s a no-no)"}, {"comment_author": "HumbleKnight14", "comment_text": "Link please?"}, {"comment_author": "evasandor", "comment_text": "Absolutely! Here you go: [evasandor.com/openingcredits](https://evasandor.com/openingcredits)\n\nThis isn’t a folk song per se— in-story it was supposedly written by my main character. IRL I meant it as an homage to James Bond movie credits, since the book itself is a spy tale."}, {"comment_author": "surfingkoala035", "comment_text": "I think it’s fun.  I have a couple of sad songs and one kind of semi bar ballad."}, {"comment_author": "HumbleKnight14", "comment_text": "Would love to hear a preview please!"}, {"comment_author": "surfingkoala035", "comment_text": "Sure.  This ones kind of a drunken sea-shanty \"When love came along\" - The Ballad of Dunger’Dir.\n\nDunger’Dir was a boatman, way stoic and brave.  Not for Kin nor his kinsmen, did he ever behave.  He would fight and would bite and could never be beat.  But when love came along, he was swept off his feet.\n\nWhen love came along, Dunger fell on his face.  He got swept overboard and all over the place.  His fighting will left him when love caught his eye, cause if he couldn’t be near her he surely would die.\n\nDunger’Dir was a boatman, who had never known love, when it finally hit him like a bolt from above.  She was a strapping young lass with hair flowing like flame, and what she did to his heart he could never explain.\n\nDunger’Dir took a breath and did steady his heart, and from his shabby coat pocket a ring did he part.  To the shock of all deckhands, he got down on one knee, and asked her ‘My love, won’t you please lie with thee?\n\nThe lass was called Ginger and gave Dunger a slap, and Dunger recoiled falling flat on his back.  ‘You old salty dog, I would never love thee!  For I am foretaken and my love is the sea!\n\nStill a WIP but I think it fits the mood and the chapter."}, {"comment_author": "Dave_Rudden_Writes", "comment_text": "I am always sceptical of poetry and songs in fantasy because often the author sets the poetry as essentially written by that world's Shakespeare, which is a pretty tall order to fill."}, {"comment_author": "may_june_july", "comment_text": "I'm a fucking horrible poet, so I avoid it as much as possible lol"}, {"comment_author": "Lazy-Nothing1583", "comment_text": "As someone with a background in music, music just doesn't work in book form. It loses its charm when it's in a book bc there is no melody, no sound. imagine hearing a disney song except there's no background track and the character is just saying the words. It's bland as hell. The only real way it can work imo is if the character is reciting poetry (Gurney Halleck has some songs in Dune, but those are so close to just being poetry that it's not that big of a deal). In short, don't try to translate a musical into a book verbatim."}, {"comment_author": "HidaTetsuko", "comment_text": "I use snatches of entire poems I have written"}, {"comment_author": "AR-Morgen", "comment_text": "I do! So I typically don't.\n\nI'm not much of a poet, and certainly not a composer or lyricist, so I tend to imply the gist through the narrative. I'll also take inspiration from existing songs of an appropriate era if I want the music to have a real world equivalent, so I have a better idea of how certain instruments might sound together or apart, or if multiple singers are intended to harmonize.\n\nHowever, you could also just be a little sneaky about it.\n\nGiven how much language has evolved over the years, we have a lot of approximate translations of old ballads or poems you could mine for inspiration and adjust to fit a rhyme and/or the phrasing you prefer.\n\nLet's say you want your characters to be able to quote a romantic local folk song to each other. You could include a brief passage of one smiling as they overhear a washer woman singing the words *\"Whatever I say, whatever I sing / whatever I do, that heart shall see / that I shall serve with loving heart / that loving heart that loves me\"*.\n\nIt will take a very specific sort of nerd to catch that you're referencing and only slightly tweaking an anonymous, 1500s love poem, and I suspect that sort of person would probably just be very pleased that you used it and they noticed. Meanwhile, your characters can address their romantic letters to \"the loving heart that loves me\", or have one innocently compliment the other what a \"loving heart\" they have around people who don't know they're in a relationship, as *\"that loves me\"* is left unspoken but understood.\n\nWhen it comes to folk *tales,* you could just take a look at the kind we have, and why they've survived, and why that character would reference and discuss them to get the ball rolling. You can think about why you want to include them as well, to help flesh out more details.\n\nIt makes sense that *The Lay of Lúthien* survived as a touching tale of grief and duty and loss... but I think we can all understand why *Aragorn specifically* was so moved by a story where an elven maiden has a tragic love with a human man. Characters would empathize with, or draw inspiration from, the stories they grew up with. Like we do with our favourite media, they'd reference them when it feels right to, or when there's a reason it's stuck in their mind. Think about what story they need in that moment, and work backwards."}, {"comment_author": "TraderMoes", "comment_text": "I find it incredibly difficult and would never even consider doing it.\n\nAlso, I'm not convinced that it really adds anything to the average story. Yeah, I like the poems/songs that Tolkien wrote, and maybe some of the ones by GRRM, but these are two of the top fantasy writers of all time, operating at the top of their craft. Most writers aren't at that level. I know I'm certainly not. So what's the point of me, a musically illiterate person, writing a song for my likely equally musically illiterate audience to read? I think this is one area where telling rather than showing works better. You can still include worldbuilding elements that way, but without all the extra work of crafting lyrics or poetry. And from the reader side, I find that I always prefer reading those descriptions over very mediocre lyrics.\n\nBut hey, that's just me. More power to anyone who feels confident in their abilities to pull this off."}, {"comment_author": "BlackCatLuna", "comment_text": "It's definitely tricky unless you're well versed in real life folk songs and poems.\n\nEven if you are a lyricist if your forte is hard rock you're probably not going to be able to pull something that would fit into a high fantasy setting without a lot of work.\n\nI enjoy writing poetry, but I don't really see myself as a songwriter. The only time I've written lyrics for my writing is for a visual novel script because the protagonist poses as a minstrel and it's asked to sing for a princess who has taken charge of fitting talent for an upcoming festival.\n\nFor my low fantasy novel, the MC was in a cult so she's only heard approved music in full prior to the initial events. She's used to suppressing her emotions and desires (something cults encourage their members to do) so one scene I'm considering is having the secondary character use music as a cue to help her feel her emotions since music is proven to affect brainwaves. For that, it's largely a description of the music mixed with her sensations."}, {"comment_author": "rdhight", "comment_text": "I don't find them difficult to write; I find them difficult to justify.\n\nThere have been a few times when a song or poem enhances a story for me, but much more often, they're like going through a toll booth.\n\nYou have to time it. You have to come in with the right poem, at the right time, and then wrap it up fast before the moment is gone, and get on with the story. It's much safer to reference them rather than to actually spell out the words."}]}, {"post_title": "The Gifted, part of an unknown early chapter [Urban Fantasy - 874 words]", "post_url": "https://www.reddit.com/r/fantasywriters/comments/1bydhss/the_gifted_part_of_an_unknown_early_chapter_urban/", "post_main_text": "I'm a newer writer. I struggle with over-writing but also worry about not giving enough description for supernatural/fantasy elements. Hopefully, this snippet is decently is pruned, but please let me know where I should trim/fix things. I'm also open to any other feedback. Thank you :)\n\n\\*\\* Context: This is another segment of the fantasy novel I'm working on. It deals with supernatural beings and elemental abilities. This is an early scene of one of the main protagainsts as she interrogates a supernatural/\"Dark\" beings about a specific person/female she knows they hunting down.\n\n\\*\\*\\*\n\n\"Damn international conferences.\" Muttered a deep voice. His dress shoes echoed like a hollow metronome in the desolate parking garage.\n\nOblivious, he walked straight past me. As he did, my staff pulsed turquoise in my hands.\n\nA black suburban let out a loud chirp, morphing to a low purr as the remote starter activated.\n\n“It has to be past Midnight.” The man yawned, tossing his suit coat and laptop bag on the passenger’s seat. Thinning dust bunny hair collected on head, strands falling along the wrinkles of his worn face; a physical resume of a life sacrificed to white-collared stress. “At least there won't be traffic, leaving the city this late.”\n\nI watched him slam the car door.\n\n“God, what I wouldn’t give for a massage and a bottle of Merlot---“\n\n“Stop.”\n\nStartled, he whirled around, coming face to face with a very sharp point and my even sharper figure behind it.\n\n“What the hell are you doing?\" He yelped, bracing himself against the vehicle, eyes focused on the weapon dangerously close to his collar.\n\n“Where is she?”\n\n“Who?” Stuttered the middle-aged man. “Lady, who the hell are you?”\n\nI narrowed my eyes. “I'm the one asking the questions here.”\n\nI had picked out this man specifically. He had all the signs. And now I was going to get answers - by force, if necessary.\n\nThe man moved his hand toward his pants pocket.\n\nA crack and a deep howl cut the night air. Red swelling rose across the man’s knuckles.\n\n\"I wouldn’t do that if I were you,\" I said, my weapon already back in position \"This conversation is purely between me and you - no phone needed.\"\n\nHe stole a glance down, panic widening his wrinkled features. \"Look lady, what do you want? Money? I--I could give you---”\n\n\"I want *her*!\" I shouted, pushing the flat side of my blade against his neck, directly below his jawline.\n\nHe wheezed.\n\nSlowly, he raised his hands. Sweat brimmed his forehead, catching in the garage’s honey lights. He strained to talk, \"Lady, please, you have to believe me. I just want to go home and see my wife. If you put down the weapon, I--I promise I will contact someone who can help you find---find *whoever* it is you’re looking for---\"\n\nI leaned in closer, shifting the angle of my staff. Beads of crimson collected on the edge of the metal. \"Shut. Up.\"\n\nThe man’s knees began to shake, but my grip remained steady.\n\n“Don’t play dumb. I already know you’re all hunting her.”\n\nHis eyes rolled upward. With a gasp, they jerked back into focus.\n\nI paused, retracting my blade.\n\nTwice more he fazed out; like something was trying to push to the surface. Like *they* were trying to push to the surface.\n\nOn the third time, his face contorted into a grimace. Then his overweight body began to sway. It wasn't much, just enough to look unnatural, his head following in rhythm. Eyes still unfocused, his lips started to move.\n\nAt first I figured he was just whispering nonsense. But the more I listened, I realized it was fragments of a prayer; one I knew well. Except, the words weren't correct. They were jockeyed, jumbled, juxtaposed.\n\n“Some devout subject you are.\"\n\nThe incessant whispers continued.\n\n\"Listen up, this is your last chance.\" I say, pointing my staff at him again. \"I know you know where she is. You are going to tell me.\"\n\nAs if in response, his shoulders sagged against the SUV, his head falling to my side. That's when I saw his pupils, round and frozen, as if his soul had been ripped out and torn to shreds.\n\n“Fine.\" I frowned. \"Then you have no use to me.”\n\nIn a flash, a clean slice split open his fat neck. Blood slipped down his skin, staining his front in a wet red. With a thud, his body crumbled, the dark liquid seeping over the concrete.\n\nFor a moment, I watched the expanding pool. I was so desensitized by this point; just another day in the office. Swiping the back of my hand across my face, I smudged speckles of scarlet.\n\n“What a waste - he wasn’t even a full Stygian yet.” I grunted, giving him a swift kick confirming he was dead.\n\nBending down, I searched the clean parts of the body. Mixed between lint and breath mint wrappers, I discovered a crinkled sticky note.\n\n“Kismet Hotel.” I squinted at the chicken scratch. “Gemma. Tomorrow at eight.”\n\nA devilish smile spilled over my lips. In the end, I always got my answers.\n\nBacking away, the cooling corpse started to lose color. A minute later it was completely ashen. Then, it began to flake away, the body disintegrating into puffs of gray.\n\nI snapped my fingers. Sparkles of blue wet the air as my barrier began to evaporate. Twinkling like fairy lights, they fell around the body, extinguishing as they reached the concrete.\n\nMy boots echoed as I darted across the floor and into the dim stairwell. Clearing the final security wall with ease, I landed in a back alley. Before disappearing into the darkness, I let another smile slip.\n\nTonight's mission was a success. Tomorrow, the Kismet Hotel will be the same. There was no question.\n\n\\*\\*\\*", "post_comments": [{"comment_author": "k_cav", "comment_text": "Here is some feedback! I'm a new writer, but an avid reader.\n\n1. I'd like to know more context as to why the man walked past your MC without notice if they are the only two people in a seemingly empty parking garage. At first, I pictured this scene occurring on a busy street which would explain why he paid her no mind. It sounds like she is standing there pretty suspiciously.\n\n2. Why does the man talk to himself? I don't think most people would do that, even in an empty parking garage. His dialogue at the beginning would probably be occurring in his head. The reader doesn't need it, and to me it breaks the immersion.\n\n3. What are the signs? Maybe this is established earlier in your story, but it would help to get some more detail as to why he is being targeted specifically. What stands out about this man to your MC?\n\n4. The MC doesn't seem surprised when the man is taken over by some supernatural or spiritual presence. Why does she then keep talking to the man as if he is the one who would respond? Shouldn't her tone shift, now speaking to this entity? She shouldn't expect him to come back to his body and willingly answer her questions if he would go to such a length to avoid them, or if he is unwillingly being taken by something else.\n\n5. It seems a little too easy for your MC to find their answer on a note in the man's pocket after all that. Consider omitting some detail, or writing the note to contain a code your MC needs to decipher, even if she does so quickly.\n\n6. I'm confused by the barrier. Did she put it up before the conversation began? Before the man entered the parking garage? What is its purpose? Make this a bit more clear.\n\n7. Small thing, not a frequent error, but you switched from past tense to present tense in the dialogue tag after your character said \"Listen up, this is your last chance.\" I also think it feels a bit off to say \"the Kismet Hotel *will* be the same\" and the word \"would\" fits better with your past-tense writing.\n\nThis is a very interesting scene overall! I'm interested to know more about your character, who she is looking for, and what it means to her. Keep up the good work!"}]}, {"post_title": "Help/Give tips on how to make an apathetic main character more engaging to the plot", "post_url": "https://www.reddit.com/r/fantasywriters/comments/1by9na9/helpgive_tips_on_how_to_make_an_apathetic_main/", "post_main_text": "Trying to get out of my procrastinating phase and write just to end up with all sorts of questions. But anyway... I need help on how to make a protagonist engaging to drive the plot of the story. \n\nAs a backstory in a world where monsters are real, this character survived life changing disaster (like Lost); watched friends/loved ones die due to monsters and/or betrayal from humans, but here's the catch, he isn't out to seek revenge as he already killed the things that caused him his initial pain and suffering, so vengeance felt empty for him. Now after surviving alone for 5 years, isolated from society, he was found and joined by a group of monster hunters and become one of them ending up living on retrofitted ship for 4 years with them as of the story proper. I plan to have a Female MC to be his opposite (Full of hope, vision, and dreams)\n\nI envisioned the protag to be in some state of existential apathy; he isn't the suicidal type that seeks out danger for a glorious meaningful death because of survivor guilt, but he lacks a sense of purpose or will to live after the events of his isolation. He doesn't seek fame or fortune, nor does he try to attain greater power.\n\nI know he sounds boring, but I don't feel it that he should end up like any other ones who are desperately looking for a grand purpose in life. I just want him to eventually find out that living is more than just surviving.", "post_comments": [{"comment_author": "byc18", "comment_text": "You could check out Murderbot Diaries. It's about a security robot who gains sentience and honestly just wants to watch its soaps. It gradually learned to care for its owner and her research team as series goes on. \n\nHere are a few random quotes:\n \"I've also had clients who thought they didn't need any security at all. That is until they got eaten. That mostly a metaphor, my non-eaten client ratio is quite high\"\n\"Who knew that being a heartless killing machine would cause such a moral dilemma. Yes, that was sarcasm\"\n\"Amena is on the survey because her education required an internship in almost getting killed, I guess\" \n\"I didn't know what being ok entailed, but I was going to settle for unmurdered\""}, {"comment_author": "ZekeFrost", "comment_text": ">\"I didn't know what being ok entailed, but I was going to settle for unmurdered\"\n\nMaan, why does this resonate with me to what I was thinking. Might give this a shot. Is this online or a physical book?"}, {"comment_author": "byc18", "comment_text": "Physical, but I did the audiobook. Also apple tv gave it a TV deal."}, {"comment_author": "ZekeFrost", "comment_text": "It got show? Aired already or soon to be? I'm checking out The wheel of time for the moment"}, {"comment_author": "byc18", "comment_text": "Supposedly this year, it's casted at least. If you want to sample it look up the third audiobook on Amazon, there is a nice sample of an in transit scene. MB masquerading as a human air marshall at the time. Also most of the books are novellas, so the audiobooks are about 4 hours."}, {"comment_author": "Hydra-Mentality", "comment_text": "Well I prefer to fuck around with medieval fantasy, so when I make an apathetic character it portrays best and most excitingly during scenes where he's battling. Like he doesn't care about the bodies he's dropping or the damage to himself. But naturally there has to be some kind of drive, a need for your character otherwise he's simply uninteresting"}, {"comment_author": "ZekeFrost", "comment_text": "Yes. It's drive for him that I want to find out. He doesn't  shy away on volunteering to doing all those suicidal mission, raiding a monster lair with 1% chance of survival. By the start of the story, seeing some civilians getting shredded by a horde wyvern doesn't even warrant a response from him. The weak gets eaten by the strong. He knows that he could end up the same if he was any weaker. But he doesn't have the heroic drive to go out and train and get stronfer to end the tyranny of a demon king. He just see it as another hunting request.\n\nKinda feels like trying to get someone out of depression. I just don't know how to convey it"}, {"comment_author": "Hydra-Mentality", "comment_text": "Well you can always hint at the apathy not being completely all consuming, give him hints of humanity and eventually figure a way to give it all back. Give him something to protect, whether it's just honor or actual people"}, {"comment_author": "Megistrus", "comment_text": "Apathetic protagonists typically come off as annoying. It's not fun reading about a dour and whiny character.\n\n>I just want him to eventually find out that living is more than just surviving.\n\nIt sounds like you're on the right track, but you didn't explain how the protagonist is involved in the main plot. What is it, how is he involved, and most importantly, what does he do to push it forward? He needs to take an active role in the story rather than just reacting to things or passively waiting by until something happens to him."}]}, {"post_title": "How to write a good villain", "post_url": "https://www.reddit.com/r/fantasywriters/comments/1by4a0j/how_to_write_a_good_villain/", "post_main_text": "I know the \" death is evil\" is cliche but hear me out:\n\nGod of Death sends shape-shifting monsters to victims who he forsees to have a cruel fate, looking like their loved ones before killing them because he thinks it's a less-crueler way to die (e.g. he sends a shape-shifter to kill someone who originally is suppose to be tortured to death)\n\nHow can I make the readers sympathize with the villain yet also make them think that there's no denying of his wrongdoings? \n\nHow can I polish his motivations? \n\nIs there anything I can do to make it better? ", "post_comments": [{"comment_author": "Vexonte", "comment_text": "Needing a villain to be sympathetic and being judged solely on his motivation is a fallacy. Villains have any number if ways to be interesting, but the most important thing is how they force there will upon the story. \n\nIf your death is a primordial force of nature, lean into that fact and make his motivation seem beyond human compression. If your death is more anthropomorphic, you can have him just simply and plainly wish for thier to be less pain in the world. Make an apology of putting down a dog."}, {"comment_author": "FairyQueen89", "comment_text": "There is mercy in their way. And understable mercy at that. Sometimes making a good villain is not about making them sympathetic, but having them acting in a way that is understandable.\n\nAlso... I can get behind that thinking. Getting a quick and maybe painless death at the hand of a (seemingly) loved one instead of torture and gruesome pain til I finally die? I take the first ALL the time.\n\nI even play a paladin with that kind of mindset in a current TTRPG group. Killed a guy quick and painless in what seems like cold blood, while she knew that guy would suffer in torture otherwise.\n\nMercy is not always kind and warm. Sometimes mercy is hard and cold like a steel blade. And making such decisions is much harder than that what others usually see as mercy.\n\nWhat I say is... Is it truly wrong? Does this death take the people too far from their time of death? Are they denying people of a sizable chunk of their lifetime? Or is it just a few days, if not hours before the \"planned\" death, that the persons in question are killed off? All things to consider to tip the scales on the villainy-meter."}, {"comment_author": "Indishonorable", "comment_text": "so he has people killed by monsters that look like loved ones because it would be less cruel?\n\nthink of the feelings of the murderee, my guy!"}, {"comment_author": "Infinite_T05", "comment_text": ">How can I make the readers sympathize with the villain yet also make them think that there's no denying of his wrongdoings?\n\nYou've already got a pretty good setup going.\n\nOn the one hand, this villain is inherently evil because they kill people. They kill people before they're supposed to die, and whilst they watch their loved ones kill them.\n\nLet's develop this a bit. Firstly, the \"before their time\" part.\n\nThis is a god, a god of death at that, so they're presumably immortal. This means they wouldn't have a good understanding of the human lifespan. Perhaps the god forsees a human dying of a horrible, painful disease and does them the mercy of killing them beforehand. However, in reality, the disease isn't even present in the victim's body for another 40 years, when they're already old. For the god, 40 years is nothing. Right around the corner. He doesn't understand that, for a human, that's a lot of opportunities they've just been robbed from. \n\nThe god believes he's doing the right thing by letting the people die before they need to suffer, so we can empathise with him, but he's undoubtedly wrong because he doesn't perceive time like us. We can't fault him for that because we know it's not really his fault. \n\nLet's move onto the second part, where he sends monsters that take the shape of their loved ones.\n\nPerhaps this is the gods attempt at understanding humans. I'm sure that, across history, people have said countless times how they'd be content with their last sight being the person they love. It's a romantic saying, and it's not untrue. The god, however, interprets this as a death being optimal if it's been done by a loved one. You want to see your loved one before you die? Don't worry, she's killing you with a warm smile. That's what humans want, right?\n\nIt's cruel, but he doesn't know that. In theory, it should make sense. You'd rather see your loved ones when you die than a random murderer. That's a fact. But in practice, he's once again failed to understand how humans work.\n\nThese are mostly aspects you've already created, but now that we've developed his motivations, we can see that this isn't a bad person. He's a god of death but he has good intentions, and therefore we can always empathise with him. He's trying to do the right thing.\n\nBut because we're human, we can see the issues immediately. The problems with his methods that he can't quite process. We can feel bad for him, since he's unaware of how badly his methods are. But no one wouldn't argue that he needs to be stopped because he's doing the wrong thing."}, {"comment_author": "AiDiZi", "comment_text": "Dive deep into the villain's backstory/motivation to show that they are not purely evil but rather driven by complex emotions and experiences. Perhaps the God of Death has witnessed countless atrocities and believes he is sparing victims from even greater suffering. Show moments of vulnerability or inner conflict that humanize the villain and make readers understand his perspective, even if they don't agree with it."}, {"comment_author": "tarlakeschaton", "comment_text": "I always found the idea of death being villain a simplification towards the death. If this is what you want to go with, of course you can have the death as your villain. But it just makes the death meaningless for me."}, {"comment_author": "GiftOfCabbage", "comment_text": "Passion. People don't sympathise with villains just because of the things that have happened to them. You need to make the reader feel how deeply and passionately this villain feels about their motivations. They connect with that emotion more than the reason behind it."}, {"comment_author": "tao39", "comment_text": "Read Pratchett's Death books."}, {"comment_author": "49th_yilling", "comment_text": "Svsss extras spoiler kinda\nFrom my experience in reading,  there was this novel where a certain villain was a child abuser and rumors about him liking significantly younger girls were well known , he was rude and unlikable,  accused of murdering a bunch of people and he goes to brothels alot\nEveryone hated his guts , even me , he didn't have any actual screen time because the genre (transmigration) dictated him the OG host,  i will not explain what that means, just you know , he died before the novel started but had significant influence on main characters (like the love interest who he abused) that we knew and hated him\nThen hundred of chapters later , we learn bits about him , nothing that make us like him but the author then hit us with his backstory,  and good lord ... what a backstory that was\nTragic was too weak of a word for it , this dude was betrayed every time he trusted someone,  abused his entire life until he became in a position of power yet still isolated and scorned (seing his personality it's understandable but it didn't help) he was a slave before , and was sa'ed or almost (the author was vague in this) but we know that it was after his owner tried to touch him that he committed those murders (he slayed as he should) he goes to brothels because he is scared of men , he never slept with the woman and the rumors about him being a pedo are false because the reason he was nicer to the younger girls was because they reminded him of the only people in his life that didn't physically hurt him \n*inhale*\nHe is still the same villain , he still abused a kid (he did it because he saw himself in him + the kid had the same name as his 'owner') BUT , the Fandom folded instantly, everyone loves him but in more times than not we are like \"why are you like this dude ?\" \n\nSo my advice :\nTRAGIC BACKSTORY \n\nI need to add , that the dude got almost no screen time but is taking a big chunk in fanfics and fanart , I love him but also, uuuuhhh\nLate disclaimer : I do not support abuse in any form"}]}, {"post_title": "Need an Interesting Drawback/Limit on Dragon Fire", "post_url": "https://www.reddit.com/r/fantasywriters/comments/1by8nmu/need_an_interesting_drawbacklimit_on_dragon_fire/", "post_main_text": "While I'm still in the worldbuilding stage of a story I'm writing with dragons as the main characters. As I refine the magic system, simultaneously trying to decide how much it should matter to the overall plot, I think regardless of the totality of its impact, it would be unwise for the dragon fire (and other elemental breaths) to be infinitely spammable. \n\nI don't want something as plain as they can only use their breath X number of times per day for whatever reason, if they do it too much they get tired, or it has to recharge over a short period. I think without more concrete limits or a drawback, the characters would use this magic way too much and that wouldn't be too interesting. \n\nSo I was hoping I could get some help refining potential ideas. \n\n**1) Consuming a Magic Source**\n\nIn this case, the dragons would have to eat a special mineral or other magically-imbued item in order to use their breath weapons. When the source of magic is a physical object, however, this has major implications for the economy of the world. Where does the source grow? How is it collected? Let's say its a mineral that must be mined. Whoever controls the largest magic mine would be the most powerful person/nation. What motivation would they have to ever share this magic with their neighbors? If they didn't, warfare over the region would be constant (even if smaller deposits did grow elsewhere, everyone would want to be top dog). I worry this idea, while already laden with ideas for conflict, doesn't necessarily mesh with the ideas I already have for the story,. Not that I'm not in an early enough stage to change this, to be fair. \n\n**2) Bleeding Weave**\n\nAnother idea is to have magic be something more intangible, like the Weave in D&D, that exists between the fabric of reality. It is everywhere, but difficult to access. Dragons have the innate ability to pluck at this Weave, granting themselves power, but doing so leaves a hole behind. The more the magic is used, the more unstable the environment around them becomes. This means using breath weapons during a battle would leave the area of the battle scarred with unstable magic, creating pockets of dangerous regions throughout the world, and use of this magic in populated areas would be highly restricted due to this danger. This approach means using their breath weapons is sort of a moral choice each and every time, and uses would be few and far between outside of life or death situations. More of a focus could be put on how the people of the world are trying to mend these holes, or at least contain the wild magic, which could have interesting implications on the overall plot. \n\n**3) Physical Toll**\n\nOne approach is to imagine how letting out a jet of hot flame from one's mouth might be physically damaging. Scarred tongues and mouth, eroded teeth, etc. With this approach, you can use the breath weapon, and then you'd have to wait for the mouth to heal before doing so again, and if you don't, you risk permanent damage. So, overuse can comprises one's ability to eat, drink, or speak properly. This is the approach with the least possible implication on the overall plot, but perhaps add some \"realism\" and interesting background to the world to imagine a sort of disability associated with overuse, so perhaps war veterans are recognizable by the burns on their mouths and such. \n\nHow do these ideas sound? Are there more interesting concepts you can think of I might be able to use? Thanks! ", "post_comments": [{"comment_author": "Infinite_T05", "comment_text": ">I don't want something as plain as they can only use their breath X number of times per day for whatever reason, if they do it too much they get tired, or it has to recharge over a short period. I think without more concrete limits or a drawback, the characters would use this magic way too much and that wouldn't be too interesting. \n\nTo be honest, I disagree. I've always interpreted a dragon's fire breath as a physical ability of theirs (like flying). And all physical abilities have limits.\n\nIt'd be a whole lot more practical if we humans were to just sprint everywhere. It'd get us places quicker. And in a fight we'd be harder to hit. So why don't we? Because it's exhausting.\n\nIf you were to imagine a dragon breathing fire, that's them exhaling. Right now, try to exhale and see how long you can hold it for. Odds are you won't be able to keep it up very long, and afterwards you'll feel winded. If that's the drawback to humans of breathing out, I think it's reasonable that it could apply to dragons too.\n\nSo I'd say go with your third idea, but it doesn't need to be so extreme. The idea of the fire burning the inside of their mouths can go because, to be harsh, it's unrealistic. If an animal has evolved to breathe fire, why wouldn't it have evolved to have fire-resistant teeth as well? If one of your dragons are really pushing themselves to their limit in a battle, then a burnt tooth or two could be an interesting after-effect to demonstrate how they were going beyond their limits. But to have it be a general concern for every dragon every time they breathe fire? It sounds to me like they'd rather never use it, and that means they never would have evolved to have it.\n\nDragons can only breathe fire for as long as their lungs will allow. Naturally, they'll have greater lung capacity than humans but, as a physical ability, their breath will eventually tire out their lungs and they won't be able to breathe fire anymore. It would also likely lead to their movements becoming sluggish and their muscles becoming weaker, since if the lungs aren't able to take in as much air, the body won't be receiving as much oxygen and that'll end up temporarily weakening them.\n\nAll of this is a logical, biological drawback to fire-breathing. And it exists in the real world, with how animals normally exhale. Taking inspiration from real life is a good idea for things like these because real life is \"balanced\". Nothing is \"op\" and nothing is stupidly underpowered. It all balances out just right"}, {"comment_author": "RevvDragon", "comment_text": "That's certainly a fair point of view, yeah! I can work with the idea that using the breath weapon leaves a dragon more vulnerable to physical attack afterward because they're briefly winded. Thanks!"}, {"comment_author": "BlackBrantScare", "comment_text": "Some random idea I got on physical weakness of dragon, this is absolutely random bullshit go btw\n\n1. Assume breathing fire is physical ability made by igniting fuel and oxidizer. Different fuel/oxidizer mix can give different flame and temperature. Fuel rich is lower temperature and made lot of soot. Oxidizer rich is high temperature, highly corrosive. Big animal usually fart methane, and if collected and compressed it is one of the strong rocket fuel in the market. Oxidizer is easier because oxygen is everywhere in the air and can be turn into liquid oxygen by mechanical compression. Both would be keep in internal organ that can hold high pressure liquid gas. Both can spray out and ignited for fire breath\n\n* however this need the dragon to hold its breath when using fire breath because hot gas go into lung is bad. It’s one of main reason why people rescue from burning building die. Breathing in the hot gas, lung damage with burn scar and swelling. Which limit hiw long and how many time it can use fire breath\n\n2. heat weaken most material (jet fuel doesn’t need to melt steel beam, only need to weaken it) and made most organic material pyrolysis (which is what cause burning building to explode sometimes) so a dragon would need some kind of heat protection to heat proof itself. And most of common fire proof material are made to resist/delay burning or charred like firefighter coat. And a layer of ablative material that burn away in super hot and sometimes corrosive flame like coating on soacecraft\n\n* fire proof lining inside dragon can take time to regenerate so there are limit time of it can use fire breath. And even worse if it use oxidizer rich fire breath. It could be one and done since all fire proof lining is burn away and any more fire breath can damage itself\n\n* dragon scale and armor could be weakened by the heat. Which mean easier to cut into or puncture the dragon body with weapon esp around the head where the heat is most concentrate to \n\n3. remember the gas tank organ from 1)? Imagine puncture that stuff with something sharp. Either it explode from gas expansion or blow up to piece if the leaking gas ignited like that one SpaceX rocket. And if the dragon didn’t explode the leaking gas leaving the body and expanding fast it could cause frozen damage around the leaking spot\n\n4. all living being have specific operational temperature. The dragon could get overheated and get sick or need cool down period between fire breath or after fleeing from the fight. Forcing it to keep fire breathing until exhausted can make dragon seriously sick and cannot move for some time.\n\nTLDR - Dragon work like rocket. It could run out of fuel, fuel tank explode, material give up, getting too heat up to operate"}, {"comment_author": "Maxathron", "comment_text": "The way the fake-umentry that Discovery channel put out was Dragons scratched out and consumed some kind of metal that enabled them to ignite the gases in their bodies into the fire breath.\n\nThey also held in their farts for this process to work.\n\nNo metal, no ignition.  Don’t eat much food, no methane to fire breath with.\n\nMeans only healthy and well fed dragons could do it."}, {"comment_author": "Indishonorable", "comment_text": "that \"bleeding weave\" thing has been done before, with Bionicle's Midak Skyblasters. they fire balls of concentrated light, but draw from the light in the area around them. while these weapons are excellent at combatting the makuta, beings of shadow, they also drain the area of light, creating pockets of shadow when overused, making the toa more vulnerable."}, {"comment_author": "METABLUNTZ", "comment_text": "I have always considered dragons to be magical creatures. You could say the dragon fire utilizes magic power or mana. Once the mana in the dragons body is depleted, it will take time for them to regenerate it naturally. Set the time limit for that natural regeneration to whatever is convenient for your narrative!"}, {"comment_author": "RobotCatCo", "comment_text": "Make it so that your dragons convert food into a sort of fat that they store in their bodies, and they use the fat as the fuel source for their dragon breath.  This means that, in order to keep your dragons ready to use dragon's breath you need to keep them fed.  Overusing dragon's breath will deplete your dragon's fat stores, and after that they start burning their own blood, which will lead to their death.\n\nYou also need to build up the fat over time, as you can't just feed them food and immediately convert it to useable fat.   Dragons also can't eat more than their stomach can hold, so you can't just overfeed them past their capacity to try to get them 'refueled' so to speak.\n\nFinally, if your dragon is too fat they can't fly or walk around as well, and will lead to long term health problems."}]}]