["Hello, and welcome to r/FantasyWriters!\n\nAs the title suggests, this thread is aimed at those of you who are new to writing, or to the fantasy genre. Be sure to read the [Rules](https://www.reddit.com/r/fantasywriters/wiki/index/#wiki_rules_.26amp.3B_guidelines_for_writers_seeking_critiques) before submitting because we will remove any post that does not adhere to them.\n\nIf you are looking for a community that shares your love of the fantasy genre, where you can meet with like-minded writers of all skill levels, you can join our Discord at the following link: [https://discord.gg/yXYmFaUFb6](https://discord.gg/yXYmFaUFb6)\n\nYou may also wish to check out our Solstice 2023 writing contest. It's well under way, but hurry up! The deadline for this contest is February 3rd! You can read more [here](https://www.reddit.com/r/fantasywriters/comments/18nxvo8/official_december_solstice_2023_writing_contest/)\n\nNow that the housekeeping is done, we’ve set this post up so that you have a place to ask anything that is on your mind.\n\n# **Intermediates and experts!** Do you have wisdom to offer? Do you have experience that you feel may help new writers? Pop your head in and share it with us.\n\nWe like to encourage the use of Google Docs to share work on FantasyWriters. For those of you who are unsure how to use it, we have put together a [guide to using Google Docs](https://docs.google.com/document/d/1aZfWMJe07XQsNRXCd9m_wmwhBMrs6c0hPRExgnzJT3Q/edit?usp=sharing). \n\nIt is strongly recommended that you use Google Docs when sharing longer texts. \n\nTo begin with, we have dedicated a section of the Wiki for new authors, which you can find by clicking [here](https://www.reddit.com/r/fantasywriters/wiki/index/a\\_beginners\\_guide\\_to\\_writing\\_fantasy\\_fiction/#wiki\\_introduction)\n\nThis wiki entry will compile any and all information we encounter on this sub that can make your life easier, and we encourage you to check it out. Most importantly, the [FAQ](https://www.reddit.com/r/fantasywriters/wiki/index/a\\_beginners\\_guide\\_to\\_writing\\_fantasy\\_fiction/#wiki\\_frequently\\_asked\\_questions) section will collect all the questions this sub sees regularly, that otherwise relate to the fundamental aspects of writing fantasy.\n\nPlease browse the Beginner Hub for access to the [FantasyWriter's Big List](https://www.reddit.com/r/fantasywriters/wiki/index/a\\_beginners\\_guide\\_to\\_writing\\_fantasy\\_fiction/#wiki\\_the\\_fantasywriters\\_big\\_list)\n\n# r/FantasyWriters Beginner Friendly FAQ\n\n[Can I do X? Am I allowed to do Y? Is it okay to do Z?](https://www.reddit.com/r/fantasywriters/wiki/index/a_beginners_guide_to_writing_fantasy_fiction/#wiki_can_i_do_x.3F_am_i_allowed_to_do_y.3F_is_it_okay_to_do_z.3F)\n\n[Is my Idea interesting enough?](https://www.reddit.com/r/fantasywriters/wiki/index/a_beginners_guide_to_writing_fantasy_fiction/#wiki_is_my_idea_interesting_enough.3F)\n\n[Should I change my MC's name?](https://www.reddit.com/r/fantasywriters/wiki/index/a_beginners_guide_to_writing_fantasy_fiction/#wiki_should_i_change_my_mc.2019s_name.3F)\n\n[How do you come up with names for your characters?](https://www.reddit.com/r/fantasywriters/wiki/index/a\\_beginners\\_guide\\_to\\_writing\\_fantasy\\_fiction/#wiki\\_how\\_do\\_you\\_come\\_up\\_with\\_names\\_for\\_your\\_characters.3F])\n\n[Is X trope overdone/overused?](https://www.reddit.com/r/fantasywriters/wiki/index/a\\_beginners\\_guide\\_to\\_writing\\_fantasy\\_fiction/#wiki\\_is\\_x\\_trope\\_overdone.2Foverused.3F)\n\n[What tools and resources should I use?](https://www.reddit.com/r/fantasywriters/wiki/index/a_beginners_guide_to_writing_fantasy_fiction/#wiki_what_tools_and_resources_should_i_use.3F)\n\n[How/when do I actually start writing?](https://www.reddit.com/r/fantasywriters/wiki/index/a\\_beginners\\_guide\\_to\\_writing\\_fantasy\\_fiction/#wiki\\_how.2Fwhen\\_do\\_i\\_actually\\_start\\_writing.3F)\n\n[What is Worldbuilding Paralysis?](https://www.reddit.com/r/fantasywriters/wiki/index/a\\_beginners\\_guide\\_to\\_writing\\_fantasy\\_fiction/#wiki\\_what\\_is\\_worldbuilding\\_paralysis.3F)\n\n[How do you define your world for your reader?](https://www.reddit.com/r/fantasywriters/wiki/index/a\\_beginners\\_guide\\_to\\_writing\\_fantasy\\_fiction/#wiki\\_how\\_do\\_you\\_define\\_your\\_world\\_for\\_your\\_reader.3F)\n\n[What does it mean to 'find the right word'?](https://www.reddit.com/r/fantasywriters/wiki/index/a\\_beginners\\_guide\\_to\\_writing\\_fantasy\\_fiction/#wiki\\_what\\_does\\_it\\_mean\\_to\\_.27find\\_the\\_right\\_word.27.3F)\n\n[How long should my novel be?](https://www.reddit.com/r/fantasywriters/wiki/index/a_beginners_guide_to_writing_fantasy_fiction/#wiki_how_long_should_my_novel_be.3F)\n\n[How do I describe simple movements?](https://www.reddit.com/r/fantasywriters/wiki/index/a_beginners_guide_to_writing_fantasy_fiction/#wiki_how_do_i_describe_simple_movements.3F)\n\n[Is it better to write a standalone or a series?](https://www.reddit.com/r/fantasywriters/wiki/index/a_beginners_guide_to_writing_fantasy_fiction/#wiki_is_it_better_to_write_a_standalone_or_a_series.3F)\n\n[How do I create a language for my story?](https://www.reddit.com/r/fantasywriters/wiki/index/a\\_beginners\\_guide\\_to\\_writing\\_fantasy\\_fiction/#wiki\\_how\\_can\\_i\\_create\\_a\\_language\\_for\\_my\\_own\\_story.3F)\n\n[As a man, how do I write from a woman's POV? (And vice versa)](https://www.reddit.com/r/fantasywriters/wiki/index/a\\_beginners\\_guide\\_to\\_writing\\_fantasy\\_fiction/#wiki\\_how\\_can\\_i\\_create\\_a\\_language\\_for\\_my\\_own\\_story.3F)\n\nYou may not recognise a question of this nature when it occurs to you, and that’s fine too. Please be aware the question may be removed, and you may instead be redirected to a Beginner’s Hub thread. As far as you are able, if you are new to the sub or the genre, please search for these threads before posting.\n\nWriting fantasy fiction is a daunting prospect. Our aim is not to isolate you, but to make sure the information best able to help you is readily available and visible.\n\nHappy writing!", "These are great resources! I'm also going to share my own post from last year on how to name characters by leveraging preexisting associations readers have with sounds:\nhttps://www.reddit.com/r/fantasywriters/comments/x5xj4j/naming_fantasy_characters/", "These seems like a great addition, thank you! I'll add it to the hub :).", "Thanks, hope folks find it helpful!", "Saving this post. Thank you!", "This should probably even be stickied to the top of the subreddit if possible!", "We have a lot of posts that benefit from being stickied unfortunately. We are still trying to optimise the rotation up there :'D Though I do agree, in lieu of that we have this post scheduled once a week.", "# [Submit Your Story Here](https://forms.gle/yaCQfTfktQYLZ9c5A)  \n**Deadline: 30 April 2024**\n\n***\n\nGood morning fantasy authors! I’ve got another fantasy authoring contest for you.\n\nThis is our second quarterly writing contest, which begins on each solstice and equinox. To check out the first contest, [here’s our winners announcement](https://www.reddit.com/r/fantasywriters/comments/1bftnf7/official_december_solstice_2023_writing_contest/)! A few minor adjustments have been made to the format and rules of the competition, which I’ll get to very soon. But first… the prompt!\n\n# Write a story about a “Sabotutor” (a Mentor who intentionally trains their student(s) incorrectly) whose scheme could be spoiled after their poor guidance leads to an unexpected discovery.\n\nAdditional Optional Prompts:\n\n- Include an animal companion. \n- Write a sentence at least five words long where every word starts with the same letter.\n- Make your POV character trip and fall.\n\n# Rules\n\nThere is a slight change here: **We are reducing the required word count to 2,000-3,000 words.** This is to make the contest easier for both the authors and judges to meet their deadlines. \n\n- The submission must be a Google Doc. 12pt Georgia, 1-inch margins, 1.5-spaced, left-aligned. The title should be in the center-top with the author's name directly below. No fancy type-setting embellishments. The only thing that should stand out is the content of your story. [Example.](https://i.imgur.com/2aPL5Ve.png)\n- Word count should be **between 2,000 and 3,000 words.**\n- The genre must be speculative fiction. (e.g., fantasy, sci-fi, magical realism, etc.)\n- Keep it PG-13. (e.g., no graphic descriptions of violence or sex, etc.)\n- **No plagiarism. No A.I.-generated content.** If found in violation of this rule, you will be immediately disqualified and banned from participating in future contests.\n\n# Your Rights\n\nAll submissions to this contest belong to their respective authors. You are free to share your story however you like whenever you like, before or after the submission deadline. We’re literally just a subreddit and will not be taking any action against you for distributing your story how you want to.\n\nWith that said, by submitting your story to our contest, you are giving us permission to also share, distribute, and judge the content, with all credit to you.\n\nYou also have the right to use your Reddit username or a pseudonym as the \"Author\" if you don’t want to share your real name on the anonymous internet.\n\n# Judging\n\nThis section will also be modified with a less strict rubric for judging. Rather than giving a numerical rating scale for each story’s concept, prose, plot, and characters, judges will instead choose their top four entries and be asked to give justifications. Again, this makes the judging process much simpler. \n\nIf you're interested in being judge (and you are not planning to participate) you must be a member of our [Discord server](https://discord.gg/7nu2Zz8StN), and you should DM me at @Page2000 with a request.\n\nLike last time, we will have a Reader’s Choice Thread. However, the comment section will be unlocked this time so that people can give comments/critiques on the stories they've read. I originally had the thread locked to enable more unbiased reads, but several participants from the previous contest asked if there could be a way to receive feedback, and this seemed like an obvious solution that would also encourage engagement. \n\nThe awards will be as follows:\n\n- First Place: A special yellow flair.\n- Reader’s Choice: A special green flair.\n- Runners-up (3): A special blue flair.\n\nIf the same author wins multiple awards, their flare color will be by order of the following priority: yellow, green, then blue. This goes without saying, but if you choose to participate in the competition, there is a chance you may not win anything at all. Please don’t take this too personally, and feel free to try next time!\n\nTimeline: (Subject to change)\n\n- 19 March 2024: Submissions Open\n- 30 April 2024: Submissions Close / Reader’s Choice Thread\n- 1 June 2024: Winners Announced\n- 20 June 2024: Next Contest Begins\n\n# [Submit Your Story Here](https://forms.gle/yaCQfTfktQYLZ9c5A)\n\nTo submit, you must include the following:\n\n1. Title of the story\n2. Your Reddit username\n3. A one-sentence blurb\n4. A Google Doc with your story\n\nTo share your Google Doc, press “Share” on the top right, under “General Access” select “Anyone with a link,” make sure the role is set to “Viewer,” and then press “Copy Link.” Paste the link into the submission form.\n\n***\n\nIf you haven't already, join our [official Discord server](https://discord.gg/7nu2Zz8StN) where you can participate in word sprints, find beta readers, and brainstorm ideas for your entries.\n\nI also apologize for the delayed activity and response from me over the past few months. Life has been a lot and my brain has been a little, so I'm pushing through the best I can. Thank you for your patience and enthusiasm, it's been super encouraging!\n\nHappy storytelling!", "2-3k words, huh? \n\nSo... you're saying I *shouldn't* accidentally write a 12,000 word novelette and hack'n'slash edit it down to size again?\n\nXD\n\nThanks Page!", "Again? Oh no...", "I think you *should* if it makes something as good as that last one.", "Whatever works, I loved yours.", "Lol, relatable. I chopped off about 3k something words for the last contest. \n\nOr you can capitalize by writing 12k words and hack'n'slashing them into six fabulous shorts. '*Writers hate them for this one neat trick!'*", "aw, thank you", "Your username makes me happy", "Wooooo, round 2 y'all!! I have a busy spring ahead of me so I may just be a judge this time, but I'm so excited to see what everyone creates!", "I'm writing a story where my main character and his partner are stuck in an illusion, causing them to walk in a circle caused by an illusion spell. What method(s) would you choose to break it so the characters could progress the story? I've been stuck on this issue for a few days now so anything at this point will help. Thank you.", "The Irish answer to this is turn your clothes inside out. Which as I think about it, the reason for that is to break the pattern. So walking backwards for time and then moving sideways suddenly. Putting something over your eyes so you can't see and walking that way. All strategies to break the pattern you are stuck in.", "Any piece of clothing—even a glove will do, reportedly.", "This is about how illusions work in your story's world, not this scene in particular.  The answer lies in fleshing out the magic system.\n\nCan spells be broken in general?  What are the rules for doing so?\n\nWho cast this spell, and why?\n\nWhat *exactly* is this spell doing?  \"Makes them walk in circles\" is vague and wide open to interpretation.\n\nIs it affecting the senses?  If so, how many?\n\nHas it put them in a pocket dimension, in which case it's not strictly an illusion?\n\nFor characters to break a spell, they must either realize there is a spell to be broken and then work towards that, or accidentally stumble on the breaking mechanism.  That's the only narrative question here, but it still depends on how the magic works.\n\nWhat might cause them to suspect a spell is in force?", "Trudvang (a Nordic fantasy RPG) has a wonderful campaign called the Wildheart. Wildheart is an evil enchanted forest, once you're in, no path leads out. The forest became sentient after a series of ancient battles where so much blood was shed that it awoke the forest.\n\nWildheart is inhabited by all manner of creatures. Trolls, dragons, the spirits of some who died there, a company of dwarfen brothers, and so on. Many are lost like you and have been there a long time.\n\nThere are two tricks to the Wildheart. The first is that any time you spill blood, there's a chance very powerful dark spirits arise to hunt the killers. The more blood you spill, the bigger the chance those spirits rise up from the bloodsoaked earth. \n\nOver the centuries, the forest has learned many secrets about its inhabitants. To turn them against one another, there's a legend that the forest will open a path to the outside world for the first to learn any 3 secrets.\n\nMany in the forest know this legend and secrets are jealously guarded and bartered in Faustian deals. The blood curse stops open violence, for the most part. But many of the forest prisoners will lie, cheat, and manipulate the protagonists to try and use them to obtain dangerous secrets without risking the blood curse themselves.", "That sounds like a birth of a fey world where the inhabitants eventually becomes Titania etc.", "Have one person close their eyes and just start walking in a random direction. The rest follow.", "I like this. First, I would have them try to follow a stream of river, just to end up back at the same place, the water having some sort of Escher-like illusion. Trying to follow the sun or stars, but the illusion holds. Eventually, randomness, and not using senses, allows them to escape the illusion.", "Could be interesting to try using your eyes, use other senses like sound or smell. Maybe your characters have other unique talents to circumvent the illusion", "Can they not see the sky? Just look up and see what the position of the sun or stars are. Just pick a directional star and keep walking towards it.", "MY characters would solve this in a bunch of different ways. \n\nKnight Vision is cheating, he can just turn on his Vision powers and see the true flows of magic, so we'll pretend he isn't there, too easy. \n\nKaffee would burn the forest down, or boil the swamp, or something equally violent and over the top. \n\nRaven would start leaving herself guidance cairns made of stones, and after a couple loops would probably sit down and carve some ritual circles into the ground and  attempt to dispel the illusion entirely. \n\nFlix and Flox can fly and would just go up until they were out of the illusion. \n\nRazdeline would simply remain hopelessly lost without her friends. Kötinga too. \n\nPika and her cousins, would unwind some string to leave a trail, and when they'd formed a bigass circle with it they'd take up three positions along that circle and us it as one giant ritual spell to take control of the illusion spell themselves, and have it lead them out. \n\nDarsun and Andurian wouldn't fall into such a trap in the first place, but if they did, they both have that same vision Power as Knight Vision, they just need a few minutes to turn it on, whereas he blinks and does it. So they're not terribly fun at this game either. \n\nFarstepper would affix his teleportation spell to a bullet and fire it from his gun and an angle that would take him likely well clear of the illusion and then when he got bored of looking for something interesting to kill in the illusion he'd teleport away.\n\nTogrin would step sideways into the spirit realm and go that way instead. Togrin goes into the spirit world to fall down stairs and pops back. That's how he solves all his problems. \n\nRingo, Zinan and Sadao would all mark the trees or landscape as they went with arrows and whatnot pointing the way, but would end up leaning heavily on Sadao trying to vibe his way out with the sorta semi- sixth sense version of the Vision power. He's just not trained enough at the Vision to be able to do it, but he can sorta sense the flows of magic better than the others.", "I'm sorry, one of your characters is called Kaffee? Is there some pun around that? As a German, my immersion would be kicked in the head if there wasn't. :D", "Kaffee, like all the names listed, are Monikers. Wizard nicknames that protect them from True Name magic. Kaffee is so called because he is always wound up like someone who has drunk 50 cups of coffee, has been since he was a child. The guy who unintentionally gave him his moniker is an old German wizard, from before earth was a planetary government, and before the planet was bombed to hell. \n\nWhen the old guy met Kaffee as a child he turned to Kaffee's mentor/adoptive dad and asks \"Did you give that child a whole pot of coffee or something?\" Obviously the mentor speaks German, but Kaffee doesn't quite understand german, he only speaks galactic common (Kids these days) but could tell he was being talked about and latched on to the word Kaffee, as it was used back and forth between the two older men many times. Most wizards don't pick their Moniker quite so young, or quite so... haphazardly. It perfectly encapsulates Kaffee as a character, energetically and enthusiastically making bad choices with confidence. \n\nHe's also sometimes described as the Caveman Wizard, but not to his face, on account of his adult appearance being rather... cavemanish.  Meaty hands, hairy knuckles, prodigious brow ridge, kinda short. People think he's dumb, because of the Moniker, and the look, but he makes wizard warp drive engines from scratch and should not be underestimated by any means. He can and will turn people inside out if they make him mad enough.", "Sarah painted the floor tiles with lipstick in Labyrinth.  Maybe they could break off branches and arrange them to point in the direction they walked", "Don't forget that the Labyrinth also messed with the orientation of the arrows. The illusion could simply change the perception of the branches' orientation.", "Bilbo climbs a tree to look for landmarks, not that it works in his case but I feel that’s a simple enough solution", "The first, possibly easiest route is trying turning right around and walking it backwards. It might be confusing you in a single direction and unable to compensate fast enough.", "You can use any method to break the illusion so long as you have a rational behind how it broke the illusion. How far can illusions go in your world? If two characters run in opposite directions at the same time, will the illusion expand to hold them or break? Does it rely on your vision? Blindfolds will work. Are they actually walking or asleep? Pain or realizing it is an illusion could snap them out of it.", "Depends on a variety of factors, most importantly, are your characters familiar with such magic, and if so, how familiar? If we use math as an example, and a scale of 1-10, where one means you know that counting exists, and ten is Stephen Hawking level mathematics, what number would they be on? \n\nIf they are around 1-3 range, where they, at most, have heard of the existence of illusion magic: there should be a lot of mistakes. They are at a level where they don't really understand what's happening, just that something is happening.  The way they get out of this is either by pure luck, or if it fits the character's style, a logical series of testing the parameters of their confinement, essentially moving them up into a higher category. \n\n4-6, where they know the basics of illusion, maybe some experience in using simple illusion magic themselves: this would follow the latter of the above options. They know it's illusion magic, they know illusion magic has rules they are familiar with.  They will have ideas of where to start, which will be based on your magic system. They would use methods to test the bounds of the magic, but these would be informed hypotheses, not the random guessing from above.  To go back to the math similarities, this group would look at a problem like 46x30 and be able to narrow it down, they know it's somewhere between 1200 (40x30) and 1500 (50x30).  They might add 46 to itself 30 times.  They could get lucky, but these guys are much more likely to get the answer on purpose because they understand the concepts at play. \n\n7-9 where they are extremely familiar with illusion as casters: these guys would steer even harder into the test their way out category, only they would understand all the principles at play.  They don't need to half-ass their math like above, they know about multiplication and how it works, hell, they know calculus. These guys would tear apart the spell pretty quickly and efficiently with the full understanding of how it works. \n\n10: they know the counterspell, the whole thing is over in a minute.", "How \"science-like\" do you want your magic to be? In recent years, partly due to the influence of Sanderson, the idea has been that magic systems should follow an almost science-like set of insularly consistent rules. If that's your approach, treat the illusion like a science-fiction simulation -- have them run quickly in opposite directions so that the illusion is forced to cover larger and larger amounts of space, draining more and more energy from the spell-caster, until the spell breaks.", "What I would do at this point is go back to an earlier point in the story and create a way to break that spell, or at least provide a sort of literary antepiece that the characters can use as a basis for interacting with the illusion.\n\nAs for *how* to break the spell:\n\n1: Realizing there's an illusion loosens its hold on the observer. It's still in effect, but they know it's an illusion and can proceed with that knowledge. They'll have to use their wits to identify the things that keep them moving in a circle. They might notice a weird pattern in the illusion, a glitch in the magical matrix, like a specific tree keeps popping up. They check it out, and it's just a part of the illusion.\n\n2: A specific item breaks illusions (at least temporarily). If you're thinking of the snap seeds from Sekiro, this is exactly how it would work. The characters could have gotten a specific amount of them from someone, and thus have a limited supply. Tension can be created through them burning through their supply, it could even resolve in such a way that they're still trapped in the illusion, but there's some other factor that leads them to safety, like a familiar scent, or the sound of something that they haven't heard in the forest.\n\n3: Illogic and violations of common sense. Illusions rely on people trusting them/their senses. If doing everything correctly works, then doing everything wrong is the only way to proceed. This could come about due to desperation or even some level of delirium. Or maybe the protagonist, the smart one of the group, or even the fool of the group reasons this out and finds the way to safety.\n\n4: If all else fails, they get rescued. It's not the most satisfying solution, but one way you could preserve character agency is to have their actions ultimately be the reason why they are rescued. Like, they free a wild animal from a trap, or from being stuck. Or they have a massive blowout, but later have a heartfelt reconciliation. (I'd even so as far as suggesting they end up splitting up as a result of the blowout, but manage to find each other again- either being guided or one of them looking for the others and getting them back together.) These actions are enough to touch the heart of a local faerie (or equivalent), who helps them find their way out.", "Could have a random animal stumble across them that’s unaffected and they follow it to freedom.", "I think it would be better to have them come up with the idea that animals might be unaffected and looking for one to follow. It makes the characters more active.", "If you're stuck, why not just not have them get caught in an illusion? Doesn't seem like you have any purpose for putting them there, or you'd have an idea in mind for how you wanted them to solve it.", "If it is intentional then just bribe them lol", "Here’s how mine would act (might give you some ideas):\n\nKris the dumb dumb says they need to hit him on the head hard to knock him out of it\n\nXiyang suggests a counter spell of some sort—maybe a spell of revealing or curse removal?\n\nSun insists that they just keep walking forward.\n\nNikki says they need to turn in circles and close their eyes, or walk backwards, or otherwise confuse themselves\n\nPeri suggests getting a rope to mark where they’ve been\n\nAnd Tarella as captain compiles these ideas", "A bell. I often use bells as like the only sound that can consistently cross planes/dimensions/whatever.", "Do they know they are trapped in this illusion spell or do they figure it out somehow by catching a recurring pattern - seeing the same tree or bird, and realize their going in circles?\n\nI like to think of Coraline and the Other Mother's world when it comes to this idea of illusions, especially when she and the cat are walking through the forest and the Other Mother's illusion fades into nothing but a white, endless void before fading back into view, as if walking the entire \"world\" of illusion and finding yourself back at the start.\n\nWhat if your characters don't even realize they're trapped in an illusion or spell until they find the end of the illusion, where the imagination of the spell caster's mind ends. 🤷🏼‍♀️ Maybe just finding a break like this is a way for your characters to escape.", "use rop to make sure you walk in straight line.  Or zig zag from tree to tree.  That last is use by survivalist to help navigate during white outs.  Basically it really easy to see you have walked a straight line for 10 15 feet.  Then you turn 90 degrees and walk to the next tree and turn 90 the other way.  This gives you a clear visual guide what way you are going.  Since you are say alternating between due NW and due NE the next result is due north.", "If the illusion is outside the mind and a 'physical illusion' then crossing their eyes will show two of the illusion like any other tree.\n\nBut if the illusion is in the mind, then crossing the eyes will not make the image double, revealing the illusion.", "Gotta make the spellcaster stop casting the spell or to lock their hands. reminds me of the blair witch film where the characters are stuck in a forest and are lost in the witch's maze. some cool ideas would be for the spellcaster in your story to be hidden in floorboards or perhaps in a cabin that the characters have to find through special items such as the compass or the witchs creations.", "Darien (shape-shifting dragon) would grow wings and fly up to get a view.\n\nErle (wolf therian) would shift into her wolf form and follow animal trails off the beaten path.\n\nKurt (half Fae half vampire) would look for the core of the spell using his sensitivity to magic and break it.", "There are about a 1000 ways to solve this issue, depending on your characters and the way your magic system works.\n\nFor example, the first solution that I could think of was to Paint an exact replica of the scenery in front of of them on a canvas, then add a dirt road right though the middle. The essence of art is capturing the reality, but the forest itself isn’t real, so by recreating the illusion in a physical state, it can be manipulated. \nIt’s a fun idea, but it won’t work if they don’t have the materials or your MC just isn’t good at painting.", "Remember, that your reasoning for the illusion to be broken does not have to follow logic, atleast any clear one.\nYou are allowed to create stories that are not logical. :)\n\nOne story had the person take a red pill to solve it, so it can be very small. Another story solved it by drinking the sea and smashing mountains, so it can be very huge.\n\nI think the answer lies in what you want your story to be, do you want it to be grand, thought-provoking, simple, cute, or any other descriptor.", "I have a flying party: they simply move straight up to get their bearings. If weather is not favorable for that solution, light magic: not as in \"magic flashlight\" but light as in \"revealing what was hidden.\" Effectively, a form of Dispel Illusion or similar.\n\nOr someone finds the good sense to ask the stones where their destination is, and the way might open. But that would require that the elementals are feeling agreeable.", "Burn the entire place down. No more forest.", "I got this idea for a story I'm considering to write, but I want to know if this idea sounds interesting or stupid.  \n   \nThe story focuses on a pair of characters named Jay and Xereck. Jay is a mercenary who's being paid handsomely to take Xerex to the other side of their post-apocalyptic world. Xereck is a strange pre-teen boy who starts developing psychic and reality-altering abilities over the course of the story.   \nOn their journey, they face all sorts of different challenges together. At first Jay sees Xereck as nothing more than talkative cargo, but they eventually grow closer until Jay is practically like an aunt to him.   \n   \nThe world they live in used to be a regular low-magic fantasy world until an apocalyptic event changed it irrevocably 20 years before the story. Eldritch abominations invaded the world, rewriting the laws of reality in their wake. These beings were sealed away, but the world was forever changed to be like an MC Escher painting.   \n  \nThroughout the book, there are several footnotes that lead to commentary at the bottom of the page about the events of the story. They're very condescending to everything except Xereck. None of the characters react to the footnotes until one is attached to Xereck's dialogue. He's able to hear the footnotes as though they were regular speech in quotations.  \nEventually it's revealed that Xereck is half-human, half eldritch abomination, which is the origin of his powers. His mother is one of the creatures who have been sealed from existence and needs his help to free her. She is also the one who has been commentating this whole time.  \n   \nAt the end of the book, Xereck's mother starts to break free, leading to some \"House of Leaves-like\" text weirdness as her presence warps the medium itself. Xereck seals her away, returns the book back to regular formatting for the final chapter(s), and starts using his powers to slowly restore the world back to the way it used to be.   \n   \nI know this is a bit experimental, so I wanted to gauge what other people thought of the idea before I develop it further. Does this playing around with the format in a way that it affects the story and antagonist sound interesting or frustrating to read?", "I think you should experiment and try it!  There's no guarantee it will work but you can keep tinkering with it and explore the possibilities.  That's the nature of innovation.", "Its cool! Go for it!", "Once you finish this thing, send me a link please, I wanna buy it.", "Honestly if you do it well that sounds sick as hell", "Definitely read The Amulet of Samarkand by Jonathan Stroud! The narrator for most of the book is a djinn who can think about multiple things at once and his commentary on and explanations for things happening around him happen in footnotes. At the beginning of the book it seems like he's just going to explain the world to you, but as the book and the rest of the series goes on, the footnotes' function gets more interesting. It's a children's book but remains one of my all time favorites, and I always recommend it to people looking to utilize footnotes in fantasy!", "Thanks for the suggestion. I'll make sure to check it out!", "Authors use unique formatting to tell their stories all the time. The only thing to remember is the formatting should enhance the story. If it becomes too confusing and causes the reader to stop reading forward and start flipping around trying to figure out what is going on, then it may be time to dial back some of your choices.", "This sounds pretty cool dooooo it", "Help give a nickname to my pirate oc (ship name Heavens Dream)\n\nHow are pirates named?\n\n\n\n\n\n\n\nIf Dan's pirate crew was the heavens dream what would his nickname \n\n my oc Dan who goes around searching for revenge after he lost Heavens Dream and his mentor Shiva.\n\nI don't really know what they would call him if they tell tales and legands of Dan\n\n\n\n\nPost for reference \nWhat I've chosen for the design \nhttps://www.reddit.com/u/Dragonbarry22/s/cc7g8BURbB\n\nOther references \nhttps://www.reddit.com/r/OriginalCharacter/s/3c2UVBdKel\n\nSome other notes to\n\nThe captain goal is freeing children from being experimented on by a mad scientist. \n\nI wanted to do a Peter pan thing with the pirates but instead they send the children off to a dream world because it is the safest place where they'll never be found or harmed.\n\n\n", "Basically, due to time constraints regarding me pursuing other interests (like school) I've come to the conclusion that I no longer have the possibility to further develop my fantasy world and book. As such, I've decided to give them to anybody who is interested. Here's what I have:\n\n* \\~110k-ish words of written text (a book) about a wizard with black eyes in a fantasy world based on medieval Europe and whatnot (especially eastern Europe).\n* Several pages of detailed and realistic lore. \n* Concept art and maps. \n\nWhat I'm asking is for you to take care of them as use them as yours. No costs whatsoever. (I know it sounds like a scam but I swear to God it's not lol).", "OP, no one else will have the vision for your story you do, no matter how ornate your research and notes are, because no one else is you.\n\n10 minutes a day every day for a year without fail is the same amount of time as a weekend without sleep, plus you might find things in your other commitments that help you enhance your writing compared to someone who spends their entire time pouring over their work.", "> What I'm asking is for you to take care of them as use them as yours. No costs whatsoever. (I know it sounds like a scam but I swear to God it's not lol).\n\nYou say that like you think this is some golden opportunity that people won't believe is real. I hate to burst your bubble, but this is the kind of thing *you* would generally have to pay someone to do for you, not something that people would pay you for.", "Nah, I don't have enough time for my own story, let alone someone else's.", "I mean if you were as popular as the guy who wrote wheel of time and were friends with another author who also writes big long detailed books (Stormlight archive) you could probably do it. But an unfinished, unpublished book? Considering copyrights and that you could try to come back and say this person stole my idea? Nah, too much work. And if you have that much written already, why not just finish it yourself or leave it unfinished? I have several stories I never finished and it’s fine, I can either reuse the ideas or they can just be a story from that time in my life.", "Got an excerpt or a sample of the art?", "Every writer has books they've shelved. I have three or four, depending on how you count.  It's completely normal, OP.", "My world is based on the Chinese five elements. I have already have central mountains(earth), eastern plains(wood), northern sea(water) and western desert(fire). But I can't seem to figure out what type of terrain metal based southern region should be. Please help.", "Dry canyons, tundra or plateau where metal veins are visible on the surface, with holes leading to metal bearing caverns, you can also add lakes full of quicksilver. \nAnother idea, craters where a long time ago some meteors landed, leaving their metallic bodies now scattered over the terrain.", "Wastelands", "I'd personally associate it with the Pilbarra in Western Australia, since it's got the worlds largest iron ore reserves. More locally we have bauxite (aluminium ore) that's basically orange-brown gravel.\n\nSo maybe you could look into what ore deposits for different metals are like and just have a variety of them. It wouldn't necessarily be immediately apparent to readers though.", "Either molten metql volcano or intresting mineral formations/crystals", "In a world where gods are former humans turned immortal, Alex finds himself in a mysterious realm after his death. Tasked with guiding souls, a benevolent light presents him with choices: reincarnation or rebirth in another world. As Alex navigates this strange new reality, he seeks answers about his past, including his father's possible possession by a demon. With the promise of a reunion with someone special in another world, Alex's journey unfolds, revealing the complexities of human nature, justice, and the afterlifafterlife and also the fate of worlds beyond his imagining.\n\nDid you like this synopsis although I haven't completed the story tell me it is good I really want to know how others thinkthinks about this so tell me if possible if you want to readread Part-I I have released so just tell ", "The fantasy/sci fi book I am writing contains the premise of no humans, with all my characters being different intelligent species capable of thought and conversation. \n\nI originally started out with the idea they would all be able to transform into humans, so they would all share a language and be able to bond without the predator/prey theme I have included in my story interfering with that.\n\nWould it be better for me to tweak humans to fit the fantasy theme, or to simply have all my different species be capable of language anyway? Is there another solution to this problem?", "Writing a story with no human characters is challenging because readers want stories they can relate to. Not impossible", "Given that humans don't share a language, I'm not sure what's the point here.", "Hi everyone. I just finished my first draft of my 150 K word novel written in first person present tense. I’m moving onto draft two and considering changing it to past tense. I feel like I’m able to make the words flow better this way, I know it’s a huge project but I figured if I’m going to do it now is the time before I get into further drafts. \nDoes anyone have any tips to make this process easier, I’m finding my brain is naturally sticking to the present tense because of how long I’ve been writing in it so I’m struggling to reword things into first person past tense \nFor example, one of the things I’m struggling with is how to be descriptive, and how do you talk about things that could happen in the future while still writing in past tense.\nAny advice is helpful! ", "Reading some books in past tense will help get your brain in the right gear.  Writing about potential futures in past tense comes out like:\n\nVeronica wasn't sure what would happen. Maybe there would be a thunderstorm in the night. The house might flood. If she could stay at her sister's, then everything would be okay. The garden probably wouldn't weather the storm. But spring was just around the corner, so it was possible that she'd still get some flowers in the yard.", "Do an exercise where you write down some of your own real life experiences, your dreams for the future, and how you think and feel about them, as if you were telling it to someone else. It doesn't need to be long. It should get you into the flow of how to use past, present and future when telling your own story (which is what 1st person past is - just the character telling their story instead of you telling your own).", "Hi! I've done this before, so here's my advice from that...\n\nFirst, please make sure you have an original document saved that you won't touch. You very well may decide it's best in first person present. Secondly, if this is an unpolished first draft, it may just not be flowing because first drafts kinda suck. \n\nSo, my suggestions: Pick a chapter, whether it's your first one or one you really like from the middle, and polish it up in first present. Then, once it's polished, if you're still feeling like past tense, change that one chapter (again with keeping the present draft saved as its own file). \n\nNow you have something tangible to compare and contrast--a present version and a past version. Read it yourself, offer it up for critique, or just see if it makes such a difference to you that you want to change that large of a  document. \n\nWhatever you choose, good luck!\n\nPS: If you're publishing--- if you haven't already, now would be the time to dive into comp titles and see what they're doing. Not that you have to be the same, but it certainly wouldn't hurt to discover now that 75% of the books in the same category as yours are all first present (for ex).", "Thank you for this!!\nSo that’s what I’ve been doing. I just rewrote my first chapter (which was pretty solid) is past tense. \nI feel like it flows better this way, I’m just struggling to get out of the present tense mind set and second guessing my word choices. \nFor example, this sentence would still be past tense correct? Even though it uses “ing” verbs as well? “I wiped the sleep from my eyes and turned my attention towards my window, staring blankly outside.”\nThis is the kind of stuff I’m getting stuck on. I’m sure the further I get into it the easier it will be, but right now I’m struggling lol. But I really think I want to make the change", "Yup, that's absolutely past tense. Here's a quick -ing comment I found on r/writingadvice\n\n[https://www.reddit.com/r/writingadvice/comments/v8ify1/using\\_ing\\_words\\_when\\_writing\\_in\\_past\\_tense/](https://www.reddit.com/r/writingadvice/comments/v8ify1/using_ing_words_when_writing_in_past_tense/)\n\nAnd I definitely echo the comment here that said to read books in past tense and try to switch your brain a little bit. I definitely find rewriting in a different tense to be way harder than just writing in that tense to begin with, but it may help you to understand the flow and wordage a bit.", "Maybe thinking about it as if your pov character is telling the story. That might help your brain to think in past tense because this way the story is being told as if it has already happened.", "The best way is to start at the beginning with MC name. Mary decided to leave today.  Decided past tense to leave present tense. Today direct object.  However the verb with the noun is past tense.  And that is what you want.  \n\nWhat makes it easier to write is using their names. And past tense tends to flow naturally from that.  This is very simplified.  But it gets you started.", "I mean is it really hard to change \"is\" with \"was\" and \"do\" with \"did\"? No offense, I just wonder because it seems simple enough.", "There’s more to it than that. Rewording and rephrasing a lot of sentences that won’t be grammatically accurate when just switching words like that", "Names are hard, and I've found having a collection of names can be very useful. Do you know of any large name repositories? Even something like a digital phonebook for a modern city is a start. I've been looking around and I'm mostly finding shitty baby name websites and wikipedia articles. I'm particularly interested in ancient cultures going back \\~2000 years but with the amount of data pollution out there I'm struggling to find good sources.", "- searching list of common name in x country on wikipedia\n\n- searching name website\n\n- reading about mythology and named character after name in the mythology \n\n- random technical term. Mining town sitting on asteroid crater? Audrite. Name of type of space rock. It also fancy and short enough to be legitimate name. \n\n- learn new language (downside - might end up naming someone funny name if not familiar with naming system enough like frieren to german audience)", "Yes I am in fact doing all of those but I am searching for actual name repositories", "I use [https://www.behindthename.com/](https://www.behindthename.com/) a lot. Good ol' site I've been using since forever.", "I use the Old Germanic list on this site for fantasy inspiration often. [https://www.behindthename.com/names/usage/ancient-germanic](https://www.behindthename.com/names/usage/ancient-germanic)", "My imagination.", "The two sites I've used for naming are [Behind the Name](https://www.behindthename.com/) and [20,000 Names](https://www.20000-names.com/). Not sure that's what you're looking for, but it could help.", "Hot take: *do not use name generators.* Naming is as much of a storytelling opportunity as anything else, and should be done thoughtfully rather than at random.", "I disagree that one should *never* use a name generator. It's a useful tool and can be a great leaping-off point when you're starting to figure out names. Plus, some of us have more responsive imaginations! Often I'll generate some names and just seeing them will inspire me to think of my own unique name that fits intentionally into the story and world.\n\nI don't think grabbing a name from a generator with zero consideration is the best technique, but there's a way to thoughtfully use them in your writing process.", "That's well and good but the question is... *How?*\n\nA lot of people, myself included, struggle with names. I struggle even with name generators and sift through dozens of entries for each one I find, and try to change them or recombine them as often as I can. But for me it really helps to have some generated names in front of me first, because otherwise my mind blanks and I can only think of names from books that I recently read. So again, if not with name generators, how do you just pull names from the ether?", ">should be done thoughtfully rather than at random.\n\nOn the one hand yes, but on the other hand then you end up with shit like \"my name is Embyr Flame, I'm the world's greatest flame mage!\" Or someone called Vidkun the Treacherous who ends out betraying the MC. It's OK for some names to have deeper meaning or thought but honestly a LOT of the time this comes across to me as a bit cringe or just really obvious storytelling for children's books, oh you mean my main Character, Cho Zenwan is the chosen one? I can't believe it!\n\nSometimes random names with a theme around them are going to overall be better than trying to come up with some way of making every single name meaningful. In real life, names are very rarely super meaningful beyond \"my grandfathers name was X so we will call you X Jnr\"", "Yeah, hard agree - name generator names are super obvious too.\n\nLove that idea of names being a narrative tool.", "I never once mentioned a name generator... The Harkonnen name was found by Frank Herbert in the yellow pages. I've found several names I really like from various faculty directories such as Nemethy, Yacine, Sokal that I've made use of.\n\nI'm worried very worried about the reading comprehension here. Do people really not understand what a directory is? This comment has more upvotes than the question and it completely misinterprets what I wrote...", "There's another [comment](https://www.reddit.com/r/fantasywriters/comments/1bnhkfw/what_name_repos_do_you_use/kwjfsui/) in this thread with some good advice, so shout out to u/lackBrantScare. I would just generally add:\n\n* during research, keep track of specific terms that relate to whatever makes your setting special; they can inform place names.\n\n* when you devise a naming system for a cultural group, stay consistent. Use nicknames to cover for cool systems that might become unwieldly if they were used often.\n\n* remember that \"thoughtful\" naming does not imply \"overwrought.\" James Bond is one of the most famous names in all of fiction, and Fleming specifically mentions how useful it is for the spy to have an \"ordinary\" name. It's well-chosen because it fits the setting and rolls off the tongue. Fantasy names do not axiomatically need to be twelve syllables long; they just need to fit.", "Learn how names are constructed.\n\nFor example, Germanic names are generally built from the combination of two word elements, some of which can be found [here](https://en.wikipedia.org/wiki/Germanic_name).  You should, of course, make sure that the word elements you're choosing both exist in the same language (wiktionary can be a good resource for this).  For an example within the example, we can pick the element Os (Old English form of Aesir or God) and the element weald (Old English \"power\") to form Osweald (Modern \"Oswald\", \"power of god\").  Or if this is a little too on the nose of a name for a chosen one, maybe you use the element gar (Old English \"spear\") and name hm Osgar (Modern \"Oscar\", \"godspear\").\n\nThen for a surname, you either do a Patronym (ex. the son of Bradford would be Bradfordson or Bradfords, North Germanic names pretty much use this exclusively), a placename (ex. Osgar from Gladstone could be \"Osgar of Gladstone\" or \"Osgar Gladstone\" or \"Osger von Glattstein\"), or a job title (ex. Smith, Porter, Miller; this tends to be most common in English).\n\nWhile this example was specifically Germanic, the overall gist can be widely applied.  Personal names generally all follow this sort of pattern, where the name has meaning (or had meaning in an older form of the language), and though you might have to do some digging to find out how the surnames work, they're quite often patronyms, which means they're a modified version of someone's personal name, which you already know how to create.", "An easy one: there is a ghost character in a story I'm writing, I called him Aki from the greek word for \"shadow\"", "I would argue that \"Ember Flaym\" is the *exact opposite* of thoughtful character naming. Some of the most legendary character names in history are quite plain... but they're still *intentional*.", "One of the things people with poor reading comprehension often can't do is take criticism in context. If you ask how people figure out names on this sub, you'll get a bunch of name generator recommendations. In fact, the first answer to your post was exactly that. \n\nAlternative advice suggesting that you ignore that response is fair game in this discussion, assuming discussion is what you want.", "Ember Flame is also intentional. Santa Stark is intentional. Using a name generator is intentional. Intentional doesn't necessarily influence a good or bad outcome.\n\nOf course put thought into names to the extent you wish, it's your writing after all, but sometimes a name is just a name and nothing more - and that's ok.", "I often look through movie credits on IMDB, particularly animated ones, since they take so many people and typically have people from a wide range of cultures.", "My spam folder.", "In addition to the methods others have listed, whenever possible (and when my fakey fantasy language at least aesthetically resembles a real one), I will try to find a Romanized transcript in that language so I can get a feel for the \"sound.\" For example, [this book of Persian inscriptions](https://archive.org/details/GrammarOfTheOldPersianLanguage/page/n73/mode/2up?view=theater) is perfect for conlangs modeled after Achaemenid-era Old Persian (duh), Akkadian, Scythian, or any other Indo-Iranian language. Notice the lack of E and O vowels, for instance.\n\nIf no such resource exists, I will [compile names](https://en.wiktionary.org/wiki/Category:Thracian_given_names) from whatever language I want to model, swapping prefixes and suffixes or extrapolating some sounds onto other sounds in order to produce new names, but ones based on the texture of real-life ones. This process might or might not include plugging the list into a [Markov generator](https://donjon.bin.sh/name/markov.html).\n\nIf all else fails, I will do something which I call \"atomizing.\" I will brainstorm a list of words which could be associated with the character, place, or thing which I am naming; then, I choose the syllables one by one so that they do not form real words, but still manage to invoke them. For example, there's a demon in my setting named Shah-chthaumaphon. \"Shah\" is derived from *Šāh,* the Persian word for \"king,\" denoting nobility, grandiosity; the *chth-* suffix comes from \"chthonic,\" which means the underworld, and *-thauma-* comes from \"thaumaturge,\"  which means magic or a mage. The *-phon* suffix is nonsense, but sounded like the way an ancient name might be Hellenized through the ages, so to me it befit the name of an ageless and malevolent creature feared through eons.\n\nAnd yeah, given the correct literary background in a reader, all those things in my opinion are exactly what the name invokes when spoken aloud: it's poised, maybe even elegant, while also esoteric, and mystical, and dangerous. So it's a name which made its way into the story and has remained ever since.", "here are the ones i use:\n\n[https://nameberry.com/](https://nameberry.com/)\n\n[https://www.behindthename.com/names/list](https://www.behindthename.com/names/list)\n\n[https://www.fantasynamegenerators.com/](https://www.fantasynamegenerators.com/)", "What kind of names are you looking for? Real world names or fantasy-sounding names?\n\nMy favourite source for fantasy names is [https://www.fantasynamegenerators.com/](https://www.fantasynamegenerators.com/)", "There is an excellent site called behind the name, with pages for every sort of name, old English, Assyrian, medieval Russian, etc. I have found that modifying the names somewhat and using them together gives the names a natural, cohesive feel, as they use a lot of the same phonemes. Name generators are better for RPGs, in my opinion, as they make everyone be a barbarian named Hrottgar.", "One of the places in my story is based on Canaan in the Bronze Age so I just go to a random part of the Old Testament/Torah and look for interesting names. I also play with changing spellings/shuffling syllables from different names around.\n\n\nSo I would recommend finding the oldest literature from a real place that most resembles your setting, reading it, and going from there. It'll also give you details about daily life and other cool stuff that you can add to your world building.", "I always use 20,000 names.\n\nThey're divided into a bunch of categories, including location. My favourite part is it has a special category section with categories like \"colour names\", \"characteristic names\", \"dragon names\", \"fairy names\", etc, etc.\n\nInside the categories, names are divided by male, female, and unisex and they all include a little note about them.\n\n\n[20,000 Names](https://www.20000-names.com/)", "I stumbled across Nook of Names while searching for Mesopotamian names. I've liked everything I've seen on it so far.\n\n[https://namenookdotcom.wordpress.com/featured-lists/](https://namenookdotcom.wordpress.com/featured-lists/)\n\nI also use Behind the Name a lot.", "SCA also has a large collection of historical records containing names actually used by people from the medieval and Renaissance era.\n\nhttps://heraldry.sca.org/names.html", "The babyname site I used for some of my names had a brown color-scheme I think... Thinkbabynames?\n\nAnyway, since it's fantasy, https://donjon.bin.sh/name/markov.html When making up words, I could do something like feed it a hungarian newspaper article to get nonsense.  Be sure to check nonsense-words for meaning.", "I usually Google fantasy names starting with a letter, find one I like, or find one I kinda like and modify it.\n\n&#x200B;\n\nIf your looking for a specific culture, you can search for a name from that culture", "I use my gf/co author.\n\nI give her a description of the character's looks, personality and their place in the story; she comes up with fitting names and surnames.", "As someone who's neurodivergent and struggles with coming up with names, generators have been a life saver. \n\nHowever, I usually take a generated name I like and then alter it to be less obviously generated. I also never use them for main or important characters. I find they're usually better if you quickly need a name for a minor side character that may or may never show up again.\n\nOther's have also suggested Behind the Name, which is incredibly useful all around, especially if you're going for names based on other langauges.", "My novel takes place in the fictional equivalent of Israel, so I looked up Hebrew names.\n\nI do the same whenever a region is based on a real world location.", "Names are just words. If you’re looking for names of something more obscure than Greek or Latin like Akkadian then just look up the Akkadian translations and play with those.", "I get around the issue by mostly writing from the perspective of cultures that use more “title/description as name” schemes.\n- A knight once know for their swiftness in battle is named “Alacrity”.\n- Apowerful cryomancer who uses the nickname “Frosty”.\n- cavalry archer with an almost supernatural affinity with horses goes by the tittle “Zahhak”.\n- A shaman in the deep wilderness known simply as “Woodbloom”.", "This has the added benefit of saving *me* time as well by telling me early on to put down your story and not read it!", "You're getting downvoted, but if I picked up a book and a speedy knight was named \"Sir Alacrity,\" I would drop it instantaneously unless it was a very, very clever parody.", "And you best believe I can tell the difference!  So yeah, I'll read another page just in case I'm wrong, but the clock is ticking at that point, lol.", "use ai, especially if youre stuggling on choosing a name. just ask it to generate 20 or 30 names depending on your characters traits,personality,and abillities. and just choose out of the 30 which one is the most meaningful out of all of them.", "I never know what to say to this. On the one hand, farming out a learnable skill to AI is objectively *terrible* advice. On the other, the more people fail to learn their craft, the less competition I have in the slush pile.", "thats not what i meant, what i mean is everything from plot and background is created by myself its my own craft. however i only asked it on the names like i said and writing tips that i could use. i use ai as a name generator because by writing a prompt that i want then it could generate me some perfect names. i tried not using ai once and the names are all awkward and weird especially if youre character is not human.", "I've used [Nameberry](https://nameberry.com/userlists) a lot. It is a baby name site, but there's an option to view user-created lists. There are categories like historical, unusual and rare, pop culture, classic, international, nature, etc. There's also [Liber a Nomen](https://moonfaeriestudio.com/knowledge-base/bookofnames/). It has a nice selection of less common names based on different themes, and many have indications of what cultures they come from.", "So while writing I have my main character admit to his estranged brother having terminal disease. The scene is only dialog as the rest of the group are just listening in so they and the audience dont know what is killing him. He admits that he won't make it to the next year. Now after this it follows a person who has a personal grudge against the main character picking up things to kill him in a later story.\n\nI know I'm adding two ticking time bombs but it feels kind of cheap to me.", "Two ticking time bombs can theoretically work, but it sounds like you’re undermining your stakes here. If the mc is terminally ill and going to die anyway, why do we care if he’s murdered? I think to pull this off you need to have the main character have something to accomplish that should be doable within the year, and the murder would prevent that. In which case the terminal illness isn’t functioning as a time bomb, it’s more like a background motivation. The plot is the mc trying to accomplish something without getting murdered", "I am seeking feedback on my prologue and first chapter in the following areas: \n\n\\- How clear and consistent the main character and her love interests' personalities are (Can you relate to them? Are their motivations clear?) \n\n\\- Is the dual POV format easy to follow? Does it add or take away from the plot/ overall story? \n\n\\- Is the first chapter compelling? Does it hook you? \n\n\\- Based on the world building notes at the beginning of the Google doc (link below) - does the world building feel cohesive? (These notes are planned to be worked in organically in further chapters) \n\n\\- Does the narration/ internal dialogue favor or hurt the story? (In future chapters, when the love interests officially meet, I plan to use dialogue, but relied on narration for the first chapter and prologue) \n\nSynopsis of Prologue & Chapter 1: \n\nThe prologue and first chapter of my story is about a 17 year old girl named Cerubi, who is the daughter (and only living child) of a kind Riverlands Lord. Her mother (Hanubi) however, is from a more pompous region and seeks to use her daughter for political gain. She sabotages a betrothal which Cerubi thought would be her chance at \"true love.\" Cerubi is then betrothed to an older man in a region far from her beloved home and father. She struggles with this, because her dream is simply to fall in love, like a normal girl, without all the politics and her mother's interference. Before her wedding, though, she has jarring chance encounter with Prince Yan (her love interest). \n\nWhile Cerubi is the main character, we also follow Yan's thoughts and feelings throughout the story - both in regard to his own family, position, and Cerubi. \n\n&#x200B;\n\nLink to Google Doc (commenting available): \n\n[https://docs.google.com/document/d/1yqj-dWiZAVTInsgGre87R3uoJaGh2jAY6xfSx6PMd3Y/edit?usp=sharing](https://docs.google.com/document/d/1yqj-dWiZAVTInsgGre87R3uoJaGh2jAY6xfSx6PMd3Y/edit?usp=sharing)", "The Death Walkers are known for their wardrobes- no one seems to know why they never wore anything darker than a medium green shade that was still distinctly green. \n\nAriel pondered this as Jaerith's vehicle crossed the ancient gates.\n\nHe wore a bow from the time before on his side holstered.\n\nIt was long and sleek, and supposedly the arrows were all kept inside of it.\n\nto have such a thing marked him out as a man of means, as did. That is when she saw the glass-like top when he finally came close- \"Is that one of those bows that use the hot light?\n\nHe nodded, his expression the same stoic resolute somewhat soulless thing of all the the Death Wlakers. His eyes looked like the pupil had cracked and was leaking out its darkness into his iris- one day it would fully leak and his irises would be gone- and so would his heart. they went inside and out of the quickly approaching- it never really got all that warm in Sylvanvale, but winter was known for burying farmers alive. \n\nJaerith spoke quietly \"How have you been Ariel?\" His voice- Thornso had once scratched his claws on a chalkboard- if that sounded was crushed up like glass, and fed to a pack of starving wolves- the bits of sound left, if put together in the worst way possible- would sound like his voice- Death Walkers spoke for the dead, and so they did not get to keep a living voice unless they spoke for the ones who where already past. \n\nAriel knew from her lessons, that in the old country, they didn't have half as many DeathWalker in Etloria- here in Niwlia. The broken continent had such a fine barrier between this world and the next, that it was much like it was not there sometimes.\n\nMr. Haverston walked out of their father's office as Ariel Guided Jaerith to his room- when a Deathwalker used their gift for too long, they needed the touch of some sort of family or they would grow heart cold faster. Jaerith had them so he was only slightly heart cold- he was distant at times- meanwhile, Mr. Haverstone was gone. His eyes were pools that drank light. He was a body operating with less heart than an automaton. She should know- Bobby was quite warm kind and caring.", "Hello, OP.\n\nThis was difficult to get through. The writing is clunky and confusing with several grammatical mistakes. Perhaps English isn't your first language, but whether it is or isn't, you have to get a handle on how to write proper sentences before you try to write a book. \n\nI didn't really follow any of this. Even if I put aside the writing errors, it's like you're trying too hard to be lyrical. Just say what you mean first and foremost, and then you can dress it up later. I also know you know what your scene it, but you haven't conveyed that to the reader. We're not inside your head, we're relying on you to paint a clear picture for us. \n\nKeep writing, keep trying. You only get better when you don't give up. I'm sure you have a ton of creative ideas to put out there.", "for context- Ariel is supposed to be a young teenager- 12 or 13- 14 to 15  at the most.", "Bababooey", "Hello again!\n\nReaching out for more critique; specifically about my first and fifth chapter, where the inciting incident occurs! About 25k words in! It is heavily inspired by this wave of modern romantic fantasy books. It also does rely heavily on my main character's perspective, and her inner dialog is abundant (perhaps maybe too much so?)  Anything helps! Thanks!\n\n&#x200B;\n\nCHAPTER 1\n\nDeer? No, the oblong prints pressed into the wet earth are too slender for that of a deer. It’s got to be an elk, and one of decent size judging by the depth it left behind on its trek of survival through the forest. I feel my heart begin to pound in my chest in anticipation; even just half an elk this size could feed us for two months. The other half will fetch enough coin to buy a new cloak for Tobias, something he desperately needs.\n\nI can already imagine the hot, juicy fat melting in my mouth—we haven't had meat, of any kind, in days. The lack of protein has taken its toll on my muscles, and I can feel their already limited strength beginning to weaken further. \n\nThe smell of water seeping into soil permeates through the forest. \n\nIt has been raining non-stop this last week, but today the sun finally won its battle against the dark, ominous clouds and its rays cast beams of light over the elk prints. The clearly defined outline, unbothered by wind, water or insects, informs me that it must've passed by not too long ago.\n\nUnclasping the smooth, mahogany bow from my back and settling the weight into my arm, I follow the tracks that slope downwards to the right of the tree. The roaring of the swelling river grows louder, its harsh sound piercing my frigid, aching ears. I pick my steps carefully, so as not to accidentally reveal my location to my prey. I've danced this dance before, since I was just a child. Ma made sure to teach me how to hunt, how to keep us alive, since I was eight.\n\nQuickly, I thank A’tharya for the lack of wind that would most certainly doom us to another day of hunger. As quiet as a mouse, I approach a large, half-barren bush nestled on a sloped hill above the river. Using the bush as cover, I peek my small head over its jagged edges and survey the flowing white rapids of water below.\n\nIt seriously has to be my lucky day. The large elk has its dark russet head and enormous antlers dipped into the river, steadily drinking in the cool streaming water from a small bank next to a towering granite boulder.\n\nThe angle at which it stands is its death sentence, nicely exposing the large section of flesh behind its powerful front legs that houses its beating heart and air-filled lungs. Without hesitating, I quickly reach back and grab an arrow from the sling that hangs from my itchy back and nock it in one fluid motion. Before the elk has time to move its shaggy neck from the river, I side-step out from behind the cover of branches and pull the bowstring tight behind me with aching muscles. This is a once-in-a-season opportunity– I've got to hit my mark. Failure is simply not a luxury we can afford.\n\nInhale.\n\nExhale.\n\nInhale. The fresh scent of water beating against smoothed rock fills my nose as I close one eye, narrowing in on the section of the elk that will ensure the cease of its large, beating heart. \n\nExhale. Releasing the tension in the bowstring with a quick, sharp snap, I let the arrow do the rest.\n\nWith no wind to skew the carved wood, the arrow flies straight and true to its intended target. A soft thud, accompanied shortly by a long jarring, eerie wail tears at my eardrums as the large animal falls onto its heavy side with a surprisingly soft but loud thump. \n\nNearby brown finches cry frantically into the thankfully cloudless sky as they flee in evacuation. \n\nBy the short time it takes me to reach the bank where my hard earned prize awaits, the elk is already dead; the arrow jutting out of its broken flesh and reaching into the open sky, its large chest eerily still. \n\nGood. It must’ve been a swift death as I had planned. Having to deal the final blow to an animal, to put it out of its misery while it watches you with suffering and panic dominating its crazed eyes, is one of the few things that still gives me pause. Animals are innocent in this world, just trying to stay alive, and I can empathize with that. But we need food, and badly. Winter is waiting around the corner to happily claim our lives if we don't have enough ready to survive its cold cruelty. We must stock up for winter, or we will not be alive come spring. It’s that simple.\n\nTaking in the size of the animal, I realize there is no way in hell I'l be able to drag this hunk of meat through the obstacle-filled forest and back to the cabin alone. At least, not in my current, not-so-muscular, slightly malnourished state. Sighing, I pull the knife from the sheath, which is always attached to my upper right thigh, and get to work. People really don’t understand how long it takes to quarter an animal of this size. \n\nAfter three grueling hours of using the serrated hunter's knife to saw the massive elk into five large, bloody pieces, I finally finish. My back strains with reluctance as I rise to my feet. A strand of silver hair escapes from the tight braid I always keep secured behind my back, partially obstructing my vision as I walk to the river's edge. I resist the urge to push it away; my hands are still caked with fresh blood, and I don't think red hair is really my jam.    \n\nOnce I finally feel somewhat clean again after washing off in the toe-curling cold, murky water, I plop down with exhaustion next to the butchered carcass and turn my face to bask in the midday sun. I wish I could just… relax. For once. \n\nAfter what feels like too short of a time, I finally gather the energy to start the trip back to our cabin. I grab the meatiest hind quarter, and take one last look at the remaining four pieces I've assembled into a crimson pile. \n\n“Stay there,” I say sternly, pointing a finger at the bloodied chunks of meat like they are dogs ready to heed my command. I will be so pissed if I come back just to find they’ve been greedily dragged away by another predator. \n\n\\#\n\nThe tree-line opens into a small grassy clearing, and our cabins' light wooden frame comes into view, the lopsided door swung wide.\n\n Ma's raspy voice travels towards me as I approach, “There once was a young princess born in the great and vast kingdom that floats through the sky, forever chasing the golden sun. She was said to be blessed by A’tharya herself, with powers that rivaled the gods,” Ma says intently, hands waving in grand gesture. \n\nTobias sits below her rocking chair on the dirt floor, eyes wide with awe written on his freckled face as she continues. “However, she was lost far, far away from home. She did not remember who she was nor what she was capable of, her ancestry locked away inside her own mind. The key tossed to the ravenous bite of wind. Until one day-,”\n\nShe cuts her story short as she sees me cross the creaking threshold. \n\nAh. The story of the Kingdom of the Sun and its lost princess. Such a cliche story, one that Ma will spew from her wrinkled mouth for hours if you'll let her.\n\n“Welcome home Kura”, she greets warmly, a soft smile tugging at her sun-speckled face. \n\n“Are you filling the boy’s head with stories of the golden kingdom?” I ask, fully knowing all the stories from start to finish myself, “He starts school tomorrow. Better start teaching him something useful, like how to count to ten instead” I tease, placing my worn bow and sling of arrows onto the table in the middle of our one-roomed cabin.  \n\n“Hey! I’m no baby” He hollers back at me with conviction as I sit down next to him on the floor, “I can too count to ten!”\n\n\"Okay, hotshot, have at it,\" I retort, crossing my arms and leaning back against the cold wooden wall.\n\n I’m fully aware he’s been practicing, he's a pretty loud counter. His counting even woke me up from a rather peaceful nap yesterday. Tobias has always been loud, it's the one thing I can always count on him being. Even when we found him, soiled with filth in an alleyway, eating greedily at a half-eaten, moldy bread roll thrown out by some guest at the local inn. He took one look at us watching him and shouted ‘what you staring at!’ It took no convincing at all for Ma to agree, and on that rainy night we brought him home with us. \n\nHe sits up straight as he replies enthusiastically, “One, two, three, four, five, six... nine, ten!” Tobias hurtles the last two words out of his mouth as fast as humanly possible. “See?” He nods, “Easy peasy”. \n\nMa looks down at him. A tilt of disapproval pulls her mature, fair skin downwards into a loose frown. \n\n“Hmmm, close, but not quite. You’ve got to spend more time studying instead of listening to Ma’s stories, Toe-bias,” I emphasize his nickname, and stick my tongue out at him. Hey, I may be twenty-two years old, but I never said I was a mature twenty two years old. \n\nTobias leans back on his arms and thrusts one very dirty foot into my smug face, wiggling his little toes for emphasis, “Better watch out! If you don’t stop calling me that, I’ll have to show you what Toe-bias can really do!”\n\nHis toes are coated in dried mud, chunks of which fall to the floor soundlessly as he continues to wiggle them in my face. \n\nOh, he's asking for it.   \n\nThe only warning he gets is the quick smile that flashes across my face as I grab his soft calf and yank him towards me. He yelps and I do what any good older sister would do, I pin him down and start a tickle fight. When I say fight, I really mean me just tickling him like a mad man, and him screaming bloody murder.\n\n“STOP”, he cries in between relentless bursts of laughter, “Stop, please!” \n\nI would stop, but this is just too much fun.\n\nMa joins in, her raspy, deep laugh blending with his chorus of protests. \n\nBut that rasp quickly turns into a wheezy cough. I quickly let go of Tobias, who scrambles away for safety.\n\n “Ma do not have any more medicine” he wheezes, out of breath, “I was gonna give her some but there's none left”. \n\nShit. \n\nThat's not good, I need to get her more later today when I head into town. \n\n“Does not,” Esther quickly corrects his grammar, “And I am fine, really, it’s just a small cold.” \n\nEver since I can remember, Ma has always tried her best to conceal her suffering. Suffering that's because of me. I know it's not really my fault, what happened all those years ago, but I can't help but feel a smidge of guilt from time to time. \n\n “That sounds like more than just a mere cold,\" I say firmly, standing up, \"How is your leg feeling?”. \n\nThe rhythmic groan of wood bellows as she rocks back and forth in her worn wooden chair.   \n\n“Oh it’s fine,” She replies, staring me down as I inch closer to her, “quit your doting.” \n\nShe's definitely not fine, and I definitely won't quit my doting. \n\nWorry scrunches my dark brows together and I reach my hand out to feel her forehead, but she quickly smacks it away. My hand turns bright red and starts to sting viciously where she made contact. \n\nWell, she’s definitely stronger than she looks, that's for sure.\n\n“Enough of that, what did you catch today? I heard the cart squealing as you approached.” Her deep blue eyes meet mine, and she raises one blonde brow as to say don't you dare try again. She knows me all too well, I was just about to go for the second attempt, damned the consequences. \n\n“Something big,” I say, respecting her choice to change the subject. \n\n“A deer?”, my brother huffs, his small, tan frame still hunkered far away from me. He's very silly to believe such a small distance would protect him. \n\n“Bigger.”\n\n“A bear?!” \n\nMy laugh bellows, “I would be the one torn to pieces in that cart instead, if it were a bear.”\n\n“An elk”, Ma states matter-of-factly. \n\n“Yes, and a large bull at that,” I say, rubbing my still stinging hand. “I'll take most of it to the butcher after I portion out what we need to keep for winter.”\n\nA scowl distorts Ma's face. “That brute of a man always gives you half of what he should. He takes advantage of us.” \n\nMy hazel eyes meet hers, the midday sun filtering through the wooden walls of our shack casting a glow on her golden hair. I understand what she doesn’t want to voice out loud in front of Tobias. The butcher knows we're desperate and will take what we can get. Beggars can’t be choosers, as they say. And we are, unfortunately, beggars. To top it all off, the village also thinks I'm a freak. Apparently, being discovered in the forest out of seemingly nowhere, coupled with the silver hair atop my head, is enough to scare most people. They even go so far as to call me a witch on extra special occasions. It's ridiculous that the townsfolk use such unimportant characteristics to judge sanity, but part of me thinks it's just an excuse to be cruel to the poor, dirt coated girl who lives in the woods.\n\n“We should get a lot of coin for this kill. Plus we'll still get to eat a big hearty meal when I get back.” I say, making my way to the door.  \n\n“So be it.” Esther says at the same time Tobias starts chanting, “Meat for dinner, meat for dinner, meat for dinner!” It’s probably his second most favorite phrase. The number one spot being strongly held by, ‘five more minutes’ when I attempt to wake him up in the mornings. \n\n “I should be back in an hour and then I can get started on dinner”, I say turning my neck to look at them, “I love you both.”\n\n“To the moon and back,” Ma replies, but Tobias was too concentrated on using his fingers to count to ten, then to usher the same reply like he normally does.\n\n&#x200B;\n\nCHAPTER 5 \n\nSnow is approaching our valley. I can sense it deep in my bones, the late autumn air feels unusually cool and restless against my face.\n\nThis morning I snuck out of the cabin to hunt before Tobias could wake me up. He always wakes me up early on my birthday. Not sure what part of yelling 'Happy Birthday' at the very top of his lungs before the sun has a chance to rise would make me happy, but he still does it nonetheless.\n\nEven though I didn't sleep much last night, I feel oddly energized today as I dig a hole into the soft sediment by a towering, old tree with my already dirt-stained hands. Dirt packs itself into the space between my uneven nails and the skin of my fingertips as I continue to scoop out mounds of rocks and sludge. Only two more traps and I'll head back. Tobias likely has a full day planned already and I'd hate to disappoint him, even if it is *my* birthday. \n\nThe animals are oddly quiet this morning, as if they too can sense the approaching danger of coming winter. \n\nThe funny thing is, we don't even know if today is actually my birthday. This is just the day Ma found me bundled up in a brown blanket on a pile of fallen leaves, crying like a banshee. It could be my birthday, or could just be a different, random day. I'll never know if it is or isn't, but I guess it doesn't matter in the end. \n\nI use thin twigs and leaves next to me to disguise the knee-deep hole. Satisfied with my craftsmanship, I rise quickly from the hard, frigid earth, and start my search for the next, and hopefully rabbit catching, spot.\n\nA couple days ago, Ma said she had a birthday gift for me. She's only ever given me one gift, my trusty mahogany bow, in all my years. So I was surprised when she said she had another to give. \n\nExcitement puts a little pep in my step, and I hurry along.\n\nOnce I find another good place to dig next to a long, fallen oak , I crouch to repeat the same motions as before. One more after this, and I'll be done.\n\nA twig snaps behind me. \n\nThe abrupt sound reverberates through the trees.\n\nMy body springs up. The bow resting on my back becomes firm within my grasp by the time it would take a honeybee to land on an outreached blossom. \n\nWhen I turn around, there's nothing there, just the usual view of trees, bushes, and rocks. \n\nWhat was that?\n\nIt could be a deer, maybe. Hopefully. But, from the slow crunch, the movement seemed intentional. Like something or someone has been stalking me, not wanting to be heard. The stillness of the air becomes eery, and anticipation settles around me like a wet blanket. \n\n*Run*\n\n A deep voice says urgently in my head. \n\nWell, that’s new. \n\nGoosebumps crawl up my back, and the heat of adrenaline creeps onto my face making my heart pump faster. I've got two options, run like the voice I am choosing to ignore at the moment suggested, or fight. \n\nIf it's a person, I can outrun them. If it's a predator I don't see yet, I am royally screwed. \n\nSo that leaves fight, sorry voice. \n\nAs quiet as a mouse, I quickly nock an arrow into my awaiting bow; ready for whatever may come out from behind the tree. Whether it be man, or monster. \n\nThe following seconds seem too slow into long, grueling hours, as if time itself decided to stand up and leisurely stretch its legs. \n\nA sharp thunder-clap of agony slams into the back of my head. The sudden intensity of the headache threatens to split my skull open into two bloody halves. The jagged rocks and  pointed sticks of the forest floor rip at the tender skin of my knees as I fall to them, but even through the pain, I refuse to let the bow drop from my hands. \n\nThe roar of the river over a mile away becomes a thunderous, deafening sound. The tickling scuttle of squirrels chasing each other, and the softest swish of leaves cutting through air on their descent from the heavy limbs above rush into my ears. My focus begins to blur, the outlines of the trees before me blending into a wall of brown and green. Then, in an instant, everything snaps back into place. \n\nFar away rocks of speckled granite go from blurry blobs of gray to crystal clear structures. Even the small black widow, with its distinguished red belly, building a web into a small crevice, becomes visible. The hues of the forest become blindingly bright and more vibrant. Colors I do not have names for come into view, lighting up the world before me. \n\nWhat is happening? \n\nIt feels as if I have never truly heard or seen anything before. As if I am just a babe surfacing from their mother's womb, experiencing the overwhelming intensity of life for the very first time. Was the world really so gray, so dull before this moment? \n\nAm I dead?\n\nLifting my hands to my head, I give it a squeeze, hoping to keep my brain from escaping its confines, like a baby bird teetering on the edge of its nest.\n\n*You will be fine hatchling, but you must breathe.* \n\n I rapidly exhale. \n\nThe heat from my lungs fills the air with condensation before my kneeled frame. Another second passes, and my headache begins to subside, but does not entirely leave me with the relief I crave.\n\nMy eyes snap towards the steady hushed pattern of air coming from behind a stout chestnut tree that I wouldn’t hear before the onslaught of pain.  \n\nBreathing. \n\nI can hear someone *breathing* behind that tree. \n\nShoving back the thoughts circling my brain of how, why, and back to how this is all happening, I return my attention to the threat ahead. \n\nIt could be Aiden, or one of the other townsfolk. But most likely Aiden, as he's the only one with a real grudge to hold. Steadying myself with one leg, I send an arrow into the thick trunk housing the cause of my growing anxiety, with a thud so loud that it causes my head to start pounding again. I'll need to invest into some quality ear-muffs after all this is over. \n\n\"I know you're behind that tree, come out and face me like a man for once in your life\", I shout, standing up and preparing another arrow for flight. \n\nThe strikingly handsome strangler that steps out from behind the wood is in-fact, not Aiden. \n\nDefinitely not Aiden.\n\nFrom the sheer size of the man, the grace of which he stalks closer to me is anything but natural. His white, shoulder-length hair is carelessly swept back, revealing deep-tan face housing shockingly bright amber eyes, a color that would make even the most glorious of sunsets jealous. A smirk plays upon his full lips, causing the corners of his eyes to crease slightly, as if I said something funny. Odd, golden armor clings to his muscular yet lithe frame, shimmering in the gentle sunlight filtering through the clouds.\n\nI don't wait to ask questions or to see what will happen next. I fire another arrow at the fast approaching stranger. \n\nBut the arrow it–it– stops mid-air. \n\nSimply… stops. \n\nEven with my rather spontaneous upgrade in vision, I can barely make out the moving current of air wrapping around the arrow, keeping it suspended and halting its progression. \n\nThe stranger's smirk turns into a full blown smile, his white canines on full display. \n\nWhat the hell do I do now? \n\nThe bow’s my main line of defense, and it was useless. I still have my knife, but what good would that do against a foe such as this? \n\nA white sling of golden arrows jut out from behind his massive back, and a wide, forearm length dagger is sheathed in a strap along his chest. \n\nMy feet become heavy, like someone set anvils atop them. Dread lodges itself into my throat like a tick burrowing under exposed skin. \n\nMy head pounds. \n\nThe arrow, still hovering in the air, rotates. \n\nSlowly it spins until I can only see the point of the arrow. With a two-fingered flick from the smiling man, the arrow cuts through the air towards me, much faster than before. There is no chance in hell I dodge it. \n\nWell, this is how I die. \n\nTobias is still too young to hunt, they will never make it through winter. Ma will be stuck wondering what tragedy became of me.\n\n My eyes lock with the stranger, the last person to see me alive. His smile is stretched wide on his golden face as he whispers something beneath his breath in a language I do not understand, nor have ever heard. \n\nThe arrow curves at the last second.\n\nIt whizzes past my face, blowing stands of silver hair off my cheek. Out of the corner of my eye, I see blood swell and form a droplet before the sting of pain has a chance to register in my overwhelmed brain. \n\nI need to do s*omething*, anything but just stand here.  \n\nSnapping out of it, I take a lesson from the voice in my head and book it in the opposite direction back towards our cabin. \n\nI am not helpless, I can outrun this man.\n\nThe ground blurs beneath me as I propel myself forward with urgency, arms pumping vigorously at my sides. My breath becomes rapid and shallow as my brain demands more oxygen. Not only can I hear and see better than before, but my body feels like a spring that has been pushed to its breaking point and then abruptly released. \n\nA low, sultry chuckle sounds behind me as I hear the man give chase. With the familiarity of the forest ingrained in my mind and my legs moving swifter than ever before, hope ignites within me. \n\nI can do this. I just need to reach the village. Surely someone will help me there. \n\nFootsteps begin to fall behind my quicker ones as my pursuer loses purchase. It can't be much farther. \n\n*Faster*  \n\nA thin isolated branch from a nearby tree smacks into my chest as I rush by, but the hurt is nothing compared to before. I pray for the wind to quicken my pace.\n\nA'tharya, I am begging you to let me return to them. \n\nLet me hear his laugh, let me hear her stories, one last time. I will do anything you ask of me. \n\nAnything. \n\nA flurry of turquoise, and auburn flashes above me as the strange golden man drops from the sky like a shooting star– right in front of me. There is no time to react before an object hurdles its way towards my head, sending me lurching backwards. I fight for consciousness, claw at the darkness swarming my mind with claws of conviction, claws of desperation. But alas, it is not enough. The last thing I think, before I am completely ripped away from reality is this:\n\nI will never pray to a deaf god again.  \n\n&#x200B;\n\n&#x200B;", "Hi all. This is the introductory scene for Ari. It's short and bloody.\n\nQuestions I'm most concerned with:\n\n1. Did the scene hook you?\n2. Is the magic system interesting?\n3. Did anything break immersion?\n4. Too fast? Too slow? Just right?\n\nNo prose rewrites, please.\n\nHappy reading!\n\n[Full scene](https://docs.google.com/document/d/17Oc8XkMoYAMloynNs_zGa-MWvqsu38NILJZ3ODjh-8I/edit?usp=sharing)\n\nOpening page:\n\n>Ari ambled along the trail, ignoring the man who tailed her.   \n>  \n>He thought himself so clever, darting among the brush at a distance, shrouded in blackness. Ari knew the type: vile, bloated with past success. He'd strike further from the village, where few ears could listen.  \n>  \n>They wanted the same thing.  \n>  \n>When had an assassin last followed her? Long enough for Ari to have lost her reputation, it seemed. An agent of the Talon? He'd been bolder in the past than the Covenant guildmasters. Slower to learn a lesson.  \n>  \n>Dust. Ari sifted through her pockets, collecting it. The particulates felt soothing, familiar between her fingers. Smoother than sand, these ones. The trader, contrary to his appearance, had been honest about the bloodstone's purity. She'd remember that.  \n>  \n>Properly, Ari should be wearing gloves. But she'd given up on propriety long ago, instead letting the bloodstone—among others—leave streaks of red and blue, gold and silver, like a painter whose easel had smudged. Now it was too late—years of exposure had let the colours spread throughout her skin, a permanent full-body tattoo.  \n>  \n>Which made her easy to identify.  \n>  \n>Ari veered off the dirt at a natural cleft in the trees. It was as good a spot as any to set up camp for the night, and Heatherington lay some twenty minutes away, well out of earshot. Farmers' fields ran along the south side of the village, not to the north, the forest far too dense to be worth clearing. She'd not seen another soul traveling, either.  \n>  \n>A faint rustling, off in the distance. To many, it would be indistinct from the noise of game, of bats, of large cats who stalked the night, stealing chickens and cows from the south. No doubt the assassin thought the same to be true of Ari. A fatal mistake.\n\n&#x200B;", "Hey, just had a quick read and here's my best attempt at answering the questions.\n\n1. I think the character voice hooked me more than the actual scene itself. I liked more of the anticipation of the conflict and her musings that mostly felt natural rather then the conflict itself.\n\n\n2. I am not the most magic system inclined so may not be the person to ask but I liked it okay. I think tying what seems like powers to different stones to be interesting enough and the potential for finding out what the seven stones are. The description of her consuming (?) the bloodstone was cool to me especially the emotive stuff, maybe cooler than the power she used that felt a little confusingly described to me. Found it hard to visualise the actual attack thing.\n\n\n3. On the whole I found it fairly immersive, especially the character voice and sprinkling of world details but a couple moments took me out a little:\n- \"A fatal mistake\" felt a bit weird in that although I knew it was an expression of her confidence in her abilities, it felt like almost an authorial intrusion and not the character speaking? \n- A couple references explaining the magic a bit too much like: \"Dust had strange effects beyond enhancing her eyes and ears\" and \"that rage, along with other emotions the dust provided\"\n- Maybe I was missing something and/or it's revealed later but I felt more confused than curious as to why the assassin was rooting through her things and why he'd take her pack. I assume she's incorrectly assumed him as an assassin but also felt confused as to why she felt he was being clever when it wasn't obvious what he'd done to make her feel that way.\n\n\n4. I liked the slowness of the opening sections but that is more my taste. Slower character stuff than action. Yet I felt like I wanted more from the power use/fight or maybe for it to be more of a fight than just an overwhelming force without any resistance. Maybe even just a moment where the assassin sees her coming before being obliterated to show she didn't handle it perfectly idk. Other than that felt like the pacing was decent.\n\nHope that this helps and lemme know if you've got more questions. Happy writing and good luck!", "Thank you for the feedback. I'll do what I can to address your points of confusion!", "So, I’m currently working on outlining my story, and I’m worried it may be too similar to the manga Berserk.  My story is a dark fantasy about two teenage boys, Brandt and Thane, who go on a revenge quest against a tyrannical king.  However, at the end of the first act, Brandt (the primary MC) kills the king, seemingly ending this revenge plot, and Thane betrays Brandt, killing many of their companions and turning the king’s plot on him to essentially become a demigod.  Thane then goes on a quest to achieve godhood with his goal being to destroy the world and create a new one at the cost of all currently living beings, while Brandt must stop him.\n\nI’ve never actually read Berserk past the first few chapters, but I was watching a video that referenced some events in the story relating to Griffith and the eclipse and they sounded pretty similar.  I was however inspired by dark souls and Elden Ring, which I know take a lot of inspiration from Berserk.\n\nAnyways, I know people often say that it doesn’t matter how similar your story is to another, but I’m just a little worried because I know how revered Berserk is.  Should I change anything?  Would it be good for me to read Berserk to make sure they aren’t the same, or would that increase the likelihood of me writing something similar?  Any input or ways to keep my story original would be great!", "Don't worry too much about the similarities if it is unintentional. But you should read Berserk so at the least you can note when you are are being too similar if it bothers you.", "Wouldn't worry about copying a book you've never read. Just write what you want to.", "You’ll be fine but one thing I’d recommend is not sharing unique names online as people will steal those", "Meh. The writer of Bezerk was worried about similarities with his work and Evil Dead 2.\n\nJust roll with it. So long as it isn't outright plagiarism it doesn't matter.", "If so, how and why? Do you write down your notes as if they are in a POV of someone who is in universe/book or from your own perspective/author postion. For instance, as your typing your story, you have the quick scene that could fit but doesn't quite match with what your currently writing.\n\nSo, do you put it off as a side note or write it in the perspective of a character explaining what's going on?\n\nWhat are your honest thoughts on writing down notes for your fantasy stories? Tolkien style 😁.\n\nEveryone's answers is appreciated here!\n\nThank you!", "Of course!\n\nIt sounds like you are more of a \"gardener\", working out the story as you write it. Well, some of the things in the garden will need to be potted and set to the side before you find a place to plant them—i.e., making notes.\n\nAs for me, I am an architect. Most of the story is planned out in advance, with extensive notes—hundreds of pages, bullet-pointed and categorized chronologically under event headings. (These are distinct from \"worldbuilding\" notes, which are an entirely different matter and get their own documents. I'm just talking story, character, and wording here.) The basic notes are not written in character. If, however, I have an idea not only for something I want to write later, but for exactly how I want to write it (whether dialogue or narration), then of course I write it out that way. At a ballpark estimate, I'd guess that's probably one-fifth of my notes, maybe less.", "Ah I see.\n\n\nIronically, I actually do gardening with my family so yeah. Makes sense too!", "The [*architect* and *gardener* language](https://www.youtube.com/watch?v=qkCDevjQISw) comes from George R. R. Martin.\n\nOthers say *plotter* and *pantser* (one who *flies by the seat of his pants*); I don't like these terms as much, though, because *pantser* implies someone who doesn't do any thinking out, whereas a *gardener* thinks things out, but also lets things go where they go.", "Makes more sense now. I never knew it came from the writer of GOT to be honest.", "I have my works in progress, then kinda an encyclopedia for my own use. Not in POV... written like a 'handy guide to'. Hell, if I ever get super famous, maybe someone will publish that too.", "I see! Thank you for your points!", "I do. I have a general plot before I begin writing, but I consider myself a discover or explorer rather than a pantser or plotter. As a result things that I hadn't expected come up or I get ideas that could take me off track. In order to keep going I'll stop make a quick note and thing continue. \n\nSince I do have a plot and general outline most of my notes are done during that period so I can capture that inspiration or idea for later.", "Scrivener makes taking and organizing notes pretty quick and simple, and it's essential IMO if you have books that are hundreds or even thousands of pages long (as I do).", "I picked up Scrivener years ago and still use it extensively! From the organization capabilities to the finished formatting, I love it", "I draw many concept art and make a lot of short note before and while I write and draw my story. So I don’t forget what is what, where is where and who the character are. Include detail that probably never made it into main story. Wool peeling festival probably never gonna get screen time, but I note it down in sheep town sketch.\n\nFor quick scene I doodle quick scene that randomly pop up in my head all the time. I have more quick scene doodle than number of page of first chapter storyboard I finished right now. If I have idea and it match quick scene I can just take the doodle and use it\n\nAlso bonus point if one day I become famous author or got anime adaptation I can made concept art compilation and say here is the good stuff that not get enough screen time in the story", "Do I write down 'notes' while crafting a story? Absolutely. Always. Everywhere.\n\nUsually it's while I'm writing, so it either gets imbedded mid-stream (I usually mark such notes with a searchable pattern like \\***) or I'll add it at the bottom. For longer pieces I keep a notes text file. \n\nI'm also a big fan of 3x5 cards for physically scribbling ideas, notes & concepts.   \nLike... with a physical writing thingy.", "Same here. I inspired my notes or how I write them anyway like Tolkien's letters.", "Here to say, yes.  My stories are just a whole series of notes (often written in character voice, but also not) until I pull the trigger and decide I have enough to start writing the story.", "Yep, have a separate document to keep names, dates, locations, money amounts, character personality, all that stuff. I reference it heavily if I don't write for a month or two.", "Word has a footnote feature which I like to use. When I'm writing, I'll often think of bits of lore that are relevant to a section and then just include it in a footnote on that page. I tend to write across devices and I tend to lose paper notes, so it's convenient for me to just have it included in the draft.", "I'm not sure if this is what you mean, but I have a subsection for \"snippets\" where I write bits of scenes that come to me in a burst of inspiration, with some guidance notes to explain where I think this should go. Then later when I get to an appropriate part, I try to fit the snippet into the main text wholesale. It doesn't always work out so neatly, but I find that it's better to write these things down when they come up rather than ignore them and lose them, or go all in trying to figure out exactly how to make them fit right then and there.", "I do.\n\nI usually have a section at the end of the document just for notes as I'm writing the story.  Once I'm done with the story, I cut the notes out and put it in its own document.", "For note-taking during a writing session: I’ve got a whole notes folder in my Scrivener project that has notes all separated out into separate categories (like plot, world building, characters, etc.). \n\nFor note-taking outside of a writing session: I have literally hundreds of notes in my notes app on my phone that are just as meticulously organized.", "Oh, of course! My ADD makes my brain flit from First Day of School™️, to Wedding Ending That Might Not Be an Ending™️, and then back to the middle for Werewolf Training™️. I’m still trying to write my first chapter, and I had to write out the first draft for the catty, passive-aggressive interaction between two characters near the end of the third part or else I would’ve forgotten the dialogue. It can get pretty annoying when I can’t just focus on the first scene, but I have a great master document to let me know what my thoughts were at the time.", "Do any of you struggle with having too many ideas? I have a slice of life outline I keep rewriting with different shots of flavor. I'm having trouble committing to more than 30, 000 words. I have another 65, 000 word story I'm not happy with enough to publish. What do you do to commit to and finish a novel?", "I've struggled with switching projects a lot. I'll share a quote from a visual novel game that helped me. \n\n>It's also really important to understand the scope of what you're trying to do. If you jump right into a huge project and you're still amateur, you'll never get it done. \r\nSo if we're talking about writing, a novel might be too much at first. Why not try some short stories?\rThe great thing about short stories is that you can focus on just one thing that you want to do right. \rThat goes for small projects in general - you can really focus on one or two things.\rIt's such a good learning experience and stepping stone. \r\n\nWriting short stories rather than full novels can get ideas out in smaller bursts and do \"just one thing you want to do right.\" Then, build back up to longer stories when you have a stronger foundation and more experience. \n\n>That's my writing advice for today. Thanks for listening.", "A lot of people know it, a lot of people agree with it. But actually trying not to work on that giant dream project and instead on smaller projects to build my skillset is...really hard! All that temptation all the time aghrrr!", "This. Also, writing short stories doesn't hinder you from writing a novel in the same world. It can even help you flesh out your important characters if you write a 5 to 10k word long short story for each one that explains their background, general motivations, etc. It makes the world you set your novel in more vivid and believable.", "Yes, absolutely 100% *yes*. I used to struggle with this a lot, where I felt like I had all these ideas but wasn't sure which one I should commit my full time to. The solution I found was to \"properly\" outline each idea that kept pestering the back of my mind. I would only follow through on actually drafting if I made it all the way through my initial outline process, which isn't like a chapter by chapter thing but more of a comprehensive \"publishing and story plan\" if nothing else. By doing this, I knew way earlier if a story wasn't really \"ready\" for me to set as a long-term project quite yet. Usually before writing anything beyond a sample chapter or two. \n\n***I've saved so. much. time. doing this.***\n\nI've posted my outline process in this sub before, so I can just paste it right here in case anyone is interested:   \nMy outline process is to start with a list of basic questions:\n\n* What is the genre?\n* Sub genre(s)?\n* ideal word count?\n* Target reader (as in age and similar books)?\n* Working title?\n* How many POVs?\n* First or Third Person?\n* Why do I want to start this project?\n* What do I think people will love about this book?\n* What's the biggest challenge I'm facing for this book right now?\n\nObviously, most of these questions will change over time and aren't intended to be set in stone, but rather they're an exercise for me to make sure I'm ready for the first real stage of outlining.\n\nNext, I write a version of the query I would pitch to agents and editors. Basically a summary like on the back cover of a novel. I write a few versions of this until I feel pretty good about where it lands (and a lot of the story structure of my novel and its world building start coming together here). I also analyze this summary for basic touchstones like if the setting is original and immersive, are the main characters relatable, and what's really the point and overall message, etc.\n\nNext, I ask myself what the major dramatic question is and what the abstract major dramatic question is. Then I determine if the answers to both are yes/no. So for example, in Star Wars this would be like \"Will Luke join the rebellion and save the princess?\" (Yes). and abstract would be \"Will Luke trust the Force and embrace the legacy of his father?\" (Yes)\n\nFrom here I also like to get more specific with character goals and why the protagonists and antagonists can't achieve them at first. Again, lots of world building will sort of organically develop at this point. This is key because your world starts to be informed authentically by your story, not the other way around and this is the major difference between a fantasy world that feels hollow and one that feels lived in and vivid.\n\nMy last step before actually drafting the first chapter is setting up a basic story outline. What's the opening/status quo? What's the inciting incident? What is the point of no return? What is the climax? What is the resolution? A lot of this will need to change as I write the novel, of course, but it's a flexible starting point. I never do this by chapter, I write it out like a synopsis you send to an agent (different from a query/summary). There are lots of helpful videos on YouTube for how to do this.\n\nThen I start writing. Over time, I'll likely start breaking the early chapters down just to sort of see how everything is pacing and if I need to make structure changes. But I can't tell you how much easier it is for me to draft an entire book this way without restarting and revising over and over again because I get \"sick\" of what I was working on. Especially when I know I want to keep the word count a certain way, so if I'm already at 50k words for a 100k novel and I haven't hit the point of no return yet, clearly something is wrong that I need to fix.", "Once I hit 10k words I thought holy cow, this is it. This isn't just a novella. This is a novel. \n\n\nWow when that thought came I kept going. \nI have a story to tell and I won't stop until I'm done. Sure I've hit writer's blocks here and there, but mostly because I was making restrictions on myself. I even had a snag where I didn't write for a whole year. Guess my brain just needed to percolate 🤷 \nBut I never lost my joy in the piece. Now when I get stuck I re-read Act I and remind myself that this is good. This is worth it. \n\n\nIf you're feeling apathetic towards writing, maybe it's the piece and not the process. ", "Now we know how you hit 10k.", "Right. 🤷", "I also struggle with too many ideas. When I get going on a project with a semi-clear outline, I usually think of another story. I've learnt not to cram them all into the book I'm writing, instead I save them in an idea-folder, for later. Sometimes I switch, because I get bored with one project, maybe you could try switching back and forth? Usually after a while I start thinking about the other story and wanna keep going.   \nBut like [Exact\\_Tiger\\_7420](https://www.reddit.com/user/Exact_Tiger_7420/) wrote, it's a good start to make short stories. It gives practice on how to structure the book and cut the overflow. Many books have started as short stories :) Good luck to you!", "I have 3-5 WIPs at any given time, with one novel complete at 120k words. The first one was easy to write because I had never given myself license to flex that creative muscle before. I was also tandem writing with my best friend as she wrote her own book, and we had a lot of fun trading chapters and giving feedback. I'd recommend finding a writer's group for a similar dynamic if you're comfortable sharing your work. \n\nNow that I'm working on a few other pieces it's slowed down a lot, but I write every day even if I don't particularly feel like it. I won't know what does or doesn't work for my stories until I get something onto the page. I put on Brandon Sanderson's lectures or podcast and let his advice give me a boost of inspiration, or I scroll through subs like this or the Absolute Write blogs, and seeing other people continuously trying makes me want to keep trying, too.", "Looking for critique on my portrayal of vampires, and how I write action sequences. Also looking for comments on characterization.\n\nWarning for vampire-typical violence and murder.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nIt's dusk when I stir from my dreamless torpor.   \n\n\nI miss sleeping. The little death and oblivion I endure every day is restful, but hollow. I do not dream or reflect on the previous night. It's silence and absence of thought. It's death in its purest form, the death of the atheist and the materialist. I dread it, but it's better than the day-drunken state I would be in, even in the darkness of my abandoned factory.   \n\n\nMy home used to be a factory of some sort. It's thick-walled, brick through and through, bearing a ceiling crosshatched with thick steel struts. Catwalks ring the cavernous space. I blocked off the windows with wood and scrap metal and broken slabs of concrete to preserve the darkness within, but I can still see every crack and spiderweb and rust stain in this place. The darkness makes no real difference to my eyes.  \n\n\nThe best part about it is that it is dry, sturdy, and I have it all to myself. No homeless person or cracked out wannabe gangster would dare to come here. They know, just like how the spiders and wasps and flies know, that they're not welcome here. Vermin recognizes me as unnatural, and take pains to avoid me. Then again, I'm not that different from them.   \n\n\nWorse, in fact.  \n\n\nI run my fingers over the few large things I keep here- a mirror, big enough to encompass all of my body. A wardrobe of clothing in case my old ones are destroyed. A safe full of money and other items I may need. A large couch I spend my torpor on. Not much, and nothing I can't afford to lose. I keep a backpack ready to go, and there's a few brooms scattered around the factory to sweep. I prefer a clean living space, and chores are fast and easy for me.   \n\n\nI haven't had to move in five years now, but I am never comfortable or at ease. The good times never last, and someone always comes to break up the party. It's only a matter of waiting. And I am very good at waiting.  \n\n\nThe perks of being 72 years old in the vampire lifestyle, I suppose.   \n\n\nI don't think I'm that old though. I was turned at 17, and I still think I'm 17 beneath the skin. 89 years old… that would make me an elderly man now, but I'm still young in my thoughts, and in my body. I've learned patience through practice, but not maturity. I'll never really grow up, I don't think. But then, that might all be my own self-deception.  \n\n\nMost of my kind die young. I'm one of the rare exceptions. I learned fast how to stay out of the elder's way, how to find good lairs, how to hunt discreetly and without stepping on the territory of a coven strong enough to kill me and determined enough to find me. I lost a few limbs doing it, and got my head crushed to stony powder more than once, but I always crawled back together and found enough blood to restore the occasional incinerated limb.   \n\n\nI should have a coven. But I never found a human I wanted to perform Cumbanam on, and I never found a predator like myself, one who was lonely and unbound and eager for kinship. The solo act became engrained habit in my first years, and I never thought to change it.   \n\n\nAll of these musings ran through my head in approximately a 50th of a second. And I already grew bored of thinking. I yawned, more out of instinct than need, and put my body through its paces. I leapt from wall to wall, crossing a good 85 feet in fractions of a second. I cartwheeled around, and leapt to the ceiling struts to run through a good 500 pull-ups in about 2 seconds. I stretched my limbs and joints to their unnatural extremes, until I heard my borderline metallic flesh straining from the stress. I did handstands and bench-pressed ten-ton lumps of rusted machinery without any real sense of weight to the action. After about 5 minutes and 34 seconds of this, I felt confident my body had not lost any of its edge in the hours since my last hunt. Not that I could ever lose my edge.  \n\n\nIf I really desired, I could have kept my torpor going for another month before feeding. Older vampires like myself gained control of our thirst, our Sete, and could live off of only 6 to 8 feedings a year. But I had never learned to keep my Sete under control to that degree, and I wasn't interested in delaying the soothing of my charred esophagus. I wanted blood, I wanted it now, and unless I got some soon I was going to tear at my throat until I got some.   \n\n\nSo I slipped out a high window in what had once been an office space, and dropped the 64 feet to the ground below. I was silent, of course. The 11-foot fence and its barbed wire was easily vaulted, and I took off along the streets of this little industrial zone. The night shift was just starting, and the pulse of human hearts echoed in my ears like a choir of drumming angels. I scaled buildings and leapt from rooftop to rooftop, occasionally glancing at the bay. It was not raining tonight, but it was clammy and foggy. The air reeked of smoke and humanity, sewage and garbage, gasoline and rubber. I heard snippets of conversation as I reached the warehouses and docks, the strike of matches and lighters. I smelled blood, oil, cigarettes and lunches.   \n\n\nI was so thirsty. Venom pooled and gathered in my mouth, and I gulped it down. It failed to stop the red-hot burning in my throat, the searing pain like choking down red hot nails dipped in pepper. I wanted to dive down into the dockside workers and slaughter every living thing there, and douse myself in red. I wanted to drink the ships dry of their crews. And I leaned over the edge of the warehouse before I realized my almost fatal error and pulled myself back. I hadn't lived this long by losing control. No, I had to exercise restraint and patience- delayed satisfaction. I snarled, and bolted to the darker and more unlit parts of the docks.   \n\n\nThe ships here were less legitimate, more prone to being smuggler's vessels. Prohibition had been my favored era for dockside hunting, but even now people still wanted goods they could not legally obtain. I perused the ships, mentally sketching out the interiors and their contents by the sound of footsteps and breathing, the smell of blood and individual body odors. This one had many armed men, that one carried diseased crew, and this… this one was practically empty. Three men aboard, all deep within the fishing ship's hold, and two armed guards. Easily enough to sate me for months.  \n\n\nI leapt onto the two men and seized their throats, one in each hand. My fangs found the first man's fat-softened throat and sank deep. The agony of my venom paralyzed him immediately, and my stone grip on the second man prevented him from even speaking or reaching for his gun. As I sucked blood, I moved forward on the docks until I was blocked from view of the other crews by the ship whose three-man crew I planned on taking as my main course. It took seconds to suck the fat man dry, and the second scarcely took longer. The orgasmic sensation of blood rushed through me, and my eyes rolled back. This was pleasure, I thought as I always did. This was joy. What human pleasures could match this? Even the tang of cigarettes and alcohol only put a tart edge on the ecstasy I felt in waves.  \n\n\nI took the bodies with me- I'd be disposing of them soon- and laid them on the deck after leaping to the ship. Then I cut the ropes with my fingernails, swiftly dropped to the docks from the prow, and set my hand against the 60-ton ship. It took a fraction of my total strength to send it sliding into the bay.  \n\n\nI leapt aboard, and tore down the steps into the hold like all the demons of hell were on my heels. It took no time at all to reach the men, and they had no chance to respond to my brutality. Two men laid dead and drained in 5 to 6 seconds, and the third had time to scream before I practically beheaded him as I bit his throat. Blood pumped hot and wet, quenching the last of my burning throat that still defied the four-man meal.   \n\n\nI collapsed on the floor with my kills, panting. I had no real need to breathe, but it felt wrong going without it for long. And after a long 20 seconds of exulting in my revitalized body and the still-pulsing heat of sweet blood, I reluctantly pulled myself up and went about the hard work of faking an accidental fire.   \n\n\nIt took 10 minutes to spread a few gallons of gasoline around, mixed with a liberal spitting of venom and the piled up, dried corpses of my dead victims. And about half a second to ignite it with a lighter. I was long out of range when the mass ignited, crashing into the sea a good 506 feet away. I didn't really bother watching the blaze, I knew it would destroy the bodies and burn the ship to ashes before anyone could possibly get at the evidence of my involvement. Even the diluted venom laced in my 5 dead meals was enough to burn holes in the ship, and all my other additions made the destruction all the more assured and complete.  \n\n\nI felt the explosion of the gas tanks as I swam to shore, and felt so pleased. Nobody would ever know of my involvement here, not even other predators. I liked it that way. It allowed me to hunt a much larger territory than most, allowed me to find prey and snatch it from under the noses of elders and covens too arrogant to consider the possibility that their prey would be poached. They'd write all this off as merely coincidence and random happenstance. My own scent would never be picked up on a nautical funeral pyre or in the constantly recycled ocean water.  \n\n\nThey were waiting for me on the shore.   \n\n\nAs I found my footing on the slick stones, three vampires appeared from the branches of the salt-stunted trees, eyes flashing red in the darkness. One boy perched in the branches, back from the others, like some predatory bat. One was a young man, huge and hulking and thick with muscles. And one was a tall, lean girl, with short dark hair and fangs so long they peeked from beneath her upper lip. They all gleamed in the firelight from the burning ship, and they smelled of the forest and dirt and fresh blood.   \n\n\nThe girl kicked a stone, which cracked past my head at supersonic speeds. I didn't bother looking back to see where it landed.   \n\n\n\"Why's his face all fucked up?\" The muscular one asked. His voice was like iron wrapped in velvet, and his tongue was the pink of the newly turned. I bared my fangs, feeling the pull of scarred flesh.  \n\n\nThe girl didn't bother answering his inane question. She carried an air of authority, her pose was slightly more calculated. She wasn't twitchy. The other two must've been younger and more immature than her, but not by much.  \n\n\n\"This is our territory. You're stealing our prey.\" Her voice was raw iron.  \n\n\n\"This belongs to neither of us,\" I corrected. \"Radcliffe and his girl own it.\"  \n\n\nShe reached in her pocket and withdrew a handful of ashes. They drifted from her pale hands and were sucked off by the breeze. The wind changed, and I scented the sickeningly sweet stench of burnt vampire.  \n\n\n\"Not anymore, short boy.\" she said.   \n\n\nI did not like my chances here. One of these fresh-blooded kids was easy to pulverize and slice apart. Two was an even match for me. But three? And three who'd killed Radcliffe, a vampire older than me by no small margin? I dropped into a fighting stance, briefly considering running. I was hopped up on blood after all, stronger and faster than usual. But against three… it wasn't ideal. Maybe I'd met the end of the road, but I would shred at least one of these fuckers.   \n\n\nThey were dropping into predatory slouches, baring their fangs, the ethereal song of venom glands rasping inside our jaws. The waif-looking boy in the back, the scrawny and sickly one, had a lighter in his hand. Fire and fangs, the best tools for killing our kind. We were seconds away from mauling each other when the fourth vampire appeared from the darkness.  \n\n\nHe didn't even move. He just materialized behind the sickly boy, his fangs ghosting through his wrist.  \n\n\nThe boy's hand fell to the ground, and the lighter skittered across the rocky beach. Half a 100th of a second later the stranger had his arm around the waif's throat, fangs poised to split open his neck.  \n\n\nThe musclebound brute almost lunged, but the girl shrieked and stopped him with a blow to the head that would have pulverized a semi truck. Ahh, that's how it was in this little coven.  \n\n\n\"Back the fuck off, or your boy toy gets decapitated,\" I snarled. Hopefully these fresh-bloods didn't know that decapitation wasn't fatal to us.   \n\n\nHer crimson eyes wheeled around to glare at me from beneath the jagged mess of her obsidian hair. The stranger hissed to emphasize the point.  \n\n\nA tense 60 seconds passed. The severed hand writhed and crawled towards its owner, but the stranger's foot pinned it.  \n\n\n\"We're leaving, Oscar,\" the girl said to the brute. She turned to the stranger. \"Will you let him go? Please?\"  \n\n\nThe stranger stepped back, releasing the boy. He scrambled for his writhing hand, and hastily rejoined it to his wrist. He tried to grab the lighter, but I snarled and sent him dashing to the girl's arms. Coward.  \n\n\n\"I better not see you around here again,\" I said. The trio fled into the woods without bothering to reply. I watched until the trees swallowed them.   \n\n\n\"Thanks for the help,\" I said, turning to the stranger. He was tall, pale blonde, and surpassingly beautiful even for a vampire, a hint of the exotic in his features. His eyes were dark crimson almonds, the hue of roses. If I had a heartbeat, I might have blushed. But as it was, I was glutted on blood. I was blushing anyways.  \n\n\nHe dipped his head, and turned to leave.  \n\n\n\"Wait, wait, wait,\" I rattled off. \"You haven't told me your name. I'm Emrys.\" My name tasted strange on my tongue. I hadn't said it in decades. And I was feeling old again. But he'd stopped at least.  \n\n\nHe turned back, and drew a long finger across his scarred throat. My brow furrowed before I caught on. How strange. Vampires healed all physical wounds aside from the Cumbanam. I'd somehow assumed that extended to muteness. I'd never seen a mute vampire before.  \n\n\n\"Apologies. Can you write your name?\"  \n\n\nHis razory fingernail slashed a little Liam in the branch by his side. I smiled. A small victory.  \n\n\n\"Well Liam, are you new here?\" He nodded, and glanced away.  \n\n\n\"I've already hunted, but I'd be rather pleased to guide you around the town. Especially since the night is so young,\" I said, stepping closer at an almost human pace. Painfully slow, but I didn't want to scare him off. For his part, Liam didn't seem concerned. I was 5 feet and 2 inches after all, and he was 6 feet and 1 inch. Not that size actually meant anything in a fight.  \n\n\nHe seemed to muse over my offer, and nodded. I grinned. We bolted into the night, aimed for the slums. I had room for dessert, after all.  \n\n\nThe hunt was over fast- some pimp and a few muggers were drained by Liam. I tore off a few arms as my share of the blood, but left the rest to him. We incinerated the bodies with the waif's lighter. Before I knew it, it was midnight, and we were sated for a long while yet.   \n\n\nWe found ourselves on the roof of an old cathedral, staring up at a cloudless night sky. The slow clockwork movement of the stars and planets was clearly visible to our slowed-down perception of the world, and it never ceased to amaze me that the night sky was so filled with color and movement. If I was human, I'd never have gotten a chance to recognize the beauty of the moon and stars like I could now. Liam seemed to enjoy the sight too, his soft red eyes tracking a brief shooting star.  \n\n\n\"Make a wish,\" I said, amused. \"But don't tell me- it won't come true if you tell anyone what it is.\"  \n\n\nI knew what I was wishing for. But telling you would be cheating, even if this is all ancient memory now. It felt nice, sitting next to someone who wasn't prey or trying to kill me. I was at least briefly at peace with myself. Maybe I could have a friend after all.", "Just as a heads up, Hidden Bodies is the title of the second book in the popular \"You\" horror/thriller series.", "Huh, I didn’t know."]