["", "Totally agree", "I once said to someone who was adamant she always help other people first, \"You can't help people when you're sick or dead\" kind of dramatic but the same point: You need a healthy balance of service and self-care.", "You're bored because you haven't exposed yourself to potential futures that demand an increase in skill.\n\nYou're anxious because you've projected too far into the future and don't have the skill demanded.\n\nHit the bullseye.", "I'm a 22m from Canada, I dedicated the last four years of my life, trying to get a bachloers of engineering in software engineering.\n\nI put a ton of effort into it to the point that I wanted to off myself many times.\n\nLong story short after 4 years of struggling, I have decided a couple of weeks ago I have to give up on engineering, and I'm now going to go into IT.\n\nI feel like a complete failure for 4 years. I sacrificed my mental health, social life, any happiness think it would be worth it. It wasn't.\n\nHow do I get my motivation back? ", "32 year old Canadian here, and I've changed my career like 4 times already in significantly different directions, going back to school for 3 of those. Currently an electrical engineer but I've been a schoolteacher, electrican, and worked with rescued wolves for 4 years. Bouncing around isn't a bad thing.\n\nTry to keep in mind the other side of the coin. There's lot of people in careers they get sick of and wind up bouncing around. There's lots of people who get the job only to realize a few months in that they hate it. Does that make them failures? No. I would argue NOT moving out of pride or whatever is the \"fail.\" \n\nIn a way you've taken the shorter road to the same destination of switching gears. Better to be 4 years in and change before you get too entrenched than decide you don't like it 10 years into the career.", "I want to work with rescued wolves... that would be a dream\n\nI have such great tradesmen skills, attention to detail, good work ethic, mentored many young people, especially in the area of out door construction and horticulture... just a bunch of skills that will keep me employed for as long as I wish..  and I would drop it all for a payout cut to work and use my skills to work with animals...\n\nReally just don't know how to go about it.", ">and worked with rescued wolves for 4 years\n\n\nWoah that sounds amazing, what made you quit?", "Amen. Almost 20 years and not happy with it is rough to do Everyday.", "I (24M) have a different path in life (military pilot), but I know what you are feeling. I screwed around a lot and didn't finish my degree like I should have by now. I'm only 80% finished. I decided to quit my job, move back home, and take double credits of classes needed so I can finish it fast. It should have been done sooner, but I was obsessed with getting a good job before finishing my degree and moving back to the city I loved. It put off me getting my degree, but at least I have experience with two pretty cool jobs. Don't feel like a failure, and don't off yourself. You're only 22, young enough to develop healthy habits. I don't know your situation, but the best thing you can do right now to get a sense of control over your life would be to clean up your living area and do some form of physical exercise. Maybe journal and right down exactly what you're feeling and why. At the very least, take some form of productive action. I'm not going to force my beliefs on you, but maybe try and give prayer a chance.", "I would try reframing the situation as “well, now that that burden is off my shoulders, what do I want to do?“ \n\nThis is your chance to go explore. You pushed yourself down a path that wasn’t working and you got off that path - and seriously, GOOD FOR YOU! So many people stay in situations (including relationships) that don’t work for them. They’re too scared to make a change because they’re scared of uncertainty. \n\nYou should be so proud of yourself for a) putting forth your best effort and giving it all you got and b) making the decision to get off your path. \n\nSo now what? My therapist had me make a list a few summers ago of all the things I wanted to do if I could do anything. It was everything from write a book, start a business, travel, like literally anything I could imagine. \n\nJust the process of writing down these ideas helped spark the motivation. It got me excited again. You’re so young and have so much life ahead of you. I know it’s awful at times, but there are so many wonderful experiences ahead of you. \n\nSeparately, I would make a list of things that bring you joy. It can be things as mundane as sitting in the park and feeding the ducks. Then start doing those things to get your mental health back. Think of them as self care. I love cooking, but I never have anyone to cook for and I used to think it’s sad to cook for just myself. Then I reframed it as - I cook to show other people I love them, maybe I should cook for myself to show myself that I love me too! \n\nIt’s small things that add up over time…. You got this!", "Wow! What a nice motivational message. I truly hope your good vibes inspire this young man. \n\nOP, I would say to you is don’t fall victim to the structure that the world impose on you. Learning is a life long journey. You have the power to apply all that you learned these four years to pursue what you truly love. No one is going to take that away from you. More than the subject matter, all your struggles have built up your character. And that’s going to help you grow as a person.", "Damn this was so good to read. OP, I don't have much to add. However, I would say \"nobody has figured it out all yet\". So, it's better to slow down and continue improving than simply giving up. Adding to this I used to do this in Notion having links of books I'm gonna read , a movie I'm gonna watch or a YT Playlist for learning a skill. You can give it a try as well", "U still learned a lot those last years. You might not realize it, because it seems obvious now. Gl king, I’m rooting for you", "Motivation is 50/50 internal and external.  \n   \nGo read this book : [https://www.amazon.com/Energy-Bus-Rules-Fuel-Positive/dp/0470100281](https://www.amazon.com/Energy-Bus-Rules-Fuel-Positive/dp/0470100281) and practice being positive to fix this :  \" I feel like a complete failure for 4 years \". You're going from Software engineering to IT. Sounds like you like computers / coding. If you really do, go onto Udemy and pick a course in coding. They all have a tangible end project which will give you that dopamine hit.  Now that you have a positive outlook, some coding experience and a cool project you've built, do more courses which will help refine what you're interested in.   \n\n\nAlthough a degree is great, it's not necessary to obtain immediately. There are jobs out there which will hire you on skill. As the years go on and you mature, you'll find that going back to uni and completing a degree will be easier. I was unable to pass uni until 28. I Just was not mature enough to have discipline with studying.   \n\n\nLastly, to hit that final 50% of external motivation, go make friends and surround yourself with people who do what you like to do. Speaking from experience, if I did not having friends who programmed, I would not have succeeded. I can't even explain how many hours I've spent talking about tech and co coding my evenings away.    \n\n\nGive this all a try, Do what you want to do, surround yourself with people who want to see you succeed but always know that the end result is dependent on you and the effort you put in.", "To piggyback on your comment - my career is in software engineering, and I learned everything through Udemy. No college degree or certificates (they do help, but not necessary). \n\nI also have met quite a few friends at coffee shops, some of which I've mentored and motivated them to learn on Udemy whatever fields might interest them. Now, we regularly talk about coding and related topics. \n\nOP, I'd highly recommend checking out a Javascript course on Udemy and build a couple website projects to put in a portfolio. \n\nI've been working at my company doing this for over 5 years now. Before this, I worked in the food industry for many years and honestly thought I was going to be doing that for the rest of my life. \n\nI promise it's possible to achieve your goals, and in many different ways too", "First things first: Stop telling yourself that you’re a failure and try to accept that 4 years have passed. Even if you don’t feel like it now, all that you went through improved you in so many ways that you may not realize until later down the line. \n\nTry to take a week or two off before jumping into IT. You may need a break mentally to relax, plan, and refocus. I’d recommend going out on walks and improving your habits outside of ‘work’ (health choices, dopamine, etc)  - this will trickle down to how you handle your career pursuits. I noticed that when I improved my body physically, it improved my mind which then made me more capable of studying, working, and everything else.\n\nYou’re still only 22 years old - society teaches us that we need to have it figured out by a certain age but that is just not true. The fact you care so much to ask this question should be proof that you’ll be okay and you’ll figure it out. Best of luck.", "I times like these, I always go back and listen to this:  [\"Don't feel guilty if you don't know what to do with your life\" ](https://youtu.be/sTJ7AzBIJoI?si=RA6c5doTV9wputoG)", "I spent 5 years chasing a masters degree running into dead ends before I quit it…all those years down the drain. But I walked away finally knowing what I wanted to do but i still have 3 more years to go. I’ll be 33 before I’m working and earning an income until then my wife has been supportive and keeping us afloat. Don’t worry you have time to turn it around", "Take a trip down memory lane and look at old photos - think about what you dreamed of doing; take time to appreciate what you have; and meditate about what your purpose is", "Sorry if I used the wrong tag. I haven't posted here before", "I'm literally in the same exact situation I'm also 22  ifell like you.", "Start with small tasks and be consistent. You’ll be surprise by how well you’ll feel after just a couple of weeks w", "same over here\nstarted my 4 years bachelors in 2018, still haven’t finished writing my thesis, it’s gonna be 6 years in a few months and i have zero motivation left\neveryone i know graduated 2 years ago lol\nmaybe it makes you feel better knowing you’re not alone haha\n\nthe thing is, do you know how badass it is to still want to keep going when most people would’ve given up already.\nyou wanting to switch to something else after four years instead of completely giving up is something you should be proud of.\nit’s not 4 years wasted, it’s experiences, you’re experiencing uni, you’re experiencing life\nit’s okay", "Motivation is a muscle you need to exercise. Calling yourself a failure is cutting yourself down before you can get started.\n\nYou need to start recognizing the things you're accomplishing so you can build up momentum towards accomplishing more things. At the end of the day, ask yourself what was one thing you did that day that you were proud of. This is important: there is nothing so small that you can't be proud of yourself for it, especially when you're depressed. The ONLY person you need to compare yourself to is who you were the day before. If you were struggling to take care of yourself for a while, then you should recognize when you do something good like brush your teeth, for example, if it was something you weren't doing before. Keep doing this every day, and then see if you can start recognizing the good things you're doing the moment you actually do them. Being proud of yourself can really help to start an upward spiral.\n\nAlso, I recommend therapy for pretty much everyone. Think of them like a personal trainer for your mind - they give you the tools and knowledge to overcome the difficult obstacles you confront, and they're there to spot you so that you don't get crushed by something you can't handle yet as you grow stronger", "My brother - as someone almost twice your age i say this. Our setbacks are the building blocks to success. This is the way the world tells us that our journey is meant for something else. Dabble and try a bit of everything in life. This will eventually prove you well. \n\nHaving a plan vs no plan is the goal. You’re doing something about this and being accountable. This is the sign of being an adult. That alone (accountability) will set you leagues apart from many people. \n\nBalance work, school and socials. Never sacrifice yourself when you could make strides. Remember - success isn’t measured in miles. Sometimes its in feet.", "\"Off yourself\"\n\nOP, PLEASE. DM me, whatever- do NOT GO DOWN THIS PATH.\n\nI've... been there. I've studied the weather. I've arranged the accident. \n\nDo NOT do so.\n\n\"Engineering' is not the be-all-end-all it is touted. Frankly, about half of the engineers I meet out of college (right now) I'd rather punch in the face and ask WTF they've been doing for the last 8 years. The other half I'd have never hired if they weren't 'special demographic picks'.\n\nI don't care WHAT you are, but all I care about is how you are and what you react to. If the jobs aren't opening in where you want to be or were told you had to be- find ones that aren't. You can always slide sideways.\n\nI... don't know how serious you were about offing yourself but.... this life is too short. I'll give you my phone number so you don't if you promise me you won't do that today.", "Hey it's okay. You tried and you have it in you to try again. Both those things are awesome \n\nThe poem \"If\" by Rudyard Kipling always comes to mind \n\nBut this time around, go easier on yourself. Don't sacrifice friendships and relationships. Make your life livable for yourself. Try to enjoy the ride", "I don't have any direct advice but hopefully my story can help a little. I studied computer engineering, finished my degree, and then spent 3 years just trying to find a job in that field. Finally ended up getting a job in IT and while it's not the big city big name company I dreamed of working for while studying I honestly love it. Get to use a wide variety of my skills and while I'm not writing full on programs there's plenty of programming adjacent work with things like scripting and API calls. You're several years younger now than I was when I finally found a job but even for me I consider it just the start of my career in tech, I'll probably be here a few years but after that who knows. Having worked with production level SaaS products now I can say that software isn't all it's cracked up to be and a lot of what is considered ready to sell is an absolute joke. It's massively helped me rebuild my confidence in my skills and in the idea that I could still work in software some day if I'm still inclined to", "Making a choice or having a choice made for you is not failure, it is life. When one door closes another opens. Walk through it. At the end of the day, all careers are jobs. Fall in love. Make friends. Care for your family. Read Moby Dick. Everything else is bull shit.", "Realize that finding you're on the wrong route and doubling back to find the right one is not only a success, it's the only way to succeed.  Beating your head against a wall will almost never knock down the wall before it breaks your skull.  \n\nIt sucks that you wasted 4 years.  But if you take a more measured approach I suspect that years from now you probably won't notice them.  You may very well consider it a crucial victory without which you'd never be the man you wanted to be.", "You're 22, no better age to change paths.", "Please help me out, i feel dumb as hell, isnt software engineering part of the IT sphere? D:", "Mushrooms!!!!!!!!!!! Im 26 have been severely depressed and demotivated. May 10th 2022 i tried to die! just started microdosing and its changing my life! Dont overdo it!", "Be prepared todo 5-6 years of IT hate it at the end and change careers ,  don't put too much pressure to stick with 1 job forever every 4-5 years you should be looking to upskill", "Do not give up dude, at least complete the degree.   \nOnce you get the degree at least you can pick it up any time in future when you want. Once You have the degree move on where ever you want, but at least get the degree.", "You're only 22! Life is very long my friend, better to change course now than regret it 20 years from now", "Edison failed 10,000 times before perfecting the incandescent electric light bulb. Don't worry if you fail once. Life is a lesson, you either learn it or you get learnt!😵‍💫", "I graduated with a degree in math and physics and still ended up in IT", "Dude this might be super random, but I’ve been feeling a bit demotivated too, I recently had a full health screening test done which showed I was low in haemoglobin, this can have some sort of effect on your drive, and day to day ability to get up and do things! So when you know the issue you can find the solution", "Try to find small victories every day. It can be as simple as going to the gym…talking to that girl you’re too shy to say something to…\n\nControl what you can control….\n\nBuild off of that.", "time will do it.. just keep going because life goes on..  \nnot sure even why you are way too concerned about those 4 years..  \ni am sure you learned relevant shit and earned transferrable credits towards IT..   \nthose two are pretty much cousins..  \nbut imo  IT suck ass.. and Canada is way saturated with IT people. the industry fuckin sucks.. at least right now..  \ncheck out cyber security.. shits better anyway than both..  \nyou want motivation for cybersec? watch mr robot.", "33 Australian. I fucked around in my 20s worked behind a bar, warehouses and sometimes didn’t have a job. Travelled Europe, the uk and some other parts of the world. It changed my outlook on life. Came back to Australia became a diamond driller, met my wife, had kids and now I’m starting a HD fitter apprenticeship. \n\nWork for a year, save money and travel. Travelling and the people I met along the way saved me from a dark hole that I was entering.", "You are 22. Think about that dude. You only recently became an adult. You still have a whole entire adult life ahead of you. Degrees take 3-4 years. Diplomas even less. There are so many options in front of you. I take it you do not have a wife and kids? A morgage, car repayments, debts?\n\nHonestly, it is way to early to use a phrase like \"complete failure\". Give yourself another 40 years of making crappy decisions, dropping out of multiple degrees, landing up homeless, drinking alcoholically for a decade and being 50+ with no savings, no pension, no medical and no assets, then maybe you can start using phrases like \"complete failure\".\n\nUntil then, just never give up man. You can make so much of your life. I would donate my limbs to science to be 22 again.", "If you're giving up because you're failing, take your time in school and take another year or 3 to finish your courses at your own pace. Get whatever engineering degree and then go for the job/roles you want. People don't worry too much about what kind of engineering degree you have. Just get the other certifications or whatever that you may need. Look for job postings that you're interested in now and see if you're on track. Don't rush anything either, life is a marathon not a sprint.", "I would start with your age. It's so weird to think back that at 22 we are too old. \nI am 48, Brazilian, changed countries 3 times, carriers twice. I was in 3 different engineering areas within electrical company, then stopped everything to start IT \n\nYou may be in the right carrier but in the wrong area. IT is diverse, and with 4 years dedicated to any area, open doors to most of the others.\n\nIf IT is not what you like to do at all, try something related like support, sales, or technical in other areas\n\nYou're 22. It's amazing what you can do", "Remove the pressure, pursue what you like. I studied 13 years for my bachelors. Life came in the way. I didnt have mental and emotional peace to truelly study before.\n\n\nBut now I have, life is calm. For the first time in a while I feel free and I can do what ever I want.\n\n\nSo you might not realize that there is too much in yourlife so you cannot study. Study is like a larvae before becoming a butterfly. You need to cocoon. \n\n\nWhen you can feel good about yourself and your goal. Then study again. Dont do it half assed.", "Let me tell you.. switching paths doesn't mean failure! Sometimes you don't know which path to choose, which is okay. Don't make it seem like a loss to you. It was an experience. \n\nMy mom is 43 y/o and she just found her dream job and education 2-3 years ago. She studied as a hair stylist, economics, priest and what not. She's such an good example of how unstressful finding your call should be.", "Dude you've mentioned self reflection, hard work, perseverance, hope and bravery all in your post.\nGratitude man, have gratitude. It changes your life completely. See you how I saw you just now .", "Bro you are just 22 not a big deal. You have got the whole life ahead atleast you finally knows what to do in life. I’ll suggest whatever you take up next don’t take it up in pressure. Take a break from everything decide what you want to do and blast it.", "[The power of gratitude for cultivating happiness ](https://avcjblog.com/the-power-of-gratitude-in-cultivating-happiness/)", "don't give up and keep on trying \" Patience you must have\" \" Always pass on what you have learned.” \" In a dark place we find ourselves, and a little more knowledge lights our way.”  “Train yourself to let go of everything you fear to lose.”   “Do or do not. There is no try.”  “Size matters not. Look at me. Judge me by my size, do you? Hmm? Hmm. And well you should not. For my ally is the Force, and a powerful ally it is. Life creates it, makes it grow. Its energy surrounds us and binds us. Luminous beings are we, not this crude matter. You must feel the Force around you; here, between you, me, the tree, the rock, everywhere, yes. Even between the land and the ship.”     You will find only what you bring in.”  - you are the hammer seeking the nail.", "Youre young and you will experience all sorts of things both good and bad. Dont rob yourself of these experiences. You can use most of what youve learned for anything so theres that.", "you can do anything you put your mind to once you realize what you are and how reality really works.", "Dude it's the small things that actually matter in the end. \nYour degrees are just tools that you pick up in your journey. Always remember not having tools will only make it tough not impossible. Our ancestors did it so do I.", "I’m going through something similar. I’m (20f) and have been trying to go to college since I was 18, with bouts of either failing my semester or doing alright in my semester, as well as taking off semesters to try and get my shit together. I would like to prefaces this by saying my parents had very high expectations for me to either go to medical or law school, and would often tell me that I needed a safe job so I wouldn’t end up like them. I come from a poor background and am paying for college on my own, however I was still in a major I hated simply because I didn’t want to disappoint my parents. But recently after failing another semester even though I was trying so hard, I decided to ask myself what I really wanted to do with my life. I felt like I was wasting time trying to be something I really wasn’t and needed to find something else. I still struggle finding the motivation to go outside of my comfort zone but if you’re unwilling to do so, then I personally feel that you will find yourself feeling stuck like you’re watching paint dry. I’ve been doing nails as a hobby in myself, and in turn I started to get more serious about going to nail school after I finally decided to put my foot down and defer for another semester. (Note that I go to a JC). For me, it made more sense to do something I was finding actual enjoyment in rather than doing what everyone was expecting of me. This summer I’ll be attending nail school and working on building my business, because one day I think I would love to own my own salon. Sometimes it takes time to figure out what you want to do, and you may change your mind more then you’d once, but as long as you continue to be patient with yourself and reflect on your interests and how you want to spend the rest of your life, you will eventually start finding more and more motivation coming back as now it’s something you like doing rather then feeling forced to.", "LET’S GET READY TO RUMBLEEEEEEEEEEEEEEEEEEEEEEEEE!  \n\nThere, feel better?", "", "I'm sorry, but every time I see this phrase, I read it as \"Don't.  Give up.\"  It is a beautiful picture, though.", "I have finals in a month and lots of things to study. The deadline, instead of motivating me, is discouraging and even the thought of what I have to do is too overwhelming.\n\nMy psychologist said to make a schedule but I end school days pretty late (literally only on Thursday I end my school day before 4pm) so the only days left for studying are weekends but I can't do all of these things in 2 days.\n\nI'm sick rn so I'm trying to use this free time for studying but as I said earlier - the amount of work is overwhelming me so I end up not doing much. \n\nHow do I fix this?\n\nP.S. sorry for any mistakes, english is not my first language", "I would just make the effort to go to the library. No distractions and you can sit down to focus. Do it a handful of times and it's a habit. \n\nGet yourself there and the rest will take care of itself. Even if it's late at night an hour or two helps.", "How late do you end your school days?   \nIs there a reason you can't study in the evenings?", "", "I spent 20 years of adult life trying to figure out how to get out of my dark place on my own. Then something in me snapped and I decided to see a social worker. In the two years since, I have pushed for a better position at work and finally (FINALLY) got my driver's license.\n\nIf you can, I strongly advise talking to someone. On the other end of that dark valley was a helping hand I just had to call out for.", "Congrats on your promotion and your license!!", "I 100% believe the right image is more impressive. Much easier to start at baseline than it is to start at the bottom of a hole.", "Indeed, digging a hole of that size can be more impressive than building a hill out of dirt.", "I learned how to dig myself out of a hole, but now I must learn how to climb a mountain", "We do but they look different. The person that climbed the mountain probably looks healthy and wealthy. The person who just climbed out of a ditch likely looks like they just climbed out of a metaphorical ditch so they get less eyes. \n\nWe celebrate sobriety, we celebrate 40+ year old people getting college degrees, we highlight people who overcame tragedy. We praise it all, it just looks different and some gets less eyes than others (cause the other is on a mountain).", "The parable of the prodigal son begs to disagree that we aren't taught to admire the latter.", "Why not both?", "\"also\"", "Ah, today I learned I'm illiterate. Thanks lol", "Im completely agree about courage and skill to climb down the valley...\n\n\n...o h never mind.", "Theres an underlying unconscious feeling of you having been muddied after crawling through the dirt, thats why its not as respected, its a snobbish thing", "Yeah not sure how you were taught, but was raised to admire both, thanks.", "\nI used to be so motivated, goal oriented, and organized. But lately i just don’t care. :( I want to care but it’s hard \n\nI’m 24F lost with what i want to do with life. currently getting a bachelors for biology with a minor in environmental science. Maybe i’ll do environmental health and safety, maybe a biology teacher, maybe just do sales IDK \n\nwhen I was a kid i used to want to save the world, now im an adult i just want to make money, travel, and have my bills paid. \n\nPeople say goals are the way to being motivated but i have no current goals\n\nI just want to stay home, i’ve NEVER been like this but this past year it’s been getting worse. I’m normally a happy, social, and creative person… or used to be i guess :( \n\nI don’t see a point in meeting new friends everyone sucks & they all just want to go to a bar anyways. I don’t see a point in trying in school when all that matters is experience. \n\nmy boyfriend is the best he’s so motivated and stable… i feel like i’m letting him down. he hugged me this morning and got me to get up and go to class after a week of skipping. \n\nmaybe i’m bored in my weird limbo of being in school for my entire life. Maybe i need a good pep talk. \n\nthank you for any and all insight. ", "Academic fatigue is real. Hard to stay up for it when you've been waiting for it to pay off for over a decade.\n\nFor me, dropping out for a semester helped. Realized how much doing straight hospitality work sucked and it motivated me to go back and get the paper. (And again when my said piece of paper didnt get me squat and i had to get a new piece of paper)\n\nGood news is your skill set for environmental science is totally in demand and you can start making money right out of school.\n\nJust finish it off. Eyes on the prize. Getting into a career will be a whole new adventure.", "Sounds like burnout.  Can you get away somewhere for a small break?  Even if for just the day?  Do something that will make you feel good & allow you to “reset”?", "I usually recommend exercise in situations like this. It's not a cure-all, but sometimes getting your endorphins up can snap you out of this kind of funk. \n\nTry lifting (if you don't already). Weight is a very tangible, understandable obstacle - and overcoming it with just your own strength is cathartic. \n\nOr if you're a runner - try to set a new mile time. I think you need to feel a real accomplishment, not just incremental steps towards an ultimate goal. \n\nKeep your chin up, remember that everyone struggles sometimes and it's ok. You've already taken steps to pull yourself out of it, and we're all rooting for you! :)", "I’ll start by saying that your joy and drive aren’t gone forever. You’re just dealing with some depression/burnout.\n\nIn my early 20’s feeling like this used to scare me more. I would think “God, I used to be so ____, what happened? Am I just cold and jaded now? Will I never be happy again?” \n\nNow it’s easier to recognize that depressive periods come and go. And when I’m in them my thoughts are distorted and I don’t have motivation. And that’s okay. Don’t beat yourself up for it, don’t panic about it, don’t try to force yourself out of it. Just be gentle with yourself and care for your base needs. Drink water, eat food, be extra kind to yourself, and know that it will pass. You don’t have to feel bad about feeling bad.\n\nAnd if it doesn’t pass on its own, know that help is available. If you can afford therapy, it’s a great option and can be very effective in learning to manage these thoughts and feelings when they appear. If not, there are audiobooks and podcasts that can lend support in the meantime. \n\nDepression has a way of tricking you into thinking that it’s “right”. That the way you see the world when you’re depressed is the “truth” and when you were happy you were just blind to the reality of the world. It’s lying. This is treatable. And you can absolutely feel like yourself again. \n\nIt’s the most normal thing in the world to feel lost and disaffected when you’re figuring out your life path - and let’s be honest environmental science can be a fast track to burnout. You’re not crazy, and you’re not broken. It’s okay that you feel this way, but it won’t be forever either.", "I've been in a similar situation. Had little/no motivation from high school to college. Just coasted through without thinking about my future.\n\nI'm a year out of college with a job that I love (though I'm looking to change for other reasons), people in my life I love, and a self that I am so insanely proud of. Here are some things that helped me and that I hope help you.\n\n1. I didn't feel happy while I was coasting either because I felt my time could be better spent elsewhere. So that's exactly what I did: I spent my time in places that I thought were meaningful. Physical health, emotional and mental health, making art, work, stuff like that. It doesn't mean that I don't have to do bullshit I don't wanna, but at least that bullshit is interspersed with stuff I DO care about anf the bullshit lets me do the stuff I care about. An additional benefit of this is that the stuff you care about will probably naturally lead you to make goals, which will help even more. It's a positive feedback loop; you just gotta start. E.g. why did you choose a bio and env sci programs? I'm guessing it was cuz you thought it was a worthwhile use of your time on this Earth to care about life. How can you actually do that? Maybe volunteer, maybe write and share a poen about nature, maybe make some amazing, low-impact food you can make for yourself and friends. Lots of choices here.\n\n2. Relates to the thing above but make sure you're taking care of yourself. We are monkeys on a rock, no matter how many quantum supercomputers and gene editing techniqued we design. We need a balanced diet, sleep, exercise, love, ways to communicate with one another, etc etc. Should've prob put this first, cuz this is the most important. DO THIS FIRST!!!\n\n3. I was crazy depressed during this time and had undiagnosed and untreated ADHD my entire life. Getting help was amazing. I have little/no suicidal ideation, love life, and feel energized and happy WAY more now than I ever did. See if your school covers therapy. It can save your life.\n\nAgain, hope that helps. Good luck with school and feel free to PM if you wanna hear more.", "Life fatigue is real. Doesn't matter how much or little you have been through. It is a part of growing up. It sucks to hit bottom, but never let go. Your BF sounds like an awesome guy! You have the world ahead of you! Let the past go, and hang on to the future!", "You are not missing “goals.”\n\nYou are missing a sense of purpose that you yourself have defined and that is not part of some system or authority figures telling it to you. \n\nWelcome to your Quarter Life Crisis. 🎪 based on your post your sorrows seem existential. Kierkegaard refers to the first major “leap” of meaning to be a person’s leap from an aesthetic way of living to an ethical way of living. For example, caring about brunching at the “popular spot” and caring about how nice the photos look (aesthetic) to spending actual time and building meaningful and intimate relationships with friends (ethical). This is a time of life where you begin to define your “purpose” in life. On your own. With no guarantee of “success.”\n\nIt’s a scary time. Here are 3 books that might help. They helped me dig my way out of two QLCs of my own. \n\n1. You are burned out on a diet of late capitalistic definitions of what “success”, “goals,”and “worth” look like. Read Burnout Society by Byung Chul Han to understand why people are increasingly feeling burned out and why it’s a legit feeling created by our late capitalist society. You’ll feel less lonely and “wrong” and it might improve your confidence in yourself. At least you’ll stop beating yourself up for feeling less than motivated. \n\n2. Then follow it up with 4000 Weeks by Oliver Burkeman to start to define your purpose. \n\n3. Then when you are feeling like some purpose has been discovered or restored and you have some sense of action orientation, try “Designing Your Life” to create a playbook for yourself. \n\nWhat you are feeling is a natural part of the progression through your twenties. Your lack of motivation is a sign that your values have shifted from under you and you don’t find your old values as meaningful anymore. Good luck and have fun with experimenting with what’s going to work for you in the next chunk of your life 💪", "Quarter Life Crisis -[https://en.wikipedia.org/wiki/Quarter-life\\_crisis](https://en.wikipedia.org/wiki/Quarter-life_crisis)", "You are burned out.", "I got not alot of insight as I am only 18 and stupid, but you sound like an amazing person who has burnout. I wish you and your boyfriend the best!", "Cut way down on phone time! Leave it in the other room/purse/backpack, turn it off for a few hours, leave it at home while you run an errand or take a walk. Whatever it takes, get your brain away from the distraction so it can reset and you can have time to get into flow and let your mind wander.", "Go to the gym. Trust me, showing up every day for 4 weeks will be difficult, but after that you will start to miss it if you don‘t go. That kind of discipline will start to show in other parts of your life too, like education etc. \nAtleast it worked for me✌🏽", "Need advice: all I do is work, eat, sleep, repeat \n\nI’m part of a family business so my schedule is as follows \n\nM-F: 8:30 to 7 \nSat: 10 to 4 \nSun: 11-4 \n\nI wake up tired and dreading to go to work and after I come home I smoke weed, and binge YouTube until 11 or so \n\nI don’t really do much else and I feel like I’m in a rut. I want to workout, meditate, and do things I like doing but I always fall back into this cycle, I need some help", "Well, you're working a 63.5 hour week, 7 days a week. If you want any semblance of life, you're going to have to either quit or talk to your family about your schedule.", "Homie is gonna need a day off.", "Or find greater meaning in the work. e.g. talk to the family about taking on additional responsibilities and finding ways to grow the business.\n\nYou can still take time to workout and do other things with that schedule. It's not the hours that are stopping them, it's a mental blockade. A greater sense of fulfillment will result in less burnout regardless of the hours worked  (exhaustion maybe, but not burnout).", "\"Oh you're working 63,5 hour weeks ? Maybe you'll feel better finding even more work to do\"", "\" talk to the family about taking on additional responsibilities \" , did you...did you read op's post about how he feels?", "Man, no nice way to say this, but eat 💩.", "It's about finding meaning in the work.  Some people work over 80 hours a week and are still extremely healthy and balanced people because their work is where the find the kind of fulfillment and purpose that most people seek in social life, travel, and leisure more generally.", "You're disregarding the key point I'm making. The sense of fulfillment wards off negative feelings. That it doesn't necessarily have to be the hours worked that is the problem, but instead a lack of purpose or feeling of accomplishment.\n\nI'm not saying it's a guaranteed win for the OP, but it's a perfectly reasonable consideration.\n\nAnd it doesn't have to be more work, but instead different work with more impact on the bottom line.", ">Some\n\nThat word is doing a whole lot of heavy lifting. I’d bargain you’re talking about a fraction of a fraction of the population there. \n\nObviously this guy isn’t one of them.", "It doesn’t matter how much you enjoy your job, working that many hours is incongruent with a balanced life. Also, we don’t have to love our jobs or find meaning. We can find that elsewhere.", ">That word is doing a whole lot of heavy lifting\n\nThat doesn't mean we shouldn't encourage people to give it a shot.  The mindset that work has to be soul-sucking is toxic.\n\n>Obviously this guy isn’t one of them.\n\nHow would you know that?  They're asking for motivation.  I'm encouraging them to reframe how they view their job.  Most people here are saying shit like \"work less\".  It's a family business and this is the status quo.  There's likely good reason for the way things are.  Either OP needs the extra money or the business needs the extra work, or family drama or whatever.  You can't control those things, but you can reframe them.\n\nRather than viewing work as something you have to do, you can view work as a place where you can make a difference.  Especially in a family business.  You can rearrange product, work on customer relations, research business innovation, or even just doing extra cleaning to make the place look/feel nice.  It can be similar to a hobby.  This framing is, largely, a choice.  You can deliberately change your framing over time.  It can be very motivating and uplifting.", "“How do I get a life when I work 70 hours a week?” You get a better job and work less hours. You already knew that. There’s no big secret and you don’t need advice. You know, in your heart, the only way out is through", "I used to be this way till a few months ago. Wake up tired and dreading the work day ahead, work your shift, smoke weed and binge YouTube till way too late at night. Going to bed was depressing bc work started soon after waking up.\n\n6 months ago, I decided to stop smoking it to clear my head and started feeling good. After a few weeks, I picked up a little bud I thought as a reward to myself and also bc I missed feeling high. It was great to veg and YouTube that weekend away but  the following week of work was depressing and unproductive.\n\nQuit smoking weed. Quitting clears the brain fog you experience and the world/life slowly starts becoming tolerable to somewhat enjoyable to \"normal\". \n\nIt's a vicious cycle that is tough to stop. When u decide to stop smoking weed, you may fall back to it more than once. I understand cuz the feeling is euphoric  and bliss in the moment. But In the long run, it's well worth kicking the habit.\n\nI wish u the best of luck, friend. 🖖🏾☮️", "Your completely right imo I have been free for 6 days of weed while still working 530pm to 530am .I'm rewarding myself to smoke 1 time after this set.But I really know I have to completely quit again", "Dude working 7 days a week its not the weed!", "Dude working 12 hours a day will destroy your body and mind.\n\n I didnt realize how bad it was till i was fired. I was overworked and my body had no time to recharge which is by design if your working all the time you camt fimd a better job.", "It's weird how long weed can stay in your system, when I realised I could feel it lingering I decided not to have it again, luckily that was early on and I didn't have easy access to it", "Why not both?\nWeed doesn’t help at all; it’ll make it worse.", "Definitely can't get better without better hours! He might need to do both though - regular marijuana usage doesn't suit a lot of folks.", "Smoking weed is always a problem. I have yet to find someone who smokes everyday and has their life in order. Smoking weed is not awful if you do it once or twice a month but everyday is abuse! When you abuse substances it has a negative effect on the body. Don’t believe me? Watch videos on how smoking affects  Cannabinoid receptors in the brain which thus impact your hormone production!", "Yeah but I do 12 hours shift and work 6 days a fortnight ....that's real work/life balance", "The guy works 7 days a week thats whats making it worse!", "Yet we all know working 7 days a week is a problem where you have no idea how much weed he consumes.\nI worked in a factory 6 days a week.\n\nMary Jane was a blessing!", "yeah fuck them cancer patients that take it to be able to keep food down", "My father started his own trucking business makes 6 figures with a 8th grade education, my mother worked in a factory for 35 years becoming a manager, my brother runs a concrete business , i run a mowing business, we all own our homes.\n\n\n\n\nMy family has bn smoking daily for over 40 years. I take it over a family of drunks or pillheads. Your exposed to worse stuff in your food, and drinks!", "Guys working 7 days a week while enabling an addiction.\n\nIt’s both.\n\nImagine if you weren’t spending money on drugs? You probably wouldn’t need to work 7 days a week.\n\nIt’s a feedback loop from hell.", "Not if you grow your own!  Also he is partner in the company thats why hes working 7 days a week.\nOnce again you do not know how much he smokes so you are speculating on how much he spends. \n\nYour scale of feedback loop from hell must be so naive compared to pills alcohol meth heroin crack fentanyl.\n\nTylenol is higher on toxicology.", "Priority #1 is get your scheduled down to 40 hours a week. You’re almost double that.", "Reddit is full of miserable people complaining about their shitty 40 hour jobs. It's not the hours, it's the lack of fulfillment and greater purpose (and possibly the drugs).", "Yea I agree you can work 40 hours and still be miserable but the glaring elephant in the room is the 67 hour work week. Take care of that first and you’ll immediately have 27 more hours in the week to exercise, meditate or look for a more fulfilling job.\n\nQuitting a habitual pot habit would also be good but the main source of misery is working 1.5+ jobs right now.", "While that's true, there's no possible way to have fulfilling hobbies or time to yourself if you work 70 hours a week it's basically not humanly possible.", "No you missed my point. I'm pushing back on the idea that 67 hours is, per se, a problem.\n\nLots of people work that much or more and have fantastic mental health. Mostly business owners or others who find deeper meaning and  fulfillment in their work (pushing an agenda that's important to them, or directly benefiting from their investment). You just don't see them on reddit complaining. But the key part is they're benefiting from that work.", "I'm not talking about leisure. I'm referring to the fulfillment that comes from serving a greater good, e.g. meaningful work, caring for and serving others.\n\nThat's why I was suggesting to the OP to consider talking to his/her family about doing more impactful work for the business. If they're in a rut, they're clearly doing menial work. And that's the source of the negative feelings, rather than the actual workload itself.", "I understood your point. Yes, some people work that much and are apparently happy. That’s obvious.\n\nMy personal experience is that that’s a minority of people. OP isn’t a business owner. And I am safely assuming he can’t immediately quit his current job and start a business doing what he loves. \n\nWorking with the tools OP has now, he should slim his hours down to a normal 40 hour work week. Doing this, he will have 27 or however many extra hours to think about life and find a different, more fulfilling career.\n\nThink about it like OP’s hierarchy of needs. From his post he doesn’t sound to enjoy his job (no higher level fulfillment) and he’s got no work life balance (a lower level fulfillment) to take care of his mind and body. \n\nAddress the lower level first (reduce hours) to mentally and physically survive, then move onto higher level priorities. Once OP can feed himself while not sacrificing all of his free time, then he can think about what it is he really wants to do for a career.", "My recommendation (in another sub-thread - so perhaps I should have added it to the above comment) to gain additional fulfillment was talk to the family about how OP can commit more meaningful contributions to the business.\n\nOption 1: Cut back hours. Hurt the family's bottom line. Still be miserable in the job\n\nOption 2: Step up your role, feel a sense of pride and accomplishment, help the family.\n\nBoth are based on wild assumptions about the OP, their business, and their family. Maybe it really is as simple as you propose and it doesn't negatively impact the family.\n\nI hope so. I'm checking out of this thread, but I do appreciate your thoughtful replies rather than the typical \"*work bad!*\" childishness.\n\nHopefully one or more of these perspectives helps them.", "If your family’s bottom line depends on them taking advantage of you then…that’s awful. And it’s a family business anyway so it’s not like career advancement is really an option like it is at a standard 9-5. \n\nAt some point OP has to do what right for him/her. His fam could hire a part time employee or the parents could take up more hours themselves so their kid can actually make a way for himself instead of drowning to help them out. \n\nLimited info on OP’s fam situation though so it’s all speculatory.", "OP said they're a partner in the business. They're not an employee.", "No, OP said “I’m part of a family business” which could easily mean employee.\n\nAlso, doesn’t Starbucks call their employees partners? Lol just because your business calls you a partner doesn’t mean you’re taking an active role in planning or profit sharing.", "Was in the comments. \"Ya I’m a partner\"", "Also FYI in small business, a \"partner\" very specifically means a partial owner.", "Im aware of what “partner” implies for small businesses, but that could honestly mean anything unless OP gives specific details. Small businesses with family are often very poorly defined - and I haven’t seen OP detail what his “partnership” entails. \n\nIs he sharing equally in the profits? Is he investing capital in the project with his family or is his investment in the form of labor? Does he have a written agreement with benefits and unemployment insurance? The ability to sell his portion of the company and a road map for what that looks like? \n\nIt could be anything.", "Is the family business just started and you need all the manpower to get it up and running?\n\nWill it be better later when things settle down, or will it get worse?\n\nI guess since it's \"your\" business you do have to put in the hours.", "Yes exactly", "Are you a partner?  If not its your familys business and they are taking advantage of you. If you own part why can you not hire someone part time to cover the weekends?", "Ya I’m a partner", "New businesses frequently don't have the cashflow to be able to hire somebody. \n\nAlso recognize that you clearly have a different mentality regarding your commitment to your family than most people do. It's not unreasonable or uncommon to do what needs to be done to help your family stay afloat. When your family needs help, you help.", "Then you need to figure out hiring a person to cover weekends. Your putting your health at risk working 7 days a week let alone your mental health from lack of sleep and stress.\n\nI understand the grind to be successful but breaking your mind/body will cost you far more in the long wrong.", "Try to hire someone part time.  You need the break man.", "See where i asked questions you assumed.\n\nMy family has 3 business my father just had two amputations dont assume things .", "Nothing will get better until you cut your hours in half. This is already taking a toll on your physical and mental health. You need to make a change immediately before it gets worse, possibly causing permanent damage to your body. Also, cut out the drugs.", "Weed is the healthiest drug", "Absolutely false.", "Nope, weed will make you feel ok with boredom but its when you are bored, that you should be learning a new skill or socialise with friends. When you smoke weed your whole life, you wont be good at anything and lack meaningful social connections.", "It has its place, but it isn’t healthy to be smoking that every day. See comment from xiCapax for why.", "How so?", "“Weed will make you ok with boredom”. \n\nThat is bullshit.  Many interesting and productive people smoke weed.", "This is unequivocally incorrect 😆 💯\n\nI smoke so much weed, every single day.\n\nI'm the most productive, and nicest, person in my workplace. I have hobbies I do daily, I have a home that's nice and clean, and my favorite pastime is hanging with my Old Pal, aka my bong.\n\nMy life is better for having weed in it.\n\nMaybe you just don't know how to use it correctly...\n\n\nCannabis also helps remove cortisol. If you're smoking more weed because you're stressed, that's understandable. Having something to help manage your day and make it easier to keep going isn't a bad thing. It's not keeping him locked in to the choices he's made, just helping him manage to get through them.", "Go visit r/leaves and tell me i'm wrong again", "Yep!\n\nBn smoking since 14 i was one of the hardest workers in the factory after 10 years i could work in half the factory. I could do about 30 jobs the only reason i could tolerate the place is necause i could smoke. \n\nYet its perfectly acceptable to be a drunk!", "You might be right, but I just can't assume you're telling the truth, when you have the username of a twelve year old.\n\nedit: poor guy is being used as child labor", "youre wrong", "You have no room to talk about anyone's username 🤣 believe in destiny? Then believe you were destined to be spanked with facts today. By someone with one of the coolest u/n on this rinky site.\n\nGotta love the way you can dissociate from the truth with such an unreasonable excuse. Truth from a 12 year old is still the truth\n\nBelieve in that.", "You are Delusional", "Did I in any way imply mine was any better (though it's definitely not an immediate 12-year-old indicator, that's for sure)? You *shouldn't* believe anything I say about this stuff, either. Though the truth is that it's simply a reference to a show I used to like.\n\nAlso, advice from a 12 year old who's talking about being the best at his \"workplace\" should be taken seriously? Yeah, no. Child labor is kind of illegal.", "Your reading comprehension is that of a 12 year old 😆", "You have to find balance in your life. You can make all the money you want but the most valuable thing you have is time. You don't want to look back on your life and realize you spent all of it just working. Ask yourself who has the most wealth; someone who has all kinds of free time and is traveling the world or doing hobbies they like versus someone making all kinds of money because they have to pay for all the stuff they can't enjoy since they're too busy working. Life is too short. Who knows you might never see retirement. The time to live is now.", "36,500 days is so short and its not even gurantee but we bn conditioned to think a 100 years is so long. \n\nYou can enjoy life when you retire is a dream!", "get ear buds and listen to YouTube at work, they have audiobooks too.\n\nsave money and go for vacation", "What audiobooks do you recommend?", "Dune 2 movie is out, so I was listening to dune the books", "The Hitchhiker’s Guide to the Galaxy for maximum quality. \n\nFor maximum value, the Stormlight Archives.", "Dune books are great ( paul voice meh) i would add battlefield earth and hitchhikers guide to the galaxy.", "I want to know your thoughts if you get to the 4th book.  😁", "I like the movies, I should read the books.", "Need about 2 ŵeeks", "let me tell u what I think about the movies first, I'm on book 2 right now, \n\nthe 1980 dune was so boring I have no ideal. what's going on and I don't care, and it's soooo long, I never finished it, but I understand it to be better than the new movies.\n\nDune 1, it sux, it's so boring and so long I have no ideal what's going on, did not care\n\nDune 2, it's so boring I didn't finish the movie, I have no ideal whats going on,\n\nso I start with the books, omg it's so boring, I know whats going on, it's just so slow, not the books fault, it's all the Sci fi I've seen and read is better, but as I get into it, it's really good, too good, and the movie did it's best adapting it to big screen.\n\nI also watched alt shift x explain Dune for like 10 hrs, I didn't get bored, it makes sense, can't wait for book 3 n 4 and to actually watch all the movies afterwards", "I watched the 90s version growing up thats what lead me to them. Same with battlefield earth ( such a bad version of the book lol).", "For me, however exhausted i am, i just decided myself to tolerate just one month to go to the gym. For that month, it was soooo hard, but as i got used to going to gym after work, and now it has become one of my routine. Everytime i see mirror, i  feel it was worth stressing myself.", "It's alright to set limits with your family. The amount you're working now is more than they can ask of you, and while they might be slow to understand ultimately a family business shouldn't be what keeps a family together.\n\nTalk to your family. Make time for yourself. Make time for them outside of work as part of the deal. You might find your relationship improving if you do more with them than work as an employee. Go fishing with your dad or something. Work with them on how to replace twenty or thirty hours of your labor - employees aren't cheap, but wages are deductible and you may be able hire someone to do a lot of unskilled labor around the business for a rate that makes sense. If the business can't survive that then you folks might have to consider whether a family business that can only persist with dozens of hours of overtime from each member is really worth maintaining. That's a tough question, but you can't be made to sign your life away to such a precarious LLC.\n\nThink hard about why you're smoking when you get home. What you say reminds me of something my friends and I have observed - are you using it as a way to basically hide from what your life is really like?  Do you feel bad almost as soon as you take that first hit? Do you feel like you should be doing something else? If your main thought while smoking is \"I'm so disappointed in myself for doing this\" then you should probably quit. Otherwise the extra time you have on your hands will just filter out in the bong water and you won't feel any better. It is even possible (this is a leap, but worth considering) that the reason you're getting such long hours is because your family doesn't want you spending extra time doing drugs. If so, that's not a good way for them to handle that, but I've seen parents do that many times with kids who like hitting the sauce more than the parents approve of. \n\nBe honest with yourself, be honest with your family, and you will find tomorrow better than today. Asking here is a good first step and I'm sure you'll get lots of advice better than mine.", "I am going to give advices that worked on me\n\nWhen you come home dont immediately lie down it makes me very lazy and dont want to do anything afterwards. Do your responsibilities first clean your home or cook for yourself(ive been ordering and sleeping until my food arrives) for example.\nQuit smoking weed alone for 1 month. Give yourself cheat days when you have company. \nIn work if you have quiet times use that time well\nReduce your screen time", "You need one day off for sure.", "Cut your hours or get a different job. You cannot have work life balance like this.", "You're gonna get thru it, bud. I admire the ambition. You're \"out there grindin,\" like the capitalists say. It's what we gotta do sometimes. \n\nNo matter what happens with your work schedule or whatever anybody says, this redditor thinks you're doing great.", "Reduce your time working. That’s the only way.", "Shit sounds all too familiar except when you had it better before and then make huge life changes and fall into your entire list which im right there with you atm so good luck", "I don’t have a solution but I feel you bruh. I opened a starter company myself and I’m half a dead zombie for the past year or so.", "Who is the boss in this family business scenario? Explain to them that the hours you are working are not sustainable. Tell them you want off at 5 and Sundays off. If that can't be done, find another job. If there's a family guilt factor, you need to get over that. If the boss is you - then you know what you need to do. \n\nSide note: I would recommend quitting smoking dope for now so you can have a clear mind to attack this. I know in hindsight my dope smoking obliterated my motivation. Getting stoned every night could be a big part of the problem. I limit mine to weekends now and am much more focused on what I want in life.", "Bro, not having a rest day is basically slavery, its againts the law.", "Stop smoking weed brother, ask for less hours and make your health a priority by doing your workouts. BUT MOST IMPORTANTLY STOP SMOKING WEED!!!", "So when you say all you do is work and sleep, actually what you’re saying is you also choose to spend your time smoking weed and watching YouTube. \n\nIt is tough - you can keep up this workload at the sacrifice of your wellbeing, or you can make a decision to change something. Either you change your job, you set boundaries so you have time to look after yourself, or you keep working these hours but do things in the evening that improve your wellbeing. Even just adding in a walk or some YouTube yoga would be an option.", "Obviously the workload is heavy and is much of the problem. But it also sounds like the time off isn’t really used productively to restore yourself - binging tv and weed will just tire you out more. Ironically, a bit of exercise in there will actually give you *more* energy.", "I agree.y schedule is set in stone and I need to make better use of my time. Would you recommend working out after work or before work. Typically I wake up at 5ish and just lay in bed", "I think that’s a personal thing. \n\nFor me, doing it after work meant cheating a lot - oh I’m tired today, or I wanna go see family or friends, or play a new game. Just didn’t work for consistency. Plus my gym gets absolutely slammed between 6-8. Too many bodies, not enough equipment (or shower stalls) for my liking.\n\nGoing before work (wake up at 5, gym 6-7/730, shower and change by 8, get to work by 8:30) has worked for me a lot better as far as consistency. Nothing else happening at that hour anyway, and the hardest part of my day is done before most folks get to work. Plus the gym tends to be way less crowded, and zero traffic to deal with getting there. \n\nBut there are downsides too, primarily, I HAVE to actually fully asleep by 11 to get enough rest, which means getting to bed by like 10:30 at the latest. As a bit of a night owl myself, this took getting adjusted to.\n\nBut, that’s me. I know gym evenings work perfectly well for a great many people. So, try both for a few weeks each, maybe a month even, and see what gets you there most consistently. Cause that’s the real key to it all - consistency.", "Get rid of the weed addiction first.\n\nSet a schedule to exercise- even if it is just walking the block.\n\nTurn off electronics past 10pm (earlier if you can).\n\nDo you snore/sleep? Might have oxygen deprivation (know too many that do and this is a major contributor).", "Get a hobby and work less. Working out is great but there's tons of stuff to do. Read books, play video games. Watch movies. Anything is better than the junk culture of YouTube", "There are times in my life that were like. \n\nYou are working too much TBH. \n\nSet a goal - run a marathon. Just training for a marathon is 100% the best part. The actual goal is not important - but set one and build a plan. \n\nWorked for me (having run so many I lost count and started giving away my medals to little kids after the races).", "Instead of smoking weed at home, get something portable (vape pen, dry herb vape, etc) and smoke while you are out walking around.\n\n\nIt will change your life", "I’d find a way to cut back on hours. I’m not sure how much control you have or what type of family business it is, but you could also find ways to incorporate things you love or want to start into your job. Since there is only so much time we have in a week, something will need to be adjusted. Long term studies have found that one of the biggest regrets people on their deathbeds have is working too much. Don’t let your life pass by because you are devoting it all to your job. \n\nI’d also suggest minimizing the weed usage. It is known to cause fatigue/motivation issues. It also is often used as an avoidance coping mechanism that could be preventing you from listening to your needs and could be feeding into the whole problem.", "All work and no sleep make Jack a tired boy", "Stop working a job over 40 hours. Move to a cheaper part of town or a different city and  do normal work for 40 hours a week . You are allowing employers to abuse you and you are crazy to live in a place as expensive as yours is in order to do it.", "Working for 7 days a week will drain any man. I think you should see if you can cut back your hours or see if you can pivot to a better work life balanced job (easier said than done but not impossible)", "quit", "Is that you, John Wayne?", "Welcome to life....work, sleep, repeat...die !", "Unless you’re going to end up owning this business, get out.\n\nAlso, stop smoking, lift heavy things.", "Yes I’m a partner and I’ll end up owning it.", "Mon-fri 7-530\nEvery other week add sat 8-12.\n\n\nI feel the pain brother. It's a grind for sure, you'll need to evaluate if that effort is worth it or if the imbalance is causing more issue than it's worth. Love your life on your terms and for your goals. ", "Cutting down on the weed could help, too. You don't need to quit, but using in moderation might help clear your mind.", "I actually didn’t smoke today and I feel pretty good!", "You can do this. Things will become more clear, my guy!", "Can you change the way you get to and from work? Maybe if you ride a bike instead of driving on M-F, it will make the day feel longer but it will give you more exercise and improve your health \n\nWeed would be the first thing to cut but you always have to replace these things with something \n\nAlso, when you go to bed, write down something you learned from watching YouTube. Half the time I can't even remember everything I watched", "Find new friends", "Try magnesium bro it changed my life", "You reccommend magnesium pills? Do you take them once/twice a day/night?", "Absolutely I feel you. I also run a small business with my family. I take morning an night. It's helps with relaxing your mind an giving you mental clarity. A less stress sorta  I got this feeling. And has helped my soreness in the gym . Feel more alert more energetic, like your cells are full. You like me an 90 percent of most people are deficient .", "Any brand of magnesium pill you recommend?", "Also bro try to get a lot more sleep. I can tell from your symptoms and attitude a few weeks of great night sleep along with magnesium, an a half mile walk will change your life .", "You don't need help, you need a personal trainer mate who doubles as a life coach, a PTis a good start tho mate", "Do your other partners work the same amount of hours as you do?", "Yes we have two stores", "Hobbies hobbies hobbies. Find an interesting hobby and your life will change", "Do you really need to follow those working hours?\nWell I'm not really sure how heavy the workload is but it's long.\n\nA problem maybe is you're too tired to do anything else after.\n\nAnother one is you can't stick to a schedule. I think you need to make it consistent for like 3 weeks to make it a habit.\n\nAnother one maybe is that might working out for now is too empty and you'll need emotional support. Not sure if you're a a guy or a girl, but maybe you can try to join like yoga sessions or with a group like CrossFit.", "I think you need to quit your job. It sounds like it’s taking up most of your time", "Why are you working?", "what's the alternative?", "The question was a bit deeper. Ask yourself why you are working and what is the purpose.\n\nIt's obvious that we have to work to be able to eat etc.\n\nIt seems the OP is Working just to \"work\" without any sense. As a lot of ppl, he is working because someone convinced him that was what he had to.\n\nHe is not happy and have no time for himself.\n\nAnd the alterntive starts in the mindset by asking yourself why you are working?\n\nAnswering that you don't - need -  to work 60h to be happy is a good start.", "That's a fair point. Unless it's a financial necessity, it doesn't need to be this consuming.", "I think that even if this was financial related, you need to have the time to profit!", "", "", "- Albert Einstein\n\n\n\nHaving a clear goal in life is essential for staying focused and motivated. Without a purpose, we risk drifting aimlessly and feeling unfulfilled. But by setting a specific and realistic goal, you can start taking control of your life and work towards achieving your dreams with confidence and determination. So, start developing a goal that inspires you and keeps you moving towards success!", "*“There is nothing outside of yourself that can ever enable you to get better, stronger, richer, quicker, or smarter. Everything is within. Everything exists.\" -* Miyamoto Musashi\n\nMusashi has so many bangers that still rings in the modern ages", "Absolutely a banger!! Thank you for sharing this!", "that hits different when you actually understand how hard is to have a real-life goal not tied to anyone or anything instead of building around a person, thank you!", "It helped me so much and it's something I think about daily now so I just wanted to share!", "Your goal should be to become a better version of yourself.", "That's an undeniably great goal. It can sometimes be hard to measure the progress though. For me at least.", "Maybe try to write at least some good points you did good on your day just to reinforce the progress on your mind to be more aware of each day, and i say it should be necessary to enjoy the progress overall to get the best results naturally.", "I'd say the best metric is long term consistency or never giving up. As cliche as it might sound.", "I will start this today! Thank you for the guidance here.", "I registered into a Virtual Half Marathon for April 26th... What I really see is that me being 44, most realistic approach that I got is to complete it in around 3 hours, which is kinda disappointing.", "Completing a half-marathon in any amount of time is an achievement and something to be proud of. Not to mention something most people would never even attempt.", "My goal is to travel the world 💕", "I'm having trouble with this, could you list some examples? I felt like a lot of my previous goals were just to please others or to boost my self esteem. It's hard to figure out a good goal that's \"for me.\"", "I'll give it a shot. \n\nI'm a CS Major, so my main goal is to be a better programmer. However, that's extremely vague, so I must be more specific. In what way do I want to be better? \n\nOne part might be becoming good at solving problems that require algorithms. That's a good sub-goal; you can measure it because if you solve enough independently, you'll find that more and more issues become more straightforward. Another goal might be building an application. It's not easy; many different technologies come into play. But again, you can measure your improvement since if you keep at it, you'll find yourself growing more competent and more comfortable with the process.\n\nMore generally, avoid setting vague goals without understanding what constitutes it. \"Self-improvement\" could mean many things, for example. One recommendation is to find one small part of your life that you're dissatisfied with, set some standard to measure your progress, and then improve along that standard. Do that for every sub-goal; then it grows into you improving overall.\n\nTL;DR: Find something you want to excel at purely because it hits home for you. Figure out a way to quantify your progress, then have at it. Often, pursuing a passion in depth will make you a better person overall.", "Half of your beauty comes from the way you speak and treat people.", "I quite literally just finished complimenting someone in another thread before coming here to be the first to comment. Being a blessing to others doesn’t just make their day better, it improves our own too. I just have to believe that if we increase the goodness and kindness in our own sphere of influence, we might just start something contagious.", "\"Most people won't remember what you said, as much as they'll remember how you made them feel.\" -country singer Braxton Hicks probably", "Beauty comes from within so I’d say all of it is how you speak and treat people, including yourself", "That's only the case if you're not just doing it because you're hoping to increase your 'beauty' in return. People like good people, but can see right through people who are doing it because they want something in return", "A lesson I teach my kids weekly as they let into kerfuffles with each other.", "So true:)", "very true", "Kindness is true beauty.", "But actually, being selfish and demanding your needs are met before you help anyone else is kind of the only way to succeed. You know how on a plane they tell you to put on your mask before helping others with theirs? Similar thing. To give, you first need to have.", "Only half.  That's a low bar to meet.", "Focus requires a goal.\n\nGoals give direction to your life.\n\nIf you don't have goals, you by definition can't focus, and you aren't aware that a distraction is a distraction.\n\n**You can't be distracted from a non-existent target.**", "This made me also think: you may have to prioritize other goals first before you achieve your initial goal. I’ve been wanting to get fit, like athlete level of fitness, but I’m having to focus on my sobriety first because there is absolutely no way I can achieve my first goal of athleticism if I’m not sober.", "Good luck to you. I believe you can do it.", "What if working out an athleticism helps you get sober? I don’t like getting lit before working out, so if I know I’m gonna work out, it puts a bit of pressure on me to wait to use ya know", "Maybe you have that backwards. I don’t work out, but why not just take a walk for one hour a day. Or maybe, if you smoke, walk while you do it. Or do jumping jacks… jk! That may be dangerous. but just get moving and maybe you’ll be more inspired to get sober. Let me know.", "I do too! Good luck mate", "Thank you, I appreciate your encouragement a lot.", "You’re right, both can go hand in hand. I can and am working on both goals simultaneously, but putting my primary focus on the sobriety part. I think what I was trying to say is there’s an issue if I’m focusing so much on getting fit while I have an entirely separate issue of falling into the trap with weed or alcohol (especially using it as a reward system, which I have in the past). I need to take care of the sobriety first and make that a priority before making the athleticism a priority. For me, weed and alcohol make me binge (a common symptom), and that totally fucks up my progress, and if I don’t address sobriety, then it’s going to become cyclical where I workout and get disappointing minimal results. I gotta break that chain to be successful.", "I support you and I hope for your success! ", "Yep, this is something I've figured as well. For something to be a distraction, it has to be distracting you from *something.* If you're not being distracted from anything, then it's not a distraction, it's just regular old automatic behaviour.", "With ADHD, everything is a distraction.", "Good point. If you are lucky enough to find a goal that is the actual passion of your soul you will automatically feel motivated (almost forced) to act. It's not easy to find such a passion though", "Family creates one for a whole lot of people. I've always been pretty focused, but never as much as my wife and kids have made me. Having them to take care of is about as strong a motivation as I could imagine.", "Oh yea! I can imagine that!", "or the goal is way too ambitious and out of reach..  \nusually theres no such thing when you break that down to achievable goals.. yearly, monthly, daily...", "I forget the saying, but it's something about you must have a destination before you can aim your sails. Unless you have a target to go to you're just sailing around in all directions. This is pointless and becomes very scary as you don't know where to go", "You also need a timeline within which you aim to achieve tour goal. But sticking to that timeline though? Give me all the tips you've got.", "Be realistic. You won't lose 50 kilo in a week.", "You're not focused on the goal because the goal doesn't interest you. Anybody can pick something out of the air and make it \"SMART\" but it doesn't interest you, you won't focus on it.", "I'd correct this to; you lack a *realistic* goal.\nIt's impossible to focus on what's not a realistic achievement. Nothing kills motivation faster than failing over and over from being too unrealistic. It can even feel traumatic depending on what the challenge is.", "You don’t lack a goal, you lack purpose \n\nYou don’t lack purpose, you lack belief\n\nYou don’t lack belief, you lack faith", "", "I have been craving a playlist in my life for ages, but lack the focus to sit down and think, “what songs do I like that I can remember” and it has always been a fruitless effort. \n\nThis has been the first playlist I’ve ever used/taken/made. Excited for the gym tonight. Thanks, fam.", "Thanks a million for posting this! This will keep me occupied for a month. Looks like plenty of music that is new to me!", "Thanks bro, always looking for good playlists for work and the gym 🤙", "Thanks bro, always looking for good playlists for work and the gym 🤙", "love it - thanks", "r/lostredditors", "r/redditorsthathaventfiguredoutyethowmuchmusicmatters\n\nFtfy", "Well that’s a dumb take lmfao. Next time just keep something that stupid to yourself", "Almost as dumb as your existence, bro, but I’m not questioning it. Go post some more reviews, that’ll sure help to stave off your misery. \n\nOoh ooh, Reddit gotcha! someone as a day job? Fatty’s your guy.", "😂😂", "Hello!\n\nThis has been week 12 of my 52 week-long attempt to document my progress, in order to be more conscientious with how I’m living my  year.\n\n# The good:\n\n* This week took another step toward crossing off a bucket list item of mine and booked a flying lesson. Just like entering the world of fashion, this is a daunting quest for me. I've always been fascinated with how people can dare to fly a plane. Are they superhuman?? I'll find out in a couple of weeks. Of course I'll just be a passenger for most of it, but apparently the teacher will let you take control for a bit. Wish me luck haha.\n* This week I've felt that I'm fully back in my studying groove. I'm still technically behind on a course, but I will get to it in due time. I'm just happy I didn't give up even though I'm struggling.\n* This week I finished a book called \"Deep Work\" by Cal Newport (a book/author I'm sure you've heard of). I enjoyed it enough to make sure to extract everything I got out of it and put it down on paper. I'm hoping I can systematically implement the ideas I captured in my notebook into my life. The notion of practicing focus is not a novel concept, but it sure could be executed better by most of us. I look forward to reading more of Newport's work, and I've also garnered a desire to read more specifically about polymaths and how they manage their time/interests.\n* I've been running a lot, but also realizing how nice a walk could be for thinking (inspired by the book!). I've also grown tired of fasted morning runs that make me bonk out at a third of my actual endurance potential 🙃 So this coming week I'll be switching it up and going for a brisk morning walk, and then squeezing in a run every other evening at minimum. Should be a lot more enjoyable.\n\n# The bad:\n\n* I didn't lift at all this week. I did complete some maintenance workouts with planks & push-ups, but I've just not found the time to focus on more training in between this crazy school schedule I have at the moment. At the same time, I'd hate to lose the little bit of muscle I've gained so far. Even though running is easier to motivate because I also get out of the house, I will try to do better next week.\n* I experienced a high amount of stress and anxiety. It's kind of inevitable when you feel overwhelmed by the work on your plate every day. Not much to do about it right now except hold out until summer break\n* I snoozed a lot, which I think might be a symptom of all the stress and just wanting to sleep more. Again, not much I can do about it right now. I just have to keep going to sleep on time and hoping that my body can recover enough to support the high-intensity period I'm currently in.\n\n# Conclusion:\n\nIn the spirit of Deep Work, I'll be using time-blocking to schedule all of next week. At least for the work day---the book also suggests scheduling what to do for your leisure time, which feels like more than I can chew at the moment. I'll just be focusing on making sure I always know what to do and that I'm not being distracted by cheap dopamine.\n\nI'll be reflecting more on what I can implement to start taking better control of my life, so I may be able to enjoy some recreational activities and not burn out. You can't change your life overnight, but I do think books like Deep Work provide good frameworks if you take the time to actually use what you've learned. We'll see.\n\nUntil next week!", "Hey as long as you are have a goal in your mind,  you're doing great! I believe in you", "I (23F) have been stuck in a rut for the past few months, and I’m starting to lose hope in everything. This has mostly been spurred by my job search. I do currently have a job but I hate it as it doesn’t pay well at all. I have been applying to jobs for months but have not even received a single interview.\n\nThis on top of just feeling super behind my peers has made me depressed. Everyone around me is in a stable relationship, in grad school, or has a good career. \n\nI don’t know how to get out of this rut. I do have goals and I do work hard towards them but to no avail. I just feel like a failure and an embarrassment. I don’t have anything going for me. \n\nI guess I would like some tips on how to feel motivated in life again. Everyday is a struggle to get out of bed bc lack of motivation for anything. ", "I think you hit on something that can help- all your friends have a this, that, and other….\nFind something you can control, train for a marathon, be the strongest person you know; volunteer for an organization you believe in; or better yet Play Dungeons and Dragons!!\n\nDepression is physiologically a downward spiral- this will spiral out of hand but see it for what it is- depression, nothing more.  Anywho- as a guy whose old, whose career is solid, whose kid is grown, all this stuff makes sense in the rear view mirror; just have faith and do you- the rest falls into place. \n\nLast thing- don’t define yourself on things you have no control over.  Ok amiga, good luck!", "Thank you for this!! I used to do sports and volunteer but I’ve forgotten abt all of that as this started.", "What really helped me when I learnt that doing my sports routine is not exhausting, it's more like re-charging my battery. \n\nI mean of course, right after it I'm tired and all that, but still happy I did it and in the long run my whole energy level just gets better.  \nAlso, I started going with going to the gym few years back and was able to more or less keep up the routine for years, but a life changer was the first time i started training martial arts (Muay thai to be more specific, but there's ofc a ton to chose from), can strongly recommend it to anyone giving it a try. It will literally help you fighting your way out of your rut :) Been only doing it for like 8 months now, but man this stuff will drive your dopamine and make you feel alive - even in the first sessions", "Woo happy to hear you found what works for you! I will def look into it as well", "Thank you!\n\nIf it helps to motivate yourself - I never had any interest in this kind of sport. Never watched boxing or whatever and had no idea what to expect\n\nHope you'll find what makes you happy!", "I'm truly sorry to hear you're feeling this way, but please know, you're not alone in these feelings, especially in today's world. It sounds like you're really tough on yourself, but it's important to recognize the effort you're putting in, even when the outcomes aren't what you hoped for. Job searching is particularly challenging and can take a toll on anyone's mental health and self-esteem.\n\nFirstly, try to remember that comparing ourselves to others often gives a skewed perception of their reality. Everyone moves at their own pace, and it’s perfectly okay to be in a different place than your peers.\n\nTo help break out of this rut:\n- **Shift your focus:** Instead of measuring success by job offers or relationship status, try to find value in personal growth and the small victories each day brings. Did you learn something new today? Did you make someone smile? These count.\n- **Set small, achievable goals:** Breaking your larger goals into smaller, manageable tasks can help build a sense of accomplishment and can gradually lead you towards where you want to be.\n- **Network and seek feedback:** Sometimes, getting into a new job requires a bit of networking. Reach out to professionals in your field on LinkedIn for informational interviews. Also, if possible, ask for feedback on your job applications or resume from mentors or professionals in the industry.\n- **Seek support:** Talk to friends or family about how you're feeling. Sometimes, just voicing your struggles can lighten your load. If you’re able, speaking to a therapist or counselor can provide tools to manage your feelings of depression and lack of motivation.\n- **Find what inspires you:** Whether it’s a hobby, exercise, or learning a new skill, find something that brings you joy and dedicate some time to it regularly. It can help shift your focus from what you feel you're lacking to what you're capable of creating or achieving.\n\nLastly, it’s okay to not have everything figured out at 23. Many people don’t have their lives fully on track at that age, despite what it may seem. Life is a journey with ups and downs, and it’s full of changes. You are not a failure; you are in the midst of overcoming a challenging chapter, and there's strength in that. Hang in there.", "Thank you this made me smile! I will remember these steps", "I'm really glad it brought a smile to your face! Remember, you're not alone, and taking one step at a time is perfectly okay. Wishing you strength and positivity on your journey. If you ever need a chat or a bit of encouragement, I'm here. Take care!", "Stop comparing yourself to others. I know it's easier said than done, but as long as you have a job and a rooftop over your head- you're doing better than some people.\n\nYou said you ''have goals''. Are those specific or general sense? Not having realistic goals, or actual steps to get them might be the issue.\n\nYou're 23. That's too young to lose hope.", "Thank you for your comment. Rereading the comments and my post I’m realizing that I am still young I have time. I think my goals are specific and realistic but these are long term goals. And not accomplishing the steps I need to achieve them is what’s getting to me", "Do you know what those steps are? like, if I give you a notepad, could you list them down?\n\nYou should do just that. Seeing them in front of you might get you to prioritise what is more possible at the moment. Also, think of an alternative option for each (for example- \"getting experience in\" can be by volunteering regularly somewhere).", "Good idea. I do not write stuff down. I need to start doing that", "So for reference, I'm 40M, so I've got a little hind sight here. I saw a quote recently that stuck with me. Someone was learning archery or something, and the instructor said, \"You're so focused on the target that you aren't paying attention to your own actions.\"\n\nAs others have said, turn your focus inward to things you can control and don't focus on the other people around you. Relationships have their own timeline. I know plenty of people who were in great relationships at your age who are picking up the pieces after their divorce now. I know others who are just getting into their first long-term relationship ever. \n\nCareers are the same way. A good friend of mine took a gamble on a new career in his late 30s and is now going back to school to go back to his previous choice in his 40s. \n\nI'll also say a few months in a rut is just super normal, and it's going to be part of your life. Now is a great time to experiment with different things to see what works.\n\nOkay, if you read this far, here are some practical ideas. Plan or go on a trip. Doesn't have to be expensive. Even a weekend road trip can shake your mind up and give your perspective. \n\nIf you aren't getting interviews, then you need to look at your resume. That is what gets you in the door. Really read the job descriptions and add keywords from the description to your resume and tailor it to the job. Even rearranging the order of things to match is a strong move. Along those lines, look and see if there is a class, skill, or certification you can knock out on these job descriptions. There may be some minimum requirement that you don't meet that you're missing. \n\nThe best relationship advice I can offer is to just focus on improving yourself and finding passions in life. The more things you are passionate about, the more likely you are to find someone to be passionate about those things with. Over the long run, those shares interests and experiences will be what help you and your partner to grow closer together rather than further apart. \n\nNow that you are a real life grown up you need to remember that life is a journey, pace yourself, try to learn patience, some of the greatest things I've done in my life have taken years to build up to. My biggest scariest most exciting pursuits have been two decades in the making.", "I love this quote. I’m always looking at what other people are doing and get nervous I’m not doing enough. Thank you for your wisdom!!", "I know this feeling very well. I am in a career that I can not stand. Despite the fact, I have a knack for starting businesses and it is something that I love to learn about. I just started my company and plan to do much better next year. This year will be tough but oh so worth it. That being said. Ruts come from inaction. I find that I do the best when I make simple goals and achieve them. As simple as it sounds setting up an acheivable weekly task sheet and crossing them off makes me feel best and like i am progressing at my own speed.", "That’s great to hear! I used to write things down and cross them off, but I stopped doing that for some reason. I’ll start again. Thanks for your comment!", "It gets better and takes time. Try to speak kindly to yourself and believe in your strong moments from the past where you did cool shit. Know the Rut is the low before you get to the high. Do things that make you happy and try to get out of bed and exercise first thing or do small things to validate your existence beyond this temporary job.", "Thank you! Things do take time I forget. I just need to keep trying", "Don’t fall victim to your own narrative fallacy. Understand that stories don’t actually exist as we think of them- as steadfast objective reality.\n\nhttps://fs.blog/narrative-fallacy/\n\nStart by deconstructing the story that you are a failure or falling behind. It’s a fiction based on real world events. Your life is not a story book with defined chapters, preplanned story arcs, and plotlines. Stories help and hinder us in understanding our world and ourselves. Historically, stories have helped civilizations remember culturally important information before the written language (facts and events are easier to remember when tied to narratives). Stories help structures of power control populations by reinforcing the values of that society. However, they are just stories. Think different. Be careful how you tell “the story about you” to yourself. This may require a therapist’s help.\n\nhttps://youtu.be/O_MQr4lHm0c?si=o3Xr9fsG8ZnzBWJU\n\nOnce you free yourself from the story you built around your life, figure out what to do next from that point. Take time to really consider what makes you tick and who you are. Is your life really about how you compare to other people based on wealth, employment, status, or other extrinsic values? Or is your life about your own intrinsic values as you grow, and build your authentic self? Start from a fresh foundation.", "Thank you for sharing these links and for the advice! I need to remember these", "Have you thought about setting up your own business?", "I have not. I’m not opposed to it, I just don’t have any ideas", "Unless you start a business or marry rich, you'll always be dependent on a job /employer and the eages they pay. If I were you, I'd be thinking about the things you care about in life. Is it health, leisure, agriculture, retail, real estate, education, or whatever, and then focus in that area only, and ideas will start flowing into your head, I promise.", "I only wish you knew that even having a job - any job - is a big deal for some people who are dysfunctional in their depression. Numbing anxiety keeps some from even applying for jobs because everything becomes an impossible risk and they function so irrationally. You are nothing like those people frozen in their limbos. You’ve got movement going for you, some movement … you aren’t as frozen as your mind makes it out to be.\n\nYou have a job, you have some experience under your belt &  you have tried applying for interviews - I really want you to know some people don’t have the balls to do all that. That’s a mountain to climb for some. what you and many others do on the daily is “ a lot” for the frozen folk. You’re better than that, you show up- there are people who can’t even “show up” to life.\n\nMaybe this won’t brighten some hope into your situation but I think if we are completely honest with ourselves - sometimes we will we see reality is a little tiny bit more gentler than we make it out to be. Yes, it is gloomy and the hurt spreads deep and doesn’t go but there are things I want you to pat yourself on the back on for because you’ve got to be honest and see the good in you too. Being fair w yourself is necessary if you want to track a proper course for your life. You’ve got my respect. Please respect yourself for what you’ve done.", "Thank you so much for this comment. I do need to remember to pat myself on the back for what I have accomplished this far", "I know what this is like and it's absolutely awful, it takes a lot of effort but I enjoy music and listen to it ALOT when I'm going thru shit. Mainly to hype me up every day and try to find something somewhat \"exciting\" each day to do or read or whatever. I'm sorry I don't have better advice 🌞", "Nice! That’s good you found something that works for you. I love music too", "Some basics that help me get out of my head. \n\nExercise, volunteer or try to help out other people in some way, stay busy, meditate. \n\nMotivation is hard because ya sometimes you feel motivated but a lot of times you don't so you can't just depend on feeling it. You just got to force yourself to get going with whatever it is you know you have to do and then after a while you actually generate motivation by seeing yourself doing things and getting stuff done.", "That’s so true. Getting motivation to do stuff is hard for me. But once I start it gives me momentum and extra dopamine. Just starting things have been sooo tough for me lately", "It's simply impossible to be \"super behind your peers\" at 23 years old. You are in a very privileged position: you are young. You have time, an invaluable resource that not even billionaires can buy. You can attend a new school right now and still come out of it young.\n\nBut...time can very easily be wasted. Not receiving job interviews mostly means that you need more education. Start getting new education and skills that are in demand. Not having a relationship it's simply normal at your age, but if you want one, you need some things: find gatherings where many people of your age go and get to know each other for real (not clubs or bars, try some volunteer work); get into your best physical shape; then you need just a bit of luck.\n\nGood luck !", "Thank you for the advice! I’ve been so much in my head I forget I still have time, but I’ve been losing it thinking that I am running out of time smhh", "I am 23M also in a rut for the last couple of months. I am in between jobs and just broke up with my gf. Hang in there, good times will come again. 🙌", "Thank you friend!", "Probably this is just the same advice as anyone else will give, but a combination of any or all of these have helped me across the years (in no particular order):\n\n- Walking / running / lifting weights\n- Eating better\n- Getting more/better sleep\n- Vitamin D supplements \n- Therapy\n- Antidepressants \n\nYou’re still super young. Keep at it, the world needs you.", "Thank you!! When I workout I do feel a lot better. Therapy should definitely be a next step for me", "Cool! Dunno if you have interest, but the year I ran a marathon really turned my mental health around. I don’t think I would do it again :-), but for almost a year, knowing it was coming up made me get out and run or ride a bike almost every day.", "I love that!! A few months ago I did a 5k for charity and was soooo happy I didn’t even care I only slept 4 hrs the night before. I forgot about the rush I felt that day. I def should get back into running", "You got to look at it as self love. Learn coping mechanisms when times get hard and reach out for support. \n\nOur Brains learn through pattern recognition. If you have bad habits you want to quit and you have good ones you need to start identifying what you want and what problems you have. \n\nJournaling therapy and the basics like good sleep, eating well and exercising are all ground for a good healthy foundation. \n\nAnytime I’d have bad thoughts I’d call them out or explore why I feel that way. Treat yourself like you would a loved one. If they messed up you wouldn’t be hard on them like you do yourself. \n\nUnlearn your bad habits. Build good new ones and look at it from the perspective of I want this. I love my self. I should do this for myself. \n\nMake sure to have a support system. I smoke weed a feel times to help with insomnia and had a few panic attacks. I’d get these thoughts, I’d investigate the fears they were coming from and some times I’d panic. So be careful what vices you are using as well to cope with your feelings. \n\nIf you end up having a panic attack remember to breathe deeply and that everything is going to be okay. They feel really intense in the moment but they will pass. This is why I think having a supportive environment is key. If you talk these out inside of tackling them alone you won’t panic but I don’t know for sure obviously. \n\nBe careful, do you best, only compare your current self to your past self. \n\nAny progress is good progress remember to celebrate that. Even as little as 1% is good.\n\nYou got this. You are loved. I have faith. I hope this helps.", "Thank you soooo much!! Yes this has helped. Just posting this and reading the comments my mood has improved. I’ve been holding onto my feelings with no outlet which has made my anxiety and depression worse. I need to find a new way to cope!", "Thanks so wonderful to hear! TikTok was big for helping me find content to help. \n\nI’ve also been using chatGPT for everything I need an answer too. Obviously you have to be cautious of what it tells you but 99% of the time it’s helpful. \n\nIt’s a good starting point. \n\nJust to give you an example, I had some left of breakfast food. I wanted to know the best way to heat up country fried steak and it told me I tried it and it worked. \n\nI’m sure if you asked it for coping mechanisms to deal with anxiety and depression it will help. Obviously cross verify with trusted sources too, but it’s an amazing help. The fact that it’s an app on your phone is priceless. \n\nI do want to say I did end up going to the doctors and I’m on anti depressants a generic form of Zoloft. They helped me a lot but you have ask yourself if they are worth it for you. \n\nThere are pros and cons, but they were my game changer. I’ve heard they can be difficult to come off of but I honestly don’t care if I have to take them the rest of my life considering how much better I feel compared to before and I am not a robot.\n\nBest of luck and much love and well wishes!", "Ooo I’ve never thought of using ChatGPT that way. And going to the doctor will probably be a good idea for me anyway since I have been feeling this way for a long time. Thank you!", "Np! 💜💜💜. I’m glad I could help 😊", "I wonder would you categorize yourself as a procrastinator? I found years ago when I stopped the procrastination cold turkey that my difficulty starting things pretty much fell to the wayside. This might sound synonymous, but for me I would procrastinate the easy things. Once I stopped doing this, it gave me momentum to tackle the more difficult things that really move the needle in life. \n\nAnother thing I did was start to break things down into smaller habits. Always had a rough time staying in the gym for more than a few months at a time. Decided that everyday I would do something active. Even if it was simply stretching for 15 minutes before bed. They say how you do anything is how you do everything.\nAs someone who only ever struggled with getting the ball rolling, this was a game changer for me.", "Fast & Pray…..and the invisible hand will create a way!", "ABC to help with motivation. If you end up in task paralysis, use this alphabet to snap out of it. That's how to get back your motivation. ", "What’s the social work room.", "This is probably a poster from a school. Some schools have Social Work rooms where a student do counseling with a social worker.", "Hmm not sure about that one. Maybe someone knows.", "Ahh, so seeing a therapist for us adults.", "Yea, that would be a good equivalent!", "Check on that one. ☑", "In my classroom we have a 3ft tall teddy bear named Teddy. He gets all the hugs!", "For a second I pictured this in a high school class which felt very sweet,  but on second thought you're a kindergarden teacher right?", "Nope! It’s high school. I thrifted the bear from my neighbor, gave it a bath and brought it to work. Sometimes all we need is a 3ft teddy bear to make us smile! 🤗", "No way! I absolutely love this.", "https://preview.redd.it/ca6sl6ux67qc1.jpeg?width=1284&format=pjpg&auto=webp&s=2d8c4f90fe4622b0d34b39984f275023a351a391\n\nI forget we can add photos 😹 Meet Teddy!", "Teddy even travels with us to competitions.\n\nhttps://preview.redd.it/iu9rhytn77qc1.jpeg?width=1284&format=pjpg&auto=webp&s=59b1b562a0728f993cd0400f01e324c5b5910b81", "This is the best news I've seen tonight! 😍\nHe's very charming", "While of course he's the maskot!", "a alcohol  \nb beer  \nc cocaine  \nd drink  \ne eat  \nf fuck  \ng gamble  \nh hentai  \n.....  \njk these are things you must not do..", "e and f don't have to be bad things tho, healthy snack, some proper (self)love, can both be good for the endorfines,", "i mean.. people tend to drown their sorrows by binge eating or fuckin whoever they shouldnt be fuckin.. but your point is also valid. but its rare.. because i is for indulge..", "I love Z, its just more Z, zzzzzzzzzzzz", "Yeah make sure you get them zzzzzzzzzzz", "I love these. My mental illness has gripped my life these days", "I'm glad you liked it too. I saved it from Pinterest when browsing mental health stuff. It is cute. Might print it out. You're not alone 😔 it's been a shitty period lately. But felt tiny bit more hopeful today so I wanted to use that to spread some support.", "My coping skills is just telling myself \"stop being a bitch\" and it's been 20yrs so far so good", ">hug a stuffed animal\n\nI have my dog stuffie trio in my apartment closet. I need to give them more love; they helped me so much when I was little.", "Yes they deserve an honorable VIP spot in your home!", "YELL INTO A PILLOW ... ^sleep", "Yes, that's exactly the order! 😂", "The fact that heavy ass weight lifting isn’t on here hurts my soul.", "You can use your imagination as taking a walk is exercising too and you can choose whatever exercise that fits you. I myself like body weight fitness and running.", "You right you right, my brother is a personal trainer and he lives and breathes body weight training and endurance runs. Both are great options!", "F should have been \"Fucks = 0 given\"", "If that motivates you, sure.", "BreathE, FFS", "I don't think I will care that much about E or not if I'm in an anxiety attack 😂", "L and R is bullshit.", "That's interesting. Couldn't disagree more. But you're supposed to choose those that works for you so why are you seeking up wrongs?", "Remember: Clearly defined goals serve as guiding beacons that illuminate the path towards success. They provide clarity, focus, and direction, helping individuals navigate through obstacles and challenges more effectively. When goals are specific, measurable, achievable, relevant, and time-bound (SMART), they become actionable targets that motivate and inspire action.\n", "None at all. I've never had a personal goal in my life. My strategy is to do whatever feels like the right thing at the time. For me, this is the best barometer of whether something is worth doing.", "I think goals are good for daily and weekly objectives, but other than that, I think it limits our potential for larger time frames. I would love to hear others thoughts.", "maybe swap Relevant with Realistic to keep your goals grounded.", "Depends.\n\nBad goal:  get healthy.  Better would be a set of SMART goals, even like moving more each day (and finding a way to measure that), or picking a series of exercises which increase the function of muscles you want better, whether that's flexibility or strength.  On the other hand, such tiny goals might not deliver what the person wants (to be skinny, to be happy, to look like x) and so success is not found (or not valued).\n\nFurthermore, in life, sometimes people see their achievements and retroactively claim that where they are now was the result of clearly defined goals.  Myself, I had, throughout my teens several \"clearly defined goals,\" which I \"worked toward.\"  I'm not doing any of those things now, 30 years later.  I'm doing something else, which was never THE clearly defined goal.  \n\nNevertheless, I'm happy where I am--as much as any human can reasonably expect.  I'm not convinced I would have been happier in the other pursuits which would have been much riskier and may have resulted in strain (or possibly a break) with my partner.  Who knows?  Maybe that's kind of sour grapes talking?", "Like  I said elsewhere,  you can clearly define a goal , make it as smart as you like, but you have to pick something you care about. If you don't care, it being smart won't drive you to achieve it.", "I'm going to be 26 this year and ultimately I feel like I have failed my past self. At this age I thought I would have a really great career because of my degree, but I got the degree two years ago and I haven't landed any work with it. I work a regular retail job. Honestly, I feel like the biggest nobody/loser. I started my own business to essentially \"create opportunities\" for myself, and I'm thinking of starting a youtube channel or podcast but I feel like what I do doesn't matter. I don't know how to make myself more marketable. I was thinking about going back to college. I've even looked at volunteer opportunities to put on my resume, and haven't found any. Overall I feel stuck at this point. I don't want the rest of my life to be like this forever. I want myself to be more impressive and accomplished. I have a dream in my head of what I want my life to be, and I know I need to get there. I just don't know how anymore. Anyone have suggestions?", "Please don’t take this as negativity, I mean this with the best intentions. \n\nThere is no “there”. You’ll be chasing “there” forever, as that point will always change the further you progress into your goals/ life changes ect. It also sounds like you’re confusing your dream with an expectation you set on yourself that you’re not meeting, just based off how you explain it. You have an expectation (dream) about where your life should be and you’re not “there” so you feel like you failed. Try not to be so hard on yourself! \n\nYou’re exploring different avenues and finding your path and that is the very essence of where “there” is. \n\nI totally get the frustration, it’s hard to see the bigger picture, especially at 26. In reality all the failures, wins, dead ends etc. all lead to where you’re going even if it seems like all you’re doing is spinning your wheels. You could have a breakthrough in a year and when the novelty wears off, you’re stuck again wondering where the next “there” is and it totally discounts all the work it took to get to that point.  Find joy in the every day, even when it sucks! You’re here right now, enjoy the process!", "Agreed. I thought of saying as a joke, just wait for your thirties rut and your forties rut. I think in general all ages have their challenges and that people at all age groups will forever often struggle with not feeling adequate or accomplished enough. Comparing yourself to others is not the way to go.", "Same 🤣 I was going to say the only way out of your 20’s rut is to hit your 30’s rut.\n\nI agree 100%. Surprise, we’re all inadequate and have no clue what the hells going on, so why not just enjoy the ride! Anyone that says they have it all figured out is lying…..unless someone knows something I don’t know 🤣l", "> the only way out of your 20’s rut is to hit your 30’s rut \n\nAs someone who is finally getting out of my 30s rut at 34, I wish I'd heard this way sooner.", "You're just in time for your late thirties rut!", "I'm actually trying to save up for a 40s double-rut.", "Good call, I can see that you are an advanced rutter", "Just go with the flow. Focus on living within your means and building savings. Comparison is the enemy of joy and the worst thing you can do for yourself is to not be patient and to chase instant gratification. \n\nIt’s good to be ambitious! Look for ways to grow your community and meet people in the field you want to work in. In the meantime, be patient on life and enjoy being 26 as much as you can.", "Dude. It took far longer for me, because of being immature, wrong decisions and the pandemic. I landed my first 'real' job at 32. My advice is, we can't do anything about it, just keep going forward.", "First and foremost, you’ve got to recognize the accomplishments you have at 26. Your perspective is everything.\n\n(My cousin is the same age as you, essentially homeless, dropped/failed out of school with no degree and a constantly toxic work environment at a restaurant as a dishwasher, oh and a drug/alcohol addict. )\n\nStart your days with gratitude, appreciate your accomplishments, and build from there. You have a fantastic foundation, most people don’t achieve one, or two for this matter by the time they are 26! \n\nYou didn’t fail your past self, you are failing your current self by feeling like you aren’t doing enough, or not being where you thought you’d be.\n\nDo the things you want to do, make the content you want to see. Focus on yourself and your worth, and building yourself into the person you want to be, one day at a time. If you keep at it, you’ll be where you want to be.\n\nLive as if you’ve already achieved what you wanted, and dream bigger.", "I'm very confused by some comments saying to build savings or implying he's earning a decent salary right now. I just assumed the retail job would be minimum wage or close to it. It's extremely difficult to save up money or \"hope for a raise\" when living paycheck to paycheck living as modestly as possible. I feel like a lot of those comments aren't considering the fact he could be poor?", "Pay no attention to that voice in your head evaluating and judging you.  Don’t think of all the right volunteer things or business things or improving your resume things that people say to do.  Is there anything you could do today that feels like it would be a part of that dream in your head.  If not, get a blank piece of paper and start transferring g that dream from your head into the concrete material world by writing or drawing it.  Make it real. Post that piece of paper on the inside of your main house  door to remind yourself every time you  go through that door to the outside world.", "You are not a loser.", "Not sure If this perspective works for everyone, but my impression is basically that your whole 20’s are all about trial and error and laying the groundwork for what’s to come.\n\nI’m 30 now and not finished with my degree, which is a bummer, but I’ve learned so much these past few years, about myself, different subjects, personal growth and life itself. The error part is obviously difficult to process, but it’s also a necessary part.\nI don’t think I would like to trade all that for anything (ofc there probably are exceptions but they would have to be hella impressive).\nI was one of the few in my circles that were excited to turn 30, and I hope in some time you will feel that way as well. \n\nMost people have high expectations when they’re younger about where they will be at 25, 28, 30 and so on. But from what I’ve seen at least, most won’t get there at that time. Or they will reach those goals “in time” and then realise that it’s no longer what they want from life, because this is a period when you change a lot even if you don’t see it when you’re in it.\n\nSo basically, you’re doing great 😌", "You need to write out that dream then. YouTube channel, podcast, your own business...it sounds like you have a lot of irons in the fire. You need to narrow it down and focus. Write out what it is you want, how/if it will sustain you, and work backwards through the steps to get there. It's not going to be perfect, and as you work your steps you'll need to change a lot of things. But that's growth, not failure. This is the only way. You have to make the choice to do it, otherwise you'll waste time daily waiting for it to happen. It never will by itself.", "A YT channel, podcast or business ..\nAll takes work and effort.\nDoing all 3 at the same time ?\nSounds like hard work keeping everything on the road at once.\n\nPeople need to realize there are 24h in a day, and when you're on your own, starting out, they might come up short.\nThe big channels (either YT or podcasts ) aren't one-man shows.\nMist of the time there is a form of support.\nI know a B tier YouTube channel, and while it seems he does it all alone, he has huge help from his wife and some friends putting it together.\nHe can be a B+ even up to a smaller A but has to commit and invest more to grow.\nI don't see him doing a podcast 'on the side' anytime soon.", "Start somewhere, move up from there. 60k job becomes a 64k job, 64k job becomes a 68k and hopefully you get promoted in 3-4 years \n\nIf you're not exceptional which most people aren't, realising this early is nice for the average person\n\nJust start somewhere regardless, build your work history up and have some money to feel safe", "OP it is never to late and sometimes it just takes time to rebuild or re-invent yourself. I went from $20 to my name at 24 and no job to an entry level 32K/year job at 25, 50K job at 27 and was making 175K by 35.", "This is great advice. I read something that said 90% of people think they are above average which is not realistic. Most of us are within 2 standard deviations of the mean and that's okay. It's so much less stressful to compare yourself to others. Improve yourself incrementally and set realistic goals. You will grow as a person, not always as fast as you want. Take it from a 41 year old man who already had 2 kids out of wedlock when I was your age. You still have time. Keep on trucking.", "Agree, just put one foot in front of the other and keep moving forward.", "How's he supposed to get a $60,000 job when he has worked in entry level retail for the past two years (most likely customer facing such as sales)?\n\nHis question is how does he land the $60k job. he's got the degree, now he wants the fake\n promise that was made, which was graduate college and you will get a good job. Total bullshit told by high school teachers and guidance counselor because they are all married to college professors.\n\nCollege is worthless unless you graduate from an Ivy League school. Save your money college is waste, unless you can get into Stanford MIT Harvard Yale or the other prestigious schools and no all those University of [enter any state name here] does not count, and online only degree mills really don't count.\n\nCollege is over priced and doesn't deliver what it was  supposed to. I want my tuition refund, where is the class action suit for breech of contract.", "what do you do", "Well that of course is based on where you live/ competitiveness of industry etc, it's funny because I did join customer service and entried for 64k, median is 56k [https://www.seek.com.au/career-advice/role/customer-service-representative-csr/salary/in-melbourne](https://www.seek.com.au/career-advice/role/customer-service-representative-csr/salary/in-melbourne)\n\nMost jobs would prefer a degree to enter the door but then you have to sell yourself in my city, either your loyalty or skill. \n\nI would assume you're American mentioning Harvard/ Yale so I've got no clue about your employment processes there but the same point stands I would imagine anywhere in the world\n\nDo you think you'll get a job complaining about not having one instead of going out and building up where you're capable of building?", "Do what you're passionate about, don't just try to survive. These are your best years.", "I needed this post today", "I’m 58 and haven’t gotten out of it yet.", "54, 40K/y and a (mostly) happy life.\nWe work, live and sleep.\nNo straining responsibility a 60K worker has, just show up and do what you do best :D", "Easy just wait till you are 30 and it gets even worse.", "You're 26. Lots of people think you're going to accomplish all these crazy things. The tiny 1% of professional athletes and geniuses are the only ones blowing it out of the water at 26. Just do what you want and stop stressing.", "26 is still young. I was in the exact same boat as you. I’m 40 now. \n\nWhen I was 26, it wss during the Great Recession of the late 00s/early 10s. I made like 40k back then and thought I was also a loser who would never amount to anything. Fast forward 15 years and now I make 600k and have a family with two wonderful kids, live in what I would consider my dream house and have a well funded retirement account for my wife and I. I couldn’t be any happier with the way life turned out now, looking back, my concerns of my life trajectory when I was younger is exactly what motivated \n\ndon’t beat yourself up too much and keep taking all steps forward. Make a goal for yourself to reach and keep working towards it. My mistake in my 20s was not having a real goal other than “make more money” which didn’t help give me any direction . \n\nI didn’t even really truly start my career until hitting 30 years old and suspect you’ll be in a similar boat :) the fact that you’re worried about your future is a good sign", "By removing the rut! 🙌\n\nI'm being serious here. It's only a rut you get stuck in if you put yourself in it. Step out of that paradigm, stop constructing that wall, that boundary, don't define yourself by being trying to be either this or that.\n\nAlternatively, accept and make peace with the fact that 1. every single step you take is bound to be a failure, until you get to the very last one. And 2. not a single person knows how many steps it'll take to get there; you won't know *when* or *how long* it will take to succeed until you have actually succeeded.", "If it makes you feel any better… in addition to what everyone else has said here, every time I have felt like this in my life, it was simply a “turning point”. Every time something shifts and it turns out for the better or I find a new hobby or a new direction to take, etc. \n\nIt could very much well be one of those moments. Try to pour into yourself some more. Pick one dream situation and write out your goals in a month, a quarter, a year or pick up something you used to enjoy. I don’t know why it works this way but it’ll eventually put you in the right place at the right time.", "Should is the biggest enemy of can. Focus on taking care of yourself and honning in on how you want to improve and lay out mini steps towards it. \n\nNothings impossible as long as you keep trying!", "It sounds like you're carrying quite a heavy burden right now, feeling stuck and distant from where you hoped you’d be. It’s natural to have these feelings, especially in our mid-twenties when we’re often surrounded by societal expectations and comparisons that can cloud our perception of success and personal growth.\n\nFirstly, it’s important to recognize that feeling like a ‘nobody’ or a ‘loser’ is a reflection of your current state of mind rather than a truth about your worth or potential. The journey from where you are to where you want to be starts with acknowledging your feelings but not letting them define you. Your value isn’t determined by your job title or the success of your business but by the qualities you bring to what you do and the lives you touch along the way.\n\nStarting your own business and contemplating a YouTube channel or podcast are signs of a proactive and creative spirit—qualities that are invaluable and can lead to fulfillment and success, though perhaps not always in the ways we initially envision. These ventures matter, as they reflect your initiative to shape your life and contribute to others'.\n\nConsidering further education or volunteer opportunities are both excellent ideas. Sometimes, the right volunteer opportunity takes time to find but keep looking, as it can be a rewarding way to gain experience, meet new people, and contribute to your community.\n\nIn terms of making yourself more marketable, reflect on the skills you enjoy using most and consider how they might align with different roles or industries. Networking, both online and in person, can also be a powerful tool. Reaching out to professionals in fields you’re interested in, attending workshops or webinars, and joining relevant online communities can provide insights and open doors to opportunities you might not have considered.\n\nLastly, it may help to break down your larger dream into smaller, achievable goals. What steps can you take this month, or even this week, that will bring you closer to your vision? Celebrate each small victory along the way—progress isn’t always linear, and every step forward is significant.\n\nRemember, it’s okay to seek support during this time. Whether it’s from friends, family, or a professional, talking about your experiences can provide comfort and clarity.\n\nYour path may not look exactly how you imagined at 26, and that’s okay. Life is a mosaic of experiences, some planned and some unexpected, that shape us into who we are meant to become. Trust in your ability to grow and adapt, and know that it’s never too late to redefine your journey.", "if you want to be more impressive and accomplished all you got to do is keep trying, and I see that you have been. Just keep going don't think too far ahead and overwhelm yourself.", "You're not alone. Heard this same thing so many times. Despite what economic indicators may say the REAL job market is tough as hell. People are employed but very few are employed in the job they want. Keep at it.", "If you have no kids or serious relationship, consider a job that allows you to travel, or move to another city where maybe you can see yourself for more than what you are. There is so much out there, explore it!", "Your thinking to broad and it's having the opposite effect you'd wish. Set achievable goals with somewhat flexible time lines.  Work towards that one goal and when you hit it set the next. Don't worry about what age you are that shit doesn't matter people develop differently.  Remember it's OK to want what other people have but it doesn't make you less awesome if you don't have it now or ever get there. \n\nRemember to keep your goals realistic and achievable. \n\nAlso remember that we're all a bunch of dumb asses  just flailing around trying to do our best. Surround yourself with people who you can have a mutually beneficial relationship with. You can provide them with something and they provide you with something. \n\nMost of all stay positive. You only get this one life. Celebrate what you achieve regardless of what it is and enjoy what you have without focusing on what you don't too much. Even if you have to fake this positivity eventually it'll be genuine. People love positive people so it'll also help with everything else in life.\n\nYou're doing fine, relax, this is a fucked up world we live in and the desire you have to improve yourself is great.  Stay positive friend. Being alive is pretty great.", "First, I think it would help to take a breather. Kind of sounds like you’re overwhelming yourself with a lot. You’re in your 20s, so you still have time to find purpose. What do you love doing? Actually try to think of what immediately makes you smile and motivates you. That’s what you should do. It’s really that easy. I like working with my hands and being creative, so I started a manufacturing business. Think honestly about what you want to do with your time; you can’t reverse the clock. You can do it!", "What is your degree in? If you really want to pursue that field, try to find an internship and learn as much as possible during that time. Spend extra time outside of the internship learning about the industry you are entering. When I first started as a med device engineer, I would ask my manager (while I was interning) for stuff to read so I could learn about the med device industry. I would read about anatomy and physiology, material science, med device regulations, everything I could to show that I wanted to be there. I wasn’t even sure at that time if I wanted to pursue that field, but skills sets you learn and read will benefit you no matter what field you enter, so just put the effort in.", "Start small. \n\nPick up one habit that you'd like to have. For example reading. \n\nAnd then write down that you're going to read for 30 mins tomorrow. \n\nAnd when you do finish it, write a few words of gratitude for yourself for finishing it. \n\nDo the same for 10 days and then add one more habit on top of it, for example you go buy a gym membership and then write going to the gym in your to-do list along with reading. \n\nAnd then thank yourself for both those things and then on and on. \n\nThis is what anyone needs to change their lives for good. \n\nWish you luck :) \n\nAnd checkout r/HighQualityLiving if you can.", "Dude you’re 26, your life really doesn’t even start for another few years. You started your own business to try it out. That’s more than most 26 year olds even consider doing. 26 is so young, and these days a 26 year old isn’t married w kids like they were 40 years ago. The world these days doesn’t expect you to move so fast. \n\nIf you’re chasing being impressive, you’re never gonna be happy. Focusing on being impressive means you’re focusing on what others like to see, what others like doesn’t make you happy. \n\nStart chasing fulfillment instead of chasing arbitrary positions you feel your life should be at. We all love different lives. \n\nHonestly, you should try and get a better job, than when you do, find something you’re passionate about and so that on the side. If it goes well, that thing you do on the side can eventually become your full time thing. \n\nThe reality is, you’re the only one who’s set your own expectations. No one around you is shitting on you for being 26 and not having every aspect of your life together. And if they are, they’re not worth listening to \n\nOn the flip, I got married and had a kid at 22, started my career at 19 and now at 33 I have a great career and stuff but I also missed out on my entire 20s bro. I’m happily divorced and I have money yet have no time. I moved so fast in my life that all the friends I had got left behind because we just weren’t mentally in the same place. And I still have my days where I feel like a failure. Where I feel hopeless and shit. So keep in mind, the career the job the money isn’t what makes you happy in the end. Completing goals won’t always fulfill you \n\nSo look for some fulfillment", "This may sound like generalized advice but I recommend a relocation. It took me moving across the country for my life to “take off”. It was scary and lonely but looking back, it was the best thing I could have ever done.", "Join the Navy and work in a nuclear plant.", "Go back to school and study something that requires a license or credential, physcian, many occupations in Healthcare, accounting, law, maybe finance. Otherwise you'll be lucky to be making more than $50K a year. If you got a english degree, art history, psychology... really all of them except a few financial careers, an attorney doctor nurse etc. You will be struggling. I have a MA and a BA, these degrees were basically  useless", "It's rigged, your only chance is to own your own business, even if small, if it makes enough to pay the bills it's 100 times better than trying to brown nose, lie, cheat, back stab your way up some corporate snake pit.", "Just wait. You'll get older. ", "Don't go with the flow, your not a bag in the wind, get your shit together ( whether that means to you ) and just do it.\n\n\nIf you don't, pretty soon your will be 30 thinking the same thing, then 40 and thinking the same thing, and so on.\n\n\nSo at least when your 30 you could think that your situation is in shit, but at least you tried x,y,z things. With any luck one of the things you will do will get you some success and you will forget all about it.\n\n\nIf you just go with the flow, get in a pattern of doing minimum wage jobs, you might get stuck in that pattern for a long time.", "Don't go back to college, you'll only dig yourself deeper (debts).\n\nYou wrote \"I have a dream in my head of what I want my life to be\" - what is that exactly? Are you speaking specifically, or very broad sense (\"I want to be successful\", \" I want to be recognized in the street\", \"own a sea shore house\", etc.).\n\nI don't think you're a failure - it sounds like you have a job that pays your bills and a rooftop over your head.", "Focus on family and a life worth living.", "I had a similar mid twenties. I was able to get into a sales job and super focused on that. I also was tired of the same friends so when anyone outside my friend group was doing something interesting I would try to tag along. I met my long term girlfriend through friends of friends. Hang in there.", "Join another degree,and this time learn skills.", "the wait will be worth it in the end!", "\n\nWorld has changed. You're doing fine.\n\nSome of the worst takes are mind boggling to me when people today push them on to us younger people.\n\nAt your age I had kids and worked for 7 years at the same company, had a house bullshit bullshit bullshiiiiii....\n\nNo. It's not the same. Not even 20 years ago was the same. Not even 10. This ad infested era is ridiculous. It sounds impossible that someone lives of off photoshopped pictures of their own ass. Then youtubers living off of kids being baited to click. Same dude being called a genius.\n\nThings are forming into some weird Wall-E adjacent where people are naive and scare easily. Trading healthy for the convenient.\n\nFor the past 4 months I was called a smackhead because I work hard at my physical job so I can get some workout out of it since gym was out of the question. Not to mention I get to flex on these snails and get positive attention from the girls. Those same people look like puddings and can't climb the stairs. Those same people think I'm weird for liking Shark Tank and American comedians (I'm in the EU surrounded by many nations at the workplace). And then they continue scrolling TikToks and smoke weed all day long.", "I’ve got ten years on you and feel the same way. You’ve got plenty of time", "Ill be 29 later this year... 2 years ago when I was 26 my cousin passed away, he was 28 at the time. \n\nBack then I was in that mid 20s rut, feeling lost and stuck in a never ending routine of waking up.. going to work .. coming home ... etc.. I was also getting annoyed and angry at such small things. but with his passing it just made me reevaluate everything, it made me realize how precious and short life is and that's ultimately what bought me out of the rut. I started being grateful for the little things like being able to have a hot shower, being able to get in my car and drive anywhere I want things like that. And now 2 years later my whole prospective on life has changed and I appreciate every little moment for what it is. \n\nDon't beat yourself up or feel like you are behind in life !! Just appreciate everything and be proud of yourself ! \n\nWhat helped me alot back then was going for walks, just 20 mins a day around sunset. The fresh air and beautiful skies really changed my mood", "Just know that you're still very young, it's not too late.\n\nI wish I was your age again, life goes by so fast, just try and make the most of it.", "I would look into getting a mentor or a coach for what is that you’re wanting to do with your life. I’ve read many books and listened to many podcasts and one thing many successful people had in commons was that they had a coach/mentor giving them advice on what they needed to do. However, just because you haven’t landed a job based on your degree, it doesn’t mean you’re a failure. You have much more to life ahead of you than you think. When I get in a rut, I think of people who became successful in life later on. Like Vera Wang who didn’t start making dresses till she was in her 40s I believe. So don’t count yourself out too quickly. You’ll get there :)", "Don't worry, life starts once you turn 27. Oh, and if you have a higher power to align yourself too.", "Wait a few years and it’ll be a new kind of rut", "Just wait until you get to 33", "This subreddit makes me realize there are SO many out there who place this “we are nobody/loser/failed-at-life” tag on themselves. I’m not saying people are delusional, yes you dissatisfaction is warranted  but it’s SO fucking widespread. I think we should not feel alone in misery any more. It’s a freakin community. \n\nI know some very successful people, who have come from scratch and become “rich rich” … visibly rich enough to be enviable but I still do not believe them when they say they feel they haven’t done enough - this man literally told me he feels he doesn’t feel like a big player at life - he feels he’s a big fish in a small pond and his success doesn’t read as “success” for him - he still doesn’t feel he’s there yet - yes he’s grateful and really enjoys his life so wholesomely - but he too is going after “there”.", "Maybe take a break form career work and pick up a hobby and exercise. Improving your life can come in many more forms than just career. Maybe by trying new things and meeting new people opportunities will come or you will have new ideas.\nAlso say present tense statements since future tense statements will never happen because the future will always be in the future but now is now. \nI am successful. My dream job comes to me. I work well with the skills I have. I am finding the job for me. I am well educated. I have the education I need for a good job. Be grateful for today. It’s ok to not be where you thought you would be. You are doing well. Sorry it’s really hard to be in the next stage in life. That is a really tricky one.", "I was exactly where you are at 26! I had a degree but worked in retail sales. All of my job applications got ghosted. I felt like a failure to my family, myself, and my future.\n\nI'm 36 now and earn six figures in a job I love! I caught up with missed retriment contributions, and am proud of what I do.\n\nI reinvented my life at 28. You can definitely do it at 26! What's your degree in? What are you doing for work right now?", "I can’t tell you how in the last 10 years I’ve gone from being in a career rut to chasing my dreams to living my dreams, to seeing my dreams get crushed, to getting my soul crushed to being content, but being okay with that! …for now.\n\nUnfortunately, life just doesn’t work so linear and so many things are out of your own control. Focus on networking, creating opportunities for yourself, and surrounding yourself with the right people.\n\nLife is 90% timing and 10% execution. Being in the right place at the right time and just being cognizant enough to make the right decision when that time comes.", "I am 59 years old and I am pursuing my ABSN right now. This is my fourth degree and a new career. \nYou are very young and it seems like you expect yourself to be further along? First, be kind in your life’s journey. I recommend on an annual basis setting short term and long term goals. Give yourself time to dream and vision what you truly want. \nFocus on breaking down your goals into manageable steps. Give yourself rewards along the way. Most importantly, remember life is not a race. Embrace your authentic self and surround yourself with good friends and family. You got this!", "Learn mindfulness", "The economy is really rough right now. I have a master's in Bioinformatics with a 4.0, and I am struggling also.\n\nI am really praying for things to improve.\n\nThere are places to gain more skills. EdX and Coursera were a big help to me. I an good with Excel and want to develop that skill further.", "Find a passion, and dedicate yourself to it, passion creates opportunities, opportunities always exist, but passion is what helps you see what you want, I thought I’d be better for myself too, And I struggled for a really long time, but nothing really clicked until I found my passion, something I enjoyed working every spare moment to achieve, find something you love and do it till you love being good at it, then put yourself out there and opportunities will find you", "Those thoughts and feelings are depression. You can get a physical and talk to a doctor for help.\n\nA natural way to combat depression is through diet, exercise and positive mental exercise. \n\nMake a schedule for yourself include work, projects, housework, food prep and eating, yardwork. Kind of make a list of everything you need to do, want to do and  get a loose itinerary. \n\nDownload a positive affirmation app. Write down positive choices, accomplishments and goals then post them around your work space, fridge, bedroom or bathroom. \n\nWrite down a list of goals that you are working towards. Then make a list of achievable steps that you can follow. Work it into you daily schedule. \n\nDO NOT put yourself down. If you have made a mistake forgive yourself, think how to not continue that mistake,  make a plan on how you will act the next time.\n\nPretend that you are cheering on a friend, what advice would you give them? People are often their own worse critics. Get out of your own way, accept that you will not succeed in every single thing. Can you learn from this failure and move on? If yes then it's not really a failure, it's a step closer to your goal.", "I needed this thread", "You and I are the same age, the best advice I can give is to pull yourself up by your bootstraps. The best way to Market yourself is to go on LinkedIn, it’s by far the best place to network. \n\nThere’s a lot of comments that say to live within your means which you should absolutely do. But if you’re looking for success, then the hustle doesn’t stop unfortunately. Even if you find a career that has nothing to do with your degree you should pursue it. And you don’t even need to find a career that ties to your degree, if you’d did that would be great but cast a wider net to find opportunities", "Wait five years and then you can be in your early 30’s rut :)", "Don’t give up, continue to apply for positions you went to school for, college counseling office could have connections to employers in your field, don’t give up", "I’m going to tell you something important: at 29, you’ll be doing this even worse. You’ll be looking at where you are, comparing that to where you thought you’d be and generally wondering where it all went. \n\nBut 30? 30 is awesome. You have a whole decade ahead of you. And by the time you are 39, you run out of F’s to give so 40 is fantastic. \n\n29 is literally the worst year. Don’t let being late 20’s get you down. Strive, sure, but also try to let go of expectations and just enjoy where you are right now. The most important lessons are letting go of expectations (comparison is the thief of joy, as they say), and to stop worrying what others think of you - most of the time they aren’t thinking anything, and those who are, don’t matter.\n\nOh… and DO ALL THE THINGS! As you age your obligations and responsibilities will make it harder to go out and do exciting stuff, so as much as you think you aren’t able to do much right now, trust me, you are! Take trips, even if cheap ones, volunteer for stuff, take classes, do all the things you can. And these things you do can lead you interesting places in other aspects of your life (just don’t form any expectations about what, because it’ll take the joy out of it)", "Get used to disappointment!", "https://youtu.be/Jta4tx2ZbkI?si=ZqXCDJiXjz8HbzW2", "Find a girl (or boy but women tend to be better at domesticating you).\n\nI was late 20s working in a below median salary position despite having a master's degree. Found myself just playing video games all evening except for two activities I did (I'm being vague as I'm always aware of doxxing). I was just complacent and didn't really push myself. Never dated anyone, virgin etc.\n\nNow nearly 10 years later. Married, house (inheritance helped but the two of us had significant savings as well), 3 children, 1.5x average salary.\n\nAnything is possible if you have a push.", "Wait until your 40 and the girl you thought would be your love for life wants a divorce after 20 yrs together and 12 yrs married with 2 kids.. \n\nThat sucks.. \n\nBut just so what you like and try finding a meaning with your presence and life. \n\nI will do everything for me and my 2 kids from now on. \n\nI got real angry for the first time at my soon ex-wife 2 days ago.. I don't give shit about that, it's mostly her problem. She always got mad etc. Have punched me twice and I have never touched her like that, now she feels how I have felt alot of times, being scared, nothing i ever wanted but she is a egotistical douche. \n\nFollow your dream and keep fighting, you will never know the winning if you just give up. \n\nI know i will do everything to succeed even though i will lose more times then succeeding! \n\nYou have to start somewhere. 😌 \n\nPs. Sorry about rant about my soon ex-wife, but that is my story. Ds.", "If you have a job you are doing better than most. The layoffs since 2021 have destroyed much of our generation and corpo still has boomer mindsets with their 40 yo. PMs and Directors where they view laid off workers as damaged goods never rehirable unless you meet some DEI standards. \n\nA lot of the illegal immigration has also come after many of the entry level roles and put a strain on taxpayers so don’t expect things to get better for citizens. \n\nIt’s all about who you know, the lower and middle class always work hard and have demonstrated ability to work hard.. it’s the passive income fks who are virtue signaling away from the truth", "Illegal anything can’t get a job at least not in the books taking minimum wage jobs away \n\nYour worried about things that can’t happen", "A boomer (Baby Boomer) was born in the period after wwii (1945 -1960) a \"40 yr\" is not a boomer and was born in 1983, this is a Millennial. Called Millennial b/c they came into adulthood in the new mellinium (2000). So please stop calling folks over 40 boomers. Boomers are closing in on 80 and usualy identify with things that happened in the 1960s. People in their 40s and 50s weren't alive for much or any of the 1960s. A 40 y.o. likly listened to nirvana and soundgarden in Jr High and his dad was a \"boomer\" just an FYI as alot of people tend to think anyone over 40 is a boomer, not right. It goes: greatest gen, baby boomer, generation X, mellinials, and Gen Z ( the first generation to be completely exposed to internet/smart phones since early childhood or birth-yikes)", "Of course everyone has a bleeding heart for people who are breaking laws others commit with honesty. I have a few illegal friends and they have either arrived 3 different ways. legally then became illegal, came through DACA, and illegal crossing and taking 25-30/hr entry level jobs at small businesses.", "You are hung up on the wrong semantics, boomer is being used as an adjective here to describe a specific mindset. The point of mentioning 40 is that he has the mindset of someone who is now in his 60s."]