[{"post_title": "[Discussion] How do I stop feeling anxious and scared?", "post_url": "https://www.reddit.com/r/GetMotivated/comments/1bys7tr/discussion_how_do_i_stop_feeling_anxious_and/", "post_main_text": "Hoping to have some kind ears and eyes grace my post.\n\nI've been in a weird headspace lately because of my job.   \nFor some context, I'm an Executive Assistant with 6 years of experience, I also dabble with digital marketing and content creation but I'm semi-freelance now, so I'm in the payroll of some company who looks for clients for me and I do the work and get paid.   \nIt was good at the start; I was paid above what I asked for and I enjoyed the flexibility but since the incident this past February, I've been having troubles. \n\n&#x200B;\n\nThe company gave me 2 part-time clients, both work in the special needs and parenting field.   \nClient 1's main task was uploading blogs to her site, but under this, I also have to humanise her AI-written blog, make it SEO friendly, create a graphic for it.   \nI could do all these in a week but according to her, it should only take me an hour because humanising AI content is easy and making her blog SEO friendly will only take a quick Google search.   \nI understood her concern, however, I struggled with the task because she didn't provide me tools to edit her content according to her needs.   \nI did look for free alternatives, but these software/tools don't really perform that well. I even offered to shoulder half the payment, but she insisted that a ''quick Google search'' will humanise her content and make it SEO friendly.\n\nClient 2 then had me create Instagram Reels and Facebook graphics using her branding and guidelines, however, every time I submitted a draft to her, she would complain: saying the fonts were unreadable, the colours don't go well etc.   \nThing is, I always test out my designs before submitting them to my clients and I followed her instructions.   \n\n\nNow both of them ended their contract with me, but this incident has made me feel inadequate.   \nI understand that these things are part of most jobs, but I've never had problems with previous clients like this.   \n\n\nWhile the company is still gracious in covering for me should the clients not pay, this has caused me some stress because it has made me fall behind my bills and other necessities.   \nI know I have to look for another job/company but I feel so anxious, insecure, and scared to start.", "post_comments": [{"comment_author": "Final_Philosopher914", "comment_text": "You should focus on your strengths to become more confident. Networking is also very helpful. Connect with people on LinkedIn or attend some events to get acquainted with new people."}, {"comment_author": "FewWillingness1081", "comment_text": "Identify the source, identify the resolution, perform small tasks to resolving the situation. \n\n  \nCheck this out by Jeff Bezos: [https://www.youtube.com/watch?v=SQHmeRIhNtw](https://www.youtube.com/watch?v=SQHmeRIhNtw)"}, {"comment_author": "shiftyT08", "comment_text": "Identifying the source is the hardest part. I still don't know if I've found it. Any tips on that?"}, {"comment_author": "FewWillingness1081", "comment_text": "I would get a journal and write down in list form everything that \\[seems\\] to be bothering you. \n\nRight or wrong, you're clearing out brain space."}]}, {"post_title": "[text] how do you start to love yourself and be happy", "post_url": "https://www.reddit.com/r/GetMotivated/comments/1by7ajt/text_how_do_you_start_to_love_yourself_and_be/", "post_main_text": "I am 34+. Thought I found someone to marry but he broke up with me few days ago after a year making me feel like I am not good enough. He is already talking to another girl.\n\nI am more angry than sad that I believed him and thought he loved me as I loved him. I am still in love with him. \n\nI have strong feelings and I love him but now I wanna take next few months to only focus on myself. I go to gym and eat less junk but I am not feeling good about myself. My self confidence is gone. I hate myself ", "post_comments": [{"comment_author": "TomatilloDramatic270", "comment_text": "My husband just left me after eighteen years because I had been working on myself in therapy and taking better care of myself for the past year.  He didn't like that I had more confidence and motivation, or- paradoxically- that I was treating him better.  He immediately went back to his ex-girlfriend from high school, with whom he had had a tremendously unhealthy relationship for a year when he was 17.\n\nThe decisions that other people make very often have nothing to do with us and everything to do with what they're not ready to confront in themselves.  Your ex was not ready to commit to a particular future version of himself.  That tells you nothing about your worth or value.\n\nGoing to the gym can be a great way to focus and get some positive emotional experience, but be patient with yourself, too.  What you've just gone through borders on traumatic. If you can't afford therapy, try to find a support group (either in person or online) to help you work through some of your feelings and figure out who you want to become moving forward.  All the best.❤️"}, {"comment_author": "ricardo9505", "comment_text": "What a great way to tackle the issue and recognize the greater forces at work beyond your control. And so quickly!"}, {"comment_author": "_CW", "comment_text": "This is such a phenomenal response.  I wish we could all do life like this.  Thank you so much!"}, {"comment_author": "wheremydisstrackat", "comment_text": "Came across this thread and comment randomly and can’t thank you enough for posting this, I needed it today. 🫂"}, {"comment_author": "ConstableDiffusion", "comment_text": "Stranger than fiction"}, {"comment_author": "TomatilloDramatic270", "comment_text": "It was a long time coming, so I had some time to mentally prepare for the possibility, even though I wasn't certain.  \n\nTherapy made a huge difference.  It helped me see both where our relationship was unhealthy, and how I was contributing.  Once I started really working on my behaviors, becoming more stable, and trying to be a better partner, my ex got uncomfortable, and then reverted back to an earlier relationship pattern that felt familiar, if insecure. It's incredibly sad, for both of us, but I think I accepted a couple months ago that it wasn't healthy for me to stay in maladaptive patterns, even if that meant being rejected for trying to get better."}, {"comment_author": "ValeriaNotJoking", "comment_text": "I’m deeply sorry that such a long relationship has come to an end. And I hope that it was for your best. But man! how does one go back to a gf who they supposedly broke up with 18 years ago!🫠😳 Those should be people on different planets by now…"}, {"comment_author": "ricardo9505", "comment_text": "Yes I come from an old fashion family that didn't buy into therapy and it has helped me immensely in life, accessing it when I realize life is getting out of control or I'm losing myself."}, {"comment_author": "DeliveryWench", "comment_text": "My ex boyfriend wanted to date after 6 years had gone by. It felt strange but I went with it and 6 months later he went back to his wife whom he was supposed to be divorcing so I’m completely alone again. I’ll be okay but man talk about a downward spiral this situation put me in. I always said I would never touch a married man (sigh)."}, {"comment_author": "Striking_Space9309", "comment_text": "Check out on book called “Mirror Work” by Louise Hay. Also I suggest stop talking to your ex and unfollow on all social media, at least while you get over your heartbreak. Nothing good ever comes out of being “friends” with exes in the middle of grief."}, {"comment_author": "Sad-Abrocoma-1446", "comment_text": ">Mirror Work” by Louise Hay\n\nThanks I just bought the book."}, {"comment_author": "Even-Boysenberry-127", "comment_text": "“You Can Heal Your Life,” by Louise Hay is the beginning."}, {"comment_author": "CapitanP1ngaL0c4", "comment_text": "\" I wanna take next few months to only focus on myself. Go to gym and eat less junk\"\n\nThis is a great place to start. Some days will be easier than others. Just remember to keep pushing. Push through, the pain, the self doubt, and eventually, you'll push the old you right outta the way. \n\nGood luck"}, {"comment_author": "Holiday_Scratch_3570", "comment_text": "It sounds stupid, but every morning and evening, when you are in the bath getting ready, look in the mirror and smile at yourself. And tell you loud. I love myself. \nBelieve me, this will help boost your self-esteem"}, {"comment_author": "YoureMyUniverse", "comment_text": "It really does!!! It feels silly and I end up laughing or maybe cringing for a sec but I’ve stopped and replaced that with admiration.\nCause in truth, your mind is conditioned by repetition, and hearing and remembering to actively be kind and love yourself is something everyone should never stop doing 💕"}, {"comment_author": "TomatilloDramatic270", "comment_text": "I love this idea so much. Great suggestion."}, {"comment_author": "Holiday_Scratch_3570", "comment_text": "That's right. In truth, it's all about conditioning yourself"}, {"comment_author": "AdJaded8589", "comment_text": "Same situation as you. I started to love myself by treating myself better. I travelled solo and stayed in beach shores to talk to myself and let my heart understand what happened and how I dodged the bullet of almost marrying a cheater. \n\nI know that your love for him is still there, there will be nights where sudden punches of memories strike through but you have to fight for it and remind yourself over and over why you deserve better. I am still healing since two years from the cheating incidence. Things will get better. I promise!"}, {"comment_author": "woolencadaver", "comment_text": "In order to love yourself you have to respect yourself. You need to make boundaries, stop picking people who are bad for you. Follow your passions. Stand up for yourself. Stop using drugs that don't suit you. Take care of people who need it (volunteer for an hour, don't pick a useless boyfriend).  Do the single most important thing - THERAPY GO TO THERAPY. Self care. Go to the gym, track your progress. Do something creative. Build your friendships."}, {"comment_author": "Gellix", "comment_text": "This is gonna be long but it kind of has to be. \n\nI’ve been so depressed for so long I was begging for death multiple times throughout my life. I’d been sad since I was a child. 2024 was the first year I started it off the happiest I’ve ever felt. \n\nI do want to say I have no idea if this will work for others like it did me. \n\nSelf love. You have to train your brain to love yourself. Our brains learn through pattern recognition.\n\nNothing else matters. Nothing validates you but who you are and the person you want to be. That’s it. Let go and forgive yourself of all your past mistakes. They don’t matter, they are only going to hold you back. \n\nDo not compare yourself to anyone but your past. That’s the only person you are competing with. No one else! \n\nStart by building a foundation of self love. Start getting 7 to 9 hours of sleep everyday. Eat as healthy as you can, and try to get 150 mins of exercise a week. Anything else you can think of that you want to do but may not have the energy **SELF LOVE**. You have skincare routine but you aren’t feeling it well you love yourself so you should probably do it. Start setting reminders in your phone to build these good habits if you have too. \n\nJournaling everyday. Start and do it until you can see it’s helping but you can’t stop until you feel it’s not helpful anymore. \n\nWrite about how your days went. Anything interesting in the news. Talk about how you are feeling. If you are having any kind of bad thoughts write them down and get them off your chest and out of your mind (this will help when you go to sleep). Any thoughts, anxiety, or fears right them down and break down where they are potentially coming from. \n\nThis will give you a good time line to go back and see how far you’ve come. \n\nI’d highly recommend therapy. It teaches you the skills to better understand and cope with your feelings. It reminds you to be kind and patient with yourself. \n\nIf a friend came to you for support you would try to relieve their stress however you could. You wouldn’t pile on. You need to start doing this for yourself. \n\nAny time you have a bad thought. You need to call it out for what it is. A bad thought, that’s it. I would call them out and laugh at my brain. I’d call it a doomer. I would then think about all the good things in my life. It can be literally anything. I’d also repeat “Thank you for the blessings.” \n\nI use to say “Thank you for the blessings now and in the future.” But it felt redundant after a while but it’s good to have this in mind. Teach your brain to look for the positives. \n\nI kept a little knickknack for me it was my lucky rock. It could be anything. Who doesn’t want a little more luck in life? Anytime something good would happen. An easy day at work, a funny coincidence, anything it was because of my lucky rock! \n\nRemember to be patient with yourself. Don’t turn Wins (Ws) into Loses (Ls). Any progress is positive progress. If you make a mistake forgive yourself and try again. \n\nHave a support system. This is really important. I was having insomnia. I started to smoke weed to help me sleep. \n\nHowever, I noticed I was crying more when I would watch media while stoned. I thought that was interesting. So I started to critically think about it. Why is this happening? \n\nWell TikTok had videos that made me consider a while back I might have ADHD. So, I wondered if the marijuana was breaking through the ADHD filter and letting me emotionally connect better to stories. \n\nThis really helped me understand my brain and all these little things I’ve been experiencing started to make so much more sense. \n\nI’m most likely undiagnosed ADHD and high functioning autistic. Idk for sure but it just kind of makes sense with my lived experiences. \n\nAnother reason you need to have a good support system is when I’d smoke. Depending on the situation I’d some times get those same bad thoughts. \n\nI’d critically think why I was feeling that way. I’d try to break it down. Well an unfortunate side effect of being high can lead to enlightenment but it can also lead to panic attacks. That’s how deep some of these fears, anxiety, and insecurities can be. In my experience all of these stem from trauma, it can even be childhood trauma. \n\nI fought through them by myself and came out better every time. They can be really intense in the moment. That’s why I suggest if you start to break down these thoughts you need a support system. \n\nSomeone you can talk to and if you break down, they will be there to pick you up. Idk, if this will happen to others but I want to mention it just in case. \n\nThis is why I recommend being careful what vices you use to cope with your emotions. They might help but they can also hurt you and your progress. \n\nI started at 18 and it took me losing 100 pounds to gain the confidence to kind of be okay with myself. \n\nIt took until 25 to go to the doctor and talk about my depression and going to therapy for 8 months. \n\nIt took until 29, smoking to see I might have ADHD and understanding my brain, breaking down my fears, to find my happiness. \n\nThe beautiful part is I know I’m truly happy because I gained all the weight back during the pandemic but I feel so mentally stable, confident and clear. \n\nI’m slowly working on losing the weight and trying to figure what to do next. \n\nI hope this helps. You are worthy of love and happiness. Don’t let anyone tell you differently, even yourself. \n\nWe can’t grow and mature if life doesn’t challenge us. We **won’t** grow and mature if we don’t challenge ourselves. \n\nTry to be as kind, patient and understanding to yourself and others. If you have any hate in your heart try your best to let it go. \n\nIf you are not sure what to do,  ask yourself what would JC do. If you are not religious, what would your favorite superhero do? Some other examples are Aang from ATLA,  Bob Ross, or Mister Roger’s. \n\nFind your happiness!"}, {"comment_author": "Formal_Ferret2801", "comment_text": "You need to go back to the source of You, and try to understand your inner child more. Trust me. U need to hug the younger version of you, whether it’s you from yesterday or your childhood. The more you find out that You are the seed that keeps growing, the more you’ll accept and enjoy that growth. But, Sometimes you just have to BE, before becoming anything else. And my advise to start that off FIRST…is to Breathe. \n\nBe present. You got this in the bag❤️ trust yourself."}, {"comment_author": "SouthernSock", "comment_text": "Do what you want all the time. Wanna travel? Save up and go travel. Wanna get a good job? Study for it. Want to be good looking? Have a godo barber, get braces, workout meticulously etc. Cant afford it? Study, save, work more, save smarter. This is what i have done all my life. Sometimes it was hard to make it work but eventually you get there, never doubt your self. You learn so much along the way and you will be so happy and love yourself. Depending on where you live some things will come easier. For example im blessed by free university and free braces through taxes since i live in Sweden in the US its harder unless you rich. But if you want it work for it!"}, {"comment_author": "LeatherLatexSteel", "comment_text": "Like everything it's difficult for a while and then gets easier, like all kinds of loss and change. But things do get better and you look back on them from a happier place and they really don't matter any more.\n\nThinking of you."}, {"comment_author": "Direct_Holiday_9464", "comment_text": "Good job...stay focused 🩷"}, {"comment_author": "Castper", "comment_text": "Lots of weekly therapy has helped me. Moved somewhere new for a fresh start. My ex up and left me for another guy and she made me feel like I meant absolutely nothing to her after 2 years of being together. No warning, nothing. Just dropped outta the blue like I was nothing. Spent a lot of nights getting blackout drunk because of it and it finally got to a point where I realized that I needed help. Been in therapy ever since and have stayed sober too. Finding myself again, feeling better, but not all days are good ones. I’m just happy that I didn’t end up killing myself from all the drinking I put myself through. Life moves on, whether you want it too or not. I still care about her… but I don’t know really know to what capacity anymore"}, {"comment_author": "mizzzaly", "comment_text": "My ex broke up with me last week and it fueled my drive to really push myself at the gym, get healthier spiritually and mentally and create my own happiness again. \n\nThis week has been the best week of my life. \n\nIt’s been hard. It’s been weird. But it’s been absolutely magical. I’m grateful for it actually, cuz he just catapulted me into a timeline where I can focus on simply becoming the best version of me. Im never looking back now. \n\nIf you want a friend, feel free to dm me. I’ve been meditating, journaling, being active, and only surrounding myself with people that can return the energy instead of requiring me to pour out of an empty cup. Always looking for likeminded people. Cuz it gets better. So much better. And a lot quicker than you might think when you return that time and energy into yourself and what’s best for YOU. 🤍"}, {"comment_author": "ExtraRezzy", "comment_text": "Start working out and start with small goals. The more you accomplish achievements the more you trust yourself. Also set boundaries for yourself and other so you don't get taken advantage of and vice versa.  After a month of doing this tell me how ya feel."}, {"comment_author": "pass_nthru", "comment_text": "stop looking for reasons to be loved, but for the barriers to being loved you have put up yourself"}, {"comment_author": "lanjevinson23", "comment_text": "Time heals things. For now, treat yourself with the same love that you would give to a partner. So just really take care of yourself mentally, spiritually, and physically. Once you’re feeling better, you will attract better energy because you’re working on feeling whole again. I wish you the best 💜"}, {"comment_author": "Devilish_Swan", "comment_text": "First thing's first : deal with the anger and the pain. \n\nIt can take a few weeks, or it can take a few years. But until you get those feelings in check, nothing else will happen. \n\nUntil then, keep living life. The kind of pain you're feeling will linger. But it will gradually dissipate. One day, you'll realize that those feelings won't be occupying your life as much. That's when you'll know you're on the right track. \n\nAs far as loving yourself is concerned, start with the basics and just take care of yourself. The acts of taking care of yourself throughout any given day are the things that build up over time that no one can take away from you. \n\nP.s. don't seek try to fill any voids with someone else."}, {"comment_author": "WeirdandWonderful_TO", "comment_text": "That dude is trash. You’re a queen. Focus on yourself. Loving yourself is hard. I am working on that too. Take small steps. \n\nStart with looking at yourself in the mirror and saying positive affirmations out loud. Do this daily in the beginning of your day. \n\nWrite down 3 things you like about yourself and 3 things you are grateful for each night. \n\nRead more on self care and self love \n\nBe kind to yourself. You deserve good things."}, {"comment_author": "Ready_Trifle_9594", "comment_text": "Long live freedom, live the life you want"}, {"comment_author": "CitiBoy95", "comment_text": "Hey bestie, I am 28M, and at 25, I went through a really tough breakup, and after many trials and errors, what has worked for me has been been just studying myself and working on myself from what I learn, and then treating myself as if I am in third person.\n\nExample: I know I love a good cheesy chipotle burrito on rainy days, so when it's a rainy day, I say \"Oh AD should get his burrito before it starts raining.\" and then I set a reminder on my phone as if it's an errand. I treat self-care and self-love as an errand/chore/duty/responsibilty/whatever you wanna call it.\n\nThat's the same with my skincare, my timely haircuts, making my bed, cleaning my room. I do it for myself, but in the moment I am detached to the feeling of enjoying it, and then I really enjoy it at the moment when I get to. I treat groceries as if it's a duty to make sure whoever opens the fridge will be happy, but then it's really me who is going to cherish my ice cream. I sit and make my car ride playlist as if I am trying to impress someone, but it really is for myself to jam to. I dress myself as if I want to make sure that this body looks good for whoever sees me. \n\nYOU START LOVING YOURSELF WHEN YOU START **TREATING** YOURSELF LIKE SOMEONE YOU ARE IN LOVE WITH. \n\n\n\nThat...is just what works for me."}, {"comment_author": "peachee007", "comment_text": "Well done!  He’s in your rearview mirror for a reason - he doesn’t deserve you!  It is hard to lose someone you love but you’re strong and you’ve got this. Sending you hugs!"}, {"comment_author": "Evil_Poptart", "comment_text": "Some things I’ve learned over the last few decades: Find your truth, own your good & bad experiences, and trust your energy."}, {"comment_author": "rollinfun", "comment_text": "You can only control your thoughts feelings and actions.  Find yourself and the next relationship should be supportive of YOU!  NEXT is how you should begin to look at it!  So many loose themselves in a relationship.  Be YOU"}, {"comment_author": "Relative_Orchid_1590", "comment_text": "How long does it take?"}, {"comment_author": "rollinfun", "comment_text": "It varies on personality and how intentional you focus on improving You!"}, {"comment_author": "VoiceOk1981", "comment_text": "i found God two years ago, and my view of love started to change. I began to realize and understand what love truly is, how i deserve that love, and how to extend it to others. it’s a journey of confronting and transforming and healing, but after gating myself since i was a child and being sewerslider since i was 11 yrs old, God is the one thing that has actually worked for me!"}, {"comment_author": "simofort", "comment_text": "what does it mean love yourself !"}, {"comment_author": "10mbSan", "comment_text": "Yo, I got you. 35m, just went through the same thing after 7 years, minus the sudden moving on or like new arm candy. Which is kind of a signifier of immaturity: that’s what seven year olds say btw “I’m mature”. In my opinion, you’re fixated too much on the great parts of having a partner, and I agree there are many really. But that doesn’t make them right, hence compromises and how many. It’s why a lot of them do fall out. When you can get back to how you thought when maybe you had a real crush or lived in innocence, to where you probably had interests but they weren’t on your radar. Who you were to achieve that one person, whether you ever did or not. And just how you accelerated outside of any of those things, you’ll be solid. Still love my ex, no doubt. But she likes to make dip shit moves IMO, I’m way on the up n up really. So I hope she comes around, if not I should still find the love of my life. I’m so rad anymore, it may just be myself. But for real, all these absolute symps need to keep cuddling up or pursuing as a sense of and to… there crack fiends and it shows because they stunt their growth, tax their inaction and actively use others for satisfaction which is fleeting. Dating doesn’t have to work that way, most things of value are readily attained. Really they’re just throwing away their time, and most kind of forgot how to enjoy a lot of naturally great things because the lifestyle that goes along with so much of it. I’ve played it all a time or ten, I’ve lost myself to others caring more, almost exclusively. Don’t let that river sweep you away and nearly drown in it.  99% of modern flex is literally just insecurity and or stupid money agendas. I couldn’t give 2 cents for almost a single damn thing this culture throws are me anymore. Just take care of yourself. My unique position maybe, I’ve only been single 1 year out of the last 13, not many partners either in there. The heartbreak has been real.  That said, I took an active year not to bring any of that baggage and drop it in another person like I don’t have any or they can help fix me. And in doing so I’ve found something that is generally intangible for throw away fuck around culture, and it seems to show. Toppling that has been nice. Now I just don’t care, if it happens it happens, if it doesn’t, shorty should have definitely tried harder lol. Their loss, go to bed happy tonight, wake up happy tomorrow.  More worried about my head n my heart and relating that. And in my history, I do pretty good finding pretty girls, but if they come around as 7s or 8s, they’re usually walking away 10s but those points drop too. I’m out here beating aging so meh lol anyway, just forget the crap, dating apps, playing games to check boxes, partner count braggadocio. Go for no competition and you’ll be doing good. That’s my opinion"}, {"comment_author": "Excellent-Estimate21", "comment_text": "Therapy"}, {"comment_author": "ptlimits", "comment_text": "I see the therapy suggestions and I agree. It can be pricey though so i also highly recommend guided meditation. It helps you process, gain mindfulness, and teaches you tricks on how to maintain your thoughts etc. I love the headspace app but found I can get free stuff on YouTube no problem. Here is one I like especially:\n\nhttps://youtu.be/yirSgDsNfQI?si=7v0PmW4UvPX51Lt8"}, {"comment_author": "Lotus_Moon", "comment_text": "Something that helped me in the past is someone saying,\n\n“Its not the first time you loved someone and therefore it wont be the last”\n\nMaybe take few months to do things that you could not while you were in relationship with that person such as spontaneous travel or going events that you otherwise could not, just dint try to put yourself “out-there” for the sake off it just because he moved on, because you will just have regrets when you realise that you’re not ready and feel like crap. \n\nDo thinks at your own pace, but work on yourself.\n\nWhen i had a tough time i found travelling for extended period of time to help me find what i enjoy and otherwise restarting my hobbies and in the end i ended up being more happy.\n\nAlso dont look at the time together as wasted time but rather take what you learned and concentrate on those points so you dont make same mistakes in next relationship.\n\nWhat else can i say, try things that you dont like perhaps, i make it a point to try things i though i dislike every 5 years, be it food or activities, i found once i grew older and my experiences in life changed some of the things i tried in the past that i did not enjoy I suddenly started to like them, some others i still did not but it was fun to try “new” things again."}, {"comment_author": "originalsanitizer", "comment_text": "Cognitive behavior therapy has done wonders for my family. I'm sorry you're going through this."}, {"comment_author": "DogwoodSally", "comment_text": "Volunteering and giving your energy to others instead can be a really nice process. It helps me process a lot of stuff and is a great way to connect with new people and the benefits to yourself and your community and endless. Take care"}, {"comment_author": "zeemode", "comment_text": "You are good enough. And you are not alone in how you feel after this scenario …  This book helped me after my wife left me\nFor someone: http://www.ignaciodarnaude.com/espiritualismo/Ruiz,Toltec%20wisdom%20book,The%20four%20agreements.pdf"}, {"comment_author": "SignedMarie23", "comment_text": "I'm in a similar situation, just got dumped by someone who decided he wasn't in love with me after almost 3 years. I've started going to the gym and eating healthier, but what has helped the most is going to therapy every week and relying on my friends. Your friends will truly show you how it feels to be loved even when we may be feeling unlovable. "}, {"comment_author": "Blondly22", "comment_text": "I’m kinda in the same boat……"}, {"comment_author": "No_File1467", "comment_text": "I believe that to love yourself you've got to look for the cause of your sadness and the reason why you don't love yourself. I've had a similar issue where I didn't feel love unless it came from someone else, it's not something you can force someone to do, and if they don't love you it will hurt but you've got no other choice but to keep going. \n\nThere are better times coming your way, keep working on yourself and with time you'll come to realize that loving yourself will bring in a person who will love you just the way you are. \n\nI personally started to work on myself by working out what was wrong, I thought I didn't look good so I decided to ditch that mentality and start to look at myself in a different light, as they say \"fake it till you make it\" and in the end I can say that I don't mind that I'm somewhat plump because I'm fine just the way I am. \n\nAll you really need is to be patient and kind to yourself, trust me, it will all feel better once you get to that point, but all I can say to conclude is to stay strong and keep pushing, eventually with patience you'll feel better and better, time heals most if not all wounds."}, {"comment_author": "def-jam", "comment_text": "If you figure this out, please let me know !  I could use this in. My life as well!  \n\nBe well. I wish you all the best."}, {"comment_author": "Time-2-Chat", "comment_text": "Some simple advice: Find people who have similar interests as you. Try to set your own expectations rather than what you think others want you to do and accomplish in life. Be ok with crying. Remember that everyone has flaws, and know that most people are just hiding how insecure they are or how uninformed they are (so don't think you are the only one who has these challenges). Think of things you are grateful for, and try to find new things to be grateful for each day. Excercise (even just a walk outside). \n\nCheck how you feel after using social media, listening to news, or watching influencers, and limit your exposure or adjust what you watch if you are getting a continuous exposure of negativity. You can get addicted to following people who make you feel like a failure, feel afraid of the future, feel hatred towards everyone else, feel like the world is too messed up to fix, etc.\n\nRemember that happiness isn't a finish line to achieve once, and then everything will be easy. You will always have feelings of sadness, fear, awkwardness, stupidity, failure, etc. no matter what you do. Learning to use these experiences to learn, grow, and have more compassion for others gives us the ability to go through life, accepting that these emotions are unavoidable. \n\n*Important: All this is easier said than done! I don't think anyone is perfect at every skill and technique to find purpose, meaning, and happiness. These are just some tips I have implemented and have gotten better at with varying degrees of progress. It's OK if progress is slow. If one or more technique doesn't work, that's ok! You are awesome for wanting to learn!"}, {"comment_author": "ChainLC", "comment_text": "that self-doubt is with us all. it will try to tear you down. tell you you're not good enough. but we have a positive side of ourselves that is stronger. it gives hope. just listen to it. both will always be with you. but you have the ultimate power to decide which to listen to. His loss, your gain. You were never meant to go through life with someone who doesn't appreciate you. He's out there. Waiting for you. Just look around and don't settle for less. You deserve the best."}, {"comment_author": "DigitalIlI", "comment_text": "From your words it sounds like you genuinely believe he betrayed you. It’s hard to tell if that’s the case because you say you love him. If he didn’t make you feel like you were good enough to be with you for a year and then betrayed you, why would you ask other people how to be happy? You sound extremely conflicted. \n\nFind out if you love this guy or not. Think back on how he treats you and if the good genuinely outweighs the bad and he’s not a narcissist like you’re saying, then find out how you would want to proceed with that in mind. \n\nIf he was genuinely treating you badly then you need to think about how you would want to deal with that too. Personally I’d cut all contact and heal the only way you can. With time and independence and trying your best to divert your focus onto building something else"}, {"comment_author": "lilacbananas23", "comment_text": "Self care. Focus on doing things for yourself. Listen to your body and your mind. Take hot baths. Keep going to the gym. Learn something new. Celebrate yourself. Take time to grieve but keep moving."}, {"comment_author": "broman243", "comment_text": "Somehow you gotta go to therapy and consistent with it."}, {"comment_author": "biggestlies", "comment_text": "Life sucks sometimes. Be kind to yourself right now. You deserve it."}, {"comment_author": "tolacid", "comment_text": "Remember that there is nothing you have done to be unworthy of love. Him falling out of love with you is not your fault. \n\nThis hurts. This sucks. That is right, and it is a sign that you have lived well. Never forget the love you have in your heart, and trust that you will find a place for it again in time.\n\nFor now, focus on finding your new normal. It will take time. It will be painful. You will be okay.\n\nEven now, in this moment, you can be okay if you remember that you are dealing with loss. Loss hurts, and hurting is right, and that's okay. You will find your new normal, and this will still ache, and that will be okay.\n\nI've been divorced, I remarried with my soulmate, and after a decade together I lost her last October. I have a lot of experience with loss, so trust me when I say this. It is horrible, it hurts, it's hard, and that's right, and it's okay, and you can survive it, and you will find normal again, and you will find your way, and you will make it back to where you can love again. You will be okay.\n\nRight now that's all you need to focus on. Make your way to okay. And if this advice resonates with you, you can always DM me if you need someone to talk things out with. I'm happy to listen."}, {"comment_author": "Kung_Fu_Kracker", "comment_text": "Meditation- just ten minutes.. or five minutes. Hell, two minutes is better than none. When seeking to love oneself, it helps to know oneself.\n\nAffirmations- written on a mirror you look in every day:\n\nI love myself\n\nI trust myself\n\nI honor myself\n\nI value myself\n\nAnd any other (positive) affirmations you'd like to add. \n\nRead them aloud at least once a day. You're going to feel silly about it at first. You're going to feel like you're lying at first. Don't worry about it. Keep reading them. You're programming your subconscious mind. It will sink in with time.\n\n\nTherapy- a lot of your negative feelings are coming from the trauma of being rejected by someone you're still in love with. You need to process and navigate those emotions or they will consume you. \n\nThe book \"Letting Go\" by David R. Hawkins is a book that I recommend to everyone, but especially to you for this situation."}, {"comment_author": "clumseykey", "comment_text": "You should try going on a healing journey to heal from the emotions of the relationship. Go to a wellness retreat or even do something like get your chakra read to find balance to reorient yourself, even though that is a pseudo science.\n\nYou’ll meet someone who’ll appreciate you."}, {"comment_author": "Pure-for-life", "comment_text": "Sorry to hear that, it’ll be okay one day ❤️"}, {"comment_author": "DefendTheStar88x", "comment_text": "Give yourself some time to heal and create a good routine for yourself. Over time, the positive feelings about yourself will rise. Relationships ending always suck especially as we get deeper into adulthood, and they seem serious and intentioned. I know it's hard to have perspective this soon but you will come to realize that you're better off bc you didn't commit yourself to someone unworthy of you and what you have to offer. Best of luck."}, {"comment_author": "yuvaap", "comment_text": "Oh, i'm so sorry you're going through this. breakups are really hard, and it’s totally normal to feel a mix of anger and sadness. but it’s great you want to focus on yourself. that’s the first step towards healing and self-love.  \nStarting with the gym and eating healthier is fantastic. these are powerful ways to show yourself love through action. maybe try adding some mindfulness or yoga? it’s not just about physical strength but finding peace within. and remember, self-love is also about the words we say to ourselves. try to catch those moments of self-criticism and replace them with kindness, like you would for a friend.  \nJournaling can be a powerful tool, too. It helps process feelings and affirm what you love about yourself. and it’s okay if it feels small at first. loving yourself is a journey, not a destination.  \nfun fact: did you know that plants can boost your mood? maybe caring for a new plant could symbolize your growth and self-care journey. What's something small you could do today that feels like a hug to yourself?"}, {"comment_author": "rainkitty00", "comment_text": "You will get there eventually. My ex-fiancé literally bombarded me with comments and criticism. From \"oh, you don't look beautiful but maybe a bit pretty\" to \"oh, you have no boobs.\" Like anything and everything to destroy my self-esteem. I just stopped thinking on a surface level, to be honest. I started thinking of every non-shallow thing about me. I am smart, I am very independent, I care about things, and I am kind. So the initial step was to disconnect my self-worth from beauty, etc. But then I grew older, and the wounds healed. I know I am sexy and hot now. It will take time. Journaling helps too, and avoiding negative social media."}, {"comment_author": "Melissa19807", "comment_text": "Never hate yourself, it will take time. Focus on yourself, getting fitter, feeling better and when you start feeling better you  can start looking straight in the mirror and actually say, or think, GOD I FEEL GOOD, AND BEGIN LIKING WHO YOU SEE IN THE MIRROR! It is the absolute best feeling.  Trust me!"}, {"comment_author": "Ryduce22", "comment_text": "Seems to me that you really have no self, and we're seeking to forge your identity and self worth through another person.\n\n\nYou should be grateful and happy. Your bf made the right move and saved you both from disaster.\n\n\nYou need to spend time alone and actually cultivate a self. Then you will be happy and love that person. If you could actually get to the point where you are very happy alone, you would invite and choose better partners and probably obtain that which you seek. Instead you likely fling yourself at anything that validates your lack of real self and try to create the identity off that(Johnny's girl, power couple, now I love life, etc.) You are trying to create relationship then self when you need to create self then relationship.\n\n\nI hope this doesn't come across as harsh, but you would probably greatly benefit from therapy. You have a very fixable problem but you just have to put the work in to become a person you love. If you don't/can't love yourself, then why would anyone else want to??"}, {"comment_author": "Character_Branch9740", "comment_text": "I’m a 37 year old man who basically has gone through very similar as you, just the other way around. My biggest piece of advice is to take some time to self, reflect and meditate and find out what exactly you hate about yourself. I get the vibe that you don't hate yourself truly but there are probably things in your life that you need to change to make yourself happy and live up to your own standards.  \n\nIt's not an easy thing to do but the moment you start doing it the better. if you need someone to talk to feel free to hit me up. I hope things get better."}, {"comment_author": "Maximum_Prior_777", "comment_text": "Read the Bible and pray ❤️"}, {"comment_author": "Far_Information_9613", "comment_text": "If you are a perfect perfect apple, or wizened apple, with spots, or worms, it would still take a lot for someone who liked apples to leave you for a peach. But the bottom line is that the you need to appreciate apples because you are in the land of trash wine. 🙂"}, {"comment_author": "Biggiesmalls_____", "comment_text": "Take a trip. Go to Thailand or Bali or something and forget about that loser"}, {"comment_author": "BarTPL0", "comment_text": "Find love when you are 2x. \nWhen you are 3x its to late."}, {"comment_author": "Real_Project2563", "comment_text": "\"Mens sana in corpore sano\". Get in your best physical shape starting right now and be smart in seeking a new partner as soon as possible. Don't waste months with the nonsense of loving yourself, the human brain is wired to only be happy with a partner and within a family, everything else is against nature. Acknowledge that your relationship is over and move on. Don't search for potential partners on social media but in the real world, go to places where a lot of people of your age and interests are present, like doing some volunteer work within an NGO. You are young, but don't waste the time thinking of someone that already talks to another girl, such a man cannot be allowed to steal your time because time is invaluable."}, {"comment_author": "No-Difficulty-5163", "comment_text": "I just smile. It makes me happy."}, {"comment_author": "Lethal1211", "comment_text": "Not possible, you'll go into a shopping addiction and one problem leads to the next and you gotta pick up an addiction to cure the last one. Otherwise just go for a donut and walk on a regular basis and get a haircut that doesn't look like pubes bundled on your head :)"}, {"comment_author": "sporesatemygoldfish", "comment_text": "You need to find God."}, {"comment_author": "shane_sp", "comment_text": "The whole world is looking for ways to love themselves which is why the world looks the way it does. When we do this, we're always wonderful and everyone else is always hideous. And in this way life is always something that is being done to us rather than some we ourselves bring about. To overcome that, stop looking for ways to love yourself, because it's a fantasy. Instead, seek ownership of all the ways that you're a shitty person. Take serious inventory and own it. Don't walk around saying \"look at all these bad things happening to ME\". Instead, realize all of the bad things you do to other people. Own your shittiness, and then maybe work on ways to overcome it."}]}, {"post_title": "Anxiety Around Starting A Task; ADHD [Discussion]", "post_url": "https://www.reddit.com/r/GetMotivated/comments/1byadt5/anxiety_around_starting_a_task_adhd_discussion/", "post_main_text": "I would really appreciate some help regarding my partner, please. It’s like watching somebody drown in slow motion. I wonder if there’s any hope.\nHe has ADHD and I’ve seen him struggle to initiate* critical projects.\n\nIt seems like he ignores things that are only going to get worse with time (e.g. the fact that he needs to move his mom to an assisted-living facility and sell her house).\n\nWhat doesn’t seem to help:\n- asking about the projects \n- asking where he thinks the best place to start on a project would be\n- asking what would help motivate him\n- labeling these projects as scary and discussing the anxiety\n- asking him to find therapy or a support group for ADHD\n- reminding him I’m available if he needs any support with the projects (he doesn’t start them with or without my support)\n\nI get the response, “you’re not telling me anything I don’t already know. I’m feeling very anxious now.” And no progress is made.\n\nI guess what I’m asking for is somebody who knows how to support somebody with ADHD who has problems initiating projects: online discussion groups, books, articles, a person who can talk to him from a shared perspective.\n\n*corrected spelling", "post_comments": [{"comment_author": "trjayke", "comment_text": "God I relate so much with your partner and I just want to thank you for persisting, they are lucky to have you."}, {"comment_author": "evilsidnz", "comment_text": "Yeh a huge thanks from someone from the otherside. Doesn't help the question but the two biggest things that have helped me and my ADHD over all was getting on meds and having a amazingly supportive wife."}, {"comment_author": "MrPatrick1207", "comment_text": "As a guy with ADHD, if i haven't taken medication no amount of therapy tools can get me to start a task until it is absolutely necessary to start (and the consequences for not doing it are severe enough), no matter how i contextualize it or think through it. Starting medication after highschool transformed my life in a way I didn't realize was possible, it's not laziness, it's a physical ailment. \n\nThat being said, even though i dont necessarily need or want to get things done with another person helping, having another person there to start the task with me can allow for me to continue the momentum and finish. And I don't mean just moral support or a mere physical presence, if someone wants to help me with something i really need them to effectively be an equal participant (at the start), in whatever way is reasonable depending on the task. \n\nAlso, if a task isnt completed in the same \"session\" that its started, or if there isnt a concrete plan for the next session working on it, it will leave my mind completely. I don't even consider it procrastination, it's much more like the thing I'm meant to be thinking about ceases to exist. I wouldn't say I get anxious about starting things, in a sense it's like asking someone to grow wings and fly, I can try as hard as I want but it's like the muscle for it just isn't there."}, {"comment_author": "Eetabeetay", "comment_text": "Can I ask what medication? The ones I've tried were like Ritalin and they just make me hyperfocus on stuff. Never really helped me with the secondary ADHD symptoms which seem to affect me more than the attention piece of it. I also tried I think some non-stimulant one once but I had a really bad reaction to it."}, {"comment_author": "MrPatrick1207", "comment_text": "I started out with adderall (10mg) but stopped that a few years ago and now take vyvanse (30mg) which i like far more since it takes effect over a longer period of time. I only actually \"feel\" it for around an hour or so in the morning, the rest of the day i just feel like I assume a normally functioning person would feel. I feel like i'm anle to just decide to start or stop doing things without agonizing over it, and it improves my short term memory an incredible amount (it stops most of the constant rambling thoughts). I never had much of the emotional volatility issues that I've heard can be related to adhd, but I would say that vyvanse gets rid of any depression I have, which is usually caused by feeling unable to do almost anything otherwise.\n\nI would say it started working much better once I started going back to the gym, fixing my sleep schedule, and eating better, none of which help any of my focus or memory issues on their own, but certainly reduced the negative side effects of the stimulants for me."}, {"comment_author": "3shotsb4breakfast", "comment_text": "Do some research into pathological demand avoidance. There are different ways to approach a task that make it seem not so task-y. Particularly if you are asking your partner to do something.\n\nOur brains are wired to not be motivated until there is either urgency or fun. Or if we are helping someone by Doing The Thing.\n\nIt ain't dope if there ain't no dopamine."}, {"comment_author": "ilivalkyw", "comment_text": "This. I'm ADHD and something has to be obviously urgent for me to even bother caring about it. I've found, that if i set myself fake deadlines that don't exist, i can fake urgency in my head. If it's monday and something doesn't need to get done until friday, i convince myself it needs to be done tmrw...and then i panic finish it on Monday, and just shelf it until friday. If i don't do that, it's getting started and done on friday."}, {"comment_author": "TroubleHeliXX", "comment_text": "This speaks to what I’ve seen demonstrated by my partner. The bare minimum always seems to get done. Also he has complemented me on the various strategies I used to “trick“ myself into doing things. Thank you both so much for your insights!"}, {"comment_author": "3shotsb4breakfast", "comment_text": "I might add it can help some people to have someone doing the task with them, or a simultaneous task, or even just sitting in the room as a form of moral support. It's called parallel play, and it tends to cross over into motivation for some autistic people, as well. Nagging or being judgemental, however, will have the opposite effect.\n\nBreaking tasks into smaller sections can be effective as well. We tend to get overwhelmed because we look at it as a whole and each step looms higher and higher. Nobody likes to climb a bunch of stairs.\n\nFor example: \"clean the house\" may consist of taking out the trash, wiping down the ceiling fans, dusting the shelves, putting back a bunch of books or movies, sweeping, mopping, doing the dishes. But it's all just \"clean the house\" and it can be hard to find a starting point when all you see is a messy house."}, {"comment_author": "majorinbirdlaw", "comment_text": "He needs meds, sorry. I was this person for at least the last 10 years. Have had ADHD symptoms since 3rd grade, has gotten progressively worse as I've aged to the point where I couldnt do anything. I had no idea that anxiety and depression were part of ADHD as well. Just got diagnosed at 36 and Adderall has changed my life in almost every way from the first dose."}, {"comment_author": "TwoTinyTrees", "comment_text": "Man, I read this and I keep trying to get diagnosed, but the psychiatrist I see will not prescribe anything because I drink casually on a weekly basis. It’s so frustrating because I know it would help me, but I also want to enjoy a beer from time to time. Did you have this issue? Is Adderall really life changing?"}, {"comment_author": "TroubleHeliXX", "comment_text": "Is it not recommended to drink on Adderall? My partner is on Adderall and drinks beer daily."}, {"comment_author": "jkca1", "comment_text": "My daughter has many of the symptoms you describe. I have find that the entirety of projects gives her analysis paralysis. However, if a project can be broken up into very small tasks there is a much better chance of success.\n\nFor example, asking her to clean her room is the road to failure. Asking her to clean off one dresser has a much better chance of success."}, {"comment_author": "Marepoppin", "comment_text": "There’s a strategy called the Smallest Possible Step that can work. Like I can’t just clean the house but I unpack the dishwasher I’m likely going to do the whole kitchen and then I might be on a roll. Or not. But I’ve done something.\nFor the assisted living issue it might be googling facilities in the area. The next step might be contacting the top 2 with you. It might be calling his mum and talking to her about it. He’s probably afraid of making the wrong choice as he hasn’t had to make this choice before. He doesn’t know what ‘done’ looks like. \n\nThe strategy of having a support person is called body doubling and it allows us to bounce ideas off and ask for help with next steps. As a bonus it’s a good opportunity for the BD to get some of their tasks done too. \n\nCompletely agree with seeking medical support though. No amount of strategies can make me do a darn thing if I’m unmedicated."}, {"comment_author": "mediumcheese01", "comment_text": "I was never able to get over this without medication"}, {"comment_author": "giola971", "comment_text": "Follow"}, {"comment_author": "ejmd", "comment_text": "Start doing it — tell him you've found some old people's homes (just pick two or three from the phone book) and that you are taking him to visit them at the weekend to start the process of getting the old girl out of the house. \n\nArrange for an estate agent to visit the property for a valuation at a time you know he can attend, then tell him you've arranged a valuation of the old girl's drum, and you'll drive there and back on the day."}, {"comment_author": "realjoeydood", "comment_text": "People are either:\n\n*Motivated towards reward* OR *Motivated away from punishment*.\n\nThere's your answer, from someone with both childhood and adult diagnosis."}, {"comment_author": "namersrockandroll", "comment_text": " *intimidate critical projects.* I'm guessing your fingers meant initiate? 😉\n\nI've been procrastinating on a lawsuit where the statute of limitations was running out. I have asked my friend who has the same management degree to 'manage' me and the tasks to get this done. She gave me one hour one day. I did more than that but then she went out of town and I retreated back into nothingness. I expect her to call me today and I'm going to ask her to give me tasks each week and we'll discuss them in the next phone call.\n\nWhat I am not seeing in your solutions is:\n\n\"Let's do this *together*, c'mon.\""}]}, {"post_title": "To watch oneself from an external perspective |[Discussion] |", "post_url": "https://www.reddit.com/r/GetMotivated/comments/1bype35/to_watch_oneself_from_an_external_perspective/", "post_main_text": "The concept is to \n\n\" To be the watcher \" ,  entails observing oneself from an external perspective , detaching from emotions and personal biases to evaluate oneself with absolute transperancy and brutal honesty , Dismissing  your personal lense , learning to watch yourself like you are watching a stranger , a random person . To judge yourself in absolute truth and brutal honesty like a stranger would .\n\nI'm exclusively talking about people with a some what normal life, like you and me on this platform reddit \n\nI'm talking about people who have some sort of control over their lives , and who can steer it in a great direction if their minds were not overwhelmed by their emotions and anxiety .\n\nLike think about it , you do not know the person who has written this , you could be miles away from them , even countries apart , you don't know who this person is , you don't what their life was like , what their life is like right now , the problems they are going through and quite frankly you don't care because you don't know about their existence , it's not about the insensitiveness but the indifference .\n\nand vice versa , I don't know the people who are gonna interact  with this post , I don't know what their life is like , I have no clue about it , it could  be totally different from mine , I don't know what they are going through right now , in my head I'm not aware about their existence , and its external.\n\nAt the end of the day you are at the centre of your universe. You would care more about yourself like you absolutely , 100 % should .\n\nYou are the one who would dictate the course of your life , people might show empathy about your situation [which is nice]  or even sympathy , but they are not gonna save you  , they are not gonna change the situation for you, only you can do that for yourself .\n\n\nEverybody is there for themselves , which is just a real fact , nobody cares about you except your family .\n\nNobody is coming to save you .\n\n\n If you told me your problems , would I feel anxious about it like you do  ? Would  I feel the overwhelming emotions that you are feeling ? NO , I would tell you the truth as it is because I don't care about your emotions , I don't know what you are feeling , straight up honest truth , I would be able to see the truth right through your bullshit and vice versa if I shared mine .\n\nThink about it when you read posts written by random redditors on reddit who are in a rut of a situation and they will say oh I am  feeling  blah blah blah about this particular  situation and I don't know what to do , you  will be able to see the situation as it is , clearly because you don't have a fog of personal irrational feelings or emotions.\n\nOr think about it when you travel from a plane or even a train , you can see a whole region and you can see buildings and all ,there are definitely people there with their own whole different lives living in them ,which you have no clue about , they are a stranger to you , people from different cultures which you have no idea about , and if you had the magical ability to have a peek into their life or their mind about what problems they are dealing with and what do they feel about it , you will be able to see right through the fog of emotions and anxiety and see the situation  for what it is and tell them the basics of what they need to do in order to transcend that situation and thrive .\n\nOr maybe watch a travel vlog for an example or visit a subreddit where people are sharing their problems . * for ex - relationship problems .\n\nI mean that's what therapists do .\n\n This has so many benefits , endless benefits , to watch yourself ,like a snake watches , cold bloodedly with no emotional reaction . To challenge yourself, and to not see yourself in a soft lens , to be brutally critical of yourself and your thinking, mindset and actions , to challenge yourself to get better ! .\n\nI see it as a skill to train oneself , mostly for irrational overthinking and anxiety. \n\nThe world won't be soft to you , so brace yourself for it , it's a brutal world .\n\nHave any of you tried this ? Any tips on how to practice this , master it ? Any positive quotes relating to it ? , any encouraging words ? Would you like to add something to this ?. \n\nI believe this is a skill which can be mastered , what are your thoughts on it ?.\n\n_______________________\n\nP.S\n\n\nThis might seem insensitive to some people and I'm really sorry for that my intention isn't to be insensitive and you can ignore  the post if it seems insensitive to you ,  just imagine that the op is just  a simple self improvement junkie , trying to train her brain and just hoping to share her ideas with you for an intellectual discussion that is meant with the intention of absolute kindness and in the hopes to that maybe this post reasonates with someone and helps them to train their mind and ofcourse  with her selfish interest of  having an intellectual discussion .\n\n\n I'm not disregarding having empathy here  , I'm not talking about victims of unfortunate conditions, situations  , nope , don't bring that up because I'm not talking about that . Ofcourse we all  wish for world peace and happiness and I'm not talking about , not having empathy here so don't come at me with that .\n\nThis post is open to constructive criticism but as I have mentioned already this is not about losing empathy and wishing Ill to others .\n\nThis post is about using a healthy level of disassociation and detachment from one's own emotions to be more rational .\n\n", "post_comments": [{"comment_author": "Fancy-Instance1548", "comment_text": "So get this yea, ive heard and thought of this concept a few times now. in moments of thought after tough scenarios i wonder how i would be percieved to an absolute stranger watching down on me with no ego but critical thought.\n\nfunny enough this is my first time properly using reddit and responding to a post, as i came on here to look for a community of like minded people and maybe make friends that can benifit and positively influence each other. bang not far off from scrolling on this topic i find this post. \n\nThis concept i try to use when making decisions in my daily life (although its not always on my mind). And i find myself answering my own question before asking it or finding better solutions to dumb decisions but most often occurs after ive acted, kinda like foresight if that even makes sense but im slow at it haha. \n\nIts a battle I truly understand, for me its overthinking or brain fog. i dont have anxiety but i do get anxious and its often. Quickly turns into a toxic cycle in the mind of what to say and do. \n\nHowever, your analogies and understood layout of this concept is mint. It has alot of potential and im sure there is some research and content on this topic. Thanks to you ill be having a consistent crack at it everyday. Keen to see it help me achieve my goals."}]}, {"post_title": "50 million for 10 years of consistency [Discussion]", "post_url": "https://www.reddit.com/r/GetMotivated/comments/1by2zh3/50_million_for_10_years_of_consistency_discussion/", "post_main_text": "Your phone rings with a random number. When you answer, a man on the other end says:\n\n“You don’t know me, but I’ve been watching you for a while and decided I want to leave you my 50 million dollar estate. But there are a few conditions, you have to pick one skill or business to build for the next 10 years. You can expand and branch out from it but can’t switch to something completely different. You must also devote at least 40 hours a week to working on it. At the end of each year, I’ll give you a bigger and bigger chunk of the 50 million (compounded).\n\nI’ll start by giving you just $50 today, and the payout will look like this:\n\n|Year|Received this year|Total received|\n|:-|:-|:-|\n|0 (Today)|$50|$50|\n|1|$149.23|$199.23|\n|2|$594.60|$793.83|\n|3|$2,369.22|$3,163.05|\n|4|$9,440.27|$12,603.32|\n|5|$37,615.18|$50,218.50|\n|6|$149,879.38|$200,097.88|\n|7|$597,201.16|$797,299.04|\n|8|$2,379,574.97|$3,176,874.01|\n|9|$9,481,523.81|$12,658,397.82|\n|10|$37,779,559.36|$50,437,957.17|\n\nIf, for any reason, you don’t put in the time or you drastically change your focus, then the payments stop.”\n\nDo you take it?\n\nCompared to an annual salary the pay doesn’t get good until at least year 6. And you only see 90% of the money in the last 2 years.\n\nWe’re conditioned to expect results immediately. Then we get discouraged and pursue something else when we don’t reach our goal in a matter of months.\n\nIf you want to achieve anything big you need to calibrate your expectations to that timescale: lots of effort with very little return up front, and a much higher payoff later.", "post_comments": [{"comment_author": "Kurupt_Introvert", "comment_text": "Let’s be real…no one is picking up a random phone number 🤣"}, {"comment_author": "ZahScr", "comment_text": " 😂 Nobody under 60 at least"}, {"comment_author": "Manic_Emperor", "comment_text": "Why not? I always pick up random phone calls, their usually important"}, {"comment_author": "HughesJohn", "comment_text": "I'm 65. Unknown numbers go to voicemail at best."}, {"comment_author": "BeardedSwashbuckler", "comment_text": "And people over 60 often get scammed over the phone by proposals just like this one!"}, {"comment_author": "arkencode", "comment_text": "It’s not like I haven’t been working the same job 40 hours a week for the last 18 years."}, {"comment_author": "Manic_Emperor", "comment_text": "I think the point is that you won't make much money the first few years"}, {"comment_author": "dimonoid123", "comment_text": "Why? People usually change jobs at least every 5 years, as this usually increases compensation."}, {"comment_author": "arkencode", "comment_text": "Hmm, yeah, that would be tricky."}, {"comment_author": "arkencode", "comment_text": "The same kind of job, I should say, not the exact same company. And honestly I would prefer not to have to change companies.\n\nGot fired last week so who knows, maybe I’ll get increased compensation 😂"}, {"comment_author": "Sliekery", "comment_text": "Is this r/GetUnmotivated?"}, {"comment_author": "ZweitenMal", "comment_text": "This is silly. What am I supposed to live on for the first 5 years?"}, {"comment_author": "bugzaway", "comment_text": "Thank you. I don't think people are fully understanding the prompt. You are basically making nothing for 5 years and it's only at the end of that that you get a livable wage (37K). \n\nYou are not allowed to have anything else overshadow the 40h a week so I guess you'd have to find a side gig to live on after hours. \n\nFor those who have enough savings for this, it's an easy choice. Personally, if I only had myself to worry about, it would be an easy choice too. I'd take 5 years of crippling poverty for that reward. But I have responsibilities (e.g., to my aging parents) so I can't."}, {"comment_author": "Ok-Seaworthiness7207", "comment_text": "Silly redditor, humans don't need a stable environment or food for 5 years! Just pull yourself by your bootstraps you lazy snowflake! 🙃"}, {"comment_author": "Eldritch-Grappling", "comment_text": "Why can't I make money with my 40hrs a week? Is there something saying I can't. It just has to be dedicated to a skill or business. That business can be profitable, no?"}, {"comment_author": "ZweitenMal", "comment_text": "Sorry, I meant 6 years of you receive the money at the end. $37k is not livable."}, {"comment_author": "Ja_Rule_Here_", "comment_text": "You make money through the business…. The money dude gives you is basically basically a bonus"}, {"comment_author": "bugzaway", "comment_text": "$37 is perfectly livable. It's not great but you will be fine. I've lived on less. I had a rented room, didn't worry about food, and had enough to clothe myself and eat out occasionally. Is it enough for an apartment or to travel? No. But it's livable."}, {"comment_author": "PariahMonarch", "comment_text": "You still need the money to start up the business if that's the case."}, {"comment_author": "ZweitenMal", "comment_text": "It is not livable where I am."}, {"comment_author": "Ja_Rule_Here_", "comment_text": "You get a loan under whatever interest rate knowing that you can pay it back in 7 years."}, {"comment_author": "Eldritch-Grappling", "comment_text": "For $50 mil you could probably move."}, {"comment_author": "ZweitenMal", "comment_text": "It’s not the second half of the timeline that worries me. Also, if I were a millionaire I’d still live here."}, {"comment_author": "Eldritch-Grappling", "comment_text": "No, I meant you could move to make the finances work if you really wanted the $50 mil but the money this man gives you doesn't have to be your only income."}, {"comment_author": "starvald_demelain", "comment_text": "Of course I take it, 50 mio in 10 years for something I could exchange for my current work schedule that earns me much less. Being able to even chose what I wanna focus on makes it a no-brainer. I'd probably work on drawing / digital art skills, even if it's frustrating from time to time with AI images looming over us.\n\nI'd just how I would not get very sick in a way that would lead to me missing a week involuntarily. It's the biggest risk I see here."}, {"comment_author": "PariahMonarch", "comment_text": "Except consider first if you could live off of 50k total for the next 5 years, supplemented only by whatever work you do beyond the 40 hours/week on this project. \n\nIf someone is financially stable enough, yes this could be a great use of time/income for the future - but anyone already barely making it can't afford to take less money for their time in the short run for it to pay off down the road: they'll have financially drowned by the time it would come to fruition.\n\nIt's the adage 'it takes money to make money', anyone already doing well financially can continue to grow that money, but the closer you are to breaking even or worse, the harder it is to succeed in the future."}, {"comment_author": "notyourstranger", "comment_text": "How do you survive the first year on only $50?"}, {"comment_author": "ZahScr", "comment_text": "Totally! Personally, I think the thing AI won't be able to easily replicate is authenticity. It may be able to draw, compose, or write \"better\" than any person, but people crave connection and feeling and I think there will still be a big market for doing that in a unique authentic way. If it makes you happy, you should work on drawing / digital arts skills regardless!"}, {"comment_author": "Eldritch-Grappling", "comment_text": "Did I miss the bit that said you can't make money from your 40hrs?"}, {"comment_author": "DryBonesComeAlive", "comment_text": "I'll go to college for the entire time and live off student loans and devote 40 hours to learning and at the end get 50 million."}, {"comment_author": "starvald_demelain", "comment_text": "Enough savings. If not for that, I would try get a part time job or similar to stay afloat if my goal from the challenge isn't something that can be used to gain some recompensation. Also there's the possibility to receive social support."}, {"comment_author": "starvald_demelain", "comment_text": "I agree that AI art alone may end up feeling hollow without some meticulous prompting. I also hope people will just not stop appreciating human art, even if the image quality is not up to par. It's not like we'll stop being able to create something interesting, there'll just be a flood of AI art since is will be exponentially less time consuming to create (already is if one can live with the flaws it creates).\n\nThanks, I will, just not 40-hours-per-week consistent (this week it was 13 hours)."}, {"comment_author": "ZahScr", "comment_text": "I highly doubt people will stop appreviating human art. So much of the value of art is already the idea and emotion behind it.\n\nAnd 40 hours was just an exaggeration to illustrate the point. The real important thing is to keep geting back on the horse."}, {"comment_author": "Nobanob", "comment_text": "ADHD. Literally not happening for me."}, {"comment_author": "zackmophobes", "comment_text": "Shit this is easy I choose gaming and now have a solid reason to put in 40 hours a week into that skill. \n\nCan still have a job too before it gets worthwhile in this situation."}, {"comment_author": "Misfiring", "comment_text": "If you're in a situation where you can survive for 5 years with just 50k, then there is literally no downside to take the deal.\n\nIf you're in a situation where you can't survive for 5 years with just 50k, then there is literally no upside to take the deal."}, {"comment_author": "ZahScr", "comment_text": "If the dude on the phone is telling the truth, then maybe you can create a situation where you can survive for 5 years 🤔"}, {"comment_author": "SethSky", "comment_text": "Never in my life. I'm a freelancer, and at 27 years old, I'm in my prime. I'm not rich by any means, but only having to work a few months per year while enjoying the rest of the time with friends, creating great memories, is much more valuable to me personally. This time and this age won't ever come back, and everyone at one point will realize that money was never worth the time."}, {"comment_author": "therealbahn", "comment_text": "Yeah - easy choice. Max out credit cards and personal loans."}, {"comment_author": "iWillBagItForYou", "comment_text": "What do you do, if you don't mind me asking?"}, {"comment_author": "TrickyAd5720", "comment_text": "This challenge is not possible if you don't have anyone to pay your bills for the first 5 years, OR don't have an already going business.\n\nYou have 168 hours total a week, -56 sleeping, -21 eating/breaks, -40 full time job, -14 total average on transport,    \n\n\nThis already leaves you with 37 hours left a week, 3 hours shorter than the requirement. Those 37 hours can be put on family, personal life, house chores, kids, healthcare, bureaucracies, all the kind of shit you need to do on your free time.  \n\n\nThe average middle class american spends around 72k a year on basics. So, for the first 5 years you can't quit your full time job and devote to your new skill/business development, unless you already have another source of income from the get go, which defeats the meritocracy selling point... and selling bs books, bs lectures, bs workshops, and all that kind of shit that makes bs people rich in no time.  \n  \nI like numbers. Numbers make bullshit go away."}, {"comment_author": "TrickyAd5720", "comment_text": "If you really want to make this work, here's what you'll need to adjust to:\n\nEating in 10 minutes, no breaks  \nWorking from home (no commute)  \nsleeping 6 hours max\n\n168-42-3.5-40= 82h of useful time  \n-40h of dedication to the challenge\n\nleaves you with 42 hours a week to take care of other businesses and have a life. 6 hours a day.\n\nTaking the commercial hours into consideration, 30 of those will be mostly useless. which leaves you with about 10 hours a week to handle stuff.\n\nIf you think you can do that in 5 years without destroying yourself in the process, congratulations.  \n  \nSome people just had to be born for the first 50M..."}, {"comment_author": "iamaweirdguy", "comment_text": "Yes duh"}, {"comment_author": "Lokijai", "comment_text": "I take it and just build on my gaming skills. Easy clap."}, {"comment_author": "gr8Brandino", "comment_text": "I'm already a software developer, so I'll continue doing that and retire in 10 years."}, {"comment_author": "UT_city", "comment_text": "I’d renegotiate the pay scale schedule cause I have rent bill due every month and $50 for the first year isn’t going to cover that."}, {"comment_author": "bcoolzy", "comment_text": "It seems more like an intense focus situation with a goal set in mind and motion. Regardless if the story mentioned is real or not, it's certainly a good thing as you would have drive and practice a laser focus thought process and by the end you will be able to see the fruits of your labor. Along the way you would I image will have picked up a wealth of skills acquired."}, {"comment_author": "SeaH4", "comment_text": "I’d figure out the minimum income I need to meet my essential living expenses for the first 5 years and find a job with the least amount of time involved to earn that income. The rest of my time would be dedicated to skill or business I have some passion for and simply go with it forever. I really enjoying growing things so definitely my 40 hours would be committed to crop culture."}, {"comment_author": "migama314", "comment_text": "Can you make it to year 6 with your current savings and no job to keep you up and running until that other promise starts providing enough income? That’s one of today’s major issues for our civilization"}, {"comment_author": "kejovo", "comment_text": "Of course, it's a free $50 at the very least!\nDamn that was lucky, I never pick up for unknown callers."}, {"comment_author": "Nyus", "comment_text": "I’ll use my existing savings to take the leap and start that streaming gig I’ve always envied so much. Playing games for 40 hours a week."}, {"comment_author": "joshistaken", "comment_text": "Let's also set expectations regarding salary in a normal job - you're never really gonna earn more than what you'd get in your year 6, no matter your profession, how hard you've worked, or whether you've worked even 30 years in it.\n\nSo yes, I'd take your deal, if in exchange for decent input from my end, it guarantees the 37mil paycheck in yr 10. No other opportunity will be as generous and secure as this."}, {"comment_author": "Speedy059", "comment_text": "You better send a pre-convo text stating what you are wanting to do before I pick up a random number. Otherwise the only person you are going to reach is my 91yr old dad, 10 extra years is a stretch..."}, {"comment_author": "samsharksworthy", "comment_text": "Fuck this guy trying to tell me how to live. No deal."}, {"comment_author": "Eldritch-Grappling", "comment_text": "Why not take free money? Where is the drawback? If I could only have his money then that would be difficult until year 5, assuming no other resources. I can be doing whatever I'm doing anyway and being paid for that and earn this on top. And it's a sure thing. Or if I am supported I can literally do whatever I want. I'm going to develop my video gaming skills and then spend the next 10 years playing video games to get 50 mil.\n\nI see risk and risk aversion as a bigger issue than consistency. If it's practical and it's a sure thing why not do it. Show me an easier way to make 50 mil. Now we could say let's go bet on the stock market. Theoretically we can go from $50 dollars to $50 mil in way less than 10 years. But realistically are we even going to make it to $50 mil if we only use our starting $50? Well, what if we put more money in? Fine, but then there's risk of losing that money just as many businesses fail. Risks are easy to take if you've already got loads of money. If you have a$1 mil liquid you can turn that into $2 mil in a short time. If you have $0 then getting to your first mil is hard."}, {"comment_author": "DeusmortisOTS", "comment_text": "Sure.  I'm starting a day trading skill/hobby/business.  I'll get the weekly hours in watching tickers, reading articles, etc.  I can do this while maintaining my current job.  After year 6, I can leave my normal job, and round out my hobbies.  All while keeping up the hours.  I'll expand and diversify, but it is all based on market exchange.  A balance of short and long term holdings.  A mix of financial instruments.  I can attend seminars and trade shows, justifying them as market research.\n\nThe work is hands off enough that I can maintain the 40 hour requirement even on vacation.  Though I would ask, is that 40 hours minimum every week, or a rolling average?  Could I log two 60 hour weeks, then take a week off?\n\nAll in all, this sounds like a pretty good deal.  I've been averaging 40+ hours per week for over 20 years now.  Many stretches in that period featured minimal change in the job, just added tasks and responsibilities.  Closest I ever got to year 7 pay was a buyout of a company that had included stock as part of the compensation package.  I've never gotten close to year 8+ pay.  This system would have me retiring more than 10 years ahead of schedule.  When can I expect the call?"}, {"comment_author": "ConjunctEon", "comment_text": "One skill, and develop it for 40 hours a week?  Do I understand the concept?  Be a porn star."}, {"comment_author": "anothercarguy", "comment_text": "Where does Uncle Sam taking fully 60% come in? (35 federal, 10 state, 8 sales tax, 8 property tax)"}, {"comment_author": "patbrucelsox", "comment_text": "I don’t have six years of cash to live off of. If it scaled up from 10-40 hours a week with a livable wage at 40 then hell yeah. I’ll take a few million to be a pet sitter or dog walker. Getting paid to hang out with animals would be a dream. I already do 10-20 hours a week learning how to program and working on a pseudo computer science degree and that’s just for fun.\n\nOr I’d just get an instagram, start an LLC with the intention of being a “lifestyle guru”, and just post random unimportant shit that no one watches for 10 years.\n\nGuy on the phone never said my business had to be successful, or generate any revenue, or have the possibility of generating revenue. Just had to start one. No overhead other than filings, renewals, a dba which I think lasts for 8 years, and maybe a website hosting. My website would be a link to a “subscribe now” where you pay for email subscriptions. Every week or so I’d send you a picture of my cat and a motivational quote I’d make ChatGPT come up with.\n\nI got this."}, {"comment_author": "destructdisc", "comment_text": "Honestly I'd jump at that so fucking quick just for the $50. Might sound hard to believe for you fine folks, but in my current state $50 would change my life."}, {"comment_author": "CplCocktopus", "comment_text": "I would just choose my current degree.\n\nProgressing in my shoulder count and  after.i would just get a job in that field then slowly progress."}, {"comment_author": "modernangel", "comment_text": "Year 5 is the break-even year where you start to receive the equivalent of a living wage. Which means if you don't have some working capital already, then you need to pick something with low start-up costs to survive until your bequest actually supports you. Usually that means something tedious and repetitive that you're probably not going to want to keep doing, 40 hours a week,  when the bigger free-money amounts start rolling in."}, {"comment_author": "Batmantheon", "comment_text": "Yeah, home dog, I got 2 young kids and a mortgage so I don't have 40 hours to dedicate to anything that isn't paying all my bills right now.  Gonna need you to front load thar 50 mol"}, {"comment_author": "MonMonOnTheMove", "comment_text": "How are you able to risk this and not knowing if it’s a scam or not"}, {"comment_author": "iamameatpopciple", "comment_text": "Easy as fuck funny so many are saying its impossible\n\nPick a \"skill\" aka a hobby that isnt doomscrolling and spend 40 hours a week doing it.\n\nGaming, art, exercising, knitting, holding your breath, whistling, twiddling your thumbs, woodworking, standing on 1 foot, cooking."}, {"comment_author": "braytag", "comment_text": "Dude it's just like getting a PHD.\n\n\nWhat's the question here?\n\n\nStuding to become a doctor:\n\n\n6-8years of school, huge salary afterwards."}, {"comment_author": "wowwhatareddit", "comment_text": "Speaking as being part of a family that has doctors, yea that's not how it works at all."}, {"comment_author": "ZahScr", "comment_text": "No real question, just discussion. My point is that it's easier to stay motivated when you've set your sights on the long term and can keep that in mind."}, {"comment_author": "catfink1664", "comment_text": "I actually thought it was! What’s the reality?"}, {"comment_author": "0100001101110111", "comment_text": "Not really. In your scenario the payout is guaranteed regardless of how successful your endeavour is. In real life that is never the case."}, {"comment_author": "ZahScr", "comment_text": "That's true. So is your point that one shouldn't invest resources today for an uncertain future payoff?"}, {"comment_author": "0100001101110111", "comment_text": "I’m saying the uncertainty is the problem, not the timescale."}, {"comment_author": "jm_santiago", "comment_text": "I imagined Liam Neeson as the guy on the phone."}]}, {"post_title": "[Story]How I overcame myself by finding my true love", "post_url": "https://www.reddit.com/r/GetMotivated/comments/1byafv8/storyhow_i_overcame_myself_by_finding_my_true_love/", "post_main_text": "**Overcoming Attachment to Love**\n\nGrowing up, the concept of love was foreign and elusive to me. In China, the phrase \"I love you\" was rarely expressed, even among family members. It was as if it was this sacred phrase, reserved only for lovers. The most I experienced were fleeting crushes on girls in school.\n\nWhen I came to America for high school, I stumbled upon a darker path. Exposure to provocative content and easy access to pornography led me down a rabbit hole of addiction and shame. Each time I indulged, I felt completely drained the next day, unable to focus or find the motivation to do what I needed to do.\n\nDuring college, I hit my lowest point. My days were consumed by playing video games, eating take-outs, and masturbating. In this darkness, I stumbled upon meditation while searching for an extracurricular class. After starting meditation, I realized the energy-draining effects of my harmful habits and understood why spiritual practitioners like monks choose asceticism.\n\nThrough meditation, I was able to release my attraction to porn. However, the habit was deeply ingrained, and I would occasionally slip back. Even though the pleasure was minimal, the pull was still there. But I was determined to overcome it and become my true self.\n\n**Finding My True Love**\n\nAs I continued my journey of self-discovery, something remarkable happened. I experienced what true love is – not the romantic love I had always yearned for, but the unconditional love of the divine, the love of my true self.\n\nWhen I got to know my true self and felt the depth of its love for me, tears would flow freely. The true self is within each of us, waiting to be united with. It's the essence of who we truly are, the fullest expression of our potential.\n\nBefore, I was a lazy person, never trying hard, even though I had the ability to become great. But after knowing my true self, after finding this love within me, I couldn't help but to try harder. I cried and longed for my true self. I decided that I would go through the pain and suffering, no matter how difficult, until the false self completely died.\n\nWith this newfound determination, I started doing everything with a renewed mindset. Waking up early, meditating diligently, exercising to the point of exhaustion – it all became a devotion to my true self. Even when the pain was excruciating, and I felt like giving up, I persisted, knowing that it was all for the sake of my true self, the one I loved so deeply.\n\nYesterday, I went on a challenging hike to the top of a mountain. The path was treacherous, and my body ached with every step. But I cried out to my true self, asking for the strength to finish. And I did, because it was no longer for me, but for the love of my true self.\n\nNever in my life have I tried so hard, but for my true self, it's all worth it. Because I love it so, so much.", "post_comments": [{"comment_author": "bombilfry007", "comment_text": "Inspiring brother! Onwards and upwards! 🚀"}, {"comment_author": "WuJi_Dao", "comment_text": "Thank you brother! Same to you! 💪🫶"}, {"comment_author": "InfamousElection2843", "comment_text": "Could you elaborate on the unconditional love of the divine, the love of the true self, what do you mean by it exactly and how did you find it?"}, {"comment_author": "WuJi_Dao", "comment_text": "Human love is not true love. Only love that is the love of God in which Christianity speak of, the unconditional love, is true and everlasting. \n\nThe moment when you were born, how you were able to grow up, being raised, with all the things given, even until the current, you have always been watched over with and your true self has always been there for you. The air you breathe, the water you drink, the ground you stand, the roof you have above you, etc. without any of this, would you indeed be able to survive. This love of the divine, love of Truth, love of universe, whatever name you call it, is unconditional and boundless… only when myself goes back to this existence itself, can there be true love found from within"}]}, {"post_title": "[Discussion] What is the point of having experiences and trying new things, besides fulfillment?", "post_url": "https://www.reddit.com/r/GetMotivated/comments/1by3jvp/discussion_what_is_the_point_of_having/", "post_main_text": "Why do people want to make memories and have experiences when all everything will be at the end of the day are memories?\n", "post_comments": [{"comment_author": "Yesdog217", "comment_text": "Everything is only a memory. Goal is to make it worth remembering. Life is a highlight reel."}, {"comment_author": "quickblur", "comment_text": "Life is just a series of memories and experiences anyway. If you do the same thing everyday, they all just blur together. Doing new experiences sets touch points in your life that you can remember and cherish."}, {"comment_author": "yewhynot", "comment_text": "You ALWAYS learn something new about yourself, and knowing more about yourself makes you happier. Being generally happy is more than just having good memories. From personal experience, I veeery slowly forced myself out of my comfort zone in which I had been for way too long because i told myself that this is who i am and like to be, no need for changes. Turns out that a lot of things i just lied to myself. After long days of e.g. going to a club and meeting new people, all of which i had previously \"hated\", i realised that i felt satisfied and quite happy, and that maybe this new experience is something i should do more often. I experienced this phenomenon quite a lot, even for banal things. Such new experiences can also culminate in more drastic changes, like my new job i only discovered through new experiences, and which i perceive as beneficial to society and not just for my fulfilment. Sorry for this anecdotal ramble, i wish somebody had told me this earlier, i hope someone else can learn from this and just go out and do stuff :)"}, {"comment_author": "DaGurggles", "comment_text": "Do you want to recall watching paint dry or do you want to remember a feeling?"}, {"comment_author": "Badwoman85", "comment_text": "One really valuable aspect of new experiences is not just the opportunity to succeed, but the opportunity to fail. A child psychologist told me that parents need to focus less on teaching their child to win and more on teaching their child how to lose but keep going. Teach them to focus on the effort, not the outcome. \n\nIf you are always focused on succeeding, failure can be devastating and can be enough to make you quit. Having the opportunity to suck at something teaches you perseverance and gives you an opportunity to improve. New experiences help you figure out what you like but also what you don’t like.\n\nMy mom was a hospice nurse. She said that when people were at the end of their lives, no one talked about how happy they were that they made so much money or owned so many possessions. They talked about their experiences. They talked about their relationships. They talked about the things that they wish they had done.\n\nNothing is permanent. All we will ever have is memories. You may as well make some worth keeping."}, {"comment_author": "castlegrass277", "comment_text": "I really like this. However to your point about focusing on effort is better than focusing on the outcome but there are only so many thoughts you can have about the effort like what would focusing on effort look like as far as what a thought process might be?"}, {"comment_author": "Badwoman85", "comment_text": "TLDR: I was a fuckup in high school but hugely successful as an adult. I am so proud of that high school fuckup, though. \n\nI struggled with severe mental health issues when I was younger. It was like my brain stopped working. Putting together thoughts was difficult. My memory was shot. All I could think about was that I didn’t want to live anymore. \n\nI went from being a gifted kid placed in advanced classes to failing all my classes and being truant so often that the court was going to get involved. My guidance counselor actually recommended that I drop out of school because he was so worried about my mental health. But I kept going. I didn’t know if I was going to be able to graduate but I was going to try. \n\nI will never forget the feeling of having to do presentations on projects that I didn’t finish because I barely had the energy to glue stuff to a piece of cardboard. The burning shame of standing in a room of smart kids who had put so much work into their projects while my failure was so evident. \n\nI knew that I wasn’t going to make it academically. So, I figured out how to pivot and focus on my other strengths. I learned how to fake confidence and charm. I was depressed as hell but having come from an abusive household, one thing I knew how to do was distract people from the fact that there were problems. It is unfortunate that I had to have that skill but it saved me in the end. I was so liked by my peers that people wanted to partner with me on projects, even though they probably knew that I was more of a deficit than an asset. My teachers loved me and gave me second chances. They saw that I struggled but still put in the effort. I participated in class as best I could. They knew how badly I wanted to succeed even though I failed every time. \n\nI actually should not have been allowed to walk at my high school graduation. I still had a couple of F’s. Those teachers gave me extra credit opportunities that I barely turned in on time. I’m sure that one of those teachers gave me a passing grade, even though they shouldn’t have. \n\nI ended up getting help for my mental health issues. I found a job that I was really difficult but I was really good at and became super successful in my career. I have won awards. I get asked to speak at conferences and be on committees. I am considered an expert in my field. \n\nI have a lot to be proud of in my career but what I am most proud of is that teenage girl who showed up to class to give a presentation that she wasn’t prepared for. I’m proud of the girl who felt so ashamed that she wanted to melt into the earth but still raised her hand in classes. I am more proud of the version of me who failed than the version of me who succeeded. \n\nIt’s easy to keep showing up for things when you know you’re going to win. But it takes guts to get back up after you have fallen. It takes humility to try something that you are bad at. It takes courage to do something that scares you. Sometimes, the most you can do is try. \n\nI encourage people to try things that they probably won’t be good at. We want things in life to go well but we also need to experience having things go wrong and continuing to try. There are things that I enjoy but I’m really bad at. But there is freedom when you let go of the mentality that you have to succeed. You get to be fully present instead of focusing on all the steps you need to take in order to win. You get to see where things went wrong and how you can do it differently next time. You gain more from failure than success. \n\nI love that I have been able to be successful but I’m so grateful that I failed so many times along the way."}, {"comment_author": "Badwoman85", "comment_text": "I gave you a super long story but I don’t know that it actually answered your question.\n\nIf you are focused on the effort instead of the outcome, you have to be present in the moment. You are focused on what you are doing right now, not what you hope will happen. It’s a mindset of “I’m going to try this. Maybe it will work, maybe it won’t. But I’m going to try it anyways. If it doesn’t work, I will look at what went wrong and try again.” You aren’t thinking about the end result. You are just thinking about each step as it comes. You celebrate every step of the way instead of waiting until the end. \n\nIf you fail, you don’t look at it as a failure, but as a growth opportunity. Keep your eyes off the prize and on what is in front of you. \n\nA lot of people won’t try something if they know they won’t be good at it. They end up missing out on so many things. They miss out on finding talents that they didn’t know they had. They miss out on learning how to do something better. They miss out on laughing with people about how badly something went. They miss out on seeing how much grit they have to push through something that won’t reward them. \n\nWhen you play a competitive sport, someone always has to lose. If you only want to play if you can win then you will never get to play. You have to be willing to risk losing but try anyways. There will be losers who will be bitter about it but there are losers who still had fun. They are proud of the fact that they and their team went out there and gave it their all. \n\nDon’t grieve losing. Be proud of the little things. All success is success. Even improving by 1% is still progress. Even if you have a setback, you still tried. It sucked but you did it anyways instead of stomping off in a huff. You learn how to get back up after you fall."}, {"comment_author": "Pr0gger", "comment_text": "Because why else live if not to have a good time and make great memories?"}, {"comment_author": "Firm_Bit", "comment_text": "Cuz it feels good. What kinda mental gymnastics do people do to try to rationalize feeling good as unimportant or as not worthwhile?"}, {"comment_author": "WillShattuck", "comment_text": "As my kids say… to have some fun. We went to the roller rink yesterday. I spent great time with my kids and they had fun and improved on their skating."}, {"comment_author": "Thieu95", "comment_text": "Because you learn from it, memories aren't the only things you keep, your experiences shape you as a person, you build wisdom, learn and grow, you find out who you are and how you handle some situations in the heat of the moment. Thinking about something isn't the same as living something, you think you may have figured out how to deal with certain situations before they happen, but you haven't.\n\nYou can resist new experiences, but some will be forced upon you, whether it's something like needing to do a job interview, dealing with taxes, needing to organise something. Going out there and doing new things will help you deal with other new things."}, {"comment_author": "ShaneBoy_00X", "comment_text": "~ That's Life..."}, {"comment_author": "catfink1664", "comment_text": "The need for novelty is one of humankind’s basic needs"}, {"comment_author": "CreamDaddy420", "comment_text": "As we live, the context of our lives (people, culture, environment, experiences ,etc.) shapes what we believe about the world. Those beliefs stay with us and act as a lens through which we see the world, often in ways that aren't obvious to us. These  beliefs manifest in the stories that we tell about the world and ourselves and can be small or really big. They also aren't always helpful to us. A belief like \"I'm worthless\" might seem justified in the story you tell yourself about your life, but doesn't help you to live. \n\nNew experiences are important because they add to and challenge the stories we tell."}, {"comment_author": "Saucy_Baconator", "comment_text": "At the end of your life, all you will really have and value are the experiences and memories you made. Make them great."}, {"comment_author": "Hellaguaptor", "comment_text": "Oh boy do I have news for you. Go ahead and continue to make fun of those people because what will blow your mind is growth. That is why you want to try new things and gain experience. That feeling is the real magic of life experience."}, {"comment_author": "nrg117", "comment_text": "Balance"}, {"comment_author": "Unstuckpod", "comment_text": "Your brain rewards novelty. That's why time moves fast when you're doing something new, and why it drags on when you're doing something you're familiar with. \n\nAlso new experiences are the fastest way to get yourself out of your comfort zone and start to grow as a person. At the end of the day, life is about how much we grew with the time we were given, so chasing new experiences and discomfort is always a no-regrets use of your time."}, {"comment_author": "Real_Project2563", "comment_text": "Those are simply ways to spend your time between real successes. True fulfillment is present only when you do things that contribute to your legacy, to what you leave behind as a unique individual."}, {"comment_author": "LostThrowaway316", "comment_text": "Foundational knowledge. Without experiencing some things, your knowledge of the world is not the same. \n\nEx: reading or watching a video about skydiving is nothing like the real experience. You won’t have the same chemical and emotional reactions as when you’re sitting on the edge of that plane. \n\nMoreover, when trying to improve one’s life, most direction is followed by those who have experienced a similar situation"}, {"comment_author": "improveyourfuture", "comment_text": "Growth"}, {"comment_author": "Even-Boysenberry-127", "comment_text": "Learning"}, {"comment_author": "LEJ5512", "comment_text": "My family went to a New Year's Eve concert in Vienna, Austria, almost twenty years ago.  It *still* makes us happy to talk about it."}, {"comment_author": "Gloomy_Quantity_9580", "comment_text": "Trying to fill your life with experience is like trying to fill a bottomless bucket. Fulfillment or Happiness is a by product of living your life. Trying to make a memory is a form of the “double bind” forcing spontaneity isn’t practical. Alan watts talks a lot about how language tends to hamstring us, “have a good time…” you say as someone leaves you to do something else, yet having a good time is entirely dependent on your perspective. To have equanimity in the face of an airline delay or mishap on your honeymoon leads to a better honeymoon, and the opposite is true, as I’m sure there is no lack of evidence for people who let circumstances rule their emotions/life. \n\nBe as present as you can be wherever you are. -Ram Dass\n\nYou can’t control what you remember or even how accurately you remember things. Better to live in the present as it’s the only thing there really is. Cant remember which mediation teacher said to but “the memory of your mother isn’t your mother” trying to hold on to memory is a trap. \n\nDo things you enjoy and let everything else be as it is."}, {"comment_author": "clumseykey", "comment_text": "The idea behind trying new things to form positive experiences and memories is to rewrite bad experiences and memories. \n\nBy doing new things you’re changing your perspective with new inputs that can help rewrite bad ones to grow you as a person. This can be fulfilling and healing at the same time."}, {"comment_author": "Hypno--Toad", "comment_text": "Trail and testing. Life is a constant development."}, {"comment_author": "Anonymark88", "comment_text": "Because they're fun?"}, {"comment_author": "notme1414", "comment_text": "You learn a lot about the world and yourself. It also makes you a well rounded person that's interesting to talk to."}, {"comment_author": "Shiny-", "comment_text": "Idek anymore. This sim needs an update"}]}, {"post_title": "[Text] How to handle rejection and be more attractive", "post_url": "https://www.reddit.com/r/GetMotivated/comments/1bxob08/text_how_to_handle_rejection_and_be_more/", "post_main_text": "\nI am tired. He said he wanted to settle down when he asked me out a year ago but he broke up with me yesterday. He is already talking to another girl. \n\nNot sure how to handle rejection. This one is difficult coz we are both over 34 and both wanted the same things in life. \nI don’t want him to see I am upset. I am having super low self confidence. Just feeling like I lost everything in life. I go to gym n eating healthy but I just feel like I am not good enough. ", "post_comments": [{"comment_author": "never1st", "comment_text": "A common mistake that we all make is using one person a barometer to determine if we are \"good enough.\"  When a relationship doesn't work out, it is not your duty to become who your ex wanted. Just keep becoming the person that you want to be. I speak from experience when I say that it's hard to find someone that will be happy with you when you are not happy with yourself. Keep your head up."}, {"comment_author": "Pure-for-life", "comment_text": "I agree.  Being completely dependent on someone else or just other people’s opinions is disastrous. I’m a people pleaser and I’d do anything to get love and support from strangers, it could easily become manipulative."}, {"comment_author": "Embarrassed-Scar2783", "comment_text": "I love this. I think it’s important to remember even in a relationship. Thanks for sharing."}, {"comment_author": "Rootsyl", "comment_text": "amen."}, {"comment_author": "Jegator2", "comment_text": "The best advice! Don't under-value your worth or talents!"}, {"comment_author": "nryporter25", "comment_text": "I have a similar mindset, and it's very easy for me to be manipulated as I've learned the hard way.  I live for acceptance from others. It's all I've wanted my entire life.  I learned to be alone with myself without needing the approval of others, and it's quiet and lonely, but I don't need to have others all the time.  I'm working on building healthy relationships rather than the unhealthy mindset I used to have."}, {"comment_author": "Pure-for-life", "comment_text": "I completely agree. Reddit actually caused me to be depressed because you can receive any comment that’s either good or bad"}, {"comment_author": "Jegator2", "comment_text": "Smart!"}, {"comment_author": "SpicySweett", "comment_text": "Give yourself some space to be sad about it. Break-ups are hard, and when it really felt right to you and you saw a future, it’s worse.\n\nYou’ll probably never know exactly why he broke up with you, but it’s highly, highly unlikely that it was about your looks. Loads of chubby people, not classically attractive people, etc are in loving relationships. And you were his type, you attracted him in the first place. But break-ups are usually about the other person (especially when it comes out of nowhere). Maybe he got scared of commitment. Maybe you’re too “real” for him and he prefers superficial. Maybe he missed his old lifestyle or wants to try something different (being a partier, being non-monogamous, etc). \n\nIt doesn’t matter the “why” of it. Be sad, be angry, have your feelings. Write them, draw them, talk about them, really have them. One day you’ll be tired of that story and ready to move on. Then you can look at what you want in your next relationship, whether there were signs he was pulling away that you can notice next time, and what were the red flags that he was all talk and not really committed. Good job with sticking with the gym and eating healthy, valuing yourself is hard when you’re sad. I’m rooting for you."}, {"comment_author": "GTOdriver04", "comment_text": "I’m personally in the “I’m tired of the story” phase now. \n\nI didn’t want her to go, I made her feel loved every single day and she said “hanging out with you is a chore.”\n\nAt the end of the phone call where she left for good, I still told her “I love you very much.” \n\nIn my own way, it was my way of driving the point home: you’re leaving and I can’t stop you. I won’t try. But I will tell you that I love you, and you’re leaving someone who does love you despite you ripping my guts out.\n\nLiterally, the last words she heard from me were “I love you very much.”"}, {"comment_author": "Interesting-Bat6631", "comment_text": "I think your last words were how you really felt. Kind words. When she goes to the “greener side” and it’s really boring…:she will want to run back. She will contact you. That is when you don’t reply. Dont acknowledge. Read and leave it on read. Let people know when they lost their chance. WOLO. We only live once. Leave people in the past where they belong. Keep pushin."}, {"comment_author": "Technical_Fly6720", "comment_text": "Women only accept Vulnerability if she respects and seeing you as dominant the guy otherwise she sees it as a weakness/too needy and it is offputting. Women want softness to them but they don’t want you to be soft overall. They want to feel like they have to earn your soft side"}, {"comment_author": "reshin83", "comment_text": "Boy, that is a really interesting thought.  I could buy that."}, {"comment_author": "redodt", "comment_text": "Thats really inaccurate, pls do not buy it\nWomen want a man who can handle his life (can pick up after his messes, both tangible and intangible) aka 'strong', but also emotionally mature to be emotionally vulnerable when the situation calls for it instead of bottling it all inside in an unhealthy manner i.e. vulnerable/'weak'. Not in the vaguely incel manner the poster above u is phrasing it"}, {"comment_author": "reshin83", "comment_text": "Do you really see no similarity between what you just said and what the responder above me said?"}, {"comment_author": "redodt", "comment_text": "That's not the point, but if that's what you wish to focus on, I'm not here to argue."}, {"comment_author": "reshin83", "comment_text": "LOL"}, {"comment_author": "FrostyMix6081", "comment_text": "Hey, so I’m currently trying to heal after a breakup and I’ve been working on myself internally. \n\nI delved into attachment styles and realized that I am anxiously attached and have a fear of rejection. When my ex broke up with me, I was shattered because I felt unwanted and similarly felt that my world was gone. \n\nAfter everything we went through, after all the promises, how could he break up with me so easily and move on like I was nothing? \n\nI dug deeper and realized that this stemmed from my internal belief of feeling like I wasn’t good enough. That was how I felt about myself due to how I was raised, so when my ex broke up with me, i felt so unwanted. I got my self worth from him and so when he left my life, my self worth was also gone. So since I realized the root cause of this feeling, I’ve been actively working on it through choosing ME.\n\nI do this by shifting my focus from my ex to myself and doing guided meditation, being kind to myself, reminding myself that I am enough just as I am right now and imagining two versions of me- one’s a baby version of me and the other is an adult version of me. I pretend that it’s the baby version of me feeling hurt and rejected, and I soothe the baby (which is me). I say kind words to the baby and remind them that it’s okay to feel the way she does. And remind her I will always be there for her when she needs. That I will never leave her. Let her cry on me and hug her tightly, console her that although it hurts, it WILL get better. \n\nAnd then after I’ve soothed the baby, I thank myself and tell myself how proud I am for trying. \n\nWhen I get reminded about my ex, I gently and kindly tell myself it’s okay to think and feel things about him, but let’s shift the focus back to me. \n\nThese are things that are helping me currently. Maybe some of these can help you too!"}, {"comment_author": "moogle15", "comment_text": "As long as you are staying healthy and hygienic, I wouldn’t worry about trying to fit anyone else’s notions of attractiveness. People are attracted and turned off by all kinds of things, and you can only control so much regarding their opinions/perceptions.\n\nThe fact that he said he was looking to settle down, then left a year later, means that he was either a flake, lying to himself, impatient, or perceived a lack of long-term compatibility and decided to take the nuclear action instead of talking things out, which indicates impulsivity and a lack of long term planning. Also, if he’s already talking to another girl, he may have been having side flings while you were together. In any case, it sounds like you dodged a bullet.\n\nLastly, if you have the means and desire, I would suggest trying out therapy, volunteering, getting a pet, trying out Meet Up events, traveling, and/or attending local community events. I’ve personally found these to be great for getting to know nice people, get out of my routine, and lift my mood. 😊"}, {"comment_author": "UnicornPanties", "comment_text": "Adding to this, a lack of long term compatibility can rarely be worked out"}, {"comment_author": "bugzaway", "comment_text": "Yo. This literally just happened. There is not a single thing you need you need to be feeling or doing right now. \n\nThere is no right way to be right this moment, except simply not doing anything crazy.  It is ok to be sad. It is ok to be angry. It is ok to eat a giant tub of ice cream. It is ok to go hit a punching bag. It is ok to cry yourself to sleep. It is ok to call or hangout with your best and talk their head off. It is ok to say nothing. All those things and more are ok. \n\nThis literally just happened. At some point you might need/use LPT to deal in whatever way feels best for you (hit the gym, go party, whatever fuck people do to get over break ups and/or regain their confidence). \n\nBut all that shit can wait. This JUST happened. It's ok to grieve."}, {"comment_author": "Chenx335", "comment_text": "I always take rejection as a gift. The other person is honest enough to tell me the truth and let me move on instead of toying with me and prolonging the agony. I appreciate that. So rejection is not a bad thing."}, {"comment_author": "terperr", "comment_text": "It’s good that he showed his true colors before y’all settled down. I’m so sorry this happened and has more to do with him than you. In terms of “attractiveness” just make sure you have good hygiene and be nice to yourself. The right one won’t want you to change a thing"}, {"comment_author": "Super_Boof", "comment_text": "There’s a lot of good advice in here. I’ll add a few things as I just went through a tough breakup: \n\n1. You shouldn’t fret over someone who doesn’t want you - why waste your emotional energy on someone who wouldn’t do the same for you? You’re better than that. Value yourself first, and look at it as if people who don’t want you don’t deserve you. This is assuming you weren’t a toxic partner; if that is the case, you probably know and have some anxiety about that - talk to a therapist and work on being healthier in your relationships. \n\n2. The most attractive thing you can do is prioritize yourself. I don’t mean that as “be as selfish / narcissistic as possible” but rather: pursue your own interests, and take care of yourself. Essentially, treat yourself like the person you are trying to impress. Demonstrate to yourself that you are worth it, and others will take notice. Focus on healthy / happy habits and living, and in time you’ll attract more people - then you just have to choose one with similar values.\n\n3. On the same note as the last 2, in order to truly be happy in life you need to forego the need for external gratification / approval (I know, Easier said than done)… the truth is that others approval should not matter to you - you are who you are and nobody can take that away from you or save you from yourself. Ultimately the game of life is against yourself, and only you can change it for better or worse. Pursue your own life passionately and you’ll find someone who will truly ride or die the you express."}, {"comment_author": "toucheyy", "comment_text": "I feel the *exact* same way."}, {"comment_author": "Deathb3rry", "comment_text": "it sounds like there's also alot of things besides it being just a rejection, you were vested in the rls, you thought he was vested, he abruptly(?) broke it off, and alr looks to have moved on.\n\nI think when we get hit by a downswing, we forget alot of the upswings we had in life. So in a small attempt to rebuild/respark that confidence, what's one recent thing you did for someone else or yourself that made you or them happy/proud?"}, {"comment_author": "SpiritGuide369", "comment_text": "Hi there I know at this moment you do not want to hear this but if he can move on so fast he does not see your value. I would suggest use this time to work on yourself, create a morning exercise routine, work on self love to build up that low confidence/self esteem. With relationships one must make sure that the love we have for our partner does not exceed the love we have for ourselves, else we would form a dependence on the love of our partner. This creates insercurities along with Fear which will create chaos possibly leading to break up. Stay committed to yourself and the right person will come at the right time, do not settle for less than you deserve just because you alone. \n\nAll the best✌❤🌞"}, {"comment_author": "Quality-C-24", "comment_text": "Hey there! Focus on yourself, I know everyone says this but it’s so true! Do the things you love doing, the things you forgot you loved doing.\nIn the process as well, vent/cry/write and go through your emotions as it will make you feel better. \nRegarding him, he’s already shown you he’s not trustworthy. Keep a reminder for yourself that you need a partner that makes you feel secure and at peace.\nHope this helps! X"}, {"comment_author": "Gibbonici", "comment_text": "There are people out there who think you're great. You might know some of them already, and you will certainly meet more of them over time.\n\nHow you're feeling about yourself now isn't reliable. Don't judge yourself by it. It's just grief, and grief passes.\n\nIn the meantime, keep doing the good things for yourself. Cry when you need to, but also look for the good things in your life. They might not feel like much right now, but they're yours and they mean more than anything that you had.\n\nThere are people out here on this thread who'll you'll probably never meet, but we're all rooting for you. It's hard to see now, but the world is full of love and people who care. \n\nIt's only a matter of time before you meet someone else, you've just got to ride the grief out first. And you will."}, {"comment_author": "AeroNHydro", "comment_text": "Take this as an opportunity to work on yourself. Get more self confidence. Go into the next relationship as a new person expecting a different result. Ideally get to the point where your \"good enough\" opinion is coming from you not your partner. If you think you are good enough that should be all you need doesn't matter what someone else thinks."}, {"comment_author": "trippknightly", "comment_text": "There is no shortage of good podcasts on breakups and on some level they all say the same thing. You need a little time but soon give a listen to Alexis Fernandez's esp the How to Get Over an Ex. She is brutally honest."}, {"comment_author": "living4life_", "comment_text": "It’s hard, I know, but you have to realize that you are worth so much more than a guy. Life works in mysterious ways and i think the only thing we can control is how we react and how we build, grow and better ourselves. You are a beautiful person and never deserve anything bad to happen, and in a way just look at this breakup as a blessing in disguise. Something better will reveal itself sooner or later, and the best thing to do is just focus on you. Let the universe do its thing. And look at it this way: be glad it happened before anything got too serious. People come and go in your life; they are there for a season, a reason, or to stay. This guy was obviously just for a season and left when it got too hard for him. You have to find the people that are there to stay and cherish them. And the people there for a reason is to teach you a lesson. At the end of the day, the ONLY thing you can control in your life is your attitude and how you deal with these things. Give yourself time to be sad, but also tell yourself that you are worth so much more, and deserve so much better. Spend some time focusing on yourself because love finds you when you least expect it. I am so proud of you, keep working hard, you will succeed in life <3"}, {"comment_author": "Equal_Physics4091", "comment_text": "My heart was broken by a guy who literally begged me on bended knee to move to Seattle for him. I didn't think we were that serious but it was probably my only chance to get out of a dead Southern town and experience life, so I said WTH.\n\nLong story short, he was a man whore. He'd lured me there with promises of marriage and kids. A year later, he was trying to gaslight me into believing that I'd followed him to Seattle because I was \"obsessed\" with him. 🙄🙄🙄\n\nStill, I was devastated when his best friend told me the extent of his whoring and we broke up.I was too naive to understand that I'd been duped by a narcissist. Now I was thousands of miles from friends and family and all on my own. \n\nHow did I get over this shit hole? At first I was depressed and angry  at myself for believing his bullshit. I was just starting to realize how he'd destroyed my self esteem. I felt unattractive and unlovable. \n\nI was sinking into a deep depression and losing sleep due to anxiety about my future.\n\nI realized that I had to expel these feelings from my body before they consumed me. \n\nFor the first time in my life, I signed up for a 24 hour gym. I started working out any and every time those feelings started to creep in. I channeled all that anxious energy and anger into my workout. I was  100 lbs overweight at the time. \n\nMy mind wasn't on a weight loss goal or a specific health plan. I simply worked out for my mental health...as a distraction from the pain and rejection I felt. \n\nIt changed my life. The weight started to fall off. I grew more confident as I bought clothes to accentuate my sexy new figure. \n\n2 years later, narcissist asshole ran into me and was floored by my appearance. This skeevy douche now wanted me back. I stood there looking at this sad little man, who'd since gone bald. How had I given this idiot so much power over MY happiness and well being. \n\nHe, strangely, wanted to move in with me and make me \"wife number one\" 🙄🙄🙄🙄. Yeah, his broke ass just needed a place to live and it damn sure wasn't gonna be with me! \n\nThat devastating break up changed my life for the better. To this day I am thankful for the way it pushed me to improve my physical and mental health. I learned that I was strong AF and vowed that I'd never let a partner disrespect me as he had. I worked on figuring out what I truly needed in a relationship and learned how to communicate those needs. \n\nThat POS inadvertently prepared me to meet the love of my life. I can't imagine the sad, lonely life I would have had if I'd married the man whore. Instead, I met my soulmate a few years later. It was the best thing that ever happened to me. \n\nSorry for the long story. It turns out that romance isn't a race to the altar. It's a journey of self-discovery, trial and error, heartbreak and finding what love means to you. \n\nI wish you luck on your path. You will find love in a partner that treasures you. There are so many guys out there looking for a treasure just like you!"}, {"comment_author": "TheGoodSmells", "comment_text": "His loss. It’s irritating that his decision affect you, but they don’t reflect upon you. You chose a loser. We all choose losers now and again."}, {"comment_author": "practiceyourart", "comment_text": "How can you possibly know it's his loss, or that he's a loser? We don't know almost anything at all from either of the two."}, {"comment_author": "TheGoodSmells", "comment_text": "For that matter, how can I be sure the earth revolves around the sun?! I’ve never seen it do that!"}, {"comment_author": "practiceyourart", "comment_text": "Please list why it's his loss and why he's a loser. 😂"}, {"comment_author": "maija_hee", "comment_text": "are u good tf"}, {"comment_author": "nixlplk", "comment_text": "Never doubt your self worth like this and let yourself be down. Do it too much and you'll spiral down deep and it's hard to come back from.  Speaking from personal experience. You are who you are and there's nothing wrong with it.  That is unless you're a Psychopath if not then you're good. \n\nSounds like you need to find yourself and get back your smile! Go out and do something that puts a smile on your face like a real great hobby, some kind of club gathering something that'll put you around people. Don't let yourself  feel like your not good enough. Go out make some friends, crack some good jokes and laugh.  I guarantee you'll find someone you can be happy with instead of needing someone to make you happy!  Good luck and i wish you nothing but happiness in life!"}, {"comment_author": "babybopper", "comment_text": "You shouldnt expect to be happy in a relationship, until you are fully happy with your self, while all alone. Happiness comes from within, not from others."}, {"comment_author": "Puzzleheaded_Coat153", "comment_text": "This will pass. Follow Dylan James. He talks a about manifestation and I do recommend listening to one of his night tapes at night, but he just posted advice he used himself. It was a picture of him years ago and one of now and how he’s changed.\nHe wrote: Discipline IS the choice on top. Follow that for at least 3-6 months and you’re life will change for the better!"}, {"comment_author": "thenthalpy", "comment_text": "Hon, I'm a 34 year old man. I think I understand some of your feelings and as others (esp. u/SpicySweett ) have said, process this in your own way. But my gut reaction is that you are already attractive. You snagged this punk a year ago and I bet you could snag another. The issue isn't with you; the issue is with a man who promises to settle down before he's even felt out the relationship. For what it's worth, my advice is to rely on your own values and remind yourself that life exists outside of romantic relationships. I bet you find fulfillment outside of partnerships and it is refreshing to remind yourself of this. Keep casting lines out for men who might be just what you're looking for but use this recent experience as a lesson to take early promises with a grain or two of salt. Be real, be grounded, and never compromise yourself or your values. Soon enough, a man will come along who values you for more than eating healthy and going to the gym. He will value you for what you're worth and you'll find that all prior relationships just don't matter anymore.\n\nP.S. I'm sorry to have called you \"hon,\" but I'm in a weird phase where I seem to use that a lot to start my trains of thought. I use it not to belittle but instead to relate."}, {"comment_author": "tripletexas", "comment_text": "You are enough."}, {"comment_author": "iamtopher1", "comment_text": "A lot of good advice here on not taking it hard but I want to provide some practical advice here as well. While “you’re fine the way you are” is good to help you feel good, and you should feel good about yourself, it’s not advice. \n\nIn my experience as a man, and understanding  men in general (won’t apply to every man as everyone has different preferences) men are attracted to “femininity“. Yes I know that’s very vague and femininity and masculinity are fluid terms but I’ll try to outline what I mean with some examples of traits below that men (generally speaking) look for in a female partner in order of priority: \n\n**1. Physical appearance**\n- Men are visual creatures, and they want someone they are physically attracted to\n- *Relatively* slim physique, but more so enough slimness to show feminine curves (this means lots of variance!)\n- if you’re considered “overweight”, def work on trying to slim down a bit - its great to see you go to the gym and eat healthy! (controversial, i know, but this is just how most men i know operate)\n- Nice hair, clothes that show off your feminine figure (not being overtly sexual and revealing, although it can work but maybe more so for guys looking for a one night stand), and not *too* much makeup where you can see the layers of foundation\n- good hygiene (probably goes without saying lol) \n\n**2. Warmth**\n- broad term but includes being just generally kind, supportive, empathetic, nurturing and non-combative\n- contrary to what many may think, men don’t really like to be challenged all the time. Yes in a flirty way, but not in a way where he has to constantly be vying for your attention etc\n- being receptive to his humor is a big one! I love making my partner laugh, it makes me happy that I’m making her laugh and be happy, and makes me feel more connected with her \n- give him room to lead and support his decision making (within reason. if he wants to fight someone for no reason, don’t support that - major red flag hahaha) \n- showing appreciation - men like to see their efforts mean something to their partner and this will go a long way\n\n**3. Integrity** \n- again, very broad term, but more along the lines of strong morals specifically demonstrating loyalty, being accountable for your actions and self awareness\n- for me personally, what i love about my partner is she has strong family values and prioritizes it. This is very attractive to me. \n\nAnd honestly that’s it. \n\n\nThere’s also some things that you should know that men generally don’t care that much about, like how much money you make, or that you’re highly educated, or that you work a lot and are ambitious. While these are great things, they’re not something that’s going to emphasize your attractiveness. So it’s fine to mention it, but don’t think that these are things that attract men in general. (Again, everyone is different and some men really do value these things, most men in my experience don’t prioritize them, especially against the 3 traits listed above). \n\nFinally don’t constantly talk about or brag about your sexual history (i think this can go for both men and women). No future partner wants to think about their current partner or prospective partner being sexual with someone else. \n\nDating in your 30s is hard and rejection is hard to deal with. The best way to deal with it, is by getting used to rejection and understanding what went wrong and changing your strategy (within reason and without losing yourself in the process) but more importantly also understanding that this person that rejected you also might not have been a good fit for you anyways! **Being rejected is not a reflection of your self worth!** \n\nGood luck and I hope this helps."}, {"comment_author": "None", "comment_text": "[removed]"}, {"comment_author": "AutoModerator", "comment_text": "Your submission was automatically removed because it includes bigotry and/or hate speech.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GetMotivated) if you have any questions or concerns.*"}, {"comment_author": "Pure-for-life", "comment_text": "You are attractive, no one needs to confirm it except you ❤️"}, {"comment_author": "bebackground471", "comment_text": "I am tired as well and read _erection_ instead of rejection in the title. That being said, sorry to hear it didn't work out, and this doesn't necessarily mean there's something wrong with you, so don't take all responsibility. I hope you move on to be happy with yourself, and that you'll find someone who loves *you*."}, {"comment_author": "LadyAnarki", "comment_text": "He lied to you. You weren't rejected. He lied to you to get you into bed, you missed the red flags, and now he's moved on to his next target. Rejection is never about you. It's about them, or it's about compatibility. You follow the 3 months no kissing rule, get to really know why a person stepped into your life, look at what they do, not what they say, and after 3 months decide if you want to be exclusive & intimate. You don't move in until you're married (if that's what you're looking for). You don't play the wife part until you are a wife. The problem here isn't your desirability. To the right man, you will always be desirable. This was the wrong guy - a liar and a user, and you just missed the signs."}, {"comment_author": "ashleyv189", "comment_text": "Something I read the other day summed it up well for me as someone who suffers with a fear of rejection.\n“It’s not rejection it’s redirection”\nIt wasn’t meant to be and there is now opportunity to go in a new exciting direction. It will hurt for a short while but then you will learn to enjoy the now and the future."}, {"comment_author": "CelticGaelic", "comment_text": "Tl;dr, it's better for a relationship to end before any major commitments are made than to end up stuck in a toxic relationship. I'm not saying any of this would have happened to you, but the grass ain't always greener.\n\nFirst off, I'm very sorry that you're going through this. It hurts, it sucks, and it's just all around devastating.\n\nWhat I have to say may seem like cold comfort, as it certainly was to me, but I will also go into some personal experiences that made me understand why people give advice like this. It's better to have a relationship end than it is to stay in a relationship that's not fulfilling.\n\nIn the beginning, your ex probably was sincere and shared the same goals and desires. However, the idea and the reality are often very different, and they may have realized that it's not what they wanted. It's possible they still have those goals, but they came to believe that you weren't the right person.\n\nAs for my personal experience, over ten years ago, I fell in love with someone who reciprocated. I truly believed that I had found my soul mate, even though it was a long-distance relationship. We were together for about three years, and we started to discuss some really serious shit like marriage. Then, seemingly out of the blue, she told me \"We need to talk.\" After we talked, the relationship was done, and I was beside myself. I was hurt, I was angry, and I was very confused. I spent weeks reflecting and trying to figure out what went wrong and what I did wrong.\n\nWell, a realization hit me after a while, and I came to the conclusion that she made the right choice. We had a lot in common, too much in common, actually. We both had some personal roadblocks that made continuing the relationship very difficult, even if we were both happy at the time. Our discussion about marriage got her thinking, and she realized that we were making plans that neither of us were going to be able to make a reality. We needed something different. \n\nAfter realizing this, I reached out and talked to her. We both still trusted each other, and neither of us said anything cruel to the other, so things were amicable. You know that whole cliche about getting friend-zoned? That's what we ended up agreeing to. We're still very close friends to this day. I'm still single, but she's married now. Her husband is different from me in ways that she really needs. And yeah, it did hurt when she started seeing someone and that relationship developed and grew, while I couldn't maintain a lasting romance with anyone else. I was lonely for the longest time and started to get bitter.\n\nStrap in, because here's where things go batshit!\n\nWhat did not help with the loneliness was most of my other friends and family were getting married, starting families, and all of that. For a time, for all of them, things were good. One of my younger cousins, who was in his mid-twenties at this point, rushed into a relationship and was drunk off dopamine. He put the \"dope\" in dopamine. It did not take his girlfriend long to start seeing red flags, and his behavior reminded me of myself at times. So his girlfriend ended the relationship, and my cousin was devastated like I was. \n\nI don't think it was even a month before he was dating someone else. About a month later, he proposed. I had some reservations because of...everything, but I was supportive. Red flags from both of them started popping up. It got so bad that my family started to suspect she was actually vandalizing my cousin's property over a petty perceived slight. It was confirmed, however, that she had not been the one to vandalize his car, thanks to the apartment complex's security cameras, so the family dropped the matter and the day of the wedding came and went.\n\nI had misgivings, but every time I asked or brought it up to others, they dismissed my concerns and their behavior as \"pre-wedding jitters\". Almost immediately after the wedding, EVERYBODY saw serious signs of abuse being suffered by my cousin. His wife threw things at him when she was upset, took complete control of the finances, and if he upset her bad enough, she would leave without notice for days and leave him without access to food (aside from family), ways to feed and care for their dogs, and other essentials. Within five months of the wedding, the family was finally acknowledging that things were bad, and that's when she started to accuse him of abuse, made threats of suicide, etc.\n\nThey separated, and the entire legal was one of the most horrific things I ever saw. My cousin had to get a lawyer and get proactive in documenting his activity because of how frequently his ex called the police to accuse him of stalking, harassment, vandalism, etc., because the cops showed up to his home a workplace ready to arrest him until his employer verified his presence during the alleged incidents. Meanwhile, she was doing everything she accused him of. The cops did nothing, and my cousin had enough and moved out of state.\n\nThat's just one of my friends/family. Another friend got married to a woman with a family full of drug addicts that resulted in their divorce. Another friend got married to his partner of over ten years and had twins. His wife was diligent and encouraged him to take a fulfilling and high-paying job that he enjoyed. One day, he got a concerned call from their children's daycare as his wife had failed to pick up their children and was not answering their calls. He called her and when she answered, she gave a cryptic response that alarmed him. He had to leave work and pick up their kids and was greeted at their home to a \"Dear John\" Letter saying that she had been fucking another guy and had run away to Europe with him because she realized she didn't actually want to settle down and have a family, even though most of that had been her idea to begin with.\n\nI've stopped dating, I've stopped flirting with women, and I don't view long-term relationships and marriage as a goal. \n\nI put the tl;dr at the top, but to get to the point, as much as you're hurting right now, it's better to let it end and focus on yourself and make life more fulfilling for you personally. Explore some hobbies, take vacations, and try new things!\n\nIf you need someone to talk to, you can hit me with a DM."}, {"comment_author": "Guses", "comment_text": "9 months ago (while in this new relationship?) you were still down because of your previous ex dumping you 2 years prior. I would recommend therapy for dealing with depression, shame and attachment issues. It helped me a lot. Good luck!"}, {"comment_author": "Otter0131", "comment_text": "I understand what you are going through. I had a bad breakup when I was 32, a guy who I had olby been dating a couple of months but I thought we were a great match. Turns out he was love bombing me, and was still in love with his ex, se he went back to her. I was devastated, as I wanted to find my person. \nA friend gave me a great advice, she said don’t focus on the person, hace trust that you will find him. Focud on you, this is your years of bachelorette party, do what you want to do, hang with your friends, travel do you. This is are the last years you will get to do that. And when your love shows in your life you will be ok to share it.\nAnd sure enough I met my husband when I was 36."}, {"comment_author": "Etoxins", "comment_text": "Well you're doing things that will make you feel better like working out. You can't control how he feels but try to work on the things you can control. You can't change the temperament you've had since you were a kid but you can control how you handle your next relationship"}, {"comment_author": "Theonethatgotherway", "comment_text": "Have you tried therapy? It sounds like there is a pattern of you thinking you deserve less and then getting stuck emotionally because of the men who see that as an opportunity to take advantage or use you as a stepping stone. If you have been emotionally hurt and seek out a potential partner in that state, the chances of them aggravating or perpetuating the cycle are pretty good. I don't know your situation, but something seems off and I think some compassionate accountability from a third party who has your best interest at heart would be invaluable to breaking through your disillusionment. As many here have said, it's less about looks and more about you being validated. If talking through it isn't initially helpful, medications, even if temporary can help with perspective, confidence and drive. Your confidence needs to be nurtured and you need to be sure it's in good hands. Wishing you all the future happiness and grace you deserve💕"}, {"comment_author": "everydayabnormalguy", "comment_text": "All you lost is a guy who can’t commit.. so you didn’t lose much haha"}, {"comment_author": "Imaginary_Heat_6699", "comment_text": "I’d say that’s a pretty normal reaction, just don’t live in it. You’re going to feel a sense of loss. Our minds and emotions can’t tell the difference between an actual death and just a break up. Just keep getting up every day one day at a time keeping with your exercise routine maybe going for extra walks, but take care of yourself, and allow yourself to grieve the relationship, what’s you’re feeling about yourself will eventually go away but during this process do not get involved with somebody else because your brain will register that like a drug and could potentially create a cycle. Do things that make you feel good about yourself. Go buy some new undergarments/lingerie. Whatever works for you go, maybe try going to the beauty salon and get your hair done make up done go get a massage you need to reinforce positive feelings about yourself. Trust me your mind is at war with yourself when this stuff happens but you are not the things that you are telling yourself you are a good person you are worth being loved, everything that you’re going through with this person deceiving you is all about them and nothing about you but I’m sure you’ve heard that before. Chin up, try to look at this as dodging a bullet because you don’t want somebody in your life that’s not fully there. my thoughts from an uneducated, but experienced in life 55-year-old female who’s had a lot of broken relationships, and finally realized what they meant sometimes our pickers get broken because we don’t give ourselves enough time between relationships to actually fully heal and realize the beauty and something ending and getting that time with ourselves to reinforce what we want and what we don’t want what we accept, and what we will not accept. God bless you be patient with yourself."}, {"comment_author": "lonelymoosh", "comment_text": "Not an advice but i’m in the same boat. Saving this for myself! Hang in there OP."}, {"comment_author": "jkca1", "comment_text": "Imagine if you had broken up with him first. Would that have improve your confidence? Would you feel like you are a better person? I don't think so, but what's important is what do you think?"}, {"comment_author": "Real_Project2563", "comment_text": "Are you in your best physical shape that you know you can be ? If not, start working towards it right now. The easiest way to handle rejection is to start searching for a new partner right away. He broke up with you, he doesn't deserve any time in your head. Time is invaluable."}, {"comment_author": "Lethal1211", "comment_text": "I think it was already mentioned, well if you don't feel good enough why don't you pick up a new talent? Learn Spanish or how to decorate landscape, or even change a tire. Who knows, but the proper way to move on is that you completely remove him out of your life and accept it only then you will be able to move on and the feelings just kind of go with it. Learn new soup recipes or how to make a pizza"}, {"comment_author": "kentuckyliz", "comment_text": "Be grateful to be released in your sexual prime.  The next one will work out.  Be the queen that you are and that he is unworthy of.  Keep kissing frogs.  Your prince will come."}, {"comment_author": "Hypno--Toad", "comment_text": "What about guys being unsure, it seems to me women reward men for lying to them and telling them what they want to hear in the moment. \n\nWhy must women pursue people keeping up appearances"}, {"comment_author": "Cyberdog", "comment_text": "When men initiate a breakup after a longish relationship it’s often because they find themselves involuntarily attracted to at least one other person and they don’t want to be unfaithful to you while still promising faithfulness. Their involuntary attraction to others is not at all a judgement about you or even about the others — they are preprogrammed that way. in fact, paradoxically, breaking up with you before possibly betraying you shows how much he cared for you."}, {"comment_author": "78kiolbassa", "comment_text": "I always said, it's easier to get over one, when you get under one. At least it did for me ..."}, {"comment_author": "finchslanding", "comment_text": "Happiness is a very attractive quality. So take some time to mourn this relationship and then figure put activities that make you happy. \n\nPs He sounds like a total loser. You dodged a bullet!"}, {"comment_author": "drellynz", "comment_text": "Do not waste time thinking about someone that is gone.  \nGet excited about who you might meet next!"}, {"comment_author": "Bulldog2117", "comment_text": "Clearly you’re not good enough he left you. Want to feel better find a really nice dressed man about 50. Take a pic with him. They a pic of your dream car. Send him the pics and tell him I was so upset but thank you. You’ve done me a huge favor"}, {"comment_author": "sleaziestsleaze", "comment_text": "Every time you think of him, pour yourself a whisky. Works like a charm."}]}, {"post_title": "[Video] Disabled Youtuber Emotionally Celebrates Youtube Total Views Going From 4017 To 4036!", "post_url": "https://youtu.be/5dpmTkkTe1M?si=2bOOberPfy0x2fKm", "post_main_text": "", "post_comments": [{"comment_author": "WhatAboutPhilly", "comment_text": "And now two more! (I watched twice)."}, {"comment_author": "Lavarekira", "comment_text": "Thank you, every view means the world to him!"}, {"comment_author": "SlaveToo", "comment_text": "Well you've done it now. Front page of reddit."}, {"comment_author": "Lavarekira", "comment_text": "Yay!"}, {"comment_author": "Teh_B00", "comment_text": "RemindMe! 1 day"}, {"comment_author": "LoserBand", "comment_text": "Wholesome!"}, {"comment_author": "Lavarekira", "comment_text": "FOLLOW UP VIDEO: https://www.youtube.com/watch?v=l-nWcAi6-yw"}]}, {"post_title": "[Video] Chauntal Capri-Lewis shares her remarkable journey, urging women worldwide not to let obstacles hinder their dreams", "post_url": "https://youtu.be/eGPxOgSJcwA", "post_main_text": "", "post_comments": []}, {"post_title": "[Text] Motivation to be healthy ", "post_url": "https://www.reddit.com/r/GetMotivated/comments/1bxxpba/text_motivation_to_be_healthy/", "post_main_text": "\nFirm believer that healthy habits are the key to motivation for me. My productivity and motivation to take care of myself comes and goes though, and I am definitely struggling right now. \n\nI had a weird childhood, and I never really developed basic healthy habits. Like I know eating vegetables is an important part of being healthy, but I just don’t care. I know sleep is important to be healthy, but I still stay up late. Same with exercise and finances. \n\nI’ve been in therapy for depression for years and it has helped, and I might just be going through a depressive episode.  But I’d love to hear what kinds of things motivate you to just take basic human care of yourself. How is “because it’s good for me” enough of a reason for someone to do unenjoyable things? \n\nIt feels a little sad to me that I don’t have that same reaction. I’ve taken care of other adults, children and animals and am always concerned about their wellbeing and am vigilant about making healthy choices. I feel like I should care about myself in the same way….but I just don’t. \n\nThank you if you’ve made it through my little ramble. I’m open to hearing any thoughts or if you can relate to what I’m saying! ", "post_comments": [{"comment_author": "Loki667", "comment_text": "A lot of what we eat in the US is total garbage! Most shouldn't even be labeled food! [All the food is poison!!](https://youtu.be/_Re6pZri8Gw?si=vGr0WU8B1Y9iq4cY) 😆 but seriously\n\nIf nothing else, don't be like me and find yourself with a serious condition because of all the garbage foods and seriously regret all of it. I felt like I was invincible without a worry. Thank God things have turned around but had I known 15 years ago, I'd be SO much better off today\n\nFor me it's a lot easier to avoid processed junk /fast foods when I became aware how much havoc these things cause in the body. My real stumbling block was drinking and making very poor dietary choices while either drunk or hung over."}]}, {"post_title": "[Discussion] What should I do? Need help quitting.", "post_url": "https://www.reddit.com/r/GetMotivated/comments/1bxo6xc/discussion_what_should_i_do_need_help_quitting/", "post_main_text": "I am 19M. Throughout the day i have zero problem controlling my masturbation because I'm always out and about busy with schoolwork, hanging out with friends, etc.\n\nHowever, the problem happens at night when I'm in bed. After I finish watching my show, i just get a insane urge to masturbate, like its a habit. For the last 6 years ive done this almost every single night, where I watch porn and masturbate to fall asleep. I'm like 99% sure this has ruined my ability to socialize and talk to women and has also given me ED as i have had trouble keeping it up during sex. \n\nHow do i stop myself from the urge of masturbating whenever I'm in bed? Any help would be greatly appreciated.\n", "post_comments": [{"comment_author": "-Dalzik-", "comment_text": "Everytime you feel the urge, do 10 push ups. Continue this until you are too tired to want to"}, {"comment_author": "F33dR", "comment_text": "I've used this method. It works."}, {"comment_author": "slatt_dog38", "comment_text": "Will try this method"}, {"comment_author": "Ranch_Dressing321", "comment_text": "Will try this out in an hour."}, {"comment_author": "its_justme", "comment_text": "The problem is the porn not the jacking. \n\nLots of people do this before bed. The problem is the instant gratification of porn. \n\nFrom now on use your imagination only. You’ll either fall asleep first  or complete but it’ll be working for the dopamine hit which is more like real life."}, {"comment_author": "Dirtymike_nd_theboyz", "comment_text": "Came here to say this. I still watch occasionally but i try to keep the subject matter within the bounds of reality, so to speak, and try to limit it to like once maybe twice a week. I jerk off every night i cant fall asleep without doing it lol but i stopped regularly watching porn every time.\n\nI had a bad habit of watching porn (like twice daily if not more) seeking out my specific interest (butt stuff) and after a decade it finally started to affect my intimate moments with women. As soon as i realized what was happening I made some efforts to change for the better.\n\nI still jerk off like 3 or 4 times a day, I cant help it, I have an insatiable, voracious libido. Bloodwork confirmed this I always have 600-800 nanograms per deciliter of testosterone and have for years, which is way in the upper range for someone my age. Its a huge inconvenience actually, and im tired of it. But for my mental health and to make sure I can rise to the occasion I am much more careful about what content i watch, for how long, etc.\n\nOne thing i want to point out for OP, your brain responds to things like placebos very strongly. If you know what you are watching is nasty, if you feel guilty or disgusting when you are finished, it is far more likely to do damage to your psyche. If you instead just appreciate the female figure without watching hardcore or fetishy porn, and dont feel guilty or disgusted with yourself when its over, you will feel much better about yourself. Its just \"me time\" there is nothing wrong with it, and you are a human being who has valid needs wants and desires. No shame in that unless you overindulge like a glutton.\n\nTheres boatloads of studies which you can draw conclusions from on this topic of placebo and how your brain effects your body- in one study i recall, two people eat the same meal, the control just has dinner without being bothered but the other subject is exposed to gross smells or audio of someone puking, that person is much more likely to experience digestive/intestinal distress from an identical meal to the control... Your mind effects your body and your body effects your mind. Same can be said for porn and it should be consumed not only in moderation but also the subject matter should be carefully chosen. Do not let your fantasies get out of hand, if you watch too much crazy stuff and dont hold back, your interests will continue to escalate until normal interactions with even the hottest of women will not be enough. Be good to yourself."}, {"comment_author": "RuncleGrape", "comment_text": "Agreed. Masturbation is healthy, porn is not."}, {"comment_author": "slatt_dog38", "comment_text": "For the past few days ive purposely stayed up watching my tv show until Im about to pass out, then I started my masturbation routine and passed out in like 2 minutes without even doing it much. A good start but I dont think its a viable solution"}, {"comment_author": "slatt_dog38", "comment_text": "Thanks for the insight. I don't feel that I'm anywhere close to the horrible state you described at the end. Porn is definitely what I want to cut back on and yeah I also have developed that habit of jerking it every night to fall asleep."}, {"comment_author": "Dirtymike_nd_theboyz", "comment_text": "Most definitely! As long as it doesnt lead to watching porn every night, its probably not even a bad habit unless your like gorilla grip destroying your meat so theres no feeling. \n\nGetting good sleep and waking up feeling ready for the day is extremely important, gotta do what you gotta do to make that happen. I would know, im a lifelong insomniac and i have resorted to eveyrthing from heavy drugs and alcohol to furious masturbation. Ill do anything for a wink of sleep because it is so goddamn elusive."}, {"comment_author": "arno3042", "comment_text": "I'm no expert but I would say instead of masturbating every day try scheduling it to be a day or two apart inststead of every day and maybe don't watch porn during your brake days because it would maybe push you and you can masturbate if that happens and if you take break days from masturbating your cum wil build up and there will most certainly more cum and the feeling will be better and stronger\n\nHope youl work this out"}, {"comment_author": "slatt_dog38", "comment_text": "Well that's the thing I try to not do it every day but my urges just get the best of me and I'm trying to stop it altogether"}, {"comment_author": "cbrown146", "comment_text": "One thing helped me. Facts: porn is fantasy. Those women are acting. Behind the scenes they have to stop acting in between shots to get a different angle. They are getting paid that’s their motivation. Having sex feels good, but the high doesn’t hit the same way twice. Imagine having too much of a good thing. That feeling and high is so low at some point it’s just another job to them. They have to get tested regularly for STDs. Finally, some of their sex positions are so unrealistic in regular sex it hurts my back thinking about doing it IRL. Hope this helps."}, {"comment_author": "lamb_passanda", "comment_text": "Are you getting triggered by something by any chance? Hot people on your IG feed for instance? If so then maybe the solution is to keep your phone at a distance when you're in bed at night, and find a non sexual book that really engrosses you. or a YouTube channel about ancient history or some other unsexy subject. Worked for me at least, I realised that IG was triggering me. Another thing I would say is that your ED issues are likely just in your head. Don't listen to the nofap cultists telling you that you're wasting your \"mojo\" by masturbating. You can fuck with the best of them. And It's normal. Even once per day is normal for many people. However, if it's really an issue then maybe you just need to wait for a partner that makes you feel like you never want to look at anyone else again. I know that probably seems unimaginable, but keep yourself open to it anyway. They will come along at some point."}, {"comment_author": "Ande138", "comment_text": "You can beat this! Just try Hard!"}, {"comment_author": "slatt_dog38", "comment_text": "Thanks for the advice, will be sure to take a whack at it"}, {"comment_author": "MurseMan1964", "comment_text": "Keep it up, you’ll get a hand on it."}, {"comment_author": "Teardrith", "comment_text": "I think trying soft might be more beneficial"}, {"comment_author": "kegastam", "comment_text": "You can strongarm this, grab your motivation tight."}, {"comment_author": "Decantus", "comment_text": "Have you been tested for ADHD?  Compulsion for stimulation is a pretty big part of it."}, {"comment_author": "slatt_dog38", "comment_text": "Never been tested but throughout my life based on my behavior I'm 99.8% sure I have it lol"}, {"comment_author": "kraddock", "comment_text": "ADHD-like symptoms are actually a CONSIQUENCE of PMO, not a cause. I'd say a huge case of people, diagnosed with ADHD nowadays (the so-called \"adult-onset AD(H)D\") actually have addictive behaviors that are causing dopamine dysregulation and ADHD-like symptoms. It's actually very easy for a practitioner to test this, but no need to spend time and money on it - just check if you had any problems in elementary school, before hitting puberty - chances are that if you hadn't (if you were not hyperactive, inattentive kid in school, with bad grades and behavior and whatnot) you don't have the disorder, just similar symptoms."}, {"comment_author": "VIktor36", "comment_text": "Masturbating once per day will not give you erectile dysfunction. It will also not affect your ability to talk to women in any way. \n\nThe kind of media where these ideas are circulating will probably cause both of those things through placebo.  Thinking talking to women is some sort of skill separate from talking to men is not a very healthy view of people, and you might want to consider talking to someone about it."}, {"comment_author": "slatt_dog38", "comment_text": "I reduced it to once per day for the past few months, however:\n\nFrom ages 12-14, it was 2 times a day\nFrom ages 14-16, it was 3 sometimes 4 a day\nFrom ages 17-18 it was 1 sometimes 2 a day\nAll with porn\n\nWhich I think has damaged me"}, {"comment_author": "fuqqkevindurant", "comment_text": "It hasnt damaged you. Stop blaming your anxiety about talking to women on beating off and actually figure out how to solve the actual problem. \n\nYou’re clinging to pseudoscience and bullshit bc it makes you more comfortable than admitting that you are the issue and you need to work on yourself"}, {"comment_author": "coopthepirate", "comment_text": "There are no studies that show this type of damage bud (and they've done a lot). Arousal is a complicated process with a lot of moving parts. You should talk to a therapist about it.\n\nThere are however a ton of dudes with podcasts (where they sell ED stuff) that push this idea and make a lot of claims. I would be skeptical of these sources of information.\n\nYou'll get there my friend. Try and keep pushing yourself to venture out of your comfort zone with social interactions (without any expectations)."}, {"comment_author": "lamb_passanda", "comment_text": "That sounds quite normal. You're not any more \"damaged\" than anyone else is. Rhetoric such as \"I'm damagednforever because I need to look at hot people to get hard."}, {"comment_author": "slatt_dog38", "comment_text": "Maybe asking a site full of gooners was a bad idea"}, {"comment_author": "fuqqkevindurant", "comment_text": "Keep blaming jerking off for not being able to talk to girls. You’re clinging to it pretty hard, must be one hell of a security blanket for you🤡"}, {"comment_author": "PhilABole", "comment_text": "JFC dude, what are you worried about? I'm 53, almost 54 and I was starting to worry that I'm only snapping one out like five mornings a week these days and not every morning, AND sometimes at night. I have a girlfriend, we have sex at least 5x/week, but we still take matters into our own hands as well, and sometimes right next to one another. I'd flip out if I lost my libido and drive."}, {"comment_author": "omijh", "comment_text": "You jacking off has nothing to do with your ability to talking to women.   \nOne advice I got from a lady a long while back is just think of women as one of the dudes and talk to them like one of your mates.  \nJacking off is like drinking coffee with a limited time window of effect, pair it with a cup of lavender or camomile tea, after a jog for about 20-30mins and you will sleep like the vampire in the coffin ⚰️"}, {"comment_author": "apflaw", "comment_text": ">You jacking off has nothing to do with your ability to talking to women.   \n\nCompletely disagree. You can't claim this if you don't know OP personally and because of that you can't diagnose exactly why he struggles. It's highly likely that his brain doesn't have the innate drive to speak to females since he's supplementing it with the masturbation. But I don't know op, I can't confirm that this is what's happening it just seems the most likely possibility."}, {"comment_author": "omijh", "comment_text": "Hmm… Let’s ask him  \nHey op are you supplementing talking to women with masturbation ? If yes then that’s your problem just think of them as separate things like playing tennis and studying French. One can only affect the other if you want it to"}, {"comment_author": "slatt_dog38", "comment_text": "I definitely think of them as two separate things I just think porn and masturbation combined has ruined my self confidence and as a result my ability to talk not just to women, but to socialize with people in general."}, {"comment_author": "apflaw", "comment_text": " Seems you are aware consciously that it's affecting your socialization skills. If you remove the habit you'll  have a stronger drive. It won't magically make you better at talking to people, that's a social skill you'll have to work on, but you will get the feeling to socialize more. When you do, go to a different mall than usual, try to ask 5 random people something. Spark any type of conversation, ask about the weather, video games, complement their clothes; anything goes as long as it's not political, race based,  etc.  Build up that confidence and before you know it you'll be talking casually."}, {"comment_author": "mystmaster", "comment_text": "I'm no expert, but I think it'll take a combination of approaches, motivation to change but also being aware and proud of your progress, no matter how small.\n\n1) Try to cut down gradually. Downloading a habit tracker app can help you keep a record of when you did it. Allocate specific days of the week and say that you will only do it on those days. It might even be 6 days a week at first, but once you start to see your progress, that will help to motivate you to continue cutting down further and further.\n\n2) Replace it with another habit. You've built a routine up for this habit, so try to switch it out for something that's healthier and will give you a boost of pride. Do some push ups, drink a glass of water, try some guided meditation or download a language learning app. Whatever it is that you decide to do, consistency is key. Before long you'll have built a new, healthier habit into your routine.\n\n3) Change your room. Your brain associates your bed with the dopamine hit from masturbating, so if you can, you could do something to change this cue: getting a new mattress or blanket, or moving your bed to a different place in your room for example. \n\n4) Join a community. You're not alone, there are loads of others on the same journey as you, so don't be afraid to keep asking for help or motivation. Ask as many times as you need, or find a buddy that you can regularly check in with.\n\nYou will probably stumble, but that's okay! You're literally rewiring your brain, so it'll take time. Remember, there is nothing more powerful as a motivator than progress, so stay positive and celebrate the small wins along the way!"}, {"comment_author": "slatt_dog38", "comment_text": "Appreciate the support. I will try the push-up method and the habit tracking app."}, {"comment_author": "ImprovementKlutzy113", "comment_text": "There's a support group for jerking off. Why?? It's normal and healthy."}, {"comment_author": "83franks", "comment_text": "As with anything in life sometimes we can develope an unhealthy relationship with something that otherwise would be normal and healthy. In an increasingly digital and less social world with unlimited porn it isnt that surprising (to me at least) that people can build an unhealthy relationship with masturbation and porn."}, {"comment_author": "slatt_dog38", "comment_text": "See r/noFap"}, {"comment_author": "icecremecatsandwich", "comment_text": "Leave your phone outside the bedroom and the washroom."}, {"comment_author": "slatt_dog38", "comment_text": "Used that strategy for a week and it worked wonders, will return to doing that most likely"}, {"comment_author": "icecremecatsandwich", "comment_text": "Definitely works better than will power. \n\nSpend that extra bit of time reading - buy a kobo reader or a kindle if you feel bored. \n\nThe biggest triggers are usually boredom and scrolling on instagram."}, {"comment_author": "ImprovementKlutzy113", "comment_text": "Why quit it's actually healthy and has been proven to reduce the risk of prostate cancer. \nI'm 58 no plans on quitting."}, {"comment_author": "Ratiofarming", "comment_text": "Always change habits slightly. So step 1: You can still do that, but don't do it in bed. Do it literally anywhere else, but the bed is for sleeping only. If you have the urge when in bed, get up, do it somewhere else, go back to bed.\n\nThen change another thing, for example do it in the morning when you have a day ahead of you and can't take forever. You get the idea, don't stop cold turkey. That won't work. Make the changes you want to make in multiple steps.\n\nAs for the ED, it's not as uncommon as you think. Even at the age. C\\*\\*\\*rings exist for a reason, so does medication."}, {"comment_author": "whenthebeatdropss", "comment_text": "Idk man. Maybe it's age catching up to me but I've gotten pretty dang good at telling myself NO when I don't wanna indulge in something and sticking with it. Helps when you don't surround yourself with triggers. IE, social medias where the algorithms know you will click on the horny-bait."}, {"comment_author": "ConkerSp", "comment_text": "When you start thinking about doing it, immediatly replace that thought.  \nThink about a funny moment of the day, your tomorrow's to-do list, recreate in your head an epic scene from a movie, anything that can prevent your mind when it starts.  \nWhen I feel too stressed, depressed, or negative thoughts come to my mind, I [listen to this video](https://www.youtube.com/watch?v=ngKds1pbTWA). Maybe it's a little corny I took from a videogame a motivational/relaxing phrase, but it works for me, and probably would work for you.\n\nKeep up the good work, don't give up if you fail. It actually counts when you get up and try again."}, {"comment_author": "slatt_dog38", "comment_text": "Thank you, I will try this"}, {"comment_author": "krystlships", "comment_text": "Quit watching porn, use only your mental spank bank"}, {"comment_author": "Puppiessssss", "comment_text": "Quit porn."}, {"comment_author": "TheKlebe", "comment_text": "Don’t watch the show :D"}, {"comment_author": "Beneficial_Hope_9258", "comment_text": "You could try to watch your show and only get in bed when you're absolutely tired. Then your brain will associate your bed with sleep instead of masterbation. If you can't sleep then maybe try playing a game or keeping your mind occupied until you're tired"}, {"comment_author": "2layZ-GTE", "comment_text": "Masturbate without porn while trying to fantasize about someone. Don't use any stimulation. You'll lose your hard on but keep going till you finish. \n\nOnce this happens a couple of times, you'll get bored of doing it. Instead of fighting the urge, you get bored of the urge. Then the urge will leave."}, {"comment_author": "83franks", "comment_text": "This is a pretty built in routine and the saying goes neurons that fire together wire together. Basically at this point your brain is very specifically telling you to masturbate everytime you trigger your bed routine. Think of the brain like a muscle that needs to be stretched and strengthened. When working out if someone is using bad form they need to unlearn that and train the muscles to fire correctly to get the right form. The brain is no different. \n\nI say all this to hopefully help remove ideas like you have no will power or something like that. Your brain is expecting something and then does its best to get that reward. Changing this is slow process but very very doable and isnt that different from learning a skill like an instrument or sport. As someone said start slow, get one night a week where you break that routine, do whatever you need to in order to break it once a week, maybe choose a specific day or something but do your best to hit that one day. Think of other bed time routines you could do, another saying is its easier to grow a thick yard of grass than pick out every single weed, basically focus on what to do, not what to avoid. You could journal, make a tea, read a book, stretch, meditate, go for a short walk, sing a song, whatever, just something that will hopefully help trigger different things in your mind. \n\n\nAnother thing i like to do when feeling urges for things i dont want is [SOBER breathing](https://socialwork.wvu.edu/files/d/58767183-ce1b-4fa2-9567-93696fa3bce6/handouts-2_newfield.pdf). It'ss a good technique that helps us make the choices we really want and get off the auto pilot that bad habits usually thrive in."}, {"comment_author": "TangyApple680", "comment_text": "Jerk off. Its normal at 19. Watching too much porn is not. That shit is junk anyways. I haven't watched porn all year, but still jerk off. Try it."}, {"comment_author": "mildheadwound", "comment_text": "You simply cannot cum enough. How could you?"}, {"comment_author": "667FriendOfTheBeast", "comment_text": "Go to SAA maybe?"}, {"comment_author": "madhatter3", "comment_text": "I’m doing AA and it’s helped a lot. The community aspect and doing the steps has really helped. No more porn, drinking, etc and I don’t feel like I’m fighting it anymore. Just working the steps."}, {"comment_author": "Anime_Carrotcake", "comment_text": "Try not to do it in 1 week. And when u can do that, try 2 etc. Slowly slow it donw, uk?"}, {"comment_author": "Stillofthenite_", "comment_text": "Take melatonin like 20 min before bed that way you’ll go straight to sleep when you lay down. After a few times, maybe a week, your brain will associate bed with sleep and not masturbation."}, {"comment_author": "slatt_dog38", "comment_text": "Have been taking melatonin on and off and its helped with the masturbation but it makes me really tired and groggy in the morning"}, {"comment_author": "ha1fway_decent", "comment_text": "I have been trying on and off to stop watching porn. I didn’t realize just how much it affected my energy/motivation during the day. Whenever I would relapse there would be a clear drop in energy levels which made it harder for me to be productive. I think masturbation is ok as long as you aren’t using outside stimulus to “get there”. Also I’ve found that the longer I go without porn the stronger my natural sexual desire is, which in a weird way not only helps me want to meet potential partners but also motivates me to be productive in other parts of my life like career and fitness. Anyways stay strong brother!"}, {"comment_author": "TreskTaan", "comment_text": "Could it be that you're subconsiously trying to avoiding the next day?\n\nmake your sleeping space a sleeping space.\n\nthe reason you're feeling unable to sociallize is due to not enough sleep.\n\nyour morning routine starts not when you wake up but when you go to bed.\n\nTrust me that if you don't focus on the good stuff it will become a viscious circle and you will start to feel bad.\n\nRegret is a powerfull emotion. be honest with yourself."}, {"comment_author": "006AlecTrevelyan", "comment_text": "Mate it's a wank before bed. Stop panicking and be nice to people."}, {"comment_author": "Hopeful-Bad-1548", "comment_text": "leave your phone charging outside your room, as far away as possible, like in a garage o near the entrace of the house;\n\ntry to use melatonin to sleep, it really helps me a lot;\n\ncold showers are also a great method to stop urges"}, {"comment_author": "Nardann", "comment_text": "Just don't watch porn. Its better to wank 3 times a day than to watch porn daily. It fucks you up in the head."}, {"comment_author": "None", "comment_text": "[removed]"}, {"comment_author": "AutoModerator", "comment_text": "Your submission was automatically removed because crossposts are not allowed.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GetMotivated) if you have any questions or concerns.*"}, {"comment_author": "Bbranched", "comment_text": "good to work on this but it’s not the only reason why you can’t talk to women. Like anything- socializing is a skill that needs practice"}, {"comment_author": "VeryWiseOldMan", "comment_text": "You got no game so you blame masturbating? interesting approach"}, {"comment_author": "slatt_dog38", "comment_text": "I blame porn"}, {"comment_author": "sarmstrong1961", "comment_text": "If you stop jacking it then you willforce yourself to talk to them....I promise"}, {"comment_author": "darkhelmet1121", "comment_text": "Try to make a point of talking to at least 3 females, casually every day and legitimately try to get to know them understand their perspective on things."}, {"comment_author": "rektMyself", "comment_text": "Have a kid. They will shut you down every time!"}, {"comment_author": "martymcfly103", "comment_text": "Sounds like there are very few qualified people on Reddit to help. See a therapist. \n\nI’m addicted to drugs and alcohol, you’re addicted to masterbation. Get some professional help. It is anonymous (just like Reddit) and will help you."}, {"comment_author": "Vree65", "comment_text": "That's kind of hot\n\nThe problem imho is possible injury to yourself. I actually had to get a painful urinary tract surgery due to blockage (penis swollen to 3x because pee couldn't pass through) which I suspect may have been related to masturbating on a hot summer day which the body just couldn't handle. It also briefly led to blood pressure problems because, guess what, pumping blood into your penis while lying on your back constantly is bad for you (you should try doing it sitting more).\n\nMedieval monks used the method of immediately dipping their penis into cold water xD\n\nimho just relax more and live less hedonistically. I was chasing and maximizing pleasure as a teen too but that actually leads to overindulgence to the point of harm and health issues. Try doing a \"fasting\" or \"abstinence\" challenge for a while where you don't eat, don't consume sugar, don't game, don't jerk off, or cut out any one habitual activity or dopamine go-to source of your choice for a while. You will find that, while it may initially seem difficult, like your body is gagging for just a few breadcrumb, there's actually not much that you, body and mind, can't get accustomed to and still work without, and your mind will quickly fill any \"void\" with new habits. The trick is getting addicted to productive habits. Like, imagine if instead of jerking off you had spent 10 minutes doing grammar exercises in bed every day. You could be fluent in two foreign languages by now."}, {"comment_author": "cowfeeda", "comment_text": "you should turn to God. \n\nnow i know, you hear this all the time, blah blah blah, but you should really give it a chance. you should read the bible, and form your own opinion on whether you agree with it or not or whatever \n\ni used to be agnostic, but a few months back i found God, and my life started to become so so much better. (NOT easier) i struggled with masturbation, but whenever i fell, i prayed to God and he brought me back up, and eventually i was able to break loose of it. \n\nanyways, when you feel the temptation, you should pray. if you don’t wanna pray, then meditate. these practice discipline and will help you break the chain of porn and masturbation. (ESPECIALLY prayer.) \n\nI love you, God bless you 🙏"}, {"comment_author": "TreskTaan", "comment_text": "indeed OP could use a bit or meditation and selfreflection."}]}, {"post_title": "[Image] Motivation Quotes", "post_url": "https://i.redd.it/1kf922i4wusc1.png", "post_main_text": "", "post_comments": [{"comment_author": "sisterblisterblob", "comment_text": "It definitely doesn't sound like a weird nazi ideology. They've also shown that exercise and eating healthy treats depression and anxiety just as well if not better than anti-depressants."}, {"comment_author": "S-Markt", "comment_text": "of course it does sound like nazi ideology. there are lots of great people in history not caring about exercise and healthy treats and still doing great things. stephen hawking is the best example. he was more intelligent than most of those who have or will downvote me. there are lots of others doing great, winston churchill kept a whole nation together during a horrifying war. one of his mottos: no sports.\n\nthis mens sana, incorpore sano thing is nazi stuff. they would have killed stephen hawking for not being in good health and therefore claiming that he was not able to keep his mind strong and clear."}, {"comment_author": "sisterblisterblob", "comment_text": "I see where your coming from, but I would still disagree that it sounds like nazi stuff because a lot of regions, philosophers and their philosophies, and other notable thinkers have said similar things about the importance of physical health. What differentiates the stuff nazi's say about good health is specifically that the weak/unhealthy should be weeded out. The above quote doesn't say that, which is why I personally don't think it sounds nazi-ish"}, {"comment_author": "S-Markt", "comment_text": "stephen hawking has proven this wrong so many times. in fact, its sounds more like weird nazi ideology"}]}, {"post_title": "[Discussion] What should I do?", "post_url": "https://www.reddit.com/r/GetMotivated/comments/1bxoi3m/discussion_what_should_i_do/", "post_main_text": "I am annoyed with myself\n\nI feel like I am not accomplishing anything, and every time I sit down to start doing something, I do it for a little bit and then my brain starts thinking \"Is this the correct choice\" and then I end up quitting, It's getting annoying, I have been trying to learn programming by making games, and the most I have made is a half baked space shooter, it is demotivating...\n\nany advice?", "post_comments": [{"comment_author": "3CD69", "comment_text": "Take her easy now"}, {"comment_author": "Used-Sheepherder-335", "comment_text": "Your are something is better than nothing"}, {"comment_author": "claire_mummy", "comment_text": "Ah sounds like the beginning of every innovator or entrepreneur. Ideas are cheap and the true worth of ideas belongs to the person who can bring it to life. I gone through your phase of self doubt as well, thoughts like I should not be wasting my time on this if it is not guaranteed to succeed and that I am too lousy to be able to make it so. \n\nI found that getting a partner onboard may help. It did for me, someone who believes in you and willing to share your dreams. When you want to give up, the other can anchor you to go on. Try finding such a person, it may do wonders for your ideas.\n\nAll the best!"}, {"comment_author": "Even-Fact1111", "comment_text": "I think it's important to accept the fact that life is itself a struggle. It gives a great relief which sounds ironic. Everyone struggles. You just need to keep going to get somewhere. Let's think in a longer term!"}]}, {"post_title": "[Text] People who struggle to wake up early, your answer is food!", "post_url": "https://www.reddit.com/r/GetMotivated/comments/1by64dn/text_people_who_struggle_to_wake_up_early_your/", "post_main_text": "Yep you read that correctly, it’s food. Because digestion is a humongous task your body does, it requires a lot of energy. This can directly affect your sleep, which in turn affects how dull or fresh you feel in the morning. Here are 3 tips that will make it easier for you to wake up in the morning. \n\nChew your food. Sounds simple, but it isn’t. Our digestion process starts from our mouth itself, where the digestive enzymes in our saliva are supposed to break our food down, and our stomach is expecting this half digested food. This way, the energy required by our stomach for digestion will be significantly less. But let’s face it, most of us don’t chew enough, and this is why this is the very first tip. \n\nDon’t stuff yourself with food. This is plain and simple - if you’re overeating, your stomach hates you for making it work overtime! Don’t starve yourself obviously, but also don’t eat like a pig! Interestingly enough, chewing your food well will naturally make sure you don’t eat too much, because we only have so much patience to chew so much food, right?  \n\nDon’t Sleep Right After You Eat. You will observe that our body becomes dull right after we eat. So it may make sense to make use of that dullness and sleep right away. Well, not if you want to get up feeling fresh in the morning! If you keep sufficient gap, where this temporary dullness caused by food has subsided, and then sleep, you will see you will feel much more fresh in the morning when your alarm rings. So have a gap of around 2 hours between dinner and sleep. \n\nMy experience with these tips : So I heard about these tips from Sadhguru last week, and after giving it some thought I was like “why not?”. I decided I’ll do it for a week. I'm still baffled to say that I woke up at 5, four times this week! It’s a pretty huge deal for me! I won’t lie though, it feels weird, because I am used to going to bed feeling absolutely dull and sleey. But I’m so glad I’m able to experience that morning high again! ", "post_comments": [{"comment_author": "johu999", "comment_text": "Seems rather reductive to write as though food is the only reason people struggle to wake up. Plus, this justification seems rather pop-science."}, {"comment_author": "S3IqOOq-N-S37IWS-Wd", "comment_text": "They're repeating something they just learned from a guru, so not even pop science. Speculation."}, {"comment_author": "KarbonKopied", "comment_text": "I'm with you, especially since I don't eat dinner. How can it even at that point?"}, {"comment_author": "SuperHazem", "comment_text": "You’re completely incorrect about the digestive enzymes part. Yes, our saliva does contain a bit of amylase for carb digestion, but it’s barely able to digest the sugars at all before it gets to your stomach and the amylase is destroyed by your stomach acid. Proteins, fats, and the vast majority of your carbs are digested by a mix of your stomach and your small intestine."}, {"comment_author": "LusidDream", "comment_text": "Enzymes not as much but the mechanical breaking down of the food from chewing makes that food way easier for the rest of your digestive system"}, {"comment_author": "SuperHazem", "comment_text": "By “easier” we’re referring to the speed of digestion. The stomach will make up the mechanical difference, but this will not have any noticeable difference on your energy levels and energy usage, no more than walking up the stairs once.\n\nIt’s just pseudoscience from unqualified people"}, {"comment_author": "Really_McNamington", "comment_text": "So I'm good to swallow my dinners like the bad guys in V ate the rats? Cool."}, {"comment_author": "RedlurkingFir", "comment_text": "Sadhguru: 'nuff said. This dude is like the motherlode of pop science. The complexity and science around human sleep can't be reduce to \"eat better\".\n\nIf I would any advice about people not waking up well in the morning, it would be to talk to your medical provider about sleep apnea and polysomnography. The rest is cheap tik tok knowledge"}, {"comment_author": "DrScience-PhD", "comment_text": "if you're telling me not to eat 3 bowls of lucky charms before bed I'm telling you shut up"}, {"comment_author": "milanpl", "comment_text": "Sounds like a bunch of balony"}, {"comment_author": "kimmywho", "comment_text": "Absolutely true- meal timing had been shown to impact circadian rhythm. Meals spike blood sugar and heart rates which impact sleep. Leave 3-4 hours between your last meal and bedtime. "}, {"comment_author": "Wild-Ad3060", "comment_text": "Interesting"}, {"comment_author": "F33dR", "comment_text": "It's not really speculation, I've spent years eating dinner by 5pm. Then gym. Then go to bed hungry. I sleep like a baby. Wake up at 5am every morning without an alarm and i'm STARVING, so I eat a big healthy breakfast each day around 5:30am. Then I'm fueled up and work well, ready for dinner by 5pm > repeat cycle."}, {"comment_author": "mapt0nik", "comment_text": "I think about what I will do, eat next day. Usually works"}, {"comment_author": "Mollischolli", "comment_text": "not eating 3 hours before bedtime has been a total game changer in sleep quality!"}, {"comment_author": "SprayShitters101", "comment_text": "Test"}]}, {"post_title": "[Discussion] *UPDATE* Russ Cook is on day 351 of running the length of Africa, averaging 50+ kilometres a day and raising €500,000 for charity. He will accomplish his goal on Sunday!", "post_url": "https://i.redd.it/x89g00a1nosc1.jpeg", "post_main_text": "", "post_comments": [{"comment_author": "The8thHammer", "comment_text": "Its crazy that its only 500k raised when people like abroad in japan raised that much (or close) riding a bike for a week in japan, staying in nice hotels, eating nice meals. Audience really is everything."}, {"comment_author": "KingsMountainView", "comment_text": "Somehow its not really been picked up by any proper media. I don't think I've seen anything about it in the news in the UK."}, {"comment_author": "Blue_wine_sloth", "comment_text": "A [British tv presenter](https://www.bbc.com/news/entertainment-arts-67442924) raised £5 million running 116 miles. A super impressive distance and a deserving charity but I feel that someone running a much longer distance should raise more! It’s a shame it’s not publicised the same way."}, {"comment_author": "stochastaclysm", "comment_text": "Donate people."}, {"comment_author": "Jofzar_", "comment_text": "It's just law of averages, more people more donations."}, {"comment_author": "Mountainbranch", "comment_text": "Connor?"}, {"comment_author": "THE-BS", "comment_text": "One thing they never told him, the African shrimping business *is tough!*"}, {"comment_author": "Professional-Isopod8", "comment_text": "Sick he’s finishing, definitely the hardest geezer"}, {"comment_author": "BloodChasm", "comment_text": "Absolute beast. Does anyone know how many km or miles this is?"}, {"comment_author": "PabloVP129", "comment_text": "Roughly 16,400 kilometres in 355 days mate"}, {"comment_author": "strictlyPr1mal", "comment_text": "a lot"}, {"comment_author": "BloodChasm", "comment_text": "That's insane to think about. Thanks man!"}, {"comment_author": "Persian_Ninja", "comment_text": "Which is roughly 10190.5 miles"}, {"comment_author": "BloodChasm", "comment_text": "At least 7"}, {"comment_author": "vFizzz", "comment_text": "28.7 miles a day"}, {"comment_author": "badass4102", "comment_text": "That's like running more than a marathon every single day. I can barely run a mile nonstop"}, {"comment_author": "Lawlor90", "comment_text": "Roughly the last 2/3 weeks he had to average 75km a day to meet the day he set a month or two ago. Some of that through sandstorms in the Sahara desert, it's crazy"}, {"comment_author": "Imaneight", "comment_text": "Where's he getting his calories from,  and how do you avoid getting kidnapped by Mali rebels and such on a journey like this?"}, {"comment_author": "AquaStarRedHeart", "comment_text": "Lots of questions answered on his IG , hardestgeezer"}, {"comment_author": "Ho3n3r", "comment_text": "Never went through Mali, precisely for this reason. But he was kidnapped in Congo."}, {"comment_author": "trikristmas", "comment_text": "He avoided Mali"}, {"comment_author": "HughesJohn", "comment_text": "Well, largely by not going through Mali."}, {"comment_author": "Imaneight", "comment_text": "Oh! He's got a Facebook too. I'm checking it out now. Thanks"}, {"comment_author": "Imaneight", "comment_text": "How did he get out that one?"}, {"comment_author": "R4TTIUS", "comment_text": "Just go check out his YouTube you can watch everything it's crazy and the videos just get better and better."}, {"comment_author": "Shock900", "comment_text": "This is all that I could find.\n\n> ...I stumbled into a rural settlement where the chief told me I must give him money. I had none. So that went down well. Pretty soon I found myself surrounded by lots of game blokes with machetes. Was escorted out the village into the bush.\n\n> \"Emptied my bag to show I had nothing but a half eaten biscuit. Gave it to them, and ran. Spent the next few hours bushwhacking through overgrown jungle paths. Trying to stay off any tracks until I was far away.\" But things then went from bad to worse after he realised the support van couldn't reach the road before two men suddenly \"pulled up on a bike.\"\n\n> He added: \"What happened next was a seven-hour motorbike ride deeper into the jungle. In my head I thought this was it. Me. The self-proclaimed hardest geezer. About to get held in a Congo gulag before being ripped apart limb by limb and eaten.\" Russell explained that he was later pulled into a hut after being driven to a village. He said a group of men began to argue about what they should do with him. The runner said he attempted to negotiate and get through to his team who organised a rescue method.\n\n\nhttps://www.mirror.co.uk/news/uk-news/britains-hardest-geezer-kidnapped-months-30654760"}, {"comment_author": "Ho3n3r", "comment_text": "The Congo kidnapping? He was a bit traumatised by it, he still hasn't talked about it in detail. The closest he got was in one of the last few episodes where they talked about how he took his fear/frustration out on his team when he returned to them."}, {"comment_author": "JuicyDarkSpace", "comment_text": "He's not a kid?\n\nDuh."}, {"comment_author": "AwesomeName7", "comment_text": "Us Broncos fans were told to let Russ Cook. This is who we should've actually been talking about"}, {"comment_author": "AquaStarRedHeart", "comment_text": "I've been following him on IG since the very beginning. Super exciting to watch him accomplish his goals"}, {"comment_author": "Blue_wine_sloth", "comment_text": "There was me feeling proud of myself for walking 7km the other day."}, {"comment_author": "WeeklyStruggle5066", "comment_text": "Nah, don't compare yourself to this guy.\n\nYour 7km walk is great!"}, {"comment_author": "stochastaclysm", "comment_text": "Ferocious ones and twos."}, {"comment_author": "JekyllnowthenMrHyde", "comment_text": "r/humansaremetal"}, {"comment_author": "GurOld7424", "comment_text": "500k seems ridicioulously low for a man dedicating this amount of time, effort, and sheer will of perseverance to a quest this absurd. Unforunate im to broke to donate"}, {"comment_author": "Apathetic_Superhero", "comment_text": "Where is the donation link?"}, {"comment_author": "Ho3n3r", "comment_text": "[https://givestar.io/gs/PROJECTAFRICA](https://givestar.io/gs/PROJECTAFRICA)"}, {"comment_author": "hako_london", "comment_text": "You can join him for the last leg!"}, {"comment_author": "Ok_Response6483", "comment_text": "What’s he gonna do next? Run all the way back?"}, {"comment_author": "PabloVP129", "comment_text": "He’s gonna be the first person to run the length of Mars 👀"}, {"comment_author": "DomskiPlays", "comment_text": "That's rad! Upvoting this for visibility, I can't believe I haven't seen this anywhwere yet"}, {"comment_author": "Saiyanjuggalo", "comment_text": "I finished it already.  Hitchhiking to get my fix new mexico all the way brothers. 👍👍👍"}, {"comment_author": "Shimmitar", "comment_text": "how did he do that without getting killed?"}, {"comment_author": "LtColnSharpe", "comment_text": "I mean, without checking them all I can't be sure but the link is in every video I've seen. It's also on the donation page as soon as you hit 'read more'.."}, {"comment_author": "johnkingina", "comment_text": "Who takes the pictures? Does he travel with a crew? How can we say that he is 100% running?"}, {"comment_author": "MrWendelll", "comment_text": "Whole thing is documented on his YouTube channel. \n\nYes he does have a support crew, not every single step was running but he has walked/run every metre of the journey"}, {"comment_author": "anothercarguy", "comment_text": "Where does it even say what his charity is and their mission?"}, {"comment_author": "LtColnSharpe", "comment_text": "Mentioned on the donation page and in several videos. Probably elsewhere as well. Added below for visibility taken from the donation page.\n\nThe Running Charity - a charity which harnesses the power of running to help people experiencing homelessness or managing complex needs.\n\nSandblast - a charity providing educational events about Saharawi people and culture through the arts in the UK and creative and skills development projects in the Saharawi refugee camps to promote talent, knowledge, self-reliance and support links."}, {"comment_author": "anothercarguy", "comment_text": "I clicked the donation page and I didn't see it. Either way, it should be in the description of the channel, front and center on the donation page, links in every video"}]}, {"post_title": "[TEXT] You are underpaid!", "post_url": "/r/u_MessagesFromLife/comments/1bxjwvx/you_are_underpaid/", "post_main_text": "", "post_comments": [{"comment_author": "realjoeydood", "comment_text": "*What is this, a sub for over-stupid crossposts*?"}]}, {"post_title": "[Text] torn between following passion and earning $$ to become independent", "post_url": "https://www.reddit.com/r/GetMotivated/comments/1bxds1v/text_torn_between_following_passion_and_earning/", "post_main_text": "**TL;DR**: can't decide whether i should focus on pursuing my passion or making $$ to move out from parents\n\n# Background\n\ni'm 17\n\nin my final year of high school and will need to go to university afterwards\n\nlove programming and have a lot of experience in it\n\nhave a youtube channel with Unreal Engine tutorials that has 1.8k subscribers, but haven't been publishing any content for a few months because lost passion for making Unreal Engine tutorials anymore + been focused on preparing for my final exams\n\n# Problem\n\ni'm really passionate about game development and have a strong desire to make my game\n\nhowever i also want to move out from my parents and gain independence as soon as possible, because want to escape their control\n\ndon't get me wrong; they do give me a relatively good amount of freedom and i'm grateful to them for that, but i still don't have full control and often find myself constrained by their decisions\n\n\n\ni am thinking about 2 paths\n\n* pursue my passion - work on my game and start a youtube channel to share development progress publicly\n* create some source of income to move out from parents - was thinking about freelancing using my existing skills (programming, video editing, graphics design) and/or continuing growing my existing youtube channel\n\n\n\ni'm struggling to decide mainly because of the following concerns\n\n* creating source of income that will allow me to become independent from parents can take a lot of time (especially using youtube to make $). maybe it would better to spend that time and energy on developing the game\n* Steve Jobs recommended to do what you love. i'm not passionate about making unreal engine tutorials anymore and i'm not sure if freelancing will spark my enthusiasm\n* making the game can be time consuming. it might be better to become financially independent first and after that dedicate time to my game while maintaining source of income\n\n\n\nthank you for taking the time to read all this!\n\ni would really appreciate any advice, insights or experience you might share", "post_comments": [{"comment_author": "Hoplite76", "comment_text": "So im going to tell you alot of things you probably dont want to hear.\n\nNeither making youtube tutorials or trying to self make a game is going to make you financially independent. Not saying you cant make some money on content but nowhere near enough to live on.\n\nTake your skills and your current parental support and find traoning/schooling to improve what you currently have. Im sure you're good at what you do but can you really look at yourself and say you're among the best? Cuz i think thats what you need to independently make a game.\n\nLearn, get better, get into the industry, become one of the best, make your game. By using your base skills to get a job and make money, you'll become financially independent along the way.\n\nGood luck!"}, {"comment_author": "Fetis_reddit", "comment_text": "Thank you for replying!  \nDo I understand correctly? You recommend to focus on improving skills and making money now, right?"}, {"comment_author": "TheKingOfTheWeevils", "comment_text": "Skills first pal. The money will come.\n\nOne of the most transformative pieces of advice I ever heard was 'being paid is a combination of how many people you serve, and how well'.\n\nIf you make your game now, you may serve a decent number of people well. If you focus on gaining skills then make your game, just imagine the amount you will be paid for serving even more people truly excellent! \n\nI would advise you focus on upskilling, it's an investment in you and your future self will reap huge dividends."}, {"comment_author": "FuckDataCaps", "comment_text": "Yes. 100% get a job. There's quite a lot that you don't know about game development.\n\nDoing it on your own *might* work but will likely result in a badly designed project.  \nGet a job in game dev, learn how it's done professionally, put some money aside and you can always work on your game after.\n\nIf it fails, you'll already have the foot in the industry and have a safe fallback."}, {"comment_author": "Hoplite76", "comment_text": "100%"}, {"comment_author": "Fetis_reddit", "comment_text": ">If you make your game now, you may serve a decent number of people well. If you focus on gaining skills then make your game, just imagine the amount you will be paid for serving even more people truly excellent!\n\nHadn't thought about it that way. That's a ver interesting perspective and I like it. Thank you!"}, {"comment_author": "Fetis_reddit", "comment_text": "Your plan makes a lot of sense, thank you!"}, {"comment_author": "RVAFoodie", "comment_text": "Get a job to gain financial independence first and foremost.  It is a very tough time for independent game developers.  Learn skills to get your career going and create positive work life balance to build your game after work."}, {"comment_author": "None", "comment_text": "I second this. Basically he needs to work double and it is better if his work relevant to his gaming passion. Unfortunate reality is that without financial means, he might get stuck somewhere down the line anyways."}, {"comment_author": "rektMyself", "comment_text": "Yup. Everyone has to do the grind. The fun stuff comes later! Then follow the passion, and hobbies."}, {"comment_author": "Crabneto", "comment_text": "Its a tough choice. If you have skills and go to uni (or skip it) and start working in the tech industry now you are going to have a great head start on growing you career. Financial stability should not be undervalued IMO. \n\nHowever, you might not have this opportunity again. Once you are in the grind of a job its harder and harder to dedicate a large amount of time to your passion. Consider giving yourself  a set amount of time to live at your parents and work on the game. You can also start freelancing at this time. If you aren't done or had the success you want after X time get a job or go back to school."}, {"comment_author": "Fetis_reddit", "comment_text": "i'm actually really inspired by Steve Jobs advice to do what you love and it makes it harder to decide  \nbut your comment makes a lot of sense for me, thank you!"}, {"comment_author": "Fetis_reddit", "comment_text": "I get the point, thanks!"}, {"comment_author": "Fetis_reddit", "comment_text": "sounds reasonable, thank you!"}, {"comment_author": "Fetis_reddit", "comment_text": "I started considering moving out from parents because I want to have more time and freedom to work on what I want. As I mentioned I often depend on my parents' decisions, so my thought was the sooner I move out the sooner I will get the freedom"}, {"comment_author": "trjayke", "comment_text": "Yea that's the words of someone who already is stable financially"}, {"comment_author": "prairie_buyer", "comment_text": "Steven Jobs built a very successful company, but he is NOT someone to take life inspiration from. If you look into his actual life, and HOW he ran Apple, he is, by all accounts a pretty terrible person.  \nAnd his poor judgement culminated in his death: he had a very treatable cancer, but following his life's pattern of believing he was smarter than everyone else, he rejected all the doctor's' advice, and didn't have surgery or any conventional treatment, because he believed he could cure himself with acupuncture, fruit juices and herbal supplements."}, {"comment_author": "Tylorw09", "comment_text": "Always make sure to keep your hobby as a hobby. It’s rare to turn your hobby into a job and still love it like you did when it was a hobby. \n\nDeadlines, stress and other factors can take what you love a hobby and make it hard to enjoy in your free time."}, {"comment_author": "patbrucelsox", "comment_text": "He also had someone who basically created the actual product for him."}, {"comment_author": "Fetis_reddit", "comment_text": "yeah, i know that, i read Steve Jobs biography by Walter Isaacson\n\ndespite all that i still have much respect for Jobs"}, {"comment_author": "Jujitsu_Master6", "comment_text": "Job's health problems, temperament, and being a fruitarian aside, that quote is often accepted as gospel without taking into consideration that Jobs said it after years of having developed passion. When he first started out, he was focused on money and proving a point. There's an excellent book by Cal Newport called \"so great they can't ignore you\" where Newport argues that doing what you loves requires a certain degree of biting bullets first. I actually respect Jobs a lot (he improved his personal relationships and contributed great ideas to business at the end of his career) but that quote is often over simplified and overused. I'd agree that it's important to pursue passions but keep in mind passions are created and require some bumpy roads to develop. Its better to become anti-fragile so happiness is independent of whether or not you make it."}, {"comment_author": "Fetis_reddit", "comment_text": "what about the people below?\n\n* steve jobs\n* mr beast\n* henry ford\n* john carmack\n* jonathan blow\n* eric barone - stardew valley developer\n* andrew spinks - terraria developer\n* jim carrey\n\nthey didn't lost their passion and made a living from it"}, {"comment_author": "Fetis_reddit", "comment_text": "Wozniak contribution was very important, I fully acknowledge that. However, Steve also put in an enormous amount of, and in my opinion, without him, things wouldn't have turn out as well as they did"}, {"comment_author": "Tylorw09", "comment_text": "100% agree with you there. There are people out there that didn’t lose passion but it is my belief that it’s a rarity. \n\nIf you feel you have the skills and passion and determination to earn a financial income and be independent while building games than go for it. \n\nBut the first thing I recommend you do is get a job. game development if possible since that is your passion but if you can’t get a job in the industry quickly be open to other industries. \n\nDeveloping your own game will take years and since it will be your first it most likely won’t have the kind of success you need to support yourself. So get a job, build your skills and then develop your game in your free time"}, {"comment_author": "Redditburd", "comment_text": "What about the other 5 billion people that are not these people?"}, {"comment_author": "wellboys", "comment_text": "And those are extremely rare cases, and two of them were just businessmen anyway. Here's another story:\n\nI'm 34, and I love writing. I have an MFA in fiction writing, and I'm actually kind of good at it -- I've published about 15 short stories in anthologies and literary magazines over the last 10 years, some of which have won awards, and I've written three YA books on contract. I have literally never had a year where I wrote to pay my rent. When I was your age  I delivered pizzas, during college I worked in restaurants, after college I bartended for a while, then I was an adjunct professor, and for the last 7 years I've been a financial researcher. I will probably never be in a position where I put \"author\" on my tax returns as my primary job. That's fine. Creative industries are incredibly difficult to break into, and they are not lucrative. I write because I like writing, not for the paycheck. \n\nYou're making an error in thinking that you have a choice to do one or the other (passion vs. making money). You have to do both, and it's super unlikely you'll ever be able to soley pursue creative projects you're passionate about in order to have a place to live with food in your fridge. That's fine -- the value of creative work isn't solely or even largely in its market value, it's in the act of creating itself."}, {"comment_author": "Fetis_reddit", "comment_text": "All that sounds very logical, I am currently tending to prioritize financial stability. Thank you!"}, {"comment_author": "Tylorw09", "comment_text": "You got this! I’m sure you’ll be successful and happy."}, {"comment_author": "Fetis_reddit", "comment_text": "I really appreciate you words and your feedback!"}, {"comment_author": "Air_Retard", "comment_text": "The phrase “do what you love and you’ll never work a day in your life” is bs. You’ll end up hating your passions that you rely on to live. \n\nI’d personally follow the money and use the money to support the lifestyle and hobbies I want. \n\nNot saying go be a lawyer or Doc to make the most $$. But I’d sooner go pour concrete for a living than be a streamer."}, {"comment_author": "Fetis_reddit", "comment_text": "i don't agree actually\n\nthere are many examples of people who didn't start hating their passion\n\n* steve jobs\n* mr beast\n* henry ford\n* john carmack\n* jonathan blow\n* eric barone - stardew valley developer\n* andrew spinks - terraria developer\n* jim carrey\n\n  \nthank you for replying!"}, {"comment_author": "Endersnamed", "comment_text": "Not to be a downer but for every one of those there’s thousands that didn’t make it. You have a skill in programming where you can do both. Go start learning about AI/ML/GENAI. Get paid 250k a year to do that and then use those skills to build your passions on the side."}, {"comment_author": "yared_cf2", "comment_text": "I don't want to be negative, but realistically speaking, for every person that was able to become wealthy with their passion, there are thousands who died broke and frustrated. I'm not saying it's not possible, but you have to be literally the best at it."}, {"comment_author": "Air_Retard", "comment_text": "I don’t wanna beat a dead horse but like the other comments say. For every name you read in history of people who had a dream and made it. There’s 10’s of thousands of people who thought the same. \n\nYour young plenty of time to make mistakes and learn.\n\nI’m 26 bought my own house and truck last year and do construction. I’m confident I can start my own business in the future doing concrete/ outdoor renovations and become financially independent like that.\n\nFrom 18-26 I thought i wanted to be a coder, game designer, streamer, YouTuber, earth mover, electrician. \n\nI did none of those. But you bet your bum that once I have my company established and I can buy back my time I’m gonna be like bushcamp dad. Just streaming for fun.\n\nPeople have different views and takes but it’s your the main character in your own story."}, {"comment_author": "ammosthete", "comment_text": "Staking your financial circumstances on something as rapidly changing as your feelings (what you feel passionate about = a feeling) is pretty risky. You already have up on one thing I assume you had been passionate about before. Could it happen again? Before you leap, think about what’s behind that myth of your passion - and who or what does it help? \n\nKeep working on your projects in parallel to a paid job, and build up equity and leverage so you can call the shots in your own life. Building your own independence will give you true experience and confidence to keep going when times are tough, vs relying on having your passion yank you around by the nose."}, {"comment_author": "CORN___BREAD", "comment_text": "That’s like saying deciding to make winning the lottery your career choice is a sound decision because a few people win the lottery. The odds are about the same.\n\nGet the education and job and pursue the other stuff on the side. If it takes off, great. If it doesn’t, you won’t be years behind on your lifetime earnings potential."}, {"comment_author": "Fetis_reddit", "comment_text": "yeah, i know about survivorship bias\n\ni actually interested in AI as well, so actions you suggested sound like a good option\n\nthank you!"}, {"comment_author": "Fetis_reddit", "comment_text": "very insightful\n\nbuying back my time later sounds like a great option\n\nalso \"Buy back your time\" is the book i'm currently reading by the way\n\nthank you for advice!\n\n>i wanted to be a coder, game designer, streamer, YouTuber, earth mover, electrician\n\ninteresting list by the way. I imagine writing code while driving a bulldozer)"}, {"comment_author": "Fetis_reddit", "comment_text": "actually i've been wanting to make a game and been moving toward that goal for almost for 4 years. I didn't have an idea for a game when I created my channel, but still decided to create it to build some audience early and decided to start with tutorials because it was a good niche. My plan was to transition from tutorials later, but now i understand it was a mistake. Though i enjoyed sharing my knowledge and building a community + i build new skills, so at least this experience wasn't completely useless\n\nanyway after reading the comments under this post i'm tending to focus on becoming stable financially\n\nthank you for your advice and for taking time to write it!"}, {"comment_author": "unsuitablebadger", "comment_text": "Important thing you raise here is find a way to be financially stable and work on the game in your spare time. What you'll find with game dev is that you have to iterate A LOT before finding a formula that clicks with your audience. If you can find that then you can perhaps make a living but it's not consistent and makes it hard to plan your life. If you get $30k at launch, $1k the month after, $3.5k the next month and maybe $200 every month after that it becomes hard to manage the financial side of your life. Also, there are a ton of games out there now so breaking into the market can be tough. What I see from the mainstream small dev/indie dev that can be considered successfully is they bring out smaller games more consistently that they can then predict an income off of. \n\nAnother point to raise is getting a dev job as your primary job will allow you to gain skill faster, see how the real dev world operates and teach you how to work in teams. I was a very talented dev coming out of uni and what I learned in the first few years on the job just cant be taught without being in the process. It will also hopefully allow you to work on your soft skills."}, {"comment_author": "Competitive-Number13", "comment_text": "Trust me bro u will get it way further with your game not having to worry about rent or bills or food"}, {"comment_author": "Fetis_reddit", "comment_text": "very stupid point\n\ni can live in a forest, hunt animals and work on my game\n\n**i'm joking)**\n\nthanks for replying!"}, {"comment_author": "prairie_buyer", "comment_text": "\"Steve Jobs recommended to do what you love\".  \nYeah, and Hitler wrote a whole book about killing the races he hated.  \nSo what? Lots of people say a lot of stuff.  \n\n\nIf the question you asked is a serious one, do some research. This is a very long-standing debate, and has been the subject of tons of social-science research.  \n20+ years ago, I was very interested in this question and was considering writing a book. I read all the popular-level books on work and life, as well as the academic research those books drew from.  \nBasically, the extensive research shows close to zero correlation between \"following your passion\"/ \"doing what you love\" and lifetime career success OR life satisfaction."}, {"comment_author": "Fetis_reddit", "comment_text": "wow, that's a surprising insight\n\nare you a psychologist? just curious"}, {"comment_author": "imamime43", "comment_text": "Advice I wish I got: Follow the money. Passions change throughout your life and most of the things that actually make you happy: independence, creativity, travel, new experiences, etc are all contingent on money. Use the money well and you can follow your passions and explore new things all you want. If you don't have enough money to afford necessities, you won't be happy."}, {"comment_author": "Fetis_reddit", "comment_text": "makes sense, thank you!"}, {"comment_author": "Redditburd", "comment_text": "I'm over 45. I make a good living now doing something that I am passionate about and I would be glad to give you my perspective. You are saying a lot of the things that I was when I was 17. \n\nAt 17 I was self taught in computers, hardware and software. This was when the internet was brand new, 1994'ish. I spent every waking moment either in high school, or at home learning computers. I learned much more at home than I did in school, but that diploma was a necessary piece of paper for the rest of my life. This was before youtube or even cell phones. I learned from books I found in the library or from other people whom I met in real life. \n\nI worked at Sonic drive in for 3.25/hr. It was terrible. I hated the smell of it, and the people that worked there were not pursuing the types of goals I was. A friend helped me change jobs to a local grocery store where I worked for a couple of years, paying the bills. \n\nThis is something I want to stress to you. First off, you have to pay your bills. This means making money in some kind of way... right now. This is not about dreams or passions, you are not there yet. This is about starting to become financially independant, which is a process you have not expereienced yet, and you have no skills in. While you are making money, be working on improving your situation and finding your goals and what steps you need to take to get there. \n\nYou mention \"programming, video editing, graphics design\" as a way to make money. These are all long term goals and it will take you years, possibly a decade to develop the skills and reputation to get paid to do these things. You have access to technology now that I never did which allows you to do all of those things for free. Take advantage of it. But realize you will be doing it on your own time, for free. Because you are passionate about it. \n\nPrograming... it's hard. The only way to really learn it is to pick a project right now and start working on it. Keep working on it and making it better. Set aside a certain amount of time every day and actually work on your project. Be focused. You will learn quickly and it will be very, very hard. Eventually with enough work you can get over the hump and things will come easier. \n\nMy first job like this was after the grocery job. I met some friends that were as into computers as I was. We hung out all the time, learning together. One of them had a connection to someone that wanted to invest in Web Designer. I was cheap and I had some obvious skills, so he took a chance on me. It hardly paid anything at all. I was terrible at it. I did not have the skills or the self discipline yet to aquire them as I needed them. While I was there though... remember what I said about improving your situation?  I was able to network with more computer guys and they taught me so much about hardware. I was now able to run networks and troubleshoot. \n\nWhich led me to my next job, in Austin with a major company doing phone support. It paid pretty good. Got married. Spent a bunch of money on things like a house, cool car... and then 2001 happened. The job was gone and I was in real trouble. There were no more computer jobs for me all the sudden. \n\nWhich leads me to my next point... Remember when I said you have to pay the bills? I took a job as a mechanic because I can troubleshoot. It did not pay much, but it paid the bills. We lost the house and the cars, and the wife got cancer and lost her leg.\n\nListen... life is frigging tough and when you are on your own everything is not handed to you. And sometimes things are not fair.  I had to work twice as hard now to support both of us.  She ended up getting pregnant and we had fully gone into default on the house now, we had to move to a different state to survive. \n\nAll of this time I'm not doing my dream job let me tell you. Working in a shop in the heat is hard work. \n\nI found the only computer job in Arkansas and it was an easy job that paid the bills but it was basically data center baby sitting. I was bored. \n\nI then decided to follow a dream, which was to be a police officer. It was a wild change and experience and I don't regret it. It's a steady job but extremely stressfull. I could write a book on it to be honest. After 20 years of that and changing states again (to again improve my station). I now make good money, doing somthing that I get fulfillment from.  Guess who is the office IT guy? lol. I occasionally get to help someone with a spreadsheet formula, and I still program sometimes for fun, but it's a use it or loose it skill. I'm not a good programer, but I am genuinely happy at home with my family. \n\nHopefully this gives you some perspecitve and helps in some way. Start your journey but don't force yourself into only accepting a path that may or may not come to fruition. Take what you have to work with and set goals and constantly work toward them. You will make progress but it will take time and hard work."}, {"comment_author": "Fetis_reddit", "comment_text": "Thank you for sharing your story, it was very useful for me and was interesting to read! You should write a book\n\n>Start your journey but don't force yourself into only accepting a path that may or may not come to fruition. Take what you have to work with and set goals and constantly work toward them. You will make progress but it will take time and hard work.\n\nSounds wise, I think I will follow your advice. Really appreciate your comment!"}, {"comment_author": "yared_cf2", "comment_text": "Why not go to college and get a degree that goes hand in hand with game development and work on your game at the same time? Something like animation, computer science, or even project management.\n\nWhen I was 17 all I wanted to do was to follow my passion and play the guitar with my band, sign with a record label, travel the world and become rich with my music. \n\nI'm 30 now and I'm glad I didn't. I went to college, got a major in biotechnology and now I work at one of the best companies in the world.\n\nI don't love what I do at work, it's pretty boring, but I'm financially independent and I can travel the world twice a year, and I still play the guitar in a band."}, {"comment_author": "ChildeOfShade", "comment_text": "As someone who was in your shoes over a year ago, and was getting ready to put his ass on a Navy ship to rethink his life. Please prioritize career and success over passion. I got my Bachelors in Game Development, and spent almost 4 years trying to land any kind of role with no success. After my contract with Microsoft for a shitty tech role was up, I was almost out of money and had no success to my name. However, through some miracle, I was able to land a developer role a year ago and now have enough money and experience that I doubt it's ever going to be a problem for me again in the future.\n\nIf you are as passionate for games as I was, then you will find the time to make them when you are not working. Most IT jobs want experienced professionals, and learning languages like C and C# will help you land developer roles while also getting some experience in game engines. Have a plan, and don't put all of your eggs in one basket."}, {"comment_author": "Fetis_reddit", "comment_text": "wow, thank you a lot for sharing your story!\n\ni know c++ pretty well, better than any other language and seems this skill can help me to become stable financially\n\nthank you again!"}, {"comment_author": "Zombie_Senpai", "comment_text": "Hey, so I'm 27 and currently back in university for computer science and I can give you a bit of advice with  some insider perspective.\n\n- if you already have programming experience and are good at mathematics very likely the first year of college will be easy enough for you that you can start working on a game If you so choose\n\n- the first 2 years of a game development track at universities is often just the computer science program with mandatory electives in things like business, computer graphics, and game dev courses. You can take these courses as just a computing science student, and if you decide not to pursue game development they still count towards graduation\n\n- the game industry is a hard place to work. I have 4 or  5 friends that are game devs and only one of them is happy with the work environment.  All of them love what they do as they love games, but its a lot more work and a lot less pay than similarly skilled individuals\n\n- the skills you learn in a computer science program will be useful regardless of where you end up, and learning more about the low level computer systems will help make your games better. \n\n- One of my friends in game dev said that when they have a job vacancy, they get 10 application from self taught workers for every application from someone with a degree, and the ones with a degree go on top of the list.\n\n- and I saved the most important point for last.\nWork experience programs. I was already a fairly competant programmer before deciding to go back to school, specifically because it has a \"co-op\" program in which I get to work in the industry, and when I finish my program there's a good chance that the company hires me back. Even if they don't I have industry relevant work experience on my resume in addition to the piece of paper that says I know my job. \n\n\nIf you do decide to go back to school, there's a bunch of things that school does not teach you (at least not in the first 2 years they might later idk yet) that you should take the time to learn. Reach out to me and I'll help you choose some things to self study!"}, {"comment_author": "Fetis_reddit", "comment_text": "very useful insights, thank you!\n\nhowever, i'm not going to skip university\n\nalso i'm living in Russia so a lot of things might be different here\n\n>the skills you learn in a computer science program will be useful regardless of where you end up, and learning more about the low level computer systems will help make your games better.\n\ni love low-level programming and have some experience with it\n\n  \nwill reach out to you, thanks again!"}, {"comment_author": "who519", "comment_text": "Follow your passion, the people who do are the only ones who are actually independent. The rest of us are beholden, to bosses, spouses, children and other responsibilities. You have an opportunity to effectively leverage your parents support to do something you may not be able to later. Good luck and be well."}, {"comment_author": "Fetis_reddit", "comment_text": "thanks!"}, {"comment_author": "action_lawyer_comics", "comment_text": "Whatever path you take, you’ll have to work your ass off. If you want to actually make a game, you need to put in as many hours or more than you would if you worked a day job. And that’s without getting paid. \n\nWhen I was your age, the biggest lesson I needed to learn was how to actually work. I coasted through high school and later college with a B- average because I was smart but never studied or did homework. That stuff doesn’t fly when you have a boss, nor will it get your game made.\n\nI say follow a path that will get you earning money regularly. You’ll have to learn to budget your time and make contributions on the regular, and that will also come in real handy when you want to apply yourself to making a game."}, {"comment_author": "Guest2424", "comment_text": "So I have a question. You say that you want to gain complete freedom from your parents, even though they do give you some freedoms. Is it because they disapprove of your programming passion? Are they forcing you out of this as a career choice? Because that's really the only case where I can see when it would make sense for you to rush gaining said freedom. For the most part, parents just want their kids to be comfortable and earn enough to be so. Programming is definitely a career that can allow you to do that.\n\nThat said, taking the time to become a more well-rounded programmer can only help you. I'm sure that a college degree isn't just for show, since most jobs will look for one. And in pursuing career does not mean putting your passions on hold, you can use your newfound knowledge in game design. But putting out a decent product can take years, what are you going to do when you dont have enough to pay rent or food during that time?\n\nTaking inspiration from people like Steve Jobs is fine, but you also have to into account of his advantage in life beyond just his words. He was born wealthy, and so he had the luxury of wasting money around. You are probably not. The money your parents use for your care and education cannot be compared. The difference between you and Steve Jobs is that he could've failed a hundred times and been able to land on his feet because his family wealth. You? You don't have that luxury."}, {"comment_author": "Fetis_reddit", "comment_text": ">  \nSo I have a question. You say that you want to gain complete freedom from your parents, even though they do give you some freedoms. Is it because they disapprove of your programming passion? Are they forcing you out of this as a career choice?\n\ni have different life values than my parents, and living with them doesn't allow me to fully pursue those values. I've tried talking to them about it, but they don't seem to understand\n\n>what are you going to do when you dont have enough to pay rent or food during that time?\n\nwhat anyone would do in this situation - live in a forest) (joke)\n\ni understand that being stable financially is important\n\n>The difference between you and Steve Jobs is that he could've failed a hundred times and been able to land on his feet because his family wealth.\n\ni think you are wrong here, his family wasn't wealth\n\n  \nthank you fro your reply and advice!"}, {"comment_author": "None", "comment_text": "[removed]"}, {"comment_author": "Fetis_reddit", "comment_text": "sounds logical, thanks"}, {"comment_author": "albino_kenyan", "comment_text": "I don't see the youtube channel as being a big moneymaker, but even if it's not it can be a huge asset to your career as a way of marketing yourself to potential employers and demonstrating your skill. It also shows that you might be good at mentoring or training your coworkers. \n\nIs college or CS or programming training a possibility? Long term, getting a CS degree might maximize your longterm income given that many companies prefer CS grads (note that i don't work in the gaming industry so can't speak to that niche). But from what i know the gaming industry is the worst kind of job you can have as a programmer bc of so many people like yourself that love it and will work for cheap. Your priorities may change as you get older and have a spouse, kid, mortgage."}, {"comment_author": "Fetis_reddit", "comment_text": ">it can be a huge asset to your career as a way of marketing yourself to potential employers and demonstrating your skill\n\nyeah, already got that - a few times i got job offers from people who occasionally discovered my channel\n\n>Is college or CS or programming training a possibility?\n\ni'm going to enroll to university to get CS degree\n\n>gaming industry is the worst kind of job you can have as a programmer bc of so many people like yourself that love it and will work for cheap\n\ni know that\n\n  \nthank you for your comment!"}, {"comment_author": "VintageHacker", "comment_text": "If you don't like the control your parents have over you, you'll hate the control you will need to place on yourself to be independent and manage all your personal responsibilities.\n\nYes, you will gain fredoms in some aspects of your life, but you will lose many more than you realise. It's not a bad thing, its part of growing up.\n\n Your parents will know this as they went through it also, so talk to them, see what you can work out. \n\nPerhaps a transition plan, where you gradually contribute more to the household and, in return, gain more freedom. As you demonstrate the ability to take care of yourself and others, your parents will automatically treat you more like an adult, but probably not as quickly as you think it should happen :)\n\nOn the flip side, if your heart says leave, then do it. It will be harder than you think, but most likely, you will do just fine and, if you put the right effort in, very likely much better than you imagine."}, {"comment_author": "Fetis_reddit", "comment_text": ">If you don't like the control your parents have over you, you'll hate the control you will need to place on yourself to be independent and manage all your personal responsibilities.\n\nyou have more life experience, so maybe you are right. However, for me, being financially stable and living independently, despite all the responsibilities (i admit i might underestimate the responsibilities) seems like a better lifestyle than living with parents. This feels especially true if income comes from own business or freelancing or a job that brings enjoyment\n\n>Perhaps a transition plan, where you gradually contribute more to the household and, in return, gain more freedom\n\ndidn't think about that, will consider, thanks\n\n>On the flip side, if your heart says leave, then do it. It will be harder than you think, but most likely, you will do just fine and, if you put the right effort in, very likely much better than you imagine.\n\ni appreciate your encouraging words, thank you!"}, {"comment_author": "Take-A-Breath-924", "comment_text": "As a Mom, you know what I’m going to say. But the truth is, you make more and have more lifelong opportunities with a degree. I don’t think it’s always worth going to university for everyone. However the field you love is highly competitive. You will need the paper for a leg up. I don’t want to curb your enthusiasm, I just want to let you know that life will kick you when you least expect it to. Having a good foundation (degree or two), will help you stay flexible and respected in the job market. Good luck!"}, {"comment_author": "Fetis_reddit", "comment_text": "Thank you for your advice! I'm going to enroll to a university and I have been focused on preparing fro my final exams for a few months and planning to keep prioritizing that until I pass them in June"}, {"comment_author": "Slight-Rent-883", "comment_text": "Chase the money. It’s gonna suck but it’s better than having a “passion” and croaking over doing a shitty low paid job. If you got the money, passion can be pursued"}, {"comment_author": "Michael_chipz", "comment_text": "Why not both? Do what you want there are no rules. The hard path is worth it maybe.\nGLHF"}, {"comment_author": "Fetis_reddit", "comment_text": "i can't do both right now because i'm preparing for the final exams. It's taking a lot of time, so focusing on 3 things (exams, income, game) is definitely not an option for me\n\nYou may wonder why not just focus only on exams? Well, that's what I've been doing for the past few months and achieved pretty good results, so decided to start dedicating at least some time to creating source of income or making game, because each of these activities is better to start as early as possible\n\nAfter exams probably i will be able to do both, but anyway i wanted to understand whether i need to try creating source of income at all and after all the feedback under this post i'm leaning toward \"yes\""}, {"comment_author": "Michael_chipz", "comment_text": "Income gives options"}, {"comment_author": "Fetis_reddit", "comment_text": "Completely agree"}, {"comment_author": "BrunoGerace", "comment_text": "Cash every time.\n\nDo \"passion\" in your spare time.\n\nYou'll thank me in 50 years."}, {"comment_author": "Fetis_reddit", "comment_text": "i will set a reminder to text you on August 7, 2074 at 3:42 GMT\n\nthank you for advice!"}, {"comment_author": "woolencadaver", "comment_text": "Do both"}, {"comment_author": "None", "comment_text": "[removed]"}, {"comment_author": "AutoModerator", "comment_text": "Your submission was automatically removed because crossposts are not allowed.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GetMotivated) if you have any questions or concerns.*"}, {"comment_author": "Not_your_guy_buddy42", "comment_text": "Definitely read about the game development industry and what crunch is if u don't know.  \nWatch DoubleFine documentary and such.  Maybe see if you can somehow get your hands on the book \"Real Artists Have Day Jobs\" lol.\n\nThe thing with passion is, you've seen it can fizzle out. Beneath passion the next stronger level is \"a calling\".  Beneath that there's pure drive and obsession. For most people passion, calling, obsession aren't enough to outweigh their survival instincts which tell them to fit in and to work. Then there's a sliver of absolutely bonkers, driven people who lack survival drive and are taking any risk that's possible to take - not as a calculated risk mind you. They just can't help themselves.\n\nThen of those, a very, very, tiny fraction survives AND lucks into the right conditions to turn into what then the others around  will build up to be \"a great man\" like Steve Jobs or whatever. Consider all the mythos is people like you who build that up because they want to believe in it, they need it for inspiration. The Steve Jobs-like person don't give a shit. Others like popstars or politicians are experts at exploiting that need in people to believe in someone great(er), and creating their persona.\n\nFinally, there's all those with rich parents, and hobby people with money, who don't necessarily share any of the drive of the other set. But boy will they definitely compete with the first set for those little \"artist slots\" in society, all the while pretending like privilege had  nothing to do with it.\n\nShould you happen to belong to set A) then god help you.  If you can, then lean on the survival part of the skill set, as your drive will break through anyway, no matter what.  \nNo matter where you are on the creativity-darwin-yourself-spectrum, I would recommend to focus on learning how to create a creative discipline.  Passion will always be unreliable. Everything is fucking unreliable. The real work only comes from having a habit of well, doing the work. That goes double if you think, can you still do it after a shit day of job work? Once you have family? When you need to do all that adulting?"}, {"comment_author": "KnightGamer724", "comment_text": ">don't get me wrong; they do give me a relatively good amount of freedom and i'm grateful to them for that, but i still don't have full control and often find myself constrained by their decisions  \n  \nI get that, I was in a similar boat until I moved out after marrying my wife. Now, my relationship with my parents is a lot better. They recognize that I am an adult, I somewhat know what I'm doing, and while I'm making different choices than what they would have done, I have my own objectives, and I'm reaching for them. I'm hoping something similar happens with you.\n\nI'm going to point you to [Pirate Software](https://www.youtube.com/shorts/YEjIiQNQhvs), who has a good quote on this. Basically, you want to be financially independent first before doing your passion full time. It sucks, but that's the way it is. So I'd find a job that can help you progress and move forward on that, but still fuel your creativity in some way. For instance, I'm a night janitor at a local university, which means I have a ton of time just cleaning the same desks, tables, and toliets every night. So I queue up shows and YouTube videos to watch while doing that, and I carry a notepad or laptop that I set up to write down notes as I come up with ideas for novels and other projects as I work. \n\nMy passion is storytelling. Whether it's novels, videos, or video game RPGs, that's what I want to be doing. But right now, I'm not in a position to sustain my wife and myself doing that. But I'm still chipping away at it, and that helps me emotionally recharge for my job. \n\nRemember, the second your passion is your job, that means it's your job. My dad is an artist, but he used to be a marketing art director. When he was in that position, he would do all sorts of fun drawings on the side at home because he wasn't doing art in his main job. Now he's a contract artist, which means he doesn't do those illustrations anymore because why would he spend another two hours on a He-Man drawing for fun when he just spent the whole day doing contract illustrations? Now, he does outside work, takes care of my sisters who are still at home, and on a rare occasion, takes commissions from an old friend for art on a figure series he's invested in. \n\nYou seem like a good kid, you are already looking forward and trying to figure out your path in life. That's excellent. While I'm not that much older than you, I remember being 17 and wanting to go all in on my passions as well. Keep that fire burning, but don't let it take the field. Harness it, bridle it, and you'll be shooting for the stars soon enough. \n\nTL;DR Get a job that'll pay the bills first, do the game development stuff on the side."}, {"comment_author": "Jujitsu_Master6", "comment_text": "I assure you its possible to go to Uni, get a job, and develop a game on your weekends. A project like that should take years (if you rush it, you'll ruin it - both your personal enjoyment of developing it and the actual quality of the game). Financial buffers give your brain a sense of more creative freedom because you won't have a nervous breakdown feeling like its game or bust. Gives you leeway if there's problems with the game's marketability. Plus, if you can learn to be emotionally independent of what you do for a living (enjoy both a day job and your side-projects) it's a win-win. Anything is possible if you're willing to take the long view."}, {"comment_author": "inkihh", "comment_text": "Did you talk to your parents in this depth?"}, {"comment_author": "GreenGrass4892", "comment_text": "Not one period or capital \"I\" in the entire post. Has to be a new record."}]}, {"post_title": "[Discussion] What to do instead of doomscrolling", "post_url": "/r/productivity/comments/1bx6cic/what_to_do_instead_of_doomscrolling/", "post_main_text": "", "post_comments": [{"comment_author": "whoareyoutoquestion", "comment_text": "Take up a non digital hobby. \n\nLearn clay sculpting or focus on exercise with groups like running clubs or climbing packs.   Take on whittling or metal welding for art.\n\nMake things in real life or improve yourself. \n\nFocus on simple goals like build a table, or go on a 5k run twice this year.    But step away from screens and do something."}, {"comment_author": "AvaranIceStar", "comment_text": "This is huge. Finding things to do in the physical world is important to mental health."}, {"comment_author": "Aggravating-Pound598", "comment_text": "Go for a run"}, {"comment_author": "kaizokuo_", "comment_text": "Okay Aggravatively noted✅."}, {"comment_author": "Aggravating-Pound598", "comment_text": "You’ll thank me :)"}, {"comment_author": "CatBootyhole", "comment_text": "reading free pdfs of books online. journaling. meditating. listening to gateway tapes? astral projecting? cooking..baking.. coloring. idk 🤔"}, {"comment_author": "lookslikeyoureSOL", "comment_text": "+1 for the gateway tapes and out-of-body experiences. I've been spending the entire year so far reading about it. \n\nIf you know, you know.\n\n/r/gatewaytapes"}, {"comment_author": "kaizokuo_", "comment_text": "Okay sir. On it..."}, {"comment_author": "kaizokuo_", "comment_text": "Please elaborate. I'm so fascinated by meditation due to Ramanujan. \n\nIf you know, you know."}, {"comment_author": "CatBootyhole", "comment_text": "i’m a girl. what about cat bootyhole makes ppl think i’m a man🤓"}, {"comment_author": "kaizokuo_", "comment_text": "Okay Madam...\nOn it..."}]}]