["Hello college students, high-schoolers, educators, and everyone in between whose used r/GetStudying,\n\nThank you for 2 million members! This subreddit was created to help connect motivated learners, and help inspire those who were ready to achieve the best they academically could. While education can be a hindrance for some, this subreddit has helped so many people do great things, and we hope this subreddit helped contribute to academic success in some way.\n\nFrom the Moderation team, thank you so much. We never would've imagined having this many people in our subreddit, but we're thankful to everyone for all their help. Onto the next milestone!\n\nAs our subreddit continues to grow, we're looking for moderators to help with the community. Visit the link below to start the application process!\n\n[https://forms.gle/5V1LK8akj9Wfppve8](https://forms.gle/5V1LK8akj9Wfppve8)\n\n&#x200B;\n\nOnce again, thank you. We hope your school year is going well, and we wish you the best to come!--\n\nThe Moderation Team @ r/GetStudying", "Hi everyone! This is the Accountability Thread where people can list what they need or want to accomplish today and have everyone else help keep you accountable to do them. So, in general, a post will look like this:\n\nThings I have to get done today:\n\n~~1: Post Accountability Thread~~\n\nIf I had more to do that I had not completed I would list them and update this when these things were complete.\n\nAlso, if I saw someone doing something that I happen to be well-educated or have some sort of expertise in I can offer support or help on the topic/task.\n\nThe thread is a versatile one, use it in a way that helps you and others stay on task!\n\nHappy studying!", "It's my anniversary today! And I have two shifts. I'm still going to try and at least do something productive between work.\n\nTo Do:  \nGroceries  \nClean keyboard  \nOrganise desk  \nStart T9 (60 mins?)  \nPut laundry away  \nRespond to UNI emails  \nStudy timetable  \nCheeky midnight shower?", "", "I wasted 5 years of my life living like this and it seems i still haven't learned a lesson, just logged off from playing a game.", "I feel the same my friend. If you wish for an ear, feel free to DM", "I would okay Overwatch every night at 10pm for 2 hours before going to sleep. Before that and if I didn’t work I would put in as much studying time as I could. It worked relatively well imo.", "The thing is, it's alright if you game after completing your study, entertainment is a necessity, the problem is when you prioritize gaming over studying", "This is me, can we talk?", "Hit the gym, lawyer up, and invest in yourself", "One advice is to add a study session among all of this. U can make it so u go to a library once a day for a few h and just study and then when u get home u play/chill/do whatever\n\nI cannot for the Life of me do ANYTHING productive in my room and in my home its the only free space. If i want to exercise or do any sutdies I have to be in a classroom or library or gym but it literally works.", "Back in college I made a deal with myself. Study for 45mins then for 15mins do whatever I wanted. Then repeat til finished. The hardest part was opening the book and my notes. \n\nThe library helped me out a lot too. I did most of my studying there until it was closing time.", "Oh yes. Idk why but this happens to me too. I am a regular at study cafes cause I cannot study in my room.", "There's no available library in my city. The only viable place to study here is in home.", "I would be nothing without actually going to a library or my moms workplace so im doing my thing while she works. :') \nAnd u still get to commit to ur hobbies after... Now changing the hobbies and habits is a different issue to tackle", "I guess thats why people say showing up is half the way Done. It genuinely saved me...", "Same. I don't even want to open my books inside my room. Too many distractions.", "100%", " FUCK, you got me but I’m tired so I’m going to sleep", "Unfortunately the story of my life.\n-\"Fuck I'm tired time to sleep\"\n*Before doing anything moderately productive*", "lol this is litteraly me and i failed 2 out of 4 mock exams last month. i am so lazy but im also deppresed so its sadly impressive i didnt fail all my exams", "I mean if you are going through depression then the fact that you are putting even this much effort is impressive. Best of luck. \nLet the force be with you.", "thanks man thats truely nice to hear 🙏", "if thats ain’t me 💀\nik i should not joke about it but here we are", "Lacks weed.", "I can relate so much! Now i always say tht I only have my self, so i only have myself to blame if I dont study.", "Kinda like self accountability. It is a very healthy attitude that you have about it.", "Man I'm cooked. I need to get my shit straight", "I truly needed this, thanks a lot 🙏", "Me right now", "The nearer the exam date, any show will get more interesting to watch 😔", "? I don’t do many of these, I just live in a region that does a bad job with rights recognition which gets in the way of good performance. I have to take too many classes to qualify for scholarships, it’s just too many to do great in", "meirl", "Thanks I think I'm screwed 🥲", "Never failed an exam and never studied for one either", "Damn was Einstein your grandaddy?", "Bro is too busy commenting on reddit all day he dont have time to study", "", "", "", "", "", "This hits different, quite nostalgic even. When I was with my previous company we used to have pizza parties at the end of every season and that was what you get per one. I would say this is quite generous honestly. We all admired our boss for how thoughtful he was and tried to repay his unfathomable kindness by buying him presents. This was until we learned how much a pizza actually costs. After that, we all agreed to quit our jobs since we have realized there is no way we can repay it and won’t be able to stop feeling guilty about it.", "", "Hi there, like the title already implies, how do you retain information over longer time periods.  When exams are approaching I most of the time forget the information from the firsts weeks. Which makes me skip the last week classes because I need to repeat the first weeks again. \n\nIs there a way to retain information without going through all readings every week. I am studying law so most of the time I have a lot of readings aside from the homework I need to prepare for every lecture. \n\nAlso a period is 7 weeks in the 8th week are exams. \n\nThank you in advance !! \n\nAlso sorry if my English isn’t great (it’s not my first language) \n", "Okay so tomorrow I have a maths test and the next day I have a writing test for my religion class. Can someone please write in the comments some words of motivation + tips so that I will get up in the morning and do some study early tomorrow. (I have done some but not enough, and I really REALLY don't want to do much right now) Please be nice!!! Thanks", "You can do this I believe in you. Wake up as early as possible and review for your test! Tip for waking up don't think twice as soon as you open your eyes be aware of your body and get off the bed!!", "Thanks!!", "Exerting yourself last minute wont help. Just focus on being well rested so your mind is as fresh and sharp as possible at the time on which your tests starts. Good luck!", "thank you :))", "Same mf boat, we got this", "Analyse exactly what it is you want to achieve and then try let your reason or  reasons for that to inspire you in to action. A great source of motivation for me is proving my haters wrong. Telling me I can’t achieve something fuels my hate fire and in turn compels me into action. I also believe that if you believe you can, you are already half way there. Stay curious too if you can. As the saying goes ‘you will never eat unless the net is tested’.", "I took a while for me to get it. The key is preparation, preparation, and preparation.  Maybe next-gen time. Set your goals on something worthy of you. Then, go to work.", "Get up soon and study , u got this and it won't be hard", "", "BE GOOOD... STUDY", "You have to study", "Wait u guys have an S?\n\n(Indian here idk we have max A+)", "SSS", "We don't even use letters. 1-5 for elementary school and high school and 5-10 for college", "Bros school rank in a tier list", "This sucks for me. I tried my best and applied all I could. I have been an honor student in my undergrad. I also feel inferior to my friend who still got honors even though it was hard as heck for me to just pass. Need some motivation right now. Or advice ", "I'm a nursing student currently in our 2nd semester, one last exam to proceed in 3rd year and I failed it. I am ashamed and I don't know what to say to my parents. It's too painful. Then later on, I found out that there's a leak in the exam and most of my classmates passed. I don't know what to react. Any advice to address my emotions? Because I want to move on and cut them off.", "First, you'll let some time pass. No decisions, no consequences until it's been a few days. This is a grieving process. The future looks bad right now cause it's tainted by your feelings. The solution is to just not look at it for a bit. \n\nDon't get me wrong, you'll have to deal with it eventually and putting it off for too long is just gonna hurt you more. But give it a day or two. Take a good nap and get some air. Once you've processed your feelings your brain won't be as crowded and you can go into problem solving mode.", "thank you so much! :⁠,⁠-⁠)", " I use the Pomodoro technique for studying and its worked out quite well. Sometimes, like when preparing for an exam, I study for longer periods, but I still do take breaks of usually 15 minutes.\n\nI usually spend the time during breaks scrolling through Instagram or watching YouTube shorts, and sometimes I feel like all the extra, useless information my brain is absorbing from these sources is hindering my ability to retain information from my study sessions. So are there any alternative things I could do during breaks that does not necessarily involve moving around as it is not possible sometimes due to the location at which I'm studying?", "You could try stretching and literally get your blood pumping in between sessions.\n\nOr an alternative I do is organize tasks in my planner in between sessions.", "", "This is so true \n\nand its never the video from my 5,000 watch later videos", "DUDE WTF! you're actually my clone. My watch later is that meme of the mom attending to here daughter(hundreds of current videos in different tabs)in the pool while her son drowns.", "Why is this true !!!", "Making a decision that will affect your future causes anxiety, avoiding pain is hard wired in us", "Sure, because you pick it on Spotify", "How effective would it be to use Reddit/Quora as a learning tool, where instead of reading books, I research and answer questions I come across, potentially gaining a deeper understanding of various topics related to general knowledge through this interactive approach.", "In my opinion both are effective platform for learning.", "In anything one considers learning, one also has to evaluate the trustworthiness of the material one is gathering. The issue surrounding any social (or otherwise) platform is that each has its own bubble that doesn't provide a truthful representation of thought, particularly true of subreddits.\n\nNow, if your subject is sociological in nature and you are examining people's behaviours online through the lens of what they publish, and possible through comparing the anonymity of reddit versus the \"required\" real-name on quora then such sources might be of interest.\n\nIt really depends on **what you are studying**, **what you consider \"knowledge\"** and in the end, **how academically sound** you want your own understanding of things.", "\nwhen they said “show me your friends, & i’ll show you your future” … oh they was right. first time being a university student & i started off the first three weeks of the semester pretty good, until i didn’t. who told me to start my ‘stoner era’ while starting university? lol bad decision. long story short, ive decided it’s better to have a W then an F. but does this mean im a complete failure & i have no hope in academic success? because im pretty smart but i also get influenced very easily, which probably doesn’t mean im smart too. idk im a walking contradiction but yeah send help lol. ", "Don’t get too anxious about this. You made a mistake and sure sounds like you already learned something about it. You did some reflection and figured you’re essy to influence, thats more self-awareness than most pol from your age group! All of that (x)era bs is also social media influence. Set your goals straight, set yourself some limits of things like actually think actively about them (e.g. next semester I won’t allow myself to smoke).  Keep your head in the game buddy, you got this. This is just a minor setback really, dont worry💕", "thank you so much! i really needed to hear that :) i truly hope you have an wonderful day💗", "You too! I would suggest you rehurs setting boundaries to other people and stay firm in your decision no matter who tries to pressure you. E.g  when someone offers you substances you decided to quit, think about how you would respond in the situation. Im sure you can find videos and sources online.", "Don't beat yourself up, we all live and learn. It's only the first semester, you can come back from this and have a do-over.", "Please look into some therapy, your worth is NOT attached to this small hiccup. You’re doing what you need to and while I agree, weed is fun! It’s often used to mask other stuff and I fear there may be something more to this considering how quickly you entered your “stoner era”", "Almost happened to me too. I might enter this era soon but after reading this… nevermind lol", "learn from my mistakes!", "Biggest advice I can give you is uni students learn at different paces, ik this sounds crazy because when you have standardised testing it makes you want to believe there’s a “right way” of doing things.\n\nIn actuality what works for someone won’t always work for you, the only constant is that you need to be dedicated to learn new things day in and day out for hours at a time. For instance I hate textbooks but I love practice questions, so when I revise I do practice questions and not reread the textbook.", "Same thing happened to me 😭😭\n\nAnyways, spring and summer classes might be a thing for you too, so there's hope 🙏", "🫢🫣🤣🤣", "hey! don’t laugh dude😂 this is supposed to be a safe space", "I am a passive learner. I take notes, do practice problems to the point it’s “second-nature.” This works well until a few days pass and I just forget everything. This is why I do fantastic on weekly quizzes and horrible on exams covering previous content.\n\nMy main problem I always find myself in is that I can’t explain the topics I’m studying nearly at all despite knowing how to “do” them. I can only do the problems based on short-term memory. \n\nHere’s the issue: it takes a crazy amount of time to go indepth in a topic to be able to explain it beginning to end.. but once I’m able to explain something AND apply it, it’s logged into my long term memory and I’m excellent at it- but it is just such a timely cost.  id practically get the same results from passive learning given a period of time to learn a wide range of content rather than focus all my time on a little amount of content. Any way to speed things up? ", "You can try to review your notes afterward. It might help you better understand and remember the material. You can also use flashcards to help you, but I recommend not creating them manually because it takes too much time.", "Maybe try teaching others, or even group studying and discussions around the topics. Sometimes the little 'mini traumas' we face when trying to speak to others or getting them to speak can help cement some topics. The idea here is that when you try to teach others you immediately find gaps in your knowledge. It is the making of connections that creates long-term memory.\n\nAnd with flashcards, like u/Darcron_ suggested, don't just fill in the blanks, but turn statements into questions. If you have access to an LLM, get the LLM to ask you questions and evaluate your answers critically.\n\nWhat works for me (these things) might not work for you but it's good to at least try new things if your current system seems ineffective.", "> This is why I do fantastic on weekly quizzes and horrible on exams covering previous content\n\nYou cannot explain something that you don't remember. Even when you might be able to \"explain\" something at the first question that goes outside the rails you might find yourself incapable to answer because you have not actually memorized the concept.\n\nIf you want to memorize things long term, my recommendation is always using flahscards. Anki is amazing if you want to invest the time and you are able to build the habit. If you want to speed things up with flashcards we are working on [flashka.ai](http://flashka.ai) which makes flashcards and quizzes automatically from PDFs and text, and there are many other similar alternatives popping out like that!\n\nGood luck!", "Help I desperately want to learn. I'm autistic and have ADHD, I know great combinations struggle to retain information and am very slow at processing things. I have however found a few things that work but the problem is they are for very specific subjects. The first thing is Duolingo and babble. The gamified method really works for me, giving me information and then working on slowly memorising it with pictures, sound and repetition. I have tried similar quiz apps but they just don't work very well for me. Duolingo is almost more childlike, I don't really know how to explain it. The other application I love is Endless Quiz, this is a real confidence booster because it shows me how much knowledge I have tucked away in my brain in my subconscious, I think that's the right word. I want to learn paramedic science but I just can't seem to find anything that works in the same way. It's too much information that I need breaking down which I can't do. That's my problem, it's funny how I only discovered how much I loved learning after leaving the education system."]