[{"post_title": "2 Million Members - Thank you from the mod team", "post_url": "https://www.reddit.com/r/GetStudying/comments/1bhdczf/2_million_members_thank_you_from_the_mod_team/", "post_main_text": "Hello college students, high-schoolers, educators, and everyone in between whose used r/GetStudying,\n\nThank you for 2 million members! This subreddit was created to help connect motivated learners, and help inspire those who were ready to achieve the best they academically could. While education can be a hindrance for some, this subreddit has helped so many people do great things, and we hope this subreddit helped contribute to academic success in some way.\n\nFrom the Moderation team, thank you so much. We never would've imagined having this many people in our subreddit, but we're thankful to everyone for all their help. Onto the next milestone!\n\nAs our subreddit continues to grow, we're looking for moderators to help with the community. Visit the link below to start the application process!\n\n[https://forms.gle/5V1LK8akj9Wfppve8](https://forms.gle/5V1LK8akj9Wfppve8)\n\n&#x200B;\n\nOnce again, thank you. We hope your school year is going well, and we wish you the best to come!--\n\nThe Moderation Team @ r/GetStudying", "post_comments": [{"comment_author": "Efficient-Energy3597", "comment_text": "I want to post but i cannot. The bot asks me if I'm a bot or not and after hitting post it just do not post! What is wrong with it"}]}, {"post_title": "Daily Accountability Thread - April 08, 2024", "post_url": "https://www.reddit.com/r/GetStudying/comments/1byqis5/daily_accountability_thread_april_08_2024/", "post_main_text": "Hi everyone! This is the Accountability Thread where people can list what they need or want to accomplish today and have everyone else help keep you accountable to do them. So, in general, a post will look like this:\n\nThings I have to get done today:\n\n~~1: Post Accountability Thread~~\n\nIf I had more to do that I had not completed I would list them and update this when these things were complete.\n\nAlso, if I saw someone doing something that I happen to be well-educated or have some sort of expertise in I can offer support or help on the topic/task.\n\nThe thread is a versatile one, use it in a way that helps you and others stay on task!\n\nHappy studying!", "post_comments": []}, {"post_title": "It's ok", "post_url": "https://i.redd.it/3b9xr9wsw0tc1.jpeg", "post_main_text": "", "post_comments": [{"comment_author": "MassiveInstruction65", "comment_text": "Did you recognize yourself?"}, {"comment_author": "Thick_Car_5603", "comment_text": "Happened last night"}]}, {"post_title": "What should I do to make studying more fun? ", "post_url": "https://i.redd.it/cqgtovy5d7tc1.png", "post_main_text": "", "post_comments": [{"comment_author": "araxitommolino", "comment_text": "Take longer breaks and reward yourself for small victories."}, {"comment_author": "InternationalCarob24", "comment_text": "Why don't you try to have a good routine for a day with good exercise and then try to study by just making tough concept seem funny like Draw that diagram in a funny way or just make a simple joke about that concept which will help you retain it for longer period try it for few days and do some self discovery about what you find funny and Integrate it with your study \nAll the best :)"}, {"comment_author": "InkyPaletteGlow", "comment_text": "That's a really good advice. Thanks man"}, {"comment_author": "InternationalCarob24", "comment_text": "Thanks mate Goodluck for future progress"}, {"comment_author": "InkyPaletteGlow", "comment_text": "You too"}, {"comment_author": "cree-cree69", "comment_text": "play music"}, {"comment_author": "InkyPaletteGlow", "comment_text": "Music distracts me unfortunately 😔"}, {"comment_author": "GirlWithSunglasses1", "comment_text": "Classical music is my go-to, I hate silence but I also hate getting distracted"}, {"comment_author": "cree-cree69", "comment_text": "eat nlng po"}, {"comment_author": "NotFromYouTube", "comment_text": "For me I only get distracted when the music has vocals and I'll stupidly sing along. I switched over to instrumental covers, lofi or whatever music that does not contain vocals.\n\nDoes music in general distract you? If it does you could try podcasts since there is no music but it entertains you a little while studying."}, {"comment_author": "InkyPaletteGlow", "comment_text": "Yes it does, any kinda music distracts me"}, {"comment_author": "Kupkakey2058", "comment_text": "RPG-fy it. Use apps like habitica and forest to make it like a game, if you study for long eventually you'll get used to it. Just make it like a super quest to kill a boss"}, {"comment_author": "InkyPaletteGlow", "comment_text": "Wow. Thanks, that's great advice"}, {"comment_author": "Kupkakey2058", "comment_text": "Yes it definitely is, I usually do that and it makes it more fun"}, {"comment_author": "KaizarHusaria", "comment_text": "Meth"}, {"comment_author": "InkyPaletteGlow", "comment_text": "Prop"}, {"comment_author": "InkyPaletteGlow", "comment_text": "(I think eth comes first I'm not sure)"}, {"comment_author": "cree-cree69", "comment_text": "have a foods"}, {"comment_author": "mrxyz890", "comment_text": "you need just to start studying. 👍"}, {"comment_author": "InkyPaletteGlow", "comment_text": "I study a lot but now I want to make it fun"}, {"comment_author": "Nu-Deathcore-king", "comment_text": "Good luck on your quest!"}, {"comment_author": "Hungry_Raspberry1708", "comment_text": "i don't know but people who have MacBooks look like they enjoy studying more..."}, {"comment_author": "InkyPaletteGlow", "comment_text": "(I'm broke)"}, {"comment_author": "Hungry_Raspberry1708", "comment_text": "same... :/"}, {"comment_author": "WiseStrike5432", "comment_text": "Masturbate"}, {"comment_author": "ayush017", "comment_text": "wtf😭"}]}, {"post_title": "heh", "post_url": "https://i.redd.it/gxqc0fvhk7tc1.jpeg", "post_main_text": "", "post_comments": []}, {"post_title": "How to get rid of this?", "post_url": "https://i.redd.it/3e7ysq6ao7tc1.jpeg", "post_main_text": "", "post_comments": [{"comment_author": "ReadyMarketers", "comment_text": "It's that moment when you think you're the best, but then something goes wrong"}, {"comment_author": "Borgormmmmmm", "comment_text": "Replace the teacher. Consume.\n\nJokes aside honestly how to fix this depends on the class/subject. For example, for English definitely recommend someone to pointing out what you need to improve then be mindful of that when writing or revising. With my past experience as a tutor just by pointing where they can improve such as parts where they can cut out or reword significantly improved their writing overtime"}]}, {"post_title": "Pain", "post_url": "https://i.redd.it/vvblx3ape7tc1.jpeg", "post_main_text": "", "post_comments": []}, {"post_title": "Distracting thing", "post_url": "https://i.redd.it/za96td1ug7tc1.jpeg", "post_main_text": "", "post_comments": [{"comment_author": "Turbulent-Mud2594", "comment_text": "😭"}]}, {"post_title": "Pleasure", "post_url": "https://i.redd.it/i15xyuf4v0tc1.jpeg", "post_main_text": "", "post_comments": [{"comment_author": "Ok-Foundation-7447", "comment_text": "Well, that's my job-"}, {"comment_author": "superstarfighter", "comment_text": "I'd take that. Math gives me flow."}, {"comment_author": "InformationFair4396", "comment_text": "Tbh I miss Math."}, {"comment_author": "pageyboy335", "comment_text": "Got to college and do a degree in mathematics if you think that would be better."}, {"comment_author": "InformationFair4396", "comment_text": "Who will earn for me then lol"}, {"comment_author": "WittyAvocadoToast", "comment_text": "I wish math was the hard part in adult life."}, {"comment_author": "SinisterSynth", "comment_text": "Its so interesting seeing someone can be passionately in love with maths and someone else dread it with all his might. Its in times like this that you realise everyone is different (this post was made by the math hating propaganda)"}, {"comment_author": "madump5427", "comment_text": "now see it depends on what kind of math homework...\n\nif it's elementary math, sign me the fuck up. but if it's beyond that, just let me suffer in my shit life thanks!"}, {"comment_author": "quantumsenigma", "comment_text": "i’d rather be shot tbh"}, {"comment_author": "itslevi-Osa", "comment_text": "Taylor really woke up and chose violence lmao 💀"}, {"comment_author": "444Ilovecats444", "comment_text": "I can’t believe i am saying this but adult life is easier than math"}, {"comment_author": "BanOfSpeedrun", "comment_text": "I do adulting stuff AND math homework to prepare for college...."}, {"comment_author": "caet_", "comment_text": "that’s why i wanna grow up"}, {"comment_author": "Silent_Fern", "comment_text": "I’ve done more math as an adult than I ever did as a child"}, {"comment_author": "pchulbul619", "comment_text": "Lol, we have to do adv statistics and spreadsheets modeling in our jobs as well."}, {"comment_author": "popthepillies", "comment_text": "I miss Calculus homework. Integrals are fun to do mindlessly"}, {"comment_author": "haikusbot", "comment_text": "*I miss Calculus*\n\n*Homework. Integrals are fun*\n\n*To do mindlessly*\n\n\\- popthepillies\n\n---\n\n^(I detect haikus. And sometimes, successfully.) ^[Learn&#32;more&#32;about&#32;me.](https://www.reddit.com/r/haikusbot/)\n\n^(Opt out of replies: \"haikusbot opt out\" | Delete my comment: \"haikusbot delete\")"}, {"comment_author": "Ignacio_dure", "comment_text": "Worst time in my life i hate maths but i love programming \nRare life style"}]}, {"post_title": "If you’re stuck should you move on or work through it? Exam Studies", "post_url": "https://www.reddit.com/r/GetStudying/comments/1byqdwg/if_youre_stuck_should_you_move_on_or_work_through/", "post_main_text": "Hii so let’s say u have 10-12 days to Study for a big exam. The exam is 4 different sections. You’ve been trying to work through an important section of the material but you’re starting to feel stuck. It’s so dense your eyes feel like they’re crossing. You have a limited amount of time, truly u should’ve started studying like 2 months ago. You’ve already been on that one section for like 4 days longer than planned.\n\n\nShould you \nA) force yourself to work through it no matter what or \n\n B) move on to the rest of the material and come back after you’ve covered everything else? \n", "post_comments": [{"comment_author": "kung-phucious", "comment_text": "Move on if the material is all weighted the same on the exam."}, {"comment_author": "Revolutionary-Sky758", "comment_text": "This is a challenging situation, and there's no one-size-fits-all answer. However, here are a few factors to consider:\r  \n\r  \n1. Assess your level of understanding:\r  \n   \\- If you're truly stuck and feel like you're not making any meaningful progress on that section, despite your efforts, it may be more productive to move on for now.\r  \n   \\- However, if you feel like you're on the cusp of understanding and just need a little more time and focus, it could be worth persisting.\r  \n\r  \n2. Consider the weight of the sections:\r  \n   \\- Evaluate how important that particular section is relative to the others. If it's a crucial foundational piece, it may be worth prioritizing it, even if it means sacrificing some time in other areas.\r  \n   \\- On the other hand, if the section is less heavily weighted, it may make sense to move on and come back to it later.\r  \n\r  \n3. Manage your time efficiently:\r  \n   \\- With only 10-12 days left, you'll need to be very strategic about how you allocate your time.\r  \n   \\- If you've already spent 4 days longer than planned on that one section, it may be better to move on and cover the remaining material, rather than risk falling behind on the other sections.\r  \n\r  \n4. Take breaks and revisit:\r  \n   \\- If you decide to move on, you could still come back to the challenging section later, after you've covered the other material.\r  \n   \\- Taking a break and returning to it with fresh eyes might help you break through the mental block.\r  \n\r  \nUltimately, it's a balancing act. My recommendation would be to:\r  \n\r  \nA) Spend a bit more time trying to understand the challenging section, but set a clear time limit (e.g., another 1-2 hours).\r  \nB) If you still feel stuck, move on to the other sections, making a note to come back to the difficult section later.\r  \nC) Regularly review your progress and consider adjusting your plan as needed.\r  \n\r  \nThe key is to be flexible, focus on the sections that will have the greatest impact, and don't get too bogged down in one area at the expense of the others. With strategic time management and a willingness to adapt, you can maximize your chances of success on the exam.\n\nr/Homeworkhelpteam\n\n[WritersABC.com](https://WritersABC.com)"}, {"comment_author": "Honest_Zombie8560", "comment_text": "Thank you so much for the detailed advice 🩷"}, {"comment_author": "Revolutionary-Sky758", "comment_text": "You are welcome Honest\\_"}]}, {"post_title": "How to motivate yourself to study when severely depressed? ", "post_url": "https://www.reddit.com/r/GetStudying/comments/1bygqf0/how_to_motivate_yourself_to_study_when_severely/", "post_main_text": "Exams wait for nobody and they definitely don’t care that nothing seems real to me anymore. \nWhen I try to study I just end up staring blankly at a screen, or listening but never remembering anything. \n\nPlease guys I’m desperate here, I used to be able to study ten hours a day every day and now I’m lucky to get an hour in a week. \n\nHelp. ", "post_comments": [{"comment_author": "Downtown_Gas5744", "comment_text": "I’m so sorry you feel that way. I’m not sure my tips will be helpful but I’m gonna write them anyways because it’s better than not. I’m just gonna tell you how I manage when feeling down. It’s not depression so I can’t imagine how you’re feeling. When I don’t feel like studying I try to remind myself of why I study. And when I feel down studying helps distracting me from my emotions. Now that’s very different from depression. I would suggest you try to get better by seeking professional help. There is nothing more important than your mental health. If that doesn’t work then be nicer to yourself. You probably expect much of yourself as you mentioned that you could go on for 10 hours. Take it one step at a time. Set mini goals every day. Tell yourself today I’m gonna study these many minutes (yes start at minutes). And then you can gradually increase it because you will for 1. Feel better through achieving goals 2. Slowly but surely be able to study more and more and regain your old habit. And it’s completely normal and okay if you one day don’t achieve what you expected to. Don’t be too hard on yourself. I hope and pray that it will get better. Take care of yourself!!"}, {"comment_author": "Matrixblackhole", "comment_text": " 10 hours a day isnt great tbh (personally I can only do maybe a maximum 3 hours on a good day). As someone who's dyslexic I'm pretty sure it's not an efficient/effective method to do 5+ hours without breaks.\n\nAnyhow, what I do is make flashcards on Quizlet and then move them over to Knowt (what quizlet used to be before they started asking you pay for stuff). Although I do prefer flashcard mode on quizlet, but I prefer the 'learn mode' on Knowt which is quite good for active recall.\n\nThen if I'm still unsure on a topic I see if there's anything on youtube / or any academic papers which explain it better, and make a physical A3 /A4 posters as it helps to map things out.\n\nIf you have any practice papers or example questions, definitely do those and see if you can answer those questions in mock exam conditions in your room just to practice.\n\nGood luck!"}, {"comment_author": "jvmpfrog", "comment_text": "This is something I struggled with for a long time. What I did to help me is download the app Forest, a pomodoro timer app that will block you from accessing apps on your phone that will not help you with your studies. After each successful study session, you get a tree!! So, you slowly grow a beautiful forest, and you can unlock new trees the more you study. This small little reward system made a huge difference for me.\n\n&#x200B;\n\nAdditionally, I will do only 1-2 assignments per day so I don't get burnt out. I started studying on FaceTime with someone so that I am held accountable, and someone sees that I'm working. Then, at the end of our session we discuss what we accomplished, and how that compared to our daily goal/plan. This way, you're able to see how much you can accomplish without getting burnt out and set tangible goals for yourself moving forward. If you don't have anyone to study with, I highly recommend just going on YouTube and putting on a video of someone studying ([pike channel](https://www.youtube.com/@pikechannel) is my favorite!) just to get the ambiance."}, {"comment_author": "VentoraTRM", "comment_text": "no offence but I dont think a tree can help :D"}, {"comment_author": "Revolutionary-Sky758", "comment_text": "I'm really sorry you're struggling with severe depression and finding it so difficult to motivate yourself to study. That must be incredibly challenging and draining. \r  \n\r  \n1. Seek Professional Support:\r  \n   \\- Reach out to a counselor, therapist, or your university's mental health services. Getting professional help to manage your depression should be the top priority.\r  \n   \\- Medication and therapy can make a significant difference in restoring your energy and focus.\r  \n\r  \n2. Break Tasks into Smaller Steps:\r  \n   \\- When even an hour of studying feels impossible, try breaking it down into 10-15 minute chunks. Celebrate small wins.\r  \n   \\- Focus on just getting started, even for a brief period. The momentum can build from there.\r  \n\r  \n3. Incorporate Self-Care:\r  \n   \\- Make sure you're getting enough sleep, nutrition, and exercise, as these can greatly impact your mental state.\r  \n   \\- Build in relaxation activities, like meditation, journaling, or connecting with supportive friends.\r  \n\r  \n4. Adjust Expectations:\r  \n   \\- Don't beat yourself up for not being able to study as much as you used to. Recognize that depression has impacted your abilities.\r  \n   \\- Set more realistic, compassionate study goals that won't overwhelm you.\r  \n\r  \n5. Seek Academic Accommodations:\r  \n   \\- Reach out to your professors or university's disability services to inquire about potential accommodations, such as extended deadlines or alternative assignment formats.\r  \n   \\- This can help reduce stress and provide you with the support you need.\r  \n\r  \nAll the Best\n\nr/Homeworkhelpteam\n\n[WritersABC.com](https://WritersABC.com)"}, {"comment_author": "Dull_Main_7342", "comment_text": "Improve your mental health by playing sports, showering with cold water, going out with friends, going to a psychiatrist, writing down everything that makes you sad on paper, take care of yourself, do not force yourself to study for ten hours, but study what you have to study."}, {"comment_author": "VentoraTRM", "comment_text": "what if he has an exam & he needs to study?"}, {"comment_author": "mendyourgarden", "comment_text": "Take a step back, relax, and most importantly enjoy the process. Break concepts into small chunks and absorb it at your own pace.\nIf you pressure yourself to ace at any cost, you'll end up demotivated and studying won't be fun anymore."}, {"comment_author": "FluffyBee16", "comment_text": "I totally feel for you! You’re not alone. I felt the same way in school. I am not sure if it will help, but I reframed my thinking about studying. Instead of thinking of it as school, I started thinking of it as my job or my business. I’m the type of person that will be able to work my job fine, but when it comes to taking care of myself, sometimes I’m not able to when I’m depressed. I would logically reason that I’m being paid for studying so I gotta do it. So being able to see it as my job (because literally my future income depends on it) helped me when I was feeling unmotivated to help myself. Definitely try to destress and do fun things on your study breaks to make it enjoyable. All the best to you and don’t give up on yourself."}, {"comment_author": "Sarangi--", "comment_text": "Following this! I know how you feel. Thanks for posting op. Glad I am not alone."}, {"comment_author": "hellokitty9834", "comment_text": "Wishing you the very best. I’ve been where you been and it’s so hard. I don’t know your medical situation but I know therapy and medication tremendously helps me cope. It doesn’t fix everything but helps me stay at a reasonable baseline. \n\nLittle things that help me with depression:\n\n- keep depression snacks in your room or backpack. So helpful for days where it’s hard to do self care or you feel like you’re running behind. I’d recommend fiber snacks or fruit snacks; something easy on your stomach. \n\n- Pomodoro apps or videos on YouTube help tremendously with getting stuff done when I’m in a rut. I’ve felt so burnt out with grad school and have seen my motivation spiral and pomodoro have saved me. I also recommend the Study Bunny app on iPhone. I have a pomodoro app on my laptop where it keeps track of the minutes I spent studying (and I like it just bc I like tracking stuff). \n\n- get out of the house to study. Go to a place with sunshine and either take snacks or make sure it’s a place you can buy something to eat or drink you like. Even if you only study for 30 minutes or 4 hours. Every bit counts! It’s very unhelpful to think in an all or nothing mindset\n\n- do something nice for yourself, something small. It’s not always easy but on some days where I feel like absolute sh-t I will carve out time to do my eyeshadow and make my hair look decent. It’s a great opportunity to express my creativity, practice mindfulness and enjoy the time using different colors. Doing this helps me feel a little bit more enthused and confident about the day, even if I know I’m still not feeling 100%. \n\n- call or text someone close to you, a safe person, you know you can confide in about your symptoms. Again, I don’t know you personally, but I know for me being able to be honest with someone and not mask helps me feel less alone and like I don’t have to be so hard on myself. I used to have a really great friend who used to let me go over to her house anytime to get work done or to have a nice meal whenever my anxiety felt like too much. \n\nYou’re welcome to DM me if I can help with anything else. I’m in graduate school training to be a psychologist. I’m not practicing (nor giving medical advice nor therapy to anyone online) but I also have lived experience with depression and anxiety in graduate school and if I can help anyone feel less alone I’m so happy to help!"}, {"comment_author": "VentoraTRM", "comment_text": "damn"}, {"comment_author": "VentoraTRM", "comment_text": "Go to therapy or tell someone you love .Then put some music and try to forget the stress."}, {"comment_author": "Ok-Marionberry-9101", "comment_text": "dreams don’t work unless you do / do something today that your future self will be thankful for. \nI genuinely repeat these two quotes every single time I feel like not studying or anxious. Even when I was depressed 5 years ago I constantly repeated these two quotes to myself and the feeling afterwards is amazing. Hope you are going to get through this difficult time and remember SUN ALWAYS COMES AFTER THE RAIN"}, {"comment_author": "deludedkermit", "comment_text": "Step 1, just get up and go to your study table. You'll feel lighter.\nStep 2: open your book/laptop\nStep 3: start with a short problem/lesson.\n\nIt's often the small steps that will help you achieve anything."}]}, {"post_title": "Off to lala land again...", "post_url": "https://i.redd.it/e4ehrw4vj2tc1.jpeg", "post_main_text": "", "post_comments": []}, {"post_title": "unable to start studying", "post_url": "https://www.reddit.com/r/GetStudying/comments/1byt9ei/unable_to_start_studying/", "post_main_text": "i am unable to concentrate on studying , even though when i actually start studying i keep studying for a long time  , however when i stop studying i find starting to study again very difficult. I Love what i study but find myself distracted by dopamine rich activities. Can someone Help me with this problem ?   \n\n\nsorry english is not my first language ", "post_comments": []}, {"post_title": "hehehe", "post_url": "https://i.redd.it/xm313ydty0tc1.jpeg", "post_main_text": "", "post_comments": [{"comment_author": "Perpetual_aqalmand98", "comment_text": "Do or do not, there is no should"}]}, {"post_title": "Study habit", "post_url": "https://www.reddit.com/r/GetStudying/comments/1bytzfd/study_habit/", "post_main_text": "I'm 15 years old and I'm currently in the third year second grade of school. Everything is going fine, I've passed the minimum requirements to go to the next year.\n\nI'm currently trying to make a good habit (study, doing homework early, doing home chores, waking up early, doing hobby rather than playing on phone etc...). I'm now summarizing history lesson in google document. During that, I have a doubt whether do I need to study or not because every lessons feels so easy. I've seen a lot of people here who are struggling on studying and remembering everything. Not to be arrogant but every lesson that I learned, I just instantly forgot most of it but if I just read it before exams I remember exactly but then forgot it again. I've never feel the pressure of failing at exams.\n\nSo, do I have the need to study more? Like summarizing everything, making a flashcards (especially for french grammar) and reread every summarize that I've made?\n\nI feel weird about these text so I will also be open about mistakes and sentence error.", "post_comments": []}, {"post_title": "How important is the Redirection feature in web blockers or productivity apps?", "post_url": "/r/getdisciplined/comments/1bvv7ku/how_important_is_the_redirection_feature_in_web/", "post_main_text": "", "post_comments": []}, {"post_title": "You sleep all day?", "post_url": "https://v.redd.it/hfwhkpczc7tc1", "post_main_text": "", "post_comments": []}, {"post_title": "You and only you", "post_url": "https://i.redd.it/mw74xpytp0tc1.jpeg", "post_main_text": "", "post_comments": [{"comment_author": "psychedelicxx-", "comment_text": "or the wall"}, {"comment_author": "OtherwiseCoconut3275", "comment_text": "My brain? My Environment? Could be the room temperature is not suitable enough? Was it because my genetics? \"I need caffeine intake right now\" then proceeds watch more memes: \\*get overstimulated\\*, barely started the first subject -> get dull rather quick. \"I can't focus study!\" Curious if there certain ways to make myself one. \\*Creates a thread or topic about it in reddit and quora while explaining the situtation at absolute level of concentration. Gets hungry, eat a little snacks that turns binge watching whole day (energy drained), forgot what to study: Doesn't feel comfortable doing it while sitting, then sees friend online and hit them up, play some games. Something-something-something, decided to study again. \\*15 minutes later\\* Body starts leaning on, goes laying on bed to get \"comfy study position\" while understanding my field of interest (I doubt.) Peek at the time, it's 4AM \\*doesn't care\\* continue stare at it for good 5 minutes, and accidentally feel asleep. Perfect agenda.\n\nWhadda u gotta do is READ. First letter, then second letter, a word, whole sentences after that, get a good full chapter, continue to the next chapter. Completed a beginner book level, goes on higher one. Practice the previous subject, rinse it like no tomorrow, Repeat!\n\nTricks the brain to make the newly received information a mandatory. If you don't do it, the brain is gonna assume the information useless and tend to throw it off the wind. (quickly forgot, cause it hasn't really been stored in long-term memory).\n\nSorry I was just saying things to myself. Don't mind me. Anyway, keep grinding folks!"}]}, {"post_title": "What is best?", "post_url": "https://www.reddit.com/r/GetStudying/comments/1bylkk1/what_is_best/", "post_main_text": "I really need help to decide what is best for me. Okay so I got into \n1.McGIll    $56,000\n 2. KCL   £37000\n 3.University of Edinburgh £35000 \n4. York $35000\n | have mentioned the per year tuition fee. I applied for ba psy at york and bsc in others. I am still waiting for UCL but the problem is these colleges are highly expensive for international student. I have no option in my home country and I do need to select one from the above. York is cheaper as it has more scholarship opportunities but it's also not well known and i have heard mixed review about it. So should I choose an expensive school or an affordable one with low ranking. Also is it worth it to spend huge amount on psy undergrad degree.\nAlso which option is better in terms of career opportunities and money from the below 1.Psychology\n2.Information Technology \n3.Business management\n4.Political Sciences", "post_comments": [{"comment_author": "Unicorn-ups", "comment_text": "Choose somewhere u can get your bsc..especially if considering clinical work post grad"}]}, {"post_title": "About my study plan", "post_url": "https://www.reddit.com/r/GetStudying/comments/1bya8fz/about_my_study_plan/", "post_main_text": "Hi everyone!\nI have exams coming up in six weeks that could change my current degree, but I haven't been preparing adequately for them because they seem relatively easy. However, I now realize the importance of thorough preparation, especially since I need to balance studying for these exams with my current degree. I'm considering a plan to study for at least 14 hours every week, totaling 84 hours in six weeks, trying to dedicate 2 hours at least each day, but I'm unsure if this plan is effective. Additionally, I have exams in three different subjects: math, physics, and chemistry. Any advice on how to stay disciplined and organized while preparing for these exams, especially with the need to juggle multiple subjects alongside my current coursework and part-time job?\nI get panic attacks just thinking about it, or when I actually start studying I get overwhelmed and stop.\n\nThank you in advance!", "post_comments": [{"comment_author": "joecarrow24", "comment_text": "Hey there! It sounds like a solid plan, but don't forget to break down your study sessions into focused chunks with short breaks in between—this can enhance concentration and retention. For balancing multiple subjects, consider a rotating schedule to keep things fresh and prevent burnout. Also, integrating your subjects with your part-time job, if possible, could provide practical application and reinforcement. Remember, quality over quantity counts in studying. Take care of yourself during this time and good luck!"}, {"comment_author": "EuphoriaMeow", "comment_text": "Thank you so much for the advice!!!! I will try my best!"}, {"comment_author": "Leading-Access6382", "comment_text": "Not here to sell anything but would you consider paying a subscription fee for an app that does this for you?"}, {"comment_author": "EuphoriaMeow", "comment_text": "Is there an app?"}, {"comment_author": "Leading-Access6382", "comment_text": "To be honest, I’m in the process of developing an app that you can use to log into your student portal. Once you’ve done that, it can pull all your courses, assignments, classes and tests along with dates and due dates. Once it has that, you can also upload your textbook and lecture notes etc. Then it goes about planning a schedule for you to study, go to class, and do assignments. Would this help you as a student? Like would this be something you would subscribe to?"}, {"comment_author": "EuphoriaMeow", "comment_text": "It would be very useful tbh, probably can consider subscribing to it"}, {"comment_author": "Leading-Access6382", "comment_text": "I recently launched an app where you can upload your textbooks and the app makes a course for you along with summaries, flash cards and a podcast to listen to. I don’t know if I should abandon that app to create this study planning one. Which would be most valuable to you as a student if you had to choose between these 2?"}]}]