[{"post_title": "2 Million Members - Thank you from the mod team", "post_url": "https://www.reddit.com/r/GetStudying/comments/1bhdczf/2_million_members_thank_you_from_the_mod_team/", "post_main_text": "Hello college students, high-schoolers, educators, and everyone in between whose used r/GetStudying,\n\nThank you for 2 million members! This subreddit was created to help connect motivated learners, and help inspire those who were ready to achieve the best they academically could. While education can be a hindrance for some, this subreddit has helped so many people do great things, and we hope this subreddit helped contribute to academic success in some way.\n\nFrom the Moderation team, thank you so much. We never would've imagined having this many people in our subreddit, but we're thankful to everyone for all their help. Onto the next milestone!\n\nAs our subreddit continues to grow, we're looking for moderators to help with the community. Visit the link below to start the application process!\n\n[https://forms.gle/5V1LK8akj9Wfppve8](https://forms.gle/5V1LK8akj9Wfppve8)\n\n&#x200B;\n\nOnce again, thank you. We hope your school year is going well, and we wish you the best to come!--\n\nThe Moderation Team @ r/GetStudying", "post_comments": [{"comment_author": "Efficient-Energy3597", "comment_text": "I want to post but i cannot. The bot asks me if I'm a bot or not and after hitting post it just do not post! What is wrong with it"}]}, {"post_title": "Daily Accountability Thread - April 08, 2024", "post_url": "https://www.reddit.com/r/GetStudying/comments/1byqis5/daily_accountability_thread_april_08_2024/", "post_main_text": "Hi everyone! This is the Accountability Thread where people can list what they need or want to accomplish today and have everyone else help keep you accountable to do them. So, in general, a post will look like this:\n\nThings I have to get done today:\n\n~~1: Post Accountability Thread~~\n\nIf I had more to do that I had not completed I would list them and update this when these things were complete.\n\nAlso, if I saw someone doing something that I happen to be well-educated or have some sort of expertise in I can offer support or help on the topic/task.\n\nThe thread is a versatile one, use it in a way that helps you and others stay on task!\n\nHappy studying!", "post_comments": []}, {"post_title": "It's ok", "post_url": "https://i.redd.it/3b9xr9wsw0tc1.jpeg", "post_main_text": "", "post_comments": [{"comment_author": "MassiveInstruction65", "comment_text": "Did you recognize yourself?"}, {"comment_author": "Sea_Tortol", "comment_text": "I did just get my nails done so yes."}, {"comment_author": "Thick_Car_5603", "comment_text": "Happened last night"}, {"comment_author": "hizinbergs", "comment_text": "Me using chatgpt at 1159"}]}, {"post_title": "What should I do to make studying more fun? ", "post_url": "https://i.redd.it/cqgtovy5d7tc1.png", "post_main_text": "", "post_comments": [{"comment_author": "InternationalCarob24", "comment_text": "Why don't you try to have a good routine for a day with good exercise and then try to study by just making tough concept seem funny like Draw that diagram in a funny way or just make a simple joke about that concept which will help you retain it for longer period try it for few days and do some self discovery about what you find funny and Integrate it with your study \nAll the best :)"}, {"comment_author": "Wise_Crayon", "comment_text": "Good routine with exercise, you mean physical exercise as in running?"}, {"comment_author": "InkyPaletteGlow", "comment_text": "That's a really good advice. Thanks man"}, {"comment_author": "CplCocktopus", "comment_text": "Also snacks."}, {"comment_author": "InternationalCarob24", "comment_text": "Yup running or stepping or some high cardio to make those hormones work"}, {"comment_author": "InternationalCarob24", "comment_text": "Thanks mate Goodluck for future progress"}, {"comment_author": "InternationalCarob24", "comment_text": "Yup yummy snacks for healthy tummy"}, {"comment_author": "Wise_Crayon", "comment_text": "Thanks! Should I do so before or after studying?\n\nSince I usually get **Mental fatigue** after intense cognitive work, such as studying math or logical hard science, like Computer Science.\n\nEdit: It feels like my head is going to burst. As if it was too pressured inside. Eyes are tired, get sweaty, head hurts... Like wtf's going on? D:\n\nIt's not a cold nor an illness. It only happens when I sit down to study."}, {"comment_author": "InkyPaletteGlow", "comment_text": "You too"}, {"comment_author": "InternationalCarob24", "comment_text": "Wake up study for some time then when it's time for sunrise go outside and exercise take some photons from the sunlight and just do some stretching before going to bed at night for good sleep"}, {"comment_author": "araxitommolino", "comment_text": "Take longer breaks and reward yourself for small victories."}, {"comment_author": "Kupkakey2058", "comment_text": "RPG-fy it. Use apps like habitica and forest to make it like a game, if you study for long eventually you'll get used to it. Just make it like a super quest to kill a boss"}, {"comment_author": "InkyPaletteGlow", "comment_text": "Wow. Thanks, that's great advice"}, {"comment_author": "Kupkakey2058", "comment_text": "Yes it definitely is, I usually do that and it makes it more fun"}, {"comment_author": "KaizarHusaria", "comment_text": "Meth"}, {"comment_author": "InkyPaletteGlow", "comment_text": "Prop"}, {"comment_author": "InkyPaletteGlow", "comment_text": "(I think eth comes first I'm not sure)"}, {"comment_author": "B1ack_Sword", "comment_text": "yes, yes it does ;)"}, {"comment_author": "Hungry_Raspberry1708", "comment_text": "i don't know but people who have MacBooks look like they enjoy studying more..."}, {"comment_author": "InkyPaletteGlow", "comment_text": "(I'm broke)"}, {"comment_author": "Hungry_Raspberry1708", "comment_text": "same... :/"}, {"comment_author": "KIWIS213", "comment_text": "Ngl the used market is pretty good for MacBooks a couple hundred if you have it especially the MacBook airs"}, {"comment_author": "KIWIS213", "comment_text": "MacBooks with the M chips last a really long time got a lot of horse power but older ones are really good as well"}, {"comment_author": "InkyPaletteGlow", "comment_text": "Thanks for your advice"}, {"comment_author": "cree-cree69", "comment_text": "play music"}, {"comment_author": "InkyPaletteGlow", "comment_text": "Music distracts me unfortunately 😔"}, {"comment_author": "GirlWithSunglasses1", "comment_text": "Classical music is my go-to, I hate silence but I also hate getting distracted"}, {"comment_author": "NotFromYouTube", "comment_text": "For me I only get distracted when the music has vocals and I'll stupidly sing along. I switched over to instrumental covers, lofi or whatever music that does not contain vocals.\n\nDoes music in general distract you? If it does you could try podcasts since there is no music but it entertains you a little while studying."}, {"comment_author": "cree-cree69", "comment_text": "eat nlng po"}, {"comment_author": "Adam_WatcherintheRye", "comment_text": "Ambient Music or White Noise can be better. Lyrics and beats attract my attention but I find those don't have the same effect. Also, try things and write down what works cause damn, forgetting a key part of your toolbox for studying is disheartening. Cheers buddy."}, {"comment_author": "InkyPaletteGlow", "comment_text": "Yes it does, any kinda music distracts me"}, {"comment_author": "NotFromYouTube", "comment_text": "Ooo dats a shame. Another thing I do before my brain fog got super bad was watching a movie or series in the background. It can act as background noise to help you focus"}, {"comment_author": "asleepering", "comment_text": "Stop putting yourself down while doing it, \n\nThis may sound self-deprecating or far-fetched, but after helping my little sister with her high school homework one day, and noticing that every so often she'd go \"It's too hard\" \"I want to sleep\" \"I just can't do it\" \"I'm too stupid for this\", etc. I realized that although I don't always voice it out, I sometimes replay a variation of those sentences is my head, I'd just never really been aware of it up till that point, it was weird to realize that I constantly repeat things to myself without being aware of them, and how **obviously I wouldn't want to study when I spend that time making myself feel like crap**.\n\nStudying with friends afterwards I noticed how common this is, when we have trouble focusing or getting a question right, we just blame and degrade ourselves.\n\nThis little realization seriously helped me not hate studying as much, I recommend making a point of noticing how you treat yourself while you study. \n\nGood Luck!!"}, {"comment_author": "InkyPaletteGlow", "comment_text": "Wow. That's a really unique advice"}, {"comment_author": "cree-cree69", "comment_text": "have a foods"}, {"comment_author": "Nu-Deathcore-king", "comment_text": "Good luck on your quest!"}, {"comment_author": "_not_sb_", "comment_text": "My set up is so depressing compared to other ppls lol. This is a pretty motivating environment to study in ngl."}, {"comment_author": "mrxyz890", "comment_text": "you need just to start studying. 👍"}, {"comment_author": "InkyPaletteGlow", "comment_text": "I study a lot but now I want to make it fun"}, {"comment_author": "CatsInTrenchCoat", "comment_text": "I like to have some nice coloured highlighters and pens for taking notes, as well as different coloured sticky notes.\n\nI can colour coordinate information or mark notes in a textbook for referencing and it makes it a little more enjoyable and easy to keep track of things. I have post it notes shaped like bananas right now and they make me happy just looking at them:)"}, {"comment_author": "BranchAcademic2693", "comment_text": "Timer"}, {"comment_author": "Woraphon90", "comment_text": "Study and Relax together"}, {"comment_author": "Akshit_Chilkoti", "comment_text": "Study..."}, {"comment_author": "Equivalent-Note-7177", "comment_text": "Study maybe ?"}, {"comment_author": "Competitive-Net-7644", "comment_text": "Get distracted by YouTube always makes it more fun for me"}, {"comment_author": "babyvegetaboob", "comment_text": "Study with semi boner"}, {"comment_author": "itslevi-Osa", "comment_text": "Don’t study."}, {"comment_author": "WiseStrike5432", "comment_text": "Masturbate"}, {"comment_author": "ayush017", "comment_text": "wtf😭"}]}, {"post_title": "How to get rid of this?", "post_url": "https://i.redd.it/3e7ysq6ao7tc1.jpeg", "post_main_text": "", "post_comments": [{"comment_author": "ReadyMarketers", "comment_text": "It's that moment when you think you're the best, but then something goes wrong"}, {"comment_author": "kjono1", "comment_text": "If your teacher has done this, it's unprofessional and should be raised with the head of the department.\n\nOther than that, you will want to ask for feedback on where you went wrong and how to improve, as that's part of learning, messing it up, building an understanding of how we went wrong and trying again."}, {"comment_author": "Only-Paramedic-1430", "comment_text": "It’s worse when it happens more than once"}, {"comment_author": "emorris1948", "comment_text": "Btw the teacher is sometimes incorrect- just sit through airline initial training and be prepared to be nauseous due to the ignorance of some. Note: I wrote “some.”"}, {"comment_author": "Sea_Tortol", "comment_text": "Always hated the work shaming some teachers do. Like they should've made things clear from the get go if there was a problem"}, {"comment_author": "Chance_Role_5952", "comment_text": "Sounds rough"}, {"comment_author": "hizinbergs", "comment_text": "Teacher uses me as an example I never did work"}, {"comment_author": "Borgormmmmmm", "comment_text": "Replace the teacher. Consume.\n\nJokes aside honestly how to fix this depends on the class/subject. For example, for English definitely recommend someone to pointing out what you need to improve then be mindful of that when writing or revising. With my past experience as a tutor just by pointing where they can improve such as parts where they can cut out or reword significantly improved their writing overtime"}]}, {"post_title": "I've studied every day of this month so far! (Each stripe is an individual day)", "post_url": "https://i.redd.it/m0qnllgv09tc1.png", "post_main_text": "", "post_comments": [{"comment_author": "BoredDev133", "comment_text": "FYI I count when it's been at least 3 hours of focused work. Studying computer science."}, {"comment_author": "Nick_Zacker", "comment_text": "What concepts are you studying btw? I’m struggling a lot with dynamic programming"}, {"comment_author": "YeahthatWeirdkid", "comment_text": "What app is thia"}, {"comment_author": "BoredDev133", "comment_text": "[https://apps.apple.com/se/app/streaky-habit-tracking/id6446580223?l=en](https://apps.apple.com/se/app/streaky-habit-tracking/id6446580223?l=en)  \n[https://play.google.com/store/apps/details?id=com.streaky.habits&hl=en&gl=US](https://play.google.com/store/apps/details?id=com.streaky.habits&hl=en&gl=US)"}, {"comment_author": "p8tryk", "comment_text": "Just a side note I read study as stupid. 😐"}, {"comment_author": "Lady-Comfortable", "comment_text": "This is a great idea!"}]}, {"post_title": "heh", "post_url": "https://i.redd.it/gxqc0fvhk7tc1.jpeg", "post_main_text": "", "post_comments": [{"comment_author": "iplawschool", "comment_text": "let's hope it's so they can pay their teachers more so they don't quit... perhaps i'm too optimistic"}]}, {"post_title": "Pain", "post_url": "https://i.redd.it/vvblx3ape7tc1.jpeg", "post_main_text": "", "post_comments": []}, {"post_title": "Dopamine trap...", "post_url": "https://i.redd.it/1ly8kzoza9tc1.jpeg", "post_main_text": "", "post_comments": []}, {"post_title": "Distracting thing", "post_url": "https://i.redd.it/za96td1ug7tc1.jpeg", "post_main_text": "", "post_comments": [{"comment_author": "Turbulent-Mud2594", "comment_text": "😭"}]}, {"post_title": "unable to start studying", "post_url": "https://www.reddit.com/r/GetStudying/comments/1byt9ei/unable_to_start_studying/", "post_main_text": "i am unable to concentrate on studying , even though when i actually start studying i keep studying for a long time  , however when i stop studying i find starting to study again very difficult. I Love what i study but find myself distracted by dopamine rich activities. Can someone Help me with this problem ?   \n\n\nsorry english is not my first language ", "post_comments": [{"comment_author": "Whizzed_Textbooks", "comment_text": "Hey! Ok so super random but I have a study tool for students with ADHD. I think it would also help you as well as students with ADHD have a dopamine deficiency in their brain which can cause extreme procrastination to the point of task paralysis. The tool is called Kumo Study on the chrome store (totally free to use).\n\n  \nSo would I would recommend using the customisable Pomodoro Timer to chunk down your day into smaller pieces. So basically, I would start with 18mins work/7mins rest. If you feel like that is manageable and you have found some flow I would move onto sets of 45mins work/10mins rest. or 52mins work 8 mins of rest.\n\nIf you are really having a day that you feel like you can't get started - move up in really small increments. So:  \n-5mins work/5mins rest\n\n-6mins work/5mins rest\n\n-7mins work/5mins rest\n\nand work up until you get to a point that feels too long to stay focused. For example: you get to 21mins and it feels like you can't stay focused that long: work back down:  \n-21mins work - 5mins rest\n\n-20mins work - 5mins rest\n\n-19mins work - 5mins rest\n\nLet me know how you go!"}, {"comment_author": "Dr_Cristie", "comment_text": "Many students have this problem, it seems like getting started is the hardest part. Try getting a study buddy/productivity partner. Focusmate is a good service and they have up to a certain number of free sessions a week (I forget how many). You sign up for an appointment and are paired with another study buddy who is also looking for that extra oomph to get started. Knowing that someone is waiting for you is a great motivator.\n\nI also recommend the 15-minute rule. In the morning, sit down and promise yourself that you will put in just 15 minutes. 15 minutes is less than 1% of your day, I'm sure you can manage to give 1% of your day to studying. If, at the end of the 15 minutes you are still struggling then stop. You gave it a fair shake. Try again later that afternoon. But here's the key, when I say stop if you are still struggling, you need to stop. It only works if you keep the promise to stop and not try to force it. More times than not, you'll get into the flow but on those days that you don't then you do need to walk away.\n\nFinally, be sure to make your study plan concrete and measurable. Tasks like \"read the first two sections of Chapter 3\" or \"complete one of the three practice questions.\" One of the reasons your brain doesn't want to start studying is because \"I'm going to study\" is a huge, uncertain concept. It feels never-ending. There's a nice bit of dopamine you can get from completing a task but \"studying\" could have no end. Turn your study plan into a series of checklists to make it feel more manageable and give you more dopamine."}]}, {"post_title": "the overwhelming feeling and needing to be great, is this normal? (i just want honors bro)", "post_url": "https://www.reddit.com/r/GetStudying/comments/1bywt3j/the_overwhelming_feeling_and_needing_to_be_great/", "post_main_text": "hi there i'm in 10th grade right now, i live in the philippines and i'm generally considered by most people as a good student, i study, study, study. sometimes i don't even have enough time to spend with my friends. my mum has really high standards since she depends on me to be the breadwinner by the time i'm like 18 which sucks cause now i have this overwhelming bearing weight on my shoulder to do good, be smart, act smart, make good decisions all the time. it's my second year in this new school. when i was in 9th grade i got HORRIBLE HORRIBLEEE grades i mean it was bad, obviously i was adjusting due to the changes from online to face to face campus but still. now i'm in 10th grade and going into 4th quarter, i just got my 3rd quarter grades and i got a 89.30 for an average. it fucking sucks, i worked my ass off and now my 3rd quarter grade is lower than my first quarter grade 89.70, what even sucks is i promised my mum that i'd get honors the whole year, now i just broke it. i got honors for the 1st and 2nd quarter, i know there's still time for the 4th quarter for me to improve but i don't know it just sucks, i haven't told my mum yet i don't want her to yell at me. need advice lowkey like i genuinely can't handle this right now", "post_comments": [{"comment_author": "MysticMegan1", "comment_text": "Focus on your own growth and don't let others' expectations define you - you're more than just a student."}]}, {"post_title": "How to scope an online class?", "post_url": "https://www.reddit.com/r/GetStudying/comments/1byxbdk/how_to_scope_an_online_class/", "post_main_text": "I've been doing online classes for some time now.  I feel like I'm struggling when it comes to learning.  \n\n  \nIs there a better way to scope the class or sections of the class before starting them?  Or can someone offer specific pointers?\n\n  \nthanks", "post_comments": []}, {"post_title": "If you’re stuck should you move on or work through it? Exam Studies", "post_url": "https://www.reddit.com/r/GetStudying/comments/1byqdwg/if_youre_stuck_should_you_move_on_or_work_through/", "post_main_text": "Hii so let’s say u have 10-12 days to Study for a big exam. The exam is 4 different sections. You’ve been trying to work through an important section of the material but you’re starting to feel stuck. It’s so dense your eyes feel like they’re crossing. You have a limited amount of time, truly u should’ve started studying like 2 months ago. You’ve already been on that one section for like 4 days longer than planned.\n\n\nShould you \nA) force yourself to work through it no matter what or \n\n B) move on to the rest of the material and come back after you’ve covered everything else? \n", "post_comments": [{"comment_author": "kung-phucious", "comment_text": "Move on if the material is all weighted the same on the exam."}, {"comment_author": "Revolutionary-Sky758", "comment_text": "This is a challenging situation, and there's no one-size-fits-all answer. However, here are a few factors to consider:\r  \n\r  \n1. Assess your level of understanding:\r  \n   \\- If you're truly stuck and feel like you're not making any meaningful progress on that section, despite your efforts, it may be more productive to move on for now.\r  \n   \\- However, if you feel like you're on the cusp of understanding and just need a little more time and focus, it could be worth persisting.\r  \n\r  \n2. Consider the weight of the sections:\r  \n   \\- Evaluate how important that particular section is relative to the others. If it's a crucial foundational piece, it may be worth prioritizing it, even if it means sacrificing some time in other areas.\r  \n   \\- On the other hand, if the section is less heavily weighted, it may make sense to move on and come back to it later.\r  \n\r  \n3. Manage your time efficiently:\r  \n   \\- With only 10-12 days left, you'll need to be very strategic about how you allocate your time.\r  \n   \\- If you've already spent 4 days longer than planned on that one section, it may be better to move on and cover the remaining material, rather than risk falling behind on the other sections.\r  \n\r  \n4. Take breaks and revisit:\r  \n   \\- If you decide to move on, you could still come back to the challenging section later, after you've covered the other material.\r  \n   \\- Taking a break and returning to it with fresh eyes might help you break through the mental block.\r  \n\r  \nUltimately, it's a balancing act. My recommendation would be to:\r  \n\r  \nA) Spend a bit more time trying to understand the challenging section, but set a clear time limit (e.g., another 1-2 hours).\r  \nB) If you still feel stuck, move on to the other sections, making a note to come back to the difficult section later.\r  \nC) Regularly review your progress and consider adjusting your plan as needed.\r  \n\r  \nThe key is to be flexible, focus on the sections that will have the greatest impact, and don't get too bogged down in one area at the expense of the others. With strategic time management and a willingness to adapt, you can maximize your chances of success on the exam.\n\nr/Homeworkhelpteam\n\n[WritersABC.com](https://WritersABC.com)"}, {"comment_author": "Honest_Zombie8560", "comment_text": "Thank you so much for the detailed advice 🩷"}, {"comment_author": "Revolutionary-Sky758", "comment_text": "You are welcome Honest\\_"}]}, {"post_title": "The Benefits of Of Public Speaking Training Holiday Workshops", "post_url": "https://www.reddit.com/r/GetStudying/comments/1bywq4z/the_benefits_of_of_public_speaking_training/", "post_main_text": "Whether you are looking to stir the child’s enthusiasm for learning or wanting to build the basic life-long skills in them, Talent Club Australia- best [public speaking training workshop](https://www.talentclubaus.com.au/holiday-programs/) in Australia is the solution. No need to look anywhere else; our holiday workshops are here for you to cover it all, yielding communication skills, an influx of confidence, and creativity. This is how your child can benefit from our workshops:  \n  \nIntroduction to Effective Communication  \n  \n  \nWorkshop attendance is highly recommended as it serves as a very useful introductory course before your child's participation in our weekly classes, which provide them with a wide range of strategies that will help them become better communicators. Relying on the involvement of activities, workshops, and experiential sessions, the kids will acquire the knowledge to speak in public in both academic and real-life environments.  \n  \n  \nElevate Public Speaking Skills  \n  \n  \nBy targeting audience interaction, our workshops have an explicit notion of hoisting your own child's public speaking skills to a higher level. From a persuasive speech for delivery or a project presentation to debating, students will know how to maintain their audience's attention, thus delivering their message clearly and confidently.  \n  \n  \nAdaptability in Public Speaking  \n  \n  \nIn modern times, where change is the name of the game, conventional public speaking norms are becoming a thing of the past and paving the way for innovative and authentic means of communication. We tailored our workshops to be exactly related to this matter, in which your child will learn the skills of how to add his unique style to his speaking while keeping his success in the points he wants to make in every presentation.  \n  \n  \nIgnite Intellectual Curiosity  \n  \n  \nThe public speaking training workshops we plan, will allow your child to enrich their knowledge by fuelling curiosity and exploring novel things. Thus, we do not only stimulate them to explore the well-expressed ideas of others but to synthesize their thinking and to conceptualize the content of the expression as well. As a result, the youngsters become the engines of change; critical thinking and reasoning become the skills that they gradually master.  \n  \n  \nPersonalized Mentorship  \n  \n  \nAt our workshops, students will learn to convey their message as the audience can become a great self-guide and also get acquainted with their particular advantages. Our experienced coaches will be working collaboratively with them, assessing their weaknesses, and providing exclusive guidance every step of the way.  \n  \n  \nSpark Creative Passion  \n  \n  \nApart from a speech, we also pull out the online creative writing workshop of your child and let them explore themselves and what they like. With online creative writing classes and through interactive activities, the students will be able to discover their own beautiful voice and speaking style, which is going to help boost their confidence for the future.  \n  \n  \nConclusion  \n  \n  \nDeveloping your child's communication skills and encouraging his creativity is a gift you can present that cannot be doubled. Our holiday workshops provide a vigorous and engaging learning platform that equips children with the ability to articulate well, reason, and eventually manifest the totality of their greatness. Through the support and knowledge of our seasoned mentors, your child can boost their confidence and take away a lot of important lessons for the future.  \n  \n  \n\n\n ", "post_comments": []}, {"post_title": "Pleasure", "post_url": "https://i.redd.it/i15xyuf4v0tc1.jpeg", "post_main_text": "", "post_comments": [{"comment_author": "Ok-Foundation-7447", "comment_text": "Well, that's my job-"}, {"comment_author": "InformationFair4396", "comment_text": "Tbh I miss Math."}, {"comment_author": "pageyboy335", "comment_text": "Got to college and do a degree in mathematics if you think that would be better."}, {"comment_author": "InformationFair4396", "comment_text": "Who will earn for me then lol"}, {"comment_author": "pageyboy335", "comment_text": "I don't get what you mean, but if you are meaning who would pay you, you could technically get a career from a degree in mathematics. Till then work part time. All hypothetical, just saying that if you actually wanted to do math again, you could, and it would benefit you too."}, {"comment_author": "WittyAvocadoToast", "comment_text": "I wish math was the hard part in adult life."}, {"comment_author": "SinisterSynth", "comment_text": "Its so interesting seeing someone can be passionately in love with maths and someone else dread it with all his might. Its in times like this that you realise everyone is different (this post was made by the math hating propaganda)"}, {"comment_author": "madump5427", "comment_text": "now see it depends on what kind of math homework...\n\nif it's elementary math, sign me the fuck up. but if it's beyond that, just let me suffer in my shit life thanks!"}, {"comment_author": "superstarfighter", "comment_text": "I'd take that. Math gives me flow."}, {"comment_author": "444Ilovecats444", "comment_text": "I can’t believe i am saying this but adult life is easier than math"}, {"comment_author": "quantumsenigma", "comment_text": "i’d rather be shot tbh"}, {"comment_author": "itslevi-Osa", "comment_text": "Taylor really woke up and chose violence lmao 💀"}, {"comment_author": "BanOfSpeedrun", "comment_text": "I do adulting stuff AND math homework to prepare for college...."}, {"comment_author": "caet_", "comment_text": "that’s why i wanna grow up"}, {"comment_author": "Silent_Fern", "comment_text": "I’ve done more math as an adult than I ever did as a child"}, {"comment_author": "pchulbul619", "comment_text": "Lol, we have to do adv statistics and spreadsheets modeling in our jobs as well."}, {"comment_author": "popthepillies", "comment_text": "I miss Calculus homework. Integrals are fun to do mindlessly"}, {"comment_author": "haikusbot", "comment_text": "*I miss Calculus*\n\n*Homework. Integrals are fun*\n\n*To do mindlessly*\n\n\\- popthepillies\n\n---\n\n^(I detect haikus. And sometimes, successfully.) ^[Learn&#32;more&#32;about&#32;me.](https://www.reddit.com/r/haikusbot/)\n\n^(Opt out of replies: \"haikusbot opt out\" | Delete my comment: \"haikusbot delete\")"}, {"comment_author": "Ignacio_dure", "comment_text": "Worst time in my life i hate maths but i love programming \nRare life style"}]}, {"post_title": "How to motivate yourself to study when severely depressed? ", "post_url": "https://www.reddit.com/r/GetStudying/comments/1bygqf0/how_to_motivate_yourself_to_study_when_severely/", "post_main_text": "Exams wait for nobody and they definitely don’t care that nothing seems real to me anymore. \nWhen I try to study I just end up staring blankly at a screen, or listening but never remembering anything. \n\nPlease guys I’m desperate here, I used to be able to study ten hours a day every day and now I’m lucky to get an hour in a week. \n\nHelp. ", "post_comments": [{"comment_author": "Downtown_Gas5744", "comment_text": "I’m so sorry you feel that way. I’m not sure my tips will be helpful but I’m gonna write them anyways because it’s better than not. I’m just gonna tell you how I manage when feeling down. It’s not depression so I can’t imagine how you’re feeling. When I don’t feel like studying I try to remind myself of why I study. And when I feel down studying helps distracting me from my emotions. Now that’s very different from depression. I would suggest you try to get better by seeking professional help. There is nothing more important than your mental health. If that doesn’t work then be nicer to yourself. You probably expect much of yourself as you mentioned that you could go on for 10 hours. Take it one step at a time. Set mini goals every day. Tell yourself today I’m gonna study these many minutes (yes start at minutes). And then you can gradually increase it because you will for 1. Feel better through achieving goals 2. Slowly but surely be able to study more and more and regain your old habit. And it’s completely normal and okay if you one day don’t achieve what you expected to. Don’t be too hard on yourself. I hope and pray that it will get better. Take care of yourself!!"}, {"comment_author": "Matrixblackhole", "comment_text": " 10 hours a day isnt great tbh (personally I can only do maybe a maximum 3 hours on a good day). As someone who's dyslexic I'm pretty sure it's not an efficient/effective method to do 5+ hours without breaks.\n\nAnyhow, what I do is make flashcards on Quizlet and then move them over to Knowt (what quizlet used to be before they started asking you pay for stuff). Although I do prefer flashcard mode on quizlet, but I prefer the 'learn mode' on Knowt which is quite good for active recall.\n\nThen if I'm still unsure on a topic I see if there's anything on youtube / or any academic papers which explain it better, and make a physical A3 /A4 posters as it helps to map things out.\n\nIf you have any practice papers or example questions, definitely do those and see if you can answer those questions in mock exam conditions in your room just to practice.\n\nGood luck!"}, {"comment_author": "jvmpfrog", "comment_text": "This is something I struggled with for a long time. What I did to help me is download the app Forest, a pomodoro timer app that will block you from accessing apps on your phone that will not help you with your studies. After each successful study session, you get a tree!! So, you slowly grow a beautiful forest, and you can unlock new trees the more you study. This small little reward system made a huge difference for me.\n\n&#x200B;\n\nAdditionally, I will do only 1-2 assignments per day so I don't get burnt out. I started studying on FaceTime with someone so that I am held accountable, and someone sees that I'm working. Then, at the end of our session we discuss what we accomplished, and how that compared to our daily goal/plan. This way, you're able to see how much you can accomplish without getting burnt out and set tangible goals for yourself moving forward. If you don't have anyone to study with, I highly recommend just going on YouTube and putting on a video of someone studying ([pike channel](https://www.youtube.com/@pikechannel) is my favorite!) just to get the ambiance."}, {"comment_author": "Revolutionary-Sky758", "comment_text": "I'm really sorry you're struggling with severe depression and finding it so difficult to motivate yourself to study. That must be incredibly challenging and draining. \r  \n\r  \n1. Seek Professional Support:\r  \n   \\- Reach out to a counselor, therapist, or your university's mental health services. Getting professional help to manage your depression should be the top priority.\r  \n   \\- Medication and therapy can make a significant difference in restoring your energy and focus.\r  \n\r  \n2. Break Tasks into Smaller Steps:\r  \n   \\- When even an hour of studying feels impossible, try breaking it down into 10-15 minute chunks. Celebrate small wins.\r  \n   \\- Focus on just getting started, even for a brief period. The momentum can build from there.\r  \n\r  \n3. Incorporate Self-Care:\r  \n   \\- Make sure you're getting enough sleep, nutrition, and exercise, as these can greatly impact your mental state.\r  \n   \\- Build in relaxation activities, like meditation, journaling, or connecting with supportive friends.\r  \n\r  \n4. Adjust Expectations:\r  \n   \\- Don't beat yourself up for not being able to study as much as you used to. Recognize that depression has impacted your abilities.\r  \n   \\- Set more realistic, compassionate study goals that won't overwhelm you.\r  \n\r  \n5. Seek Academic Accommodations:\r  \n   \\- Reach out to your professors or university's disability services to inquire about potential accommodations, such as extended deadlines or alternative assignment formats.\r  \n   \\- This can help reduce stress and provide you with the support you need.\r  \n\r  \nAll the Best\n\nr/Homeworkhelpteam\n\n[WritersABC.com](https://WritersABC.com)"}, {"comment_author": "Dull_Main_7342", "comment_text": "Improve your mental health by playing sports, showering with cold water, going out with friends, going to a psychiatrist, writing down everything that makes you sad on paper, take care of yourself, do not force yourself to study for ten hours, but study what you have to study."}, {"comment_author": "mendyourgarden", "comment_text": "Take a step back, relax, and most importantly enjoy the process. Break concepts into small chunks and absorb it at your own pace.\nIf you pressure yourself to ace at any cost, you'll end up demotivated and studying won't be fun anymore."}, {"comment_author": "FluffyBee16", "comment_text": "I totally feel for you! You’re not alone. I felt the same way in school. I am not sure if it will help, but I reframed my thinking about studying. Instead of thinking of it as school, I started thinking of it as my job or my business. I’m the type of person that will be able to work my job fine, but when it comes to taking care of myself, sometimes I’m not able to when I’m depressed. I would logically reason that I’m being paid for studying so I gotta do it. So being able to see it as my job (because literally my future income depends on it) helped me when I was feeling unmotivated to help myself. Definitely try to destress and do fun things on your study breaks to make it enjoyable. All the best to you and don’t give up on yourself."}, {"comment_author": "Sarangi--", "comment_text": "Following this! I know how you feel. Thanks for posting op. Glad I am not alone."}, {"comment_author": "hellokitty9834", "comment_text": "Wishing you the very best. I’ve been where you been and it’s so hard. I don’t know your medical situation but I know therapy and medication tremendously helps me cope. It doesn’t fix everything but helps me stay at a reasonable baseline. \n\nLittle things that help me with depression:\n\n- keep depression snacks in your room or backpack. So helpful for days where it’s hard to do self care or you feel like you’re running behind. I’d recommend fiber snacks or fruit snacks; something easy on your stomach. \n\n- Pomodoro apps or videos on YouTube help tremendously with getting stuff done when I’m in a rut. I’ve felt so burnt out with grad school and have seen my motivation spiral and pomodoro have saved me. I also recommend the Study Bunny app on iPhone. I have a pomodoro app on my laptop where it keeps track of the minutes I spent studying (and I like it just bc I like tracking stuff). \n\n- get out of the house to study. Go to a place with sunshine and either take snacks or make sure it’s a place you can buy something to eat or drink you like. Even if you only study for 30 minutes or 4 hours. Every bit counts! It’s very unhelpful to think in an all or nothing mindset\n\n- do something nice for yourself, something small. It’s not always easy but on some days where I feel like absolute sh-t I will carve out time to do my eyeshadow and make my hair look decent. It’s a great opportunity to express my creativity, practice mindfulness and enjoy the time using different colors. Doing this helps me feel a little bit more enthused and confident about the day, even if I know I’m still not feeling 100%. \n\n- call or text someone close to you, a safe person, you know you can confide in about your symptoms. Again, I don’t know you personally, but I know for me being able to be honest with someone and not mask helps me feel less alone and like I don’t have to be so hard on myself. I used to have a really great friend who used to let me go over to her house anytime to get work done or to have a nice meal whenever my anxiety felt like too much. \n\nYou’re welcome to DM me if I can help with anything else. I’m in graduate school training to be a psychologist. I’m not practicing (nor giving medical advice nor therapy to anyone online) but I also have lived experience with depression and anxiety in graduate school and if I can help anyone feel less alone I’m so happy to help!"}, {"comment_author": "Whizzed_Textbooks", "comment_text": "Hey! I am so sorry you are going through this. Super random, but I have a study tool for students with ADHD that might actually help you as well. Students with ADHD have a dopamine deficiency in their brain which makes it really hard for them to focus and they can get really easily overwhelmed and stressed.  \nIt is called Kumo Study and you can find it on the chrome store. (it is totally free) - if you can't find it just let me know and I will dm you.\n\n  \nWhat I would recommend for you is breaking your study day into smaller chunks based just off what you can handle that day. My tool has a customisable study timer and basically what I would recommend is doing: 5x8mins on 4 minutes off until you get some flow. If you feel like you can do longer than that maybe try 45mins of work/10mins of rest or 52mins work/8mins rest.\n\nSometimes if I am not sure how I am feeling, I will do 5mins work/5mins rest - 6mins work/5mins rest - 7mins work/5mins of rest until I get to a time that feels too long for me and then I work back down. Let's say I get to 13mins and it feels too long, I will then work back down with 13mins work/5mins rest - 12mins work/5mins rest -  11mins work, 5mins rest etc etc\n\nI am so sorry you are having such difficulty with study! You are such a trooper though and good on you for going for some advice!\n\nGoodluck!"}, {"comment_author": "Ok-Marionberry-9101", "comment_text": "dreams don’t work unless you do / do something today that your future self will be thankful for. \nI genuinely repeat these two quotes every single time I feel like not studying or anxious. Even when I was depressed 5 years ago I constantly repeated these two quotes to myself and the feeling afterwards is amazing. Hope you are going to get through this difficult time and remember SUN ALWAYS COMES AFTER THE RAIN"}, {"comment_author": "deludedkermit", "comment_text": "Step 1, just get up and go to your study table. You'll feel lighter.\nStep 2: open your book/laptop\nStep 3: start with a short problem/lesson.\n\nIt's often the small steps that will help you achieve anything."}]}, {"post_title": "Off to lala land again...", "post_url": "https://i.redd.it/e4ehrw4vj2tc1.jpeg", "post_main_text": "", "post_comments": []}, {"post_title": "Unmasking Your Potential: Navigating Imposter Syndrome in College for a Healthy Mind", "post_url": "/r/911papers_homworkhelp/comments/1byxbxe/unmasking_your_potential_navigating_imposter/", "post_main_text": "", "post_comments": []}, {"post_title": "Study habit", "post_url": "https://www.reddit.com/r/GetStudying/comments/1bytzfd/study_habit/", "post_main_text": "I'm 15 years old and I'm currently in the third year second grade of school. Everything is going fine, I've passed the minimum requirements to go to the next year.\n\nI'm currently trying to make a good habit (study, doing homework early, doing home chores, waking up early, doing hobby rather than playing on phone etc...). I'm now summarizing history lesson in google document. During that, I have a doubt whether do I need to study or not because every lessons feels so easy. I've seen a lot of people here who are struggling on studying and remembering everything. Not to be arrogant but every lesson that I learned, I just instantly forgot most of it but if I just read it before exams I remember exactly but then forgot it again. I've never feel the pressure of failing at exams.\n\nSo, do I have the need to study more? Like summarizing everything, making a flashcards (especially for french grammar) and reread every summarize that I've made?\n\nI feel weird about these text so I will also be open about mistakes and sentence error.", "post_comments": [{"comment_author": "kjono1", "comment_text": "Don't be fooled by good explanations. Understanding what the teacher said and understanding the material are two different things.\n\nIf I asked you to explain the topics you will be questioned on, can you answer them yourself, without thinking about what it was the teacher said about them.\n\nIf you don't study, you won't know and the exam is not the time to find out that you should have studied."}, {"comment_author": "HNGabriel", "comment_text": "👍"}, {"comment_author": "mustafizn73", "comment_text": "hey there! It's great that you're finding school manageable—that's a sign of your potential. But yes, developing good study habits now can set you up for success later. It's not just about passing, but understanding the material deeply and retaining it. Consider studying a little each day, even if the material seems easy; this helps with long-term retention. Summaries and flashcards (especially for subjects like French grammar) are fantastic tools. Keep it up, and always stay curious!"}, {"comment_author": "HNGabriel", "comment_text": "Thanks"}, {"comment_author": "Additional-Money3588", "comment_text": "starting good study habits now will be great for your future, especially as you're not finding it difficult atm, because later on the work will get more difficult and more 'dense'."}]}]