[{"post_title": "2 Million Members - Thank you from the mod team", "post_url": "https://www.reddit.com/r/GetStudying/comments/1bhdczf/2_million_members_thank_you_from_the_mod_team/", "post_comments": [{"comment_text": "Hello college students, high-schoolers, educators, and everyone in between whose used r/GetStudying,\n\nThank you for 2 million members! This subreddit was created to help connect motivated learners, and help inspire those who were ready to achieve the best they academically could. While education can be a hindrance for some, this subreddit has helped so many people do great things, and we hope this subreddit helped contribute to academic success in some way.\n\nFrom the Moderation team, thank you so much. We never would've imagined having this many people in our subreddit, but we're thankful to everyone for all their help. Onto the next milestone!\n\nAs our subreddit continues to grow, we're looking for moderators to help with the community. Visit the link below to start the application process!\n\n[https://forms.gle/5V1LK8akj9Wfppve8](https://forms.gle/5V1LK8akj9Wfppve8)\n\n&#x200B;\n\nOnce again, thank you. We hope your school year is going well, and we wish you the best to come!--\n\nThe Moderation Team @ r/GetStudying", "reply_text": "I want to post but i cannot. The bot asks me if I'm a bot or not and after hitting post it just do not post! What is wrong with it"}]}, {"post_title": "How do you study when you don't feel like it? ", "post_url": "https://i.redd.it/elzzqvfgsutc1.png", "post_comments": [{"comment_text": "*image is copied ", "reply_text": "I punish myself ... Ik im extreme"}, {"comment_text": "*image is copied ", "reply_text": "I don't really know, i just get on with it when i do or don't feel like doing it because i need to. But i love studying"}, {"comment_text": "*image is copied ", "reply_text": "The key is to trick your brain and build momentum with small, achievable steps. Here are some tips:\n\n* **The 5-Minute Rule:** Tell yourself you'll just study for 5 minutes. Often, those 5 minutes turn into a productive study session.\n* **Break it Down:** Large tasks can be overwhelming. Chunk your studying into smaller, more manageable sections. Focus on one concept at a time.\n* **Change Your Environment:** Try studying in a different location like a library, coffee shop, or even outside (weather permitting!).\n* **Find a Study Buddy:** Studying with a friend or classmate can keep you accountable and make the process more engaging.\n\nYou can also join our community at [](https://www.reddit.com/r/911papers_homworkhelp/) for more tips and also to connect with other students who share similar academic experiences.\n\n[911papers.com](http://911papers.com/)"}, {"comment_text": "*image is copied ", "reply_text": "I often use a 30-minutes rule to overcome lack of motivation. I start a task and give myself a chance to continue a bit say myself going through 30 min. Then I increase the time that I give. This technique helps me to focus and get things done."}]}, {"post_title": "I am done running . Let's get this done ", "post_url": "https://www.reddit.com/r/GetStudying/comments/1c1bp9c/i_am_done_running_lets_get_this_done/", "post_comments": [{"comment_text": "Long Story short - wasted last 6-7 years of my life being addicted to smartphones (internet in general) , being lazy , just procrastinating even in simplest of tasks . Completely disregarded studying and anything valuable. Due to this damaged my future prospects a lot and my overall health but now it's enough man . I am done running . If I continue on this path I will soon mess up very big time . May even die early due to my obesity and other health problems.  But enough is enough man . I got my issues . I know the solutions . Now I just have to do it . I have known the solutions for a very long time but never made sincere efforts but now the time has come . I know this doesn't make any sense to be highly motivated. Maybe this is just an emotional post . But f**k it man , we ball . I hate myself and now it's time to change this situation. I know even if I give myself 1 year properly I can recover from a lot of damage I have done to myself over the years . It will be tough but it will be worth it . Have a tough exam coming up in 4 months (usually requires 8 months of prep but as you can guess I procrastinated and will face consequences now ) , I will try to go beast mode if I can . I may fail again but I have to get better even if it's by 10% because I have been at 0% for past 6-7 years . I am just stuck in my mind all the time . Now it's time to get this done . Good luck everyone with their tasks . We gonna get this done . ", "reply_text": "Rooting for you! Please keep us posted on how you make out: so that we can encourage you along the way & celebrate every win with you."}]}, {"post_title": "How do I study?", "post_url": "https://www.reddit.com/r/GetStudying/comments/1c1aicj/how_do_i_study/", "post_comments": [{"comment_text": "Hello everybody, I’m pretty sure there’s been plenty of posts similar to this before but even then please listen. I genuinely don’t know how to study. Throughout highschool I got pretty good grades without studying a day and now that I’m going to a good school I know I can’t just spend my days doing anything but studying. How should I do it? What should I do? How should I prepare for university classes? Thank you for lending me some of your time.", "reply_text": "PLANNING \n•know the syllabus well and categories them into priority order \n•pickup only one good resource and stick to it\n•calculte the time for each subject and each chapters and block the time\n•Read pyq before attending the lecture \n•Along with studying the next chapter start solving previous chapters pyq and mark them on book\nSTUDYING STRUCTURE \n•make notes on your own by watching lecture which are readable \n•start visualise the concept and ask why to everything if you have time\n•in shortage of time try to grab all the basic things and understand imp concepts very well\n•Make flowchart for better understanding \nEXECUTION \n•Be regular solve questions from the topics the day you studied itself \n•On weekends try to revise everything you have studied on weekdays and see pyq for once \nREVISING \n•Have an idea of the time required to revise one complete chapter \n•Revise the diff concepts first\n•Revise notes+underline \n\nIN THE END\n• take a blank paper and make the short notes for your last min revision \nDo it again without looking into anything \n\nOnce I wrote these things which works for me personally so you can try this \nGood luck to you ✨"}, {"comment_text": "Hello everybody, I’m pretty sure there’s been plenty of posts similar to this before but even then please listen. I genuinely don’t know how to study. Throughout highschool I got pretty good grades without studying a day and now that I’m going to a good school I know I can’t just spend my days doing anything but studying. How should I do it? What should I do? How should I prepare for university classes? Thank you for lending me some of your time.", "reply_text": "To prepare for university classes, start by creating a structured study schedule that allocates specific times for reviewing class materials, and adopt active learning techniques such as summarizing information, self-testing, and participating in study groups. It's crucial to find a study method that works for you, remain consistent, and adjust your strategies based on what enhances your understanding and retention of the material."}]}, {"post_title": "PLEASE HELP", "post_url": "https://i.redd.it/sg27oce8trtc1.jpeg", "post_comments": [{"comment_text": "can someone know how to solve this(rush/cramming)", "reply_text": "For the quartiles, first arrange the data points from smallest to largest. Find your median, that’s Q2. Q1 is the median of everything below Q2, and Q3 is the median of everything above Q2. Q3-Q1 should be equal to Q2."}, {"comment_text": "can someone know how to solve this(rush/cramming)", "reply_text": "I. What's a fuckin' math problem. Shoot yourself pls"}]}, {"post_title": "I can’t seem to be able to achieve my goals", "post_url": "https://www.reddit.com/r/GetStudying/comments/1c1bim3/i_cant_seem_to_be_able_to_achieve_my_goals/", "post_comments": [{"comment_text": "Hey, first year physiotherapy student. For our course we have to study systematic anatomy, and I currently find it very difficult and just did a test, which I’m praying to God I passed (x=>50%). I also have a second anatomy test this Saturday. I hate this. I hate it all. I’m a first year and I feel like I’m being overwhelmed with content, and I don’t know how I’ll survive the next three years. Back in high school, I was competently academic and got good enough scores to get into top 2% of my state without really studying much, even in finals. I did 3-4 hours of study for the anatomy test and I’m unsure if I pass or not. I’m barely getting by in my classes and sudden drop in my academic progress is really coming as a shock to me. I don’t know if I can keep doing this anymore please any tips and suggestions are recommended. I have a pretty weak mental state and it feels like I’m digging myself into a pit", "reply_text": "It seems like they made US high school purposely too easy so students can't adapt in college. You're going to have to learn to put more time into study. So when you are learning material it's normal to forget things the first time you are introduced to them. Repetition exposure helps to deeply ingrain memories. \n\nI would try going to a place to study a few hours a day: library, cafe, park, whichever you prefer. Do a quick overview of things you've learned, plus whatever homework you have. Then you can focus on really reviewing material more deeply. Remember you don't have to learn everything the first time, just introducing yourself and exposing yourself to it helps if you keep it up almost every day. \n\nIf it's something like anatomy: the first step would be just reading the names and locations, next session you could do more review and maybe test your memory of locations. Remember it doesn't have to be perfect. Then about 15 minutes later try again, then again. Over time you will see you are making progress. Hope this helps."}]}, {"post_title": "How to brute memorize something?", "post_url": "https://www.reddit.com/r/GetStudying/comments/1c13bx4/how_to_brute_memorize_something/", "post_comments": [{"comment_text": "I have a test coming up that the teacher just told us about and we have to memorize all the rules for volleyball (I don't know why) and I tried using anki and other methods but I don't think they're going to work. Im thinking I just brute memorize it because its only 25 rules but how should I go about doing this?", "reply_text": "write it out man. you will probably get it under an hour (if you are a fast writer). but write it out at least 20 times."}, {"comment_text": "I have a test coming up that the teacher just told us about and we have to memorize all the rules for volleyball (I don't know why) and I tried using anki and other methods but I don't think they're going to work. Im thinking I just brute memorize it because its only 25 rules but how should I go about doing this?", "reply_text": "How much time do u have? \n\nFirstly, I’d try to apply them irl, read the rules and try to at least see a game of volley for instance. You’re more likely remember it if you see it in practice.\n\nThen, when you’re familiar enough with the content, move to Anki to not forget"}, {"comment_text": "I have a test coming up that the teacher just told us about and we have to memorize all the rules for volleyball (I don't know why) and I tried using anki and other methods but I don't think they're going to work. Im thinking I just brute memorize it because its only 25 rules but how should I go about doing this?", "reply_text": "A simple mnemonics trick I used: \"assign\" each rule to stuff in your room, books, tables, pictures, etc. When you conjure an image of that thing in your mind, you will also remember the rule."}]}, {"post_title": "How do you guys study for an exam that you'll 100% pass the course in", "post_url": "https://www.reddit.com/r/GetStudying/comments/1c11ts9/how_do_you_guys_study_for_an_exam_that_youll_100/", "post_comments": [{"comment_text": "Hi all,\n\nThis is my first time here so if this is a common question I apologize. I'm currently only doing one course before finishing my diploma. This is a course I'm going into the final exam for with over a 90% with. so even with a 50% final I only need to get like a 30% on the exam to get a passing grade in the course. Despite this I still feel like I should study for my final a bit, but each time I try I just get frustrated and feel like I'm wasting my time. How do you study for an exam that you know you realistically don't really need to study for?\n\nThanks!", "reply_text": "High school education is not some whimsy the government obligates on us, the process is overall beneficial. Learning is inherently productive, it would be productive even without a graded course or exam, so think of this exam as even more incentive (through the structure it provides) to engage in a guided area of learning. Hope this helps!"}, {"comment_text": "Hi, thought I should clarify since I understand I wasn’t clear. I finished high school a few years ago. I’m at a polytechnics institute completing a diploma of technology. This is my last course before getting this diploma. Realistically with the knowledge I have, even without studying, I am going to pass this course, but I would still like to do well on the exam but am having a hard time motivating myself to study for it, because I know I’m going to pass the course regardless", "reply_text": "Well, surely the question here is, \"Do you want to pursue a career in technology?\"\n\nIf you want to pursue a career in this field, surely you should also want to learn the material that is relevant to this career path.\n\nDon't look at it as \"I need 30% to pass the exam\" and instead \"I want to learn this because I want to become a [insert career title here]\""}, {"comment_text": "Hi, thought I should clarify since I understand I wasn’t clear. I finished high school a few years ago. I’m at a polytechnics institute completing a diploma of technology. This is my last course before getting this diploma. Realistically with the knowledge I have, even without studying, I am going to pass this course, but I would still like to do well on the exam but am having a hard time motivating myself to study for it, because I know I’m going to pass the course regardless", "reply_text": "I suppose spending the time you would use to study for this exam instead on subjects that are more inherently important to your line of life would be a better use of time, if you have the self-motivation to engage in autodidactism when there’s a factor of implicit incentive then go right ahead. If you need structure, then studying for this exam might be the optimal pursuit of learning for you personally. Have fun!"}, {"comment_text": "Well, surely the question here is, \"Do you want to pursue a career in technology?\"\n\nIf you want to pursue a career in this field, surely you should also want to learn the material that is relevant to this career path.\n\nDon't look at it as \"I need 30% to pass the exam\" and instead \"I want to learn this because I want to become a [insert career title here]\"", "reply_text": "Very true"}]}, {"post_title": "What are some useful tools for studying Algebra 1 Math?", "post_url": "https://www.reddit.com/r/GetStudying/comments/1c13h84/what_are_some_useful_tools_for_studying_algebra_1/", "post_comments": [{"comment_text": "Currently, I'm in Algebra 1 math (in 9th grade/Freshmen year of High School). Math has always been my weak subject when it comes to school. Currently, we do a lesson, do homework over the lesson then take a quiz, and repeat. We have 1-3 of these quizzes a week and they do impact my grade a lot if I do horribly on them!  \n\n\nWhat are some great tools/websites that are trusted that I can use to help me gain a greater understanding of the topic?   \n\n\nSome of you may say \"Use YouTube, its amazing\" but my trust in YouTube has since disappeared after my last quiz - the person teaching in the YouTube video didn't explain something and that drove me into an hour long tangent trying to figure out and explain stuff myself which wasn't smart of me I know, but ever since, I have lot trust in YouTube!", "reply_text": "My previous employer was a company called GetMoreMath. Around the time I left, they were working on a homeschool solution that might be exactly what you’re looking for. It doesn’t actually teach you math, but it reinforces what you’re already learning. \n\nOh, also ChatGPT or other ai told could def give you a leg up if you’re missing specific concepts. Just don’t always settle for the first explanation it provides."}, {"comment_text": "Currently, I'm in Algebra 1 math (in 9th grade/Freshmen year of High School). Math has always been my weak subject when it comes to school. Currently, we do a lesson, do homework over the lesson then take a quiz, and repeat. We have 1-3 of these quizzes a week and they do impact my grade a lot if I do horribly on them!  \n\n\nWhat are some great tools/websites that are trusted that I can use to help me gain a greater understanding of the topic?   \n\n\nSome of you may say \"Use YouTube, its amazing\" but my trust in YouTube has since disappeared after my last quiz - the person teaching in the YouTube video didn't explain something and that drove me into an hour long tangent trying to figure out and explain stuff myself which wasn't smart of me I know, but ever since, I have lot trust in YouTube!", "reply_text": "Check out [this math(all of it) youtube playlist!](https://youtube.com/playlist?list=PLybg94GvOJ9FoGQeUMFZ4SWZsr30jlUYK&feature=shared) Love it so much. This man explains arithmetics, algebra, geometry, trigonometry, calculus, and linear algebra, all the way up to advanced topics taught in college. The longest videos are about 15 minutes long and most are around the 5-10 minute mark."}, {"comment_text": "Currently, I'm in Algebra 1 math (in 9th grade/Freshmen year of High School). Math has always been my weak subject when it comes to school. Currently, we do a lesson, do homework over the lesson then take a quiz, and repeat. We have 1-3 of these quizzes a week and they do impact my grade a lot if I do horribly on them!  \n\n\nWhat are some great tools/websites that are trusted that I can use to help me gain a greater understanding of the topic?   \n\n\nSome of you may say \"Use YouTube, its amazing\" but my trust in YouTube has since disappeared after my last quiz - the person teaching in the YouTube video didn't explain something and that drove me into an hour long tangent trying to figure out and explain stuff myself which wasn't smart of me I know, but ever since, I have lot trust in YouTube!", "reply_text": "You shouldn't blame the YouTube person for not explaining something. You should blame yourself for not knowing what you had to study. Your teacher should have a study guide or at least let you know what concepts will be on the quiz/exam. From there you should look up each specific concept/topic on YouTube and study that."}]}]