[{"post_title": "A farmer was in a bar drinking and looking all depressed. His friend asked him why he was looking depressed and he replied, \"Some things you just can't explain.", "post_url": "https://www.reddit.com/r/Jokes/comments/1byqsk6/a_farmer_was_in_a_bar_drinking_and_looking_all/", "post_main_text": "\nThis morning I was outside milking a cow. As soon as the bucket was full the cow kicked it down with his left foot so I tied up his left foot to a pole.\nI began to fill up the bucket again and he kicked it down with his right foot, so I tied his right foot to a pole too.\nAs soon as I finished milking the cow again he knocked down the bucket with his tail and I took off my belt and tied up his tail with my belt.\nAs I was tying up his tail, my pants dropped down, then my wife came out and well, trust me, some things you just can't explain.\"", "post_comments": [{"comment_author": "Cyrus-114", "comment_text": "*As soon as the bucket was full the cow kicked it down with **his** left foot so I tied up **his** left foot to a pole.*\n\n\"Milking\" the cow, you say?\n\nThat ain't a bucket of milk you got there, Farmer Bob."}, {"comment_author": "countafit", "comment_text": "Not only that but this 'cow' has only one left and one right foot?"}, {"comment_author": "Dyrogitory", "comment_text": "To quote comedian Yakov Smirnoff, “If you milk a bull, you’ve got a friend for life.”"}, {"comment_author": "sphereseeker", "comment_text": "It would be worth considerably more than milk. He would have a lot of explaining to do to his wife as to how thousands of dollars of product got knocked onto the floor"}, {"comment_author": "Clearhead09", "comment_text": "The key is in “his left foot”"}, {"comment_author": "occasionally_cortex", "comment_text": "He ain't a farmer. He a Perv."}, {"comment_author": "wittyusername652", "comment_text": "Took him a little bit to get her warmed up but then pow, all at once..."}, {"comment_author": "Boring_Material_Dude", "comment_text": "Momma always said, “If you milk a bull, you have a friend for life!”"}, {"comment_author": "notverytidy", "comment_text": "He was accidentally milking Big Steve the farmhand. Who was dressed as cow for...well never you mind that...."}, {"comment_author": "WolfShaman", "comment_text": "Only tying the rear legs makes sense, though. The forelegs wouldn't reach the bucket without the cow falling over. Therefore, only the rear legs would need to be tied."}, {"comment_author": "plausiblydead", "comment_text": "Cows don’t kick with their front legs."}, {"comment_author": "average_texas_guy", "comment_text": "Found the person that hasn't milked a cow. You really only have to worry about the back legs."}, {"comment_author": "DadWhoMustNotBeNamed", "comment_text": "Is Big Steve the bus driver?"}, {"comment_author": "ChicagoDash", "comment_text": "I have nipples, Greg. Could you milk me?"}, {"comment_author": "Shael1223", "comment_text": "They are just rehearsing for a play"}, {"comment_author": "stevesinca", "comment_text": "Shhhh"}, {"comment_author": "Rubber_Rose_Ranch", "comment_text": "Some things you just can’t explain"}, {"comment_author": "secretprocess", "comment_text": "This guy milks (or fucks cows)"}, {"comment_author": "olsen_twentigg", "comment_text": "I'm this economy, he's lucky to have a job."}, {"comment_author": "WolfShaman", "comment_text": "Um..uh...well...uh...\n\nNeither, actually. But knowing what a cow looks like helps understand how their bodies work."}, {"comment_author": "secretprocess", "comment_text": "This guy knows what a cow looks like"}, {"comment_author": "Senpai_Has_Noticed_U", "comment_text": "You can't tie \"his\" leg and get milk from that cow. I'm thinking this farmer knew what's what...."}, {"comment_author": "CGB_SpenderReal", "comment_text": "And he wondered why the \"he-cow\" grinned and moaned ''yeah, baby\" while being milked"}, {"comment_author": "sirjimithy", "comment_text": "Kelly can be a boy's name too. HEY!"}, {"comment_author": "uthini_mfowethu", "comment_text": "Definitely explains the kicking"}, {"comment_author": "CGB_SpenderReal", "comment_text": "I also kick when someone tickles my johnson"}, {"comment_author": "JupiterSWarrior", "comment_text": "I’m confused. Are you milking a cow? Or a bull?"}, {"comment_author": "EyeoCy", "comment_text": "\"We don't have a cow, brother Hezekiah.  We have a bull.\"\n\nhttps://youtu.be/dLF725CX4mM?si=L3DNK1CShW9napM7"}, {"comment_author": "Needs-more-cow-bell", "comment_text": "That’s where my mind went too. One of the greatest movies ever made, and I will die on that hill."}, {"comment_author": "Emotional-Gas-9535", "comment_text": "he just wanted the cow to stop mooo-ving"}, {"comment_author": "___HeyGFY___", "comment_text": "#That's a bull..."}, {"comment_author": "YZXFILE", "comment_text": "It's still milk!"}, {"comment_author": "RockPaperChipper", "comment_text": "Wife was speechless in udder disbelief"}, {"comment_author": "HighColdDesert", "comment_text": "Saying \"he\" for a milking cow? That's really jarring. I couldn't read past that."}, {"comment_author": "theservman", "comment_text": "Sounds like this cow only had one teat"}, {"comment_author": "YZXFILE", "comment_text": "Frankencow Abi-normal."}, {"comment_author": "HurricaneDane", "comment_text": "Great joke! \nI started laughing as soon as I read \"his\" and couldn't stop."}, {"comment_author": "Joricano", "comment_text": "Milking a He cow. No wonder his wife had questions"}, {"comment_author": "StormGoth", "comment_text": "3 full buckets! That's impressive."}, {"comment_author": "YZXFILE", "comment_text": "Beats me!"}, {"comment_author": "certified-fumbler", "comment_text": "I just remembered the video 😂"}, {"comment_author": "Noturdadbut", "comment_text": "A cowboy milking a boycow... \"You had your handy twice.... If you ain't got opposable thumbs, something else' got to give...."}, {"comment_author": "Beebohsaurus", "comment_text": "Don't cows have like hooves though? Also, that's a bull..."}, {"comment_author": "10wuebc", "comment_text": "Both have hooves"}, {"comment_author": "docstuffinsmd", "comment_text": "The cow’s name is Norman. You were pulling on his dick!"}, {"comment_author": "misteraskwhy", "comment_text": "I’m going to go wash up"}, {"comment_author": "Tedious_research", "comment_text": "Caught my brother in the barn behind the cow growing up... He quickly grabbed it's tail, wrapped it around his waist and said he was trying to see if he could make a belt."}, {"comment_author": "Tuna_Sushi", "comment_text": "> some things you just can't explain\n\nThen he explains it fully."}]}, {"post_title": "(NSFW) A sumo wrestler is getting married to a very small woman.", "post_url": "https://www.reddit.com/r/Jokes/comments/1bypowc/nsfw_a_sumo_wrestler_is_getting_married_to_a_very/", "post_main_text": "A massive sumo wrestler, about 6'7, and over 450lbs, is getting married. His  wife is very, very small, about 4'5 and maybe 90 lbs or so. \n\nAfter they say their vows, a few of his friends come up to him, and one says- \"This is gonna sound rude, but how the hell do you guys have sex?\"\n\nThe sumo responds, \"Well, I lift her up, place her on my dick, and move her up and down with both hands\"\n\nOh\", says the guy, \"that's not too bad\"\n\nSumo replies- \"Yeah, its a lot like jacking off, except now I have someone to talk to.\"", "post_comments": [{"comment_author": "Shadp9", "comment_text": "This isn't a joke, it's a genre"}, {"comment_author": "saywhatnow117", "comment_text": "Called?"}, {"comment_author": "Spare-Leg-1318", "comment_text": "Human Fleshlight"}, {"comment_author": "Big-Boy-Felix", "comment_text": "Nuggets"}, {"comment_author": "Lokijai", "comment_text": "Unzips"}, {"comment_author": "EirHc", "comment_text": "Are we talking about fuck dolls or real humans?"}, {"comment_author": "aldwinligaya", "comment_text": "I am equally curious and scared to actually google that."}, {"comment_author": "Nightcheerios", "comment_text": "Sigh ???????"}, {"comment_author": "SmallieNL", "comment_text": "Yes"}, {"comment_author": "yonk9", "comment_text": "Is there a difference?"}, {"comment_author": "IttsssTonyTiiiimme", "comment_text": "This joke fails at being a joke on a rudimentary level."}, {"comment_author": "enbyayyy", "comment_text": "Yeah I kinda expected some reveal or punchline"}, {"comment_author": "Tifoso89", "comment_text": "It's weird because I feel like it *should* be funny, but at the same it doesn't work as a joke. I think it would be funny if it's said in a context, like a comment from a stand-up comedian during a show. It's more of a quip than a joke."}, {"comment_author": "dy_funct", "comment_text": "It has its ups and downs up and down up and down"}, {"comment_author": "mrdanielsir9000", "comment_text": "This is more like a joke in a sitcom, except it would be the sumo delivering it"}, {"comment_author": "Silentwarfare13", "comment_text": "Does anyone have the link?"}, {"comment_author": "nemeras", "comment_text": "*kink"}, {"comment_author": "ClimateThick4659", "comment_text": "I can’t find the joke. Did anyone find it funny?"}, {"comment_author": "-Zoppo", "comment_text": "The imagery made me giggle a little but that was all. Still better than half the jokes getting up voted here that make me irritated because of the time I just wasted in reading them."}, {"comment_author": "IonizedRadiation32", "comment_text": "It has a standup/podcast vibe to it. It's a funny situation and visual, which would probably be even funnier when told well and/or in the context of some larger funny story"}, {"comment_author": "Clever_Owl", "comment_text": "A lot of people seem to think sex=funny.\n\nUnless it’s from the woman’s perspective. In which case it’s EXTREMELY UNFUNNY 😂"}, {"comment_author": "BryanFolkCartoon", "comment_text": "I did ."}, {"comment_author": "IncredibleAlloy", "comment_text": "Boomer humor at its best"}, {"comment_author": "ReV-Whack", "comment_text": "I'm already duct taping an Alexa to a flesh light I made it order."}, {"comment_author": "AsinusRex", "comment_text": "r/3amjokes"}, {"comment_author": "Granite66", "comment_text": "Reminds me of the story of Andre the giant roommate walking on him having sex with a Japanese woman and saying it was like watching an elephant having sex with a pretzel"}, {"comment_author": "Slyzoor", "comment_text": "Is that supposed to be funny?"}, {"comment_author": "mrjuicepump", "comment_text": "None of the jokes on this sub are funny wtf"}, {"comment_author": "jacquesrabbit", "comment_text": "Everybody know about the fuck plank"}, {"comment_author": "HurricaneDane", "comment_text": "I think I heard that over a decade ago. Refresh my memory?"}, {"comment_author": "slamdanceswithwolves", "comment_text": "Yes, and planks for reminding me."}, {"comment_author": "jacquesrabbit", "comment_text": "They use the plank to push over the fatty flabs from morbidly obese people so that they can fuck each other"}, {"comment_author": "jamieliddellthepoet", "comment_text": "Didn’t that originally get mentioned in a post about weird medical cases, and the nurse posting it said that the woman in question had come in because the “fuck plank” had caused a lot of abrasions which had become infected?"}, {"comment_author": "HurricaneDane", "comment_text": "Oh. That is NOT the plank joke I was thinking of."}, {"comment_author": "Evil_Umbreon", "comment_text": "You were thinking about Plank from Ed, Edd and Eddy."}, {"comment_author": "blahblahbush", "comment_text": "https://www.youtube.com/watch?v=a0Kjm8Op60A"}, {"comment_author": "bumblebeedrill", "comment_text": "Can someone explain the punchline? I don’t understand the joke."}, {"comment_author": "TheMelv", "comment_text": "It's the absurdity of the punchline. Sumo sounds like having someone to talk to during that activity is what makes it different than going solo."}, {"comment_author": "Amore_vitae1", "comment_text": "My wife’s baby daddy was super big (nothing against him. He’s a cool dude and a good dad) but I mean like 500 pounds big.. she says he had a small dick too, probably bc of his size, and that sex with him was basically just like humping a pillow, but having someone to talk too"}, {"comment_author": "SummerPop", "comment_text": "A man needs a name."}, {"comment_author": "Smokestack830", "comment_text": "This is 'old inappropriate boomer who doesn't understand that most of his \"jokes\" are just creepy and weird' humour"}, {"comment_author": "re5t", "comment_text": "It’s funny because it’s absurd"}, {"comment_author": "cutslow", "comment_text": ".... except now I dont need a sock to cum in."}, {"comment_author": "shadowkeshik", "comment_text": "So this is what would’ve happened if that sumo guy in wano married o kiku"}, {"comment_author": "Evil_Umbreon", "comment_text": "Am I the only one who thought Kiku was in love with Kinemon?"}, {"comment_author": "greymadders", "comment_text": "Let me introduce you to my Fistwife"}, {"comment_author": "STGC_1995", "comment_text": "Do they talk about the weather?"}, {"comment_author": "Emotional-Gas-9535", "comment_text": "we all know he has a little fella"}, {"comment_author": "stlmick", "comment_text": "If it's even poking through, it's a champion."}, {"comment_author": "latupuikko", "comment_text": "More like Fleshlight"}, {"comment_author": "brudzool", "comment_text": "Who is reading your phone?  NSFW matters not for text.  I don't get why people tag it....oh yeah, clickbait"}]}, {"post_title": "A man and his pig walk into a bar...", "post_url": "https://www.reddit.com/r/Jokes/comments/1bysfzl/a_man_and_his_pig_walk_into_a_bar/", "post_main_text": "(apologies if this has been posted before)\n\nThe pig has three good legs, and one wooden leg.\n\n\"Now there's a story,\" says the barman. \"I'll give you a free beer if you tell me about the pig.\"\n\n\"Pig'll 'ave a beer too,\" says the farmer.\n\nThe barman agrees, and after downing half the tankard, the farmer says, \"Now, this 'ere pig, 'es a good pig. Faithful, loyal, better at 'erding sheep than a dog, says me. Now I'll tell you, we were out in the ute, and a tyre blew. Skidded off the track, and the truck rolled.\n\n\"Now, I were stuck upside down and injured, like, but pig could get out. 'e crawled out of the window, trotted three mile over hill and through creek to get me wife, so 'e did. And when the ambulance arrived, pig trotted all three mile back to get them to me. Is a good pig, so 'e is. Saved me life, I reckon.\"\n\nThe barman is suitably impressed, but says \"That's a hell of a story mate, but that doesn't explain the wooden leg.\"\n\n\"Oh that!\" exclaims the farmer. \"Oh, well, like I said, pig saved my life. An' a pig like that, well, you don't eat 'im all at once do yer!\"\n\n", "post_comments": [{"comment_author": "rowenlemmings", "comment_text": "I've heard this one as a rule of three joke that partially subverts the \"Farmer's daughter\" set up.\n\nI won't retell it, but the set up is a man's car breaks down and he has to shelter in a farmhouse. He sees the peg-legged pig and asks the farmer.\n\nThe farmer tells three stories about what a great pig he is, each one describing a death-defying feat. Diving into a herd of sheep during a wolf attack. hauling the farmer out from underneath a tractor, even running headlong into the burning farm house to wake the farmer.\n\nAfter each story, the man asks \"Oh and is that how he lost his leg?\" The farmer scoffs \"Naw, but let me tell you another one--\" and launches into the next story.\n\nFinally, the man comes straight out and asks how the damn pig lost its leg, and the same punchline works."}, {"comment_author": "pragyan52yadav", "comment_text": "Can you tell original joke too please"}, {"comment_author": "Adorable_Challenge37", "comment_text": "Jesus! Take an upvote.\n\nI'm not a vegetarian nor will I claim to consume a lot of meat, but I think this joke is ***food*** for thought. A lot of people usually consider the pig filthy and dumb but they are supposedly more intelligent than most dogs...\n\nWould we eat dogs? Life-saving or otherwise?\n\nGood joke and it made me think, thanks."}, {"comment_author": "kmj420", "comment_text": "Does dog meat taste as good as bacon?"}, {"comment_author": "notverytidy", "comment_text": "if you simply bash random animals over the head with a hammer until they go into a coma, then technically you're just eating vegetables."}, {"comment_author": "buster_de_beer", "comment_text": "> Would we eat dogs? Life-saving or otherwise?\n\n\nYes. Both currently in places in the world, but also when there is famine. I don't think many pets survive those conditions. "}, {"comment_author": "Make_the_music_stop", "comment_text": "Hey, sewer rat may taste like pumpkin pie, but I'd never know 'cause I wouldn't eat the filthy motherfucker. Pigs sleep and root in shit. That's a filthy animal. I ain't eat nothin' that ain't got sense enough to disregard its own feces."}, {"comment_author": "Adorable_Challenge37", "comment_text": "One way to find out..."}, {"comment_author": "betelgozer", "comment_text": "Eating a dog can be risky, but eating one leg of a pig is a rasher decision."}, {"comment_author": "Anna_Pet", "comment_text": "Probably not to your palate, but taste isn’t objective."}, {"comment_author": "HammerThatHams", "comment_text": "Nothing tastes as good as bacon"}, {"comment_author": "Eldon42", "comment_text": "Pulp Fiction FTW."}, {"comment_author": "MrElderwood", "comment_text": "What a'bout a dog? Dog eats his own faeces."}, {"comment_author": "Disastrous-Bite-1538", "comment_text": "A pig won't do that if given a choice. If you keep it in a small pen full of mud and it's own shit, it don't have much choice.  They don't sweat, so the mud is helpful in keeping them cool, preventing sunburn, and keeping the flies off."}, {"comment_author": "Eldon42", "comment_text": "More than one, depending on which fast-food outlets you have nearby."}, {"comment_author": "BatangTundo3112", "comment_text": "Hold on to your horses there. No one's eating a dog here.🤨"}, {"comment_author": "Speed_Alarming", "comment_text": "Don’t eat dog neither!"}, {"comment_author": "notverytidy", "comment_text": "So do several A+ celebrities....allegedly."}, {"comment_author": "theantlion", "comment_text": "Wait, are horses on the menu too? What's going on?"}, {"comment_author": "No-Cheek-1188", "comment_text": "😂😂"}, {"comment_author": "nosomthin", "comment_text": "Good ol' # 44!"}, {"comment_author": "bornagain-stillborn", "comment_text": "Yes. Yes you do."}, {"comment_author": "sidkhullar", "comment_text": "If?"}, {"comment_author": "Nervous-Hair-2107", "comment_text": "Once again Norm McDonald told this story the best. By god I can’t believe no ones here heard of him"}, {"comment_author": "Shang-di", "comment_text": "Can someone translate \"now I'll you \"\n\n\n- edit. Ah it was a typo. They fixed it."}, {"comment_author": "cAmSg0tGaMz", "comment_text": "Now I'll tell you, but this is quite common to say"}]}, {"post_title": "It seems like not everyone know this joke: Everyone Knows Dave", "post_url": "https://www.reddit.com/r/Jokes/comments/1byxq31/it_seems_like_not_everyone_know_this_joke/", "post_main_text": "Dave was bragging to his boss one day, \"You know, I know everyone there is to know. Just name someone, anyone, and I know them.\"  \nTired of his boasting, his boss called his bluff, \"OK, Dave, how about Tom Cruise?\"  \n\"No dramas boss, Tom and I are old friends, and I can prove it.\" So Dave and his boss fly out to Hollywood and knock on Tom Cruise's door, and Tom Cruise shouts,  \n\"Dave! What's happening? Great to see you! Come on in for a beer!\"  \nAlthough impressed, Dave's boss is still skeptical. After they leave Cruise's house, he tells Dave that he thinks him knowing Cruise was just lucky.  \n\"No, no, just name anyone else,\" Dave says.  \n\"President Obama,\" his boss quickly retorts.  \n\"Yup,\" Dave says, \"Old buddies, let's fly out to Washington,\" and off they go.  \nAt the White House, Obama spots Dave on the tour and motions him and his boss over, saying, \"Dave, what a surprise, I was just on my way to a meeting, but you and your friend come on in and let's have a beer first and catch up.\"  \nWell, the boss is very shaken by now but still not totally convinced. After they leave the White House grounds he expresses his doubts to Dave, who again implores him to name anyone else.  \n\"Pope Francis,\" his boss replies.  \n\"Sure!\" says Dave. \"I've known the Pope for years.\" So off they fly to Rome.  \nDave and his boss are assembled with the masses at the Vatican's St. Peter's Square when Dave says, \"This will never work. I can't catch the Pope's eye among all these people. Tell you what, I know all the guards so let me just go upstairs and I'll come out on the balcony with the Pope.\" He disappears into the crowd headed towards the Vatican.  \nSure enough, half an hour later Dave emerges with the Pope on the balcony, but by the time Dave returns, he finds that his boss has had a heart attack and is surrounded by paramedics.  \nMaking his way to his boss' side, Dave asks him, \"What happened?\"  \nHis boss looks up and says, \"It was the final straw... you and the Pope came out on to the balcony and the man next to me said, 'Who the fuck is that on the balcony with Dave?'  \n", "post_comments": [{"comment_author": "InsidiousColossus", "comment_text": "Everyone knows this joke"}, {"comment_author": "sielingfan", "comment_text": "I heard it from Dave. You?"}, {"comment_author": "Ghostthroughdays", "comment_text": "Around the world"}, {"comment_author": "tarwheel", "comment_text": "Dave? Dave?  \nDave's not here"}, {"comment_author": "DaveAndCheese", "comment_text": "*knock knock*\n\nHello?"}, {"comment_author": "tlbs101", "comment_text": "Dave’s not here, because he’s out meeting new people."}, {"comment_author": "Chemical_Form_8015", "comment_text": "I got it. Younger folks may not."}, {"comment_author": "x_caliberVR", "comment_text": "No dude, *I’m Dave*!"}, {"comment_author": "iwonderthesethings", "comment_text": "Sounds like OP needs to know [Dave a bit better.](https://www.reddit.com/r/Jokes/s/cKLEIOqZKv)"}, {"comment_author": "redbeard_gr", "comment_text": "you should meet Dave. Great guy. He knows everybody"}, {"comment_author": "lostinspacelac", "comment_text": "If he knows everybody, why should I meet him? Doesn’t he already know me?"}, {"comment_author": "nosomthin", "comment_text": "Good ol' # 21!"}, {"comment_author": "teardropgeek", "comment_text": "These are the Daves I know:\n\n[https://www.youtube.com/watch?v=8nvzEqsZIGo](https://www.youtube.com/watch?v=8nvzEqsZIGo)\n\nedit: for stray apostrophe.  They are plural Daves, not my Daves"}, {"comment_author": "Klotzster", "comment_text": "The Daves I Know\n\nhttps://youtu.be/8nvzEqsZIGo?si=3FLMeu7NehvmFad2"}, {"comment_author": "Silphire100", "comment_text": "Oh Dave? Yeah I know him. Decent guy"}, {"comment_author": "daveshops", "comment_text": "I'm Dave, and I approve this joke"}, {"comment_author": "NeklosWarrof", "comment_text": "Dave the Diver?"}, {"comment_author": "tomeareeverything", "comment_text": "Weirdly, I told this one to the wife yesterday. She’s got a memory like a sieve, so I can cycle through them again and again, much like Reddit!"}, {"comment_author": "MusicMan013", "comment_text": "Haven't heard it a while. Thanks for the laugh"}, {"comment_author": "spaceylaceygirl", "comment_text": "One of my favorite jokes."}, {"comment_author": "Free-Rule-4661", "comment_text": "I never heard it and thought it was great lol"}, {"comment_author": "Working-Living-5589", "comment_text": "First time. Much appreciative of the cackle. Ahahah"}, {"comment_author": "Callsign_Crush", "comment_text": "Good old Dave, he's a good mate of mine."}]}, {"post_title": "Barack Obama walks into a bar, but he is invisible.", "post_url": "https://www.reddit.com/r/Jokes/comments/1byaodw/barack_obama_walks_into_a_bar_but_he_is_invisible/", "post_main_text": "After attracting the bartender’s attention, the bartender says \"Ok, I'll bite. Why are you invisible?\"  \nBarack says \"Well, I found a bottle on the beach and...then I rubbed it.\" \"And then...importantly...A genie came out.\" \"The genie said I could have...3 wishes.\"  \nFor my first wish, I said \"Let me say this, and this is profoundly important...I want Michelle to marry me...I love her,...and I think America will love her too.\" That wish was granted.  \nFor my second wish, I said \"Like all patriotic Americans, I am deeply patriotic...and I want to be President...of the United States...so I can serve my country.\" That wish was granted too.  \nAnd then, for my third wish, I started by saying \"Let me be clear...\"", "post_comments": [{"comment_author": "WorthHabit3317", "comment_text": "As soon as I read \"Let me be clear\" the voice in my head became Obama's and I laughed out loud. Well done!"}, {"comment_author": "Boojum2k", "comment_text": "I can picture Obama telling this joke."}, {"comment_author": "Stringy63", "comment_text": "I don't see that happening"}, {"comment_author": "HeavySomewhere4412", "comment_text": "I can too but I definitely can't see John Cena doing it"}, {"comment_author": "Ampersandbox", "comment_text": "Came back to the thread to upvote this. N I C E."}, {"comment_author": "ProjectKeris", "comment_text": "Not anymore after that 3rd wish was summoned, and granted."}, {"comment_author": "ultrab1ue", "comment_text": "It's possible with enough Upvotes. And maybe if we had Obama's direct contact info. Or if we can get the attention of other folks in his life"}, {"comment_author": "revtim", "comment_text": "Because it's not so good, or because you think he doesn't have a sense of humor?  \nHe approved being asked \"What's it like being the last black president\" for Between Two Ferns, so I think he's a sport, whatever else one might think of him."}, {"comment_author": "Austin111Gaming_YT", "comment_text": "Who?"}, {"comment_author": "Phoenix4235", "comment_text": "r/whoosh"}, {"comment_author": "sataniclilac", "comment_text": "because the joke is about him being invisible"}, {"comment_author": "Psychological-Scar53", "comment_text": "Oh, if you think that is funny, you should check out Obama's correspondence dinners.... He is actually a funny guy. In one of the dinners he stated that he was late because he was on \"CPT\"... Another one he had Keegan Michael Key on it as \"Luther\", his anger translator. It was a fucking blast to watch... Lol"}, {"comment_author": "michlogg", "comment_text": "r/whoosh"}, {"comment_author": "LarsBonzai", "comment_text": "One of the funniest lines from Between Two Ferns!"}, {"comment_author": "Bug-03", "comment_text": "Mike Jones"}, {"comment_author": "K-Wguyinheat", "comment_text": "I'm Star Lord man..... Star Lord!"}, {"comment_author": "revtim", "comment_text": "I considered that, and concluded that was not what was meant, perhaps incorrectly."}, {"comment_author": "revtim", "comment_text": "Yeah, those were hilarious.  Obviously they were written by professional comedy writers, but Obama had the skill to tell a joke. I remember McCain wasn't bad either! I suppose you can't get anywhere in politics without being a gifted public speaker, and that probably lends itself to telling jokes to some extent."}, {"comment_author": "gsfgf", "comment_text": "The 2011 speech might have been a bad idea in hindsight..."}, {"comment_author": "WhatTheOk80", "comment_text": "The best Obama correspondence dinner bit was the bucket list. When he said he didn't have a bucket list, but his list rhymes with bucket."}, {"comment_author": "Splattered_Smothered", "comment_text": "He's got some stand-up (comedian) chops."}, {"comment_author": "micmacimus", "comment_text": "The anger translator was laugh-out-loud, it had me in absolute stitches."}, {"comment_author": "A_Feast_For_Trolls", "comment_text": "Wait, you're either misremembering a Hilary Clinton speech/joke or this just adds to it, but a few years ago Hilary got in trouble for saying she was running on cpt time, and when a black man next to her said that wasn't cool she said \"I meant crooked politicians time\" I swear to God i remember this actually happening."}, {"comment_author": "revtim", "comment_text": "Yup, that's fair"}, {"comment_author": "tojara1", "comment_text": "Lol This made me laugh more than the joke, mainly because I haven't listened to Obama's speeches."}, {"comment_author": "Stringy63", "comment_text": "I can't picture an invisible man."}, {"comment_author": "Psychological-Scar53", "comment_text": "I agree, but Obama's delivery was executed beautifully."}, {"comment_author": "Psychological-Scar53", "comment_text": "Nope, Obama said he was running late because he was on CPT. You can find that correspondence dinner that he said it at on YouTube."}, {"comment_author": "Weekly-Ad-3746", "comment_text": "I read the quotes in Obama's voice and felt it was missing pauses and \"uh\"s."}, {"comment_author": "germy-germawack-8108", "comment_text": "Well crafted. Your version of Obama had his priorities right. Becoming prez is whatever whatever, but any miracle to find yourself a woman, man."}, {"comment_author": "Asleep_Lock6158", "comment_text": "Well, he did Marry Michelle before being elected President."}, {"comment_author": "gaussmini", "comment_text": "For the first wish, the genie is really technical and probably just \"let him say his piece\"."}, {"comment_author": "Successful-Bridge331", "comment_text": "He found both"}, {"comment_author": "None", "comment_text": "[removed]"}, {"comment_author": "joey__jojo", "comment_text": "Somewhere to stick it, and a stick.  \n\nMust be like being a kid again."}, {"comment_author": "ADirtFarmer", "comment_text": "Try thinking about something other than dicks for a minute."}, {"comment_author": "JohnMcClanesPenis", "comment_text": "Serious question.\n\nWhy the fuck do you goddamn Trumper dipshits harp on Michelle used to be a man???\n\nI truly don’t get it."}, {"comment_author": "Raetekusu", "comment_text": "Even if Michelle Obama turned out to be a transgender man named Michael, so fucking what?"}, {"comment_author": "moe-hong", "comment_text": "Fuck off transphobe, bigot, whatever you are. You do not make the world a better place."}, {"comment_author": "68W38Witchdoctor1", "comment_text": "Because they love the fantasy. Yanno, [projection](https://lawsuit.org/general-law/republicans-have-an-obsession-with-transgender-pornography/) and all that."}, {"comment_author": "winthroprd", "comment_text": "Punchline is really good but I can't stop thinking about how an invisible man got a bartender's attention."}, {"comment_author": "snouz", "comment_text": "It's the same bartender in all the bar jokes, he's used to it by now."}, {"comment_author": "Optimal_Law_4254", "comment_text": "This frickin’ bartender has seen talking animals, a guy with a 12 inch pianist and all sorts of amazing stuff. Why not an invisible former president?"}, {"comment_author": "GREATwhiteSHARKpenis", "comment_text": "He wasn't naked, and he held up an empty glass? "}, {"comment_author": "topasaurus", "comment_text": "Well, he is invisible.  His clothes likely weren't.  That and his voice still worked."}, {"comment_author": "Accomplished_Age7883", "comment_text": "He sees and hears things others cant"}, {"comment_author": "Turq-Hex-Sun", "comment_text": ">Like all patriotic Americans, I am deeply patriotic"}, {"comment_author": "snkn179", "comment_text": "Dude forgot about all the shallowly patriotic Americans."}, {"comment_author": "ben_gaming", "comment_text": "I’m the patriot\n\nYes I’m the real patriot\n\nYou other patriots\n\nAre just imitating\n\nSo all you shallowly patriotic Americans can just sit down"}, {"comment_author": "Sgeo", "comment_text": "It's nice to see a political joke that is actually about a specific person, instead of being a generic <insert politician here> joke."}, {"comment_author": "KillaDaKlown", "comment_text": "Didn't see that coming."}, {"comment_author": "qwertacius_boi", "comment_text": "Neither did his wife~"}, {"comment_author": "Dizz2K7", "comment_text": "I heard she gets the eye patch off later this week."}, {"comment_author": "Optimal_Law_4254", "comment_text": "Wow. A clean and non offensive Obama joke. Nice!\n\nIt’s tough to find for love or money…\na joke that’s clean and also funny."}, {"comment_author": "VoidExileR", "comment_text": "I read this in Obamas voice and the pauses makes it even better. The joke was jaw dropping by any means but at least it was transparent"}, {"comment_author": "LadyFannieOfOmaha", "comment_text": "Brilliant. Wish I could give you two upvotes."}, {"comment_author": "SeaSignificance8962", "comment_text": "indeed"}, {"comment_author": "trucorsair", "comment_text": "So Obama has a transparent sense of humor"}, {"comment_author": "Zharaqumi", "comment_text": "A very witty joke. I like."}, {"comment_author": "TootsNYC", "comment_text": "this is funny because it’s actually pegged to him, and not just any old politician.\n\nThough Joe Biden would have the same problem."}, {"comment_author": "Open_Test", "comment_text": "Only Clint Eastwood could see him.  That explains his weird rant to an otherwise empty chair."}, {"comment_author": "actuallyz", "comment_text": "Thanks Obama"}, {"comment_author": "bigbootybiden", "comment_text": "That's so fucking stupid. I LOVE IT."}, {"comment_author": "MolassesMediocre1071", "comment_text": "Somehow I don’t get this…"}, {"comment_author": "Empty401K", "comment_text": "Obama started a lot of his sentences with “let me be clear…”  The genie took that literally, so now he’s invisible."}, {"comment_author": "DOLO_F_PHD", "comment_text": "Obama started alot of speeches with \"let me be clear\" (invisible)"}, {"comment_author": "CuriousDave1234", "comment_text": "My wife doesn’t either.  Is this a gender thing?"}, {"comment_author": "Raetekusu", "comment_text": "And Shatner-level pauses."}, {"comment_author": "cpeosphoros", "comment_text": "Most probably a political awareness thing. The punchline is related to one of Obama's \"trademark\" lines."}, {"comment_author": "AccomplishedHold4645", "comment_text": "It's really the pause that makes the joke."}, {"comment_author": "couchpotatoe", "comment_text": "\"Invisible Man\" by Ralph Ellison dealt with the many issues faced by Black Americans in the early 20th century."}, {"comment_author": "say592", "comment_text": "He kind of wasted a wish on Michelle marrying him. Either it's super creepy that be got a her to marry him when she otherwise wouldn't, or she would have married him and wishing was unnecessary."}, {"comment_author": "JSIcey", "comment_text": "It's a joke..."}, {"comment_author": "Able_Reality5298", "comment_text": "The lights are off"}, {"comment_author": "EnumeratedWalrus", "comment_text": "Great work"}, {"comment_author": "FewCoach2765", "comment_text": "How does the bartender see invisible?"}, {"comment_author": "kinzer13", "comment_text": "A very Norm joke..."}, {"comment_author": "buckwurst", "comment_text": "Barack Obama walks into a bar, but he is invisible, he's carrying a clipboard and writes on it to get the bartender to notice him.  Bartender says \"Why are you invisible?\"\nBarack says \"Well, I found a bottle on the beach and a genie came out.\" \"The genie said I could have 1 wish.\"\nI started by saying \"Let me be clear...\""}, {"comment_author": "Phase_Alienated620", "comment_text": "Obama's playing the genie game! I'd definitely beg for free pizza for life or something. But, nah! He goes huge! Getting Michelle to marry him, becoming President—he's got ambition! And what about \"\n\nLet me be clear...\" for the third wish? That was a classic Obama maneuver! Can you imagine the speeches he'd give if he had that invisible superpower in reality?"}, {"comment_author": "ThingsIllegalToKnow", "comment_text": "\"Let's be clear I Barack Obama do now Authorize the use of a coordinated drone strike on one Abdullahrahmen Alwaqi , who is  a 16 year old US citizen, who is infact a minor child, and that such person has never been charged in any US court with a crime, thus this action constitutes capital murder, Because I am a revenge seeking piece of human filth and a War Criminal\""}, {"comment_author": "Buceye78", "comment_text": "The only head man in our country that gives head to a man"}, {"comment_author": "ADirtFarmer", "comment_text": "You sure think about giving head a lot."}, {"comment_author": "Raetekusu", "comment_text": "And that's a bad thing why, exactly?"}, {"comment_author": "Crazy_questioner", "comment_text": "Serious question - do you think this is some kind of sick burn?"}, {"comment_author": "Buceye78", "comment_text": "So your point is ?"}, {"comment_author": "frabjousdae", "comment_text": "Karma farmer, huh?\n\nhttps://www.reddit.com/r/Jokes/s/1qmebEkFB7"}, {"comment_author": "Ok_Local_893", "comment_text": "It was 3 years ago bro. Shouldn't a good joke be mentioned again every now and then?"}, {"comment_author": "jerdle_reddit", "comment_text": "This is r/Jokes. It should be called r/eposts. None of these are original."}, {"comment_author": "frabjousdae", "comment_text": "That’s fair. I swear I’ve seen this one each time it’s been posted. My comment also stemmed from that it’s a 2 day old account with one of the posts literally asking for upvotes. \n\nhttps://www.reddit.com/r/Jokes/s/cmfRxftEu7\n\nhttps://www.reddit.com/r/Jokes/s/XD5eVo5Bgr\n\nhttps://www.reddit.com/r/Jokes/s/zNsBtmFXc9\n\nhttps://www.reddit.com/r/Jokes/s/afWvQy6RI4"}, {"comment_author": "Zealousideal_Beat365", "comment_text": "Too bad this didn’t really happen then the nightmare we’re living in wouldn’t be present"}, {"comment_author": "ADirtFarmer", "comment_text": "2/3 of that joke did happen."}, {"comment_author": "SkeletorInvestor", "comment_text": "Bro is crying over a joke about an invisible president"}, {"comment_author": "Raetekusu", "comment_text": "The year is 2096.  The Marvel Cinematic Universe (4th reboot) has just released the world's first movie made entirely of post-credits ads.  Humanity has colonized Mars and is looking to push further, to Jupiter's moons.  Sir Patrick Stewart is still doing well.\n\nAnd Republicans are still malding about Obama."}, {"comment_author": "AccomplishedHold4645", "comment_text": "You would have been happy with an invisible President Obama?"}, {"comment_author": "6098470142", "comment_text": "Jackie laugh"}]}, {"post_title": "A man finds a lamp with a genie inside", "post_url": "https://www.reddit.com/r/Jokes/comments/1byczaj/a_man_finds_a_lamp_with_a_genie_inside/", "post_main_text": "A man finds a lamp with a genie inside. The genie tells the man that he can grant him one wish. Since the man is already quite wealthy and relatively happy, he asks for the only thing bothering him at the moment - he asks to reach orgasm at the same time as his wife.\n\nAfter a few weeks, the man returns to the lamp, rubs it and the genie comes out.\n\n\"Hey Genie, I'm afraid I'll have to cancel my last wish.\"\n\n\"What's wrong? Did I make a mistake while granting the wish?\" curiously asks the genie.\n\n\"Well no, nothing's wrong, but imagine this: You're in the pub with your friends. You're playing cards, drinking beer... and suddenly - Orgasm.\"", "post_comments": [{"comment_author": "Suggul", "comment_text": "I thought the joke would be that he doesn't orgasm now either"}, {"comment_author": "TwoSillyStrings", "comment_text": "I genuinely can’t tell which would be funnier. Either that or “Every time I call my wife to tell her I have to work late, 45 minutes later…. orgasm.”"}, {"comment_author": "Powerful-Internal953", "comment_text": "I was thinking about the wify getting orgasms in 10 seconds. But this is real..."}, {"comment_author": "HaloDeckJizzMopper", "comment_text": "Clever"}, {"comment_author": "KlingonJ", "comment_text": "Definitely the best"}, {"comment_author": "joey__jojo", "comment_text": "I'm now the most productive person in the office.\n\nSeven years in a row!"}, {"comment_author": "664designs", "comment_text": "Or she calls informing him she'll be late, then 45 minutes later......"}, {"comment_author": "RedditsLittleSecret", "comment_text": "Every time she’s going to the store to grab a few items: boom, orgasm."}, {"comment_author": "usernametaken0987", "comment_text": ">\"What's wrong? Did I make a mistake while granting the wish?\" curiously asks the genie.\n\n\"Well no, nothing's wrong. It works fine, once a night every Saturday, three times on Monday\" he replies.\n\n\"So what's wrong?\" asks the genie.\n\n\"I'm at work on Mondays.\""}, {"comment_author": "Imaginary_Coat441", "comment_text": "This"}, {"comment_author": "mralex", "comment_text": "Genie grants 3 wishes. \n\nFor his first wish, the man asks for a beer.\n\nPoof! He has a bottle of beer in his hand. He drinks it--the most amazing beer he's ever had--and the bottle is full again.\n\n\"What's up with this?\"\n\nGenies says \"This is Genie beer. Every time you empty the bottle, it fills up again.\"\n\nHe tries it a few more times. \"This is GREAT.\"\n\nGenie says \"I aim to please. You get two more wishes.\"\n\nMan says, \"I'll take two more of these!\""}, {"comment_author": "Hefty-Hyena-2227", "comment_text": "Sounds like the Norwegian lottery winner of 400 million euro who decided to take the annuity of 400 million payments of 1 euro each year!"}, {"comment_author": "JJNEWJJ", "comment_text": "That’s not stupid at all.\n\nHe could sell the other 2 for god knows how much.\n\nOr even better, keep one for himself and use the other to open a pub"}, {"comment_author": "ketoleggins", "comment_text": "Is this real? Sounds more like a Swede. (Finnish here)"}, {"comment_author": "mightylonka", "comment_text": "Suomi mainittu! Torilla tavataan!"}, {"comment_author": "Hefty-Hyena-2227", "comment_text": "(I am American of Norwegian descent)"}, {"comment_author": "ketoleggins", "comment_text": "😆"}, {"comment_author": "NotThatJoel", "comment_text": "“Did I make a mistake granting the wish?”\n“All I know is I can’t make it through a work day without climaxing.”"}, {"comment_author": "anthropomorphicdave", "comment_text": "I was cleaning a lamp and a genie popped out.  He said I could have 2 wishes.  I said “Two!  What happened to three?”  He said, “Check your pants.”"}, {"comment_author": "whiznat", "comment_text": "I looked and there was a 12-inch pianist in there!"}, {"comment_author": "JJohnston015", "comment_text": "\"Trust me. I've been doing this a long time.\""}, {"comment_author": "Vermouth1991", "comment_text": "?"}, {"comment_author": "IrisBlaze", "comment_text": "The genie already knows what's the first wish would be"}, {"comment_author": "Twiztid-Dragon-77", "comment_text": "GENIE: \"I am not your usual Genie. Yes, I will grant you THREE wishes, but with one stipulation -- whomever you hate the most, will receive DOUBLE what you wish for.\"\n\nMAN: \"Okay, well then, I wish I had $5 million.\"\n\nG: \"Alright. WHOM do you hate the most? THEY will get double.\"\n\nM: \"My ex-wife\"\n\nG: \"It is done. You have $5 Mil, and she has $10 Mil. What is your next wish?\"\n\nM: \"I wish I had a big fancy yacht.\"\n\nG: \"Okay. Your ex-wife now has 2. You have one final wish. Choose wisely before I return to my lamp.\"\n\nMAN, pausing in thought: \"Now I wish you would scare me half to death....\""}, {"comment_author": "SpuddyTater", "comment_text": "I was expecting him to tell the genie that he can’t make his wife orgasm 😅"}, {"comment_author": "ketoleggins", "comment_text": "…Or even better, through his wish, he finds out his wife never actially cums when she haves sex with him."}, {"comment_author": "TooShiftyForYou", "comment_text": "I was having sex with my wife last night when things started to get a little wild.\n\nSuddenly she yelled out, \"Steve, get you dick out of my ass!\"\n\nI told her, \"Just try to relax, babe.  I think you might actually like this.\"\n\n-\n\nShe said, \"What the hell is Steve even doing here in the house?\""}, {"comment_author": "CIADarkSauce", "comment_text": "Steve is supposed to be in the stable. Horses aren't supposed to be indoors."}, {"comment_author": "jaMMint", "comment_text": "At the funeral..."}, {"comment_author": "figurative-trash", "comment_text": "He didn’t ask for a big dick? How unorthodox for this sub."}, {"comment_author": "Lapidariest", "comment_text": "Sounds like she could use a big Dickins' cider.   It's always refreshing to get a Big Dickens' cider."}, {"comment_author": "Pitythebackseat1", "comment_text": "She’s mad that it only takes her 1 minute 8 seconds to finish, now."}, {"comment_author": "Acceptable_Stop2361", "comment_text": "Got me beat by an even minute"}, {"comment_author": "anthropomorphicdave", "comment_text": "I was cleaning a lamp and a genie popped out.   He said I could have a great memory of a huge dick.  I can’t remember what I chose."}, {"comment_author": "joey__jojo", "comment_text": "I have a great memory of a huge dick too!   \n\nSadly Chestnut died last year in a freak hail storm."}, {"comment_author": "notverytidy", "comment_text": "Darling I'm working late tonight with my boss....<husband mysteriously orgasms 10mins later>"}, {"comment_author": "Emotional-Gas-9535", "comment_text": "Well something else musta been long too in this story"}, {"comment_author": "Waystation_mom", "comment_text": "0"}, {"comment_author": "jamesbrown2500", "comment_text": "A black man find a lamp, rubs it and a genius comes outside. The genius say:I will give you 3 wishes.\nThe black man think a little and says:First I wanna be white, second I want to be always between women and third I want to work 4 or 5 days each month.\nThe genius snap his fingers and transforms the man into a sanitary napkin."}, {"comment_author": "moleculariant", "comment_text": "It's good, but hear me out: the punchline should be \"I cum in my pants\"."}, {"comment_author": "TownAdministrative61", "comment_text": "🤣🤣🤣"}, {"comment_author": "Judyyymarie", "comment_text": "I was expecting something else lol"}, {"comment_author": "brudzool", "comment_text": "Who is reading your phone over your shoulder long enough to be offended by this NSFW post?  People don't get it."}, {"comment_author": "blakeusa25", "comment_text": "Husband rushes home only to find a note from the wife she had a run over to her bosses house to get some papets...   was bam thank you mam."}]}, {"post_title": "I rented a luxury car and they forgot to get me a driver.", "post_url": "https://www.reddit.com/r/Jokes/comments/1bytd9k/i_rented_a_luxury_car_and_they_forgot_to_get_me_a/", "post_main_text": "All that money and nothing to chauffeur it.", "post_comments": [{"comment_author": "OriginalPenguin94", "comment_text": "I read the headline and thought it was r/TIFU"}, {"comment_author": "notverytidy", "comment_text": "I rented a luxury vehicle. I intended to ride it all through my holiday.\n\nBut apparently buying a woman a drink doesn't make her into a vehicle guaranteeing a ride, and \"renting\" people is illegal.  Or so some guy with a gun and a disco setup on the roof of his car told me."}, {"comment_author": "airscottie", "comment_text": "I guess the real joke isn’t always in the comments"}, {"comment_author": "SeaSignificance8962", "comment_text": "my wife wanted a foriegn covertable for our 20th anniversary .....\n\nso i bought her a ricshaw!"}, {"comment_author": "anon1292023", "comment_text": "Doesn’t make sense. The chauffeur wouldn’t be driving money around, they’d be driving the person who rented the luxury car. \n\nJoke would work better if it was, *“I rented an armored truck to move my lottery jackpot, but the driver didn’t show up. All that money and nothing to chauffeur it”*"}, {"comment_author": "FishEatCorn", "comment_text": "Whooosh"}, {"comment_author": "Phase_Alienated620", "comment_text": "What's the use of buying a luxury car if you can't relax and let someone else drive? But, on the bright side, you've got a nice set of wheels to cruise about in. \n\nTurn on some music, roll down the windows, and enjoy the feeling of being in control of your own destiny on the road. Plus, you've had a funny story to tell about when you were your own chauffeur in a luxury whip."}, {"comment_author": "commeconn", "comment_text": "What the hell is going on here?"}, {"comment_author": "onlyforthisjob", "comment_text": "/r/lostredditors"}, {"comment_author": "16thmission", "comment_text": "Sounds like a 16 yo kid in a rich household trying to flaunt."}, {"comment_author": "SayYesToPenguins", "comment_text": "AI bot wants to show status by usurping control of your Tesla's electric windows and music system, and wants a completely different bit of software to do the driving"}, {"comment_author": "Cold_Table8497", "comment_text": "Ikr. He didn't even buy it. It's just a rental."}, {"comment_author": "Technical-Choice-678", "comment_text": "r/iagree"}, {"comment_author": "anon1292023", "comment_text": "r/iliketurtles"}]}, {"post_title": "Helpful tips for a safe eclipse viewing experience", "post_url": "https://www.reddit.com/r/Jokes/comments/1bythji/helpful_tips_for_a_safe_eclipse_viewing_experience/", "post_main_text": "Found this on Twitter shared by someone who found it on Facebook as a screenshot of text. Those aren’t allowed here so, I've retyped the text. Credit to whoever came up with it:\n\n**Helpful tips for a safe eclipse viewing experience:**\n* The people of Tennessee may have the best view but will also be the first to be sacrificed.\n* Animals may behave strangely. If your dog speaks like a man heed its dire warning.\n* Don't trust the squirrel with the child's face. It speaks only lies.\n* When your double arrives, resist the inclination to fight it. It may be stronger than you. Chances are it will disappear after the eclipse. Be careful it doesn't switch places, it will be a few decades before you get the chance to come back.\n* If you stare into the void, and it blinks first, you win. But the prize is insanity.\n* Werewolves are not only impossible to kill during an eclipse, they become SUPER WEREWOLVES.\n* Whatever you do don't buy any weird plants, we don't want a repeat of last time.\n* Apophis, the Moon Serpent, may try to eat you. Let him.\n* If once upon a time you were falling in love, but now your only falling apart, there's nothing you can do. This a different type of eclipse.", "post_comments": [{"comment_author": "fattonydaaxe", "comment_text": "These super werewolves, do they wear capes and tights? How do you even go about putting tights on a werewolf?"}, {"comment_author": "ToneDef2525", "comment_text": "Just like anyone else, one leg at a time."}, {"comment_author": "Blue_foot", "comment_text": "I’d like to meet his tailor!"}, {"comment_author": "fattonydaaxe", "comment_text": "But whose leg?!?"}, {"comment_author": "sha_doobie", "comment_text": "And have a piña colada with him at Trader Vic's"}, {"comment_author": "fattonydaaxe", "comment_text": "Stay away from him, he’ll rip your lungs out Jim."}, {"comment_author": "notverytidy", "comment_text": "> Whatever you do don't buy any weird plants, we don't want a repeat of last time.\n\nhttps://youtu.be/E0MklanXNTY?t=28"}, {"comment_author": "Cefour_Leight", "comment_text": "Aww, and here I was, [expecting triffids](https://youtu.be/Lrin0N8r1Ls)"}, {"comment_author": "Phase_Alienated620", "comment_text": "I'm just going to watch the eclipse and keep my dog safe from any strange squirrels. Who knew eclipses had such dramatic side effects? \n\nAnd don't get me started on the SUPER WEREWOLVES! 😂 Thank you for sharing, and let's hope none of us end up exchanging places with our doubles or fighting Moon Serpents."}, {"comment_author": "JeanMorel", "comment_text": "Loved the *Total Eclipse of the Heart* reference at the end 😂"}, {"comment_author": "RutCry", "comment_text": "It’s why Winchester Ballistic Silvertips are known as werewolf killers.  Check your States game laws for werewolf bag limits."}, {"comment_author": "Callsign_Crush", "comment_text": "Can you give me an idea of what weird plants to avoid? It's a bit vague."}, {"comment_author": "lurkandpounce", "comment_text": "Any named Audrey would be a good start!"}, {"comment_author": "SolarPanel19", "comment_text": "Triffids"}, {"comment_author": "konkilo", "comment_text": "I live in TN and the instructions are unclear\n\nWhere should the sacrificial queue form?"}, {"comment_author": "JeanMorel", "comment_text": "Right outside Graceland? 🤷‍♂️"}, {"comment_author": "puledrotauren", "comment_text": "I live in the path I'll watch it online tomorrow"}, {"comment_author": "bobisinthehouse", "comment_text": "If your double shows up naked DO NOT HAVE SEX WITH IT!!   Got fooled the last time!!"}, {"comment_author": "jurassickayak", "comment_text": "Remember what Senex said to his son in a Funny Thing Happened on the way to the Forum: A word of advice: never fall in love during a total eclipse."}]}, {"post_title": "A traveling salesman finds himself in an elevator. While he's all alone, he rips a huge stinking fart. He quickly opens his sales briefcase and takes out a can of air-freshener and give it a few squirts.", "post_url": "https://www.reddit.com/r/Jokes/comments/1byvem0/a_traveling_salesman_finds_himself_in_an_elevator/", "post_main_text": "\n\n\n\nA few moments later a beautiful woman enters the elevator, visibly disturbed by the strong smell.\n\n\n\n\"Smells nice doesn't it? It's a special blend of pinewood\" Says the salesman.\n\n\n\nThe woman looks at him with disgust and says \"It smells like someone just shit out a Christmas tree\"", "post_comments": [{"comment_author": "argon40fromk40", "comment_text": "I got to laugh once today. Thankee Sai!"}, {"comment_author": "wigzell78", "comment_text": "It's like those car air fresheners, with scents like forest or tropical, so it makes it smell like someone farted at the beach."}, {"comment_author": "ItzakPearlJam", "comment_text": "He could've used an orange scented spray. Then it'd smell like shitrus."}, {"comment_author": "gthrees", "comment_text": "Is this like a third grade fart joke"}, {"comment_author": "HouseCravenRaw", "comment_text": "[Mrs. Brown's Boys did this joke](https://www.youtube.com/watch?v=tjJc8xLYhak), except it was in a kitchen and an air freshener.  Something about having a curry earlier that didn't sit well."}, {"comment_author": "Make_the_music_stop", "comment_text": "The whole programme does not sit well. Avoid it."}, {"comment_author": "ccoakley", "comment_text": "We had an orange scented spray at my first job out of college. We called that “shitrus.”"}, {"comment_author": "Paqueo2", "comment_text": "Thank you!! I fucking laughed out loud"}, {"comment_author": "Muagh", "comment_text": "Stinking amazing"}]}, {"post_title": "A young man comes to the confessional: \"Forgive me father, I have sinned. I was with a woman of dubious morals.\"", "post_url": "https://www.reddit.com/r/Jokes/comments/1by3dih/a_young_man_comes_to_the_confessional_forgive_me/", "post_main_text": "The pastor asks, \"Is that you, Jimmy?\"  \n\"Yes, it is I, father.\"  \n\"And who was this woman you talk about?\"  \n\"I can't tell you that, father. I wouldn't want to sully her name.\"  \n\"I'll find out sooner or later, so it doesn't matter if you tell me now. Was it that girl Kathy Miller?\"  \n\"I mustn't say.\"  \n\"It was Mary Smith, wasn't it?\"  \n\"I am not telling.\"  \n\"Sally Rogers?\"  \n\"I will be silent as a grave.\"  \n\"How about Betty Teller, then?\"  \n\"Father, do not ask, I won't betray her.\"  \n\"Then it must have been Peggy Jones?\"  \n\"Please, father, I vowed to remain silent.\"  \nThe priest sighs reluctantly. \"You truly are determined, Jimmy. I almost have to admire you. But you have sinned and you have to do penance for it. You are not allowed to show your face in this church for three weeks! Now go in peace.\"  \nJimmy returns to his bench where his best friend greets him. \"Well, how was it?\"  \n\"Great!\"  \n\"What did you get?\"  \n\"Three weeks of vacation and five good tips.\"", "post_comments": [{"comment_author": "fathompin", "comment_text": "Reminds me of the documentary about the Kinsey Reports;  two scholarly books on human sexual behavior, in the Human Male (1948) and Sexual Behavior in the Human Female (1953).\n\nThe documentary said college-age boys would hang around outside the survey room to take note of which girls stayed longer to fill out the extended version of the survey that was given only to those girls who responded on the short survey that they were sexually active.   Good times back then,"}, {"comment_author": "waldemar_selig", "comment_text": "Reminds me of Clerks \"Hey try not to suck any dick on your way out of the parking lot!\""}, {"comment_author": "maybeonmars", "comment_text": "In school we always hung out with the chicks that smoked... cos ya know, if she smokes she pokes"}, {"comment_author": "tjmin", "comment_text": "On the other hand, the Kinsey Reports also established and detailed the spectrum of sexual orientation that we all accept now, by 1953, the year before I was born. Nothing in that report has ever been refuted with evidence. And yet here we are, on the brink of an election -- if that is the word -- that could take us back, not only to the 1950s, but to the 500s. This is exactly why I HATE morons."}, {"comment_author": "Few-Entertainer3879", "comment_text": "Lucky for you I just moved your response counter from 666 to 667.\nYou're welcome 🤗"}, {"comment_author": "JanusDuo", "comment_text": "Kinsey was a paedophile and these studies involved adults giving kids orgasms. Science is not above morality. The times they weren't actually so good."}, {"comment_author": "royphotog", "comment_text": "\"My girlfriend sucked 37 dicks\". \"in a row\" ?"}, {"comment_author": "wemustkungfufight", "comment_text": "\"My girlfriend sucked 27 dicks!\"  \n\"In a row?\""}, {"comment_author": "BrockJonesPI", "comment_text": "Hey! Get back here!"}, {"comment_author": "joe-from-illawong", "comment_text": "Hey! Hey you! Get back here!"}, {"comment_author": "LawyerJC", "comment_text": "God, that movie is so overrated. There’s **one** line everyone talks about and that’s it."}, {"comment_author": "StrikingExcitement79", "comment_text": "Some likes chicks that pokes. Some likes chicks that will get poked."}, {"comment_author": "fathompin", "comment_text": "Greetings fellow 69er and \"moron\" loather."}, {"comment_author": "fathompin", "comment_text": "Thanks, I'm located on the total eclipse path, and that number would be so ominous to be associated with. /s"}, {"comment_author": "alphajm263", "comment_text": "Who said they were good times?"}, {"comment_author": "rdcl89", "comment_text": "You are a liar"}, {"comment_author": "lo-sho", "comment_text": "This is a lie."}, {"comment_author": "idk_whatever_69", "comment_text": "Amateur, Grant from college humor did 50. And yes in a row."}, {"comment_author": "Mangosta007", "comment_text": "Line 'em up and make like a circus seal."}, {"comment_author": "TinIsAlreadyTaken", "comment_text": "37"}, {"comment_author": "banana_buddy", "comment_text": "Our girlfriend, FTFY"}, {"comment_author": "Boost_Moose_Deux", "comment_text": "I wasn't even supposed to *be* here today!"}, {"comment_author": "ShriekinWatcher", "comment_text": "Is it, “This job would be great if it weren’t for the fucking customers.” ?"}, {"comment_author": "Knave7575", "comment_text": "“Your ruse mam, your cunning attempt to deceive me”"}, {"comment_author": "Inevitable-Tank3463", "comment_text": "You must have sucked in high school"}, {"comment_author": "TurbulentWeb1941", "comment_text": "\"My God I think I can see her kidneys\""}, {"comment_author": "HeavySomewhere4412", "comment_text": "Get my drink on\n\nAnd my smoke on\n\nAnd go home with something to poke on. (Wha'sup bitch?)"}, {"comment_author": "fathompin", "comment_text": "I did in my comment about how boys figured out how to take note of who the \"bad\" girls were.  Seemed to me that kind of activity, with the anticipation and all, was a lot of fun.  Like Flounder would think in the movie Animal House."}, {"comment_author": "joey__jojo", "comment_text": "I always said those college humor guys sucked dick.  \n\nNow I know why it was at so many things, because of all the practice."}, {"comment_author": "Warren_E_Cheezburger", "comment_text": "Um, actually, in “True Facts About Grant O’Brien 2”, Brennan’s character is introduced as someone named after the number of people Grant performed oral sex on in one night; NOT specifically the number of people granted *blew* in one night. It’s possible any number of those 50 were women he ate out."}, {"comment_author": "BeneficialEvidence6", "comment_text": "In a row?"}, {"comment_author": "LawyerJC", "comment_text": "I sucked less than that stupid movie and the neckbeards who praise it.\n\n*looking at U/inevitable-tank3463*"}, {"comment_author": "Heavy_Ape", "comment_text": "You Know, There's A Million Fine Looking Women In The World, Dude. But They Don't All Bring You Lasagna At Work."}, {"comment_author": "idk_whatever_69", "comment_text": "He's talked about it a number of times and has referred to those people as \"guys\" and has said that he has \"sucked 50 dicks\"."}, {"comment_author": "thirty7inarow", "comment_text": "Yep."}, {"comment_author": "Sea_Eagle_Bevo", "comment_text": "Blasphemy..."}, {"comment_author": "johnathandoe03", "comment_text": "Ya know what, I've never even seen whatever movie you're talking about. But I just want to say, your username definitely checks out... because only a lawyer would be this huge a prick."}, {"comment_author": "Otisburg", "comment_text": "Most of them just cheat on you."}, {"comment_author": "Sammeeeeeee", "comment_text": "27?"}, {"comment_author": "LawyerJC", "comment_text": "Go call your mom and tell her about this comment, nerd. *Mom! And then I wrote…!*"}, {"comment_author": "OjaiMark", "comment_text": "So, was it 27 separate snowballs, or just one big one at the end?"}, {"comment_author": "nickllhill", "comment_text": "36 I counted them myself!"}, {"comment_author": "hnish", "comment_text": "funny, i once got behind a glory hole and ALSO got 3 weeks of vacation and 5 good tips!"}, {"comment_author": "Kylynara", "comment_text": "How many bad tips?"}, {"comment_author": "joey__jojo", "comment_text": "This guy knows well that you don't find glory on the first try."}, {"comment_author": "halite001", "comment_text": "I wouldn't say bad, but some tips were definitely cheesy."}, {"comment_author": "Kylynara", "comment_text": "Not a guy. Know how shit guys can be at sex."}, {"comment_author": "joey__jojo", "comment_text": "And here I thought the internet could never boost my confidence."}, {"comment_author": "Nice-Care8561", "comment_text": "I've heard this one with a different punch line: \"Five Hail Marys, four Our Fathers, and three good leads.\""}, {"comment_author": "TacticalGarand44", "comment_text": "Ha! I love it!"}, {"comment_author": "skribsbb", "comment_text": "The changes from the original version make this not make sense at all."}, {"comment_author": "Educational-Tale7176", "comment_text": "And that's how Reddit works!"}, {"comment_author": "Charmedrose74", "comment_text": "What’s the original version?"}, {"comment_author": "PurposeSensitive9624", "comment_text": "It makes complete sense?"}, {"comment_author": "ObtuseBug", "comment_text": "But it is new!\n\n435v-a!"}, {"comment_author": "appocomaster", "comment_text": "I've never heard the altar boy version linked before - not sure what the bit which doesn't make sense is? The holiday is that you don't have to attend church, and the leads goes without saying.  \n\n\nI've heard it as a married woman that they've been with rather than it being an altar boy (which, whilst there's no maximum limit, are generally suggested to be younger)."}, {"comment_author": "GoldenMegaStaff", "comment_text": "Parochus interrogat: \"Estne tu, Jimmy?\"\n\nEgo sum, pater.\n\n\"Et quae fuit ista mulier narras?\"\n\n\"Non possum dicere tibi, pater. Nolo nomen eius polluere.\"\n\n\"Reperio citius aut serius, non refert si nunc dicas. Eratne illa puella Kathy Miller?\"\n\n\"Non oportet dicere.\"\n\n\"Maria Smith, annon?\"\n\n\"Nescio.\"\n\n\"Sally Rogers?\"\n\n\"Ut sepulchrum silebo.\"\n\n\"Quomodo ergo de Anna Teller?\"\n\n\"Pater, non peto, non prodo.\"\n\n\"Tunc debet esse Peggy Jones?\"\n\n\" Quaeso, pater, silere vovi.\"\n\nSacerdos invitus suspirat. \"Vere enira, Jimmy. Paene habeo te admirari. Sed peccasti et habes poenitentiam. Non licet tibi ostendere faciem tuam in hac ecclesia per tres septimanas! Nunc vade in pace.\"\n\nJimmy ad scamnum suum redit ubi amicus optimus eum salutat. \"Quid ergo?\"\n\n\"Magna!\"\n\n\"Quid habebatis?\"\n\n\"Tres feriarum septimanas et quinque bonas apices."}, {"comment_author": "Paladin_Tyrael", "comment_text": "The young man in the joke was an altar boy, so he didn't have a whole lot of leeway to just not come into church lf his own volition."}, {"comment_author": "Jasong222", "comment_text": "The difference I remember was that the guy had sinned with 'sex before marriage'. But the joke basically follows the same structure  \n \nEdit: like this: https://www.reddit.com/r/Jokes/comments/92gvya/little_johnny_goes_to_confession/?utm_source=share&utm_medium=mweb3x&utm_name=mweb3xcss&utm_term=1&utm_content=share_button \n  \n  \nOr this one:  https://www.reddit.com/r/Jokes/comments/31wg4u/an_italian_boys_confession/?utm_source=share&utm_medium=mweb3x&utm_name=mweb3xcss&utm_term=1&utm_content=share_button"}, {"comment_author": "JudgeHodorMD", "comment_text": "I think the pastor’s wife or daughter"}, {"comment_author": "big_guyforyou", "comment_text": "Guy walks into a bar. Bartender says, \"I am a priest, and you most atone from your sins.\"\n\nThe guy atones and leaves. He doesn't buy a drink because alcohol is a sin."}, {"comment_author": "skribsbb", "comment_text": "I don't remember it exactly, but I remember it making more sense.  Some problems with this one:\n\n* The pastor is naming girls, not the guy.  So the pastor would already think they're slutty and wouldn't need their names.\n* The man said he was with \"a person\" and the pastor got 5 \"leads\".  In the original version, the man was with 3 women and named them all.\n* Banishment from the church for 3 weeks is not a punishment I've heard of.  It's usually a prayer they have to say or some other penance.  \n* Banning 1 person from the church wouldn't give 3 weeks vacation, unless that was the only parishioner.  Which is another reason this makes the joke worse."}, {"comment_author": "thealthor", "comment_text": "Right, what is he talking about?"}, {"comment_author": "rickey77", "comment_text": "Amen"}, {"comment_author": "lawndartgoalie", "comment_text": "I think that was in Paul's letter to the Roman's."}, {"comment_author": "DreamyTomato", "comment_text": "Fascinating reading your translation and picking out the different words that have passed down into modern languages. \n\nI don’t know Latin but I know English, technical / science English, French, a bit of Spanish and I keep recognising words in these different languages. Plus a bit of German and Italian too. \n\nIt’s like reading a jumble of languages mashed up together. (I know that’s backwards but it’s the effect it has on me)"}, {"comment_author": "WhatthehellSusan", "comment_text": "~~Romanes eunt domus~~ Romani ite domum"}, {"comment_author": "Xelid47", "comment_text": "?? Difference?"}, {"comment_author": "megapenguin88", "comment_text": "Jokes on you, I cant read Spanish."}, {"comment_author": "Sarke1", "comment_text": "###ROMANES\n\n###EUNT\n\n###DOMUS!"}, {"comment_author": "DavidRobertJones88", "comment_text": "You are amazing"}, {"comment_author": "Rogne98", "comment_text": "podicem futuendum meum seorsum ridens"}, {"comment_author": "JimJimmery", "comment_text": "I mean...I wish I had more upvotes to give."}, {"comment_author": "t53deletion", "comment_text": "Nice."}, {"comment_author": "Coinsworthy", "comment_text": "Ridens magna!"}, {"comment_author": "BuckTravers", "comment_text": "You do and you’ll clean it up!"}, {"comment_author": "confusedandworried76", "comment_text": "He gets the typical Catholic penances of saying Hail Marys."}, {"comment_author": "quajdejtari", "comment_text": "Thanks for the links to the original posts. I did not know about them and only posted the joke as it was told to me (the fact that it was about an altar boy was omitted, but makes more sense)."}, {"comment_author": "call_jimmy", "comment_text": "Yeah, it doesn't make sense because you got it wrong. The guy is an altar boy, so he get's 3 weeks off of altair service. And the priest is naming the girls, meaning he knows a lot of slutty girls, and the boy says to his friend that he got a few leads. \n\nBut I kinda get the confusion, this version is poorly written."}, {"comment_author": "PurposeSensitive9624", "comment_text": "I dont get it. It’s completely fine for me"}, {"comment_author": "DudeManBroGuyski", "comment_text": "Lol"}, {"comment_author": "MoonHead127", "comment_text": "Hahahaha dude."}, {"comment_author": "A110_Renault", "comment_text": "Close. It was in his lesser known letter to Trojans"}, {"comment_author": "Pkrudeboy", "comment_text": "A Woman?"}, {"comment_author": "mrgoobster", "comment_text": "It's not good Latin, so don't read into it too much."}, {"comment_author": "MaximusMeridiusX", "comment_text": "The difference is that they put it into google translate lol"}, {"comment_author": "Asleep_Lock6158", "comment_text": "Is that supposed to say 'Romans go home!'?  :-P"}, {"comment_author": "SwimmingExtreme1465", "comment_text": "Romani ite domum!"}, {"comment_author": "MaharajaMack", "comment_text": "Gesundheit"}, {"comment_author": "Jasong222", "comment_text": "Oh nothing against you, but yeah, it's a classic."}, {"comment_author": "skribsbb", "comment_text": "Oh, I see it now.  So it's a flip from the other one."}, {"comment_author": "brother_of_menelaus", "comment_text": "Yeah it’s poorly written, if you’re reading quickly it’s not entirely clear who is saying what, especially at the end. The impact of cutting the joke off in the title and then starting at “the pastor” in the body also has the effect of making it seem like the pastor is the main character in the joke, adding to the confusion. It also isn’t stated that the kid is an altar boy, so the vacation line comes out of nowhere"}, {"comment_author": "DreamyTomato", "comment_text": "I can tell :) the tenses and word agreement seem all wrong. Not that I could do any better in a non-native language."}, {"comment_author": "GoldenMegaStaff", "comment_text": "Not possible; google translate wasn't around during the Roman Empire."}, {"comment_author": "texaschair", "comment_text": "*(Holds knife to Brian's throat)* \"Now conjugate the verb!\""}, {"comment_author": "Nuada-oz", "comment_text": "Now write it out one hundred times!"}, {"comment_author": "ES_FTrader", "comment_text": "Loose lips sink ships"}, {"comment_author": "certified-fumbler", "comment_text": "Hold up! How does the Priest know so many women of dubious morals?"}, {"comment_author": "Jellodyne", "comment_text": "He hears confessions, so it's possible he's getting the word right from the whoreses mouths."}, {"comment_author": "Redbeard4006", "comment_text": "I would assume from taking their confessions."}, {"comment_author": "darth_voidptr", "comment_text": "He talks to a lot of young boys."}, {"comment_author": "Few-Entertainer3879", "comment_text": "Because they turned him down he sullies them. 🤣"}, {"comment_author": "gerrineer", "comment_text": "I now see gollum saying whoreses...yes I get the pun"}, {"comment_author": "certified-fumbler", "comment_text": "Well,that's a good one.I guess thats why he knows them whorely."}, {"comment_author": "allegedlytheostrich", "comment_text": "Is it the same whoreses that put theirs fingers ups my bums?"}, {"comment_author": "speeler21", "comment_text": ">whoreses \n\nSometimes the most precious rings are the ones you meet along the way"}, {"comment_author": "ExaminationSoft9839", "comment_text": "And sometimes not\n\n#ringworm"}, {"comment_author": "Firesonallcylinders", "comment_text": "Dave Allen is proud. 😁"}, {"comment_author": "Randyeshow", "comment_text": "Best confessional joke I’ve ever heard. Reminds me of another one I can’t remember."}, {"comment_author": "Asleep_Lock6158", "comment_text": "Here is a short but good one:  A young man is at confession.  \"Father, forgive me, for I have sinned.\"  \"It's good that you confess this, my son.  What was the nature of your sin?\"  \"Impure thoughts, Father.\"  \"I see.  I must ask - were any of these thoughts of a homosexual nature?\"  \"No, Father.  They were of girls.\"  (Pause)  \"Next!\""}, {"comment_author": "InfiniteCommercial72", "comment_text": "The best involves the boy and the closet getting paid for the baseball glove"}, {"comment_author": "Acrobatic_Jelly4793", "comment_text": "I don’t get it"}, {"comment_author": "InsidiousColossus", "comment_text": "The boy was actually happy that he didn't have to go to church for 3 weeks.  And the priest gave him the names of 5 girls who were of dubious morals, so he had a good chance with them."}, {"comment_author": "Acrobatic_Jelly4793", "comment_text": "Ohhh; I see.  \nOkay that’s funny"}, {"comment_author": "monalisa_jones", "comment_text": "Plot twist: All of those women had confessed to being with the young man. XD"}, {"comment_author": "ChemicalMention9002", "comment_text": "I remember my grandpa telling this joke just before he passed, was good to see it pop up. Had a laugh"}, {"comment_author": "yourdaddz-Abel", "comment_text": "That was smart."}, {"comment_author": "Key_Recover9608", "comment_text": "Define ,\"dubious morals?\""}, {"comment_author": "JohnLockwood", "comment_text": "Awesome."}, {"comment_author": "Such_Arrival2519", "comment_text": "🤣🤣🤣🤣"}, {"comment_author": "simagus", "comment_text": "sweet"}, {"comment_author": "KoopaNooba", "comment_text": "Hi! Welcome to r/jokes, you must be new here!"}, {"comment_author": "est1-9-8-4", "comment_text": "A priest wouldn’t ask for your name. It is inconsequential. In fact most confessions occur face to face. Using the screen is from a bygone era but that is seldom implimented. A priest also wouldn’t break seal of confession as it is grounds for being defrocked. Priest would in fact make you go to church more not less. Catholics are expected to go to mass once a week on a Sunday (similar to Jewish practice of sabbath that’s on Friday). Also priest wouldn’t care who you sinned with as it is your confession not the other party. I would give this joke 3/10. One point for trying, another point for acceptable grammar and punctuation, last point for not being overly offensive just misinformed."}]}, {"post_title": "my wife said she was tired of me pretending to be an 80s action movie star and that we should split up", "post_url": "https://www.reddit.com/r/Jokes/comments/1byvvo5/my_wife_said_she_was_tired_of_me_pretending_to_be/", "post_main_text": "I said good idea, much more likely to catch the bad guys", "post_comments": [{"comment_author": "_Damitol", "comment_text": "Should have said, “I’ll be back”."}, {"comment_author": "Imaginary_Coat441", "comment_text": "Nah to hell with her.. \n\nHasta la vista baby!"}, {"comment_author": "Heerrnn", "comment_text": "You wanna *split* up? Then *get to tha chopper!*"}, {"comment_author": "SaulgoodeXL", "comment_text": "\"We'll cover more ground that way!\"\n\n\nOr\n\n\n\"Good idea! I'll take the front, you go round the back!\""}, {"comment_author": "CreditBrunch", "comment_text": "She’s blaming you, cause you’re the fall guy."}, {"comment_author": "Malalang", "comment_text": "Maybe she had a problem with your Miami Vices"}, {"comment_author": "AllPinkInside95", "comment_text": "Bad boys bad boys, whatcha gonna do"}, {"comment_author": "Wil420b", "comment_text": "That's '90s."}, {"comment_author": "ElectronicAd27", "comment_text": "I don’t get it🤷‍♂️"}, {"comment_author": "Avser", "comment_text": "Hes so in charactor that he thinks she meant split up as in to cover more ground when srarching for the bad guus. She really meant as in divorce though."}, {"comment_author": "ElectronicAd27", "comment_text": "Thanks."}]}, {"post_title": "The old church needed a fresh coat of paint", "post_url": "https://www.reddit.com/r/Jokes/comments/1byd0cd/the_old_church_needed_a_fresh_coat_of_paint/", "post_main_text": "But money was tight in the budget, so the pastor figured he would save a few bucks by only buying about half the paint that was needed and thinning it out with turpentine to make it go farther. So he did this, and the next Saturday the entire congregation gathered to help paint the church. \n\nThey worked all day, from dawn til dusk, and when they were finished the church had a beautiful fresh coat of paint. But just as they were packing up to go home, storm clouds suddenly rolled in, and a torrential downpour began. The rain washed all of the thinned paint off the church's walls, undoing their whole day's work.\n\nAnd a mighty voice boomed down from the heavens: \"REPAINT... and thin no more!!\"", "post_comments": [{"comment_author": "JudgeJoeDean24", "comment_text": "Mike Tyson is God?"}, {"comment_author": "mordecai98", "comment_text": "Yeth he ith."}, {"comment_author": "__meeseeks__", "comment_text": "Everybody's God until they get punched in the face"}, {"comment_author": "fireinmyeyes69", "comment_text": "Wirhout this rib I wouldn't have gotten the punchline lol"}, {"comment_author": "lawnGnom3MMM", "comment_text": "So fuckin funny"}, {"comment_author": "PhoMNtor", "comment_text": "Someone who says words can hurt as much as punches has never been punched in the face."}, {"comment_author": "joey__jojo", "comment_text": "God is not going to thend thomeone to hell for my misthakes. Thaths why I never make them with your fathe."}, {"comment_author": "Dranask", "comment_text": "LOL"}, {"comment_author": "questfornewlearning", "comment_text": "oh god! older than old… good ole #-100"}]}, {"post_title": "Damn girl, are you a math book?", "post_url": "https://www.reddit.com/r/Jokes/comments/1bymdxn/damn_girl_are_you_a_math_book/", "post_main_text": "Because you have a lot of problems surrounding your \"x\".", "post_comments": [{"comment_author": "Imaginary_Coat441", "comment_text": "Sounds like He's just not integer."}, {"comment_author": "up_the_dubs", "comment_text": "I think she's the square root of -1"}, {"comment_author": "PepeAwesome", "comment_text": "Damn, girl, are 2n+1? Because I can't even with you."}, {"comment_author": "Spitdinner", "comment_text": "That’s a pretty sick burn tbh"}, {"comment_author": "FerroMancer", "comment_text": "“‘Cause I would love to help you *sin*.  Don’t ask *y*.   Just *cos*.”"}, {"comment_author": "Kat121", "comment_text": "Maybe in a sec"}, {"comment_author": "OrangeDit", "comment_text": "Nice tan"}, {"comment_author": "FatherD00m", "comment_text": "Don’t be obtuse."}, {"comment_author": "Lily_Selene_Jackson", "comment_text": "because I want to cry myself to sleep after slamming you down and failing to solve any of your problems"}, {"comment_author": "ChaseShiny", "comment_text": "You are clearly x/x, x≠0. You're definitely the 1, and I'm not over you."}, {"comment_author": "BinaryBlitzer", "comment_text": "Damn girl, I am the math book, coz I'm hard."}, {"comment_author": "cumtothedarkside69", "comment_text": "I was so sure the answer would be \"because I don't understand you\" 😂"}, {"comment_author": "wigzell78", "comment_text": "Because you make things hard and I like to slam you on the desk."}, {"comment_author": "spicynicho", "comment_text": "Cos i left this station at 5pm travelling 50km/h and you left your station at 3pm travelling 70km/h and I'm really horny"}, {"comment_author": "I0I0I0I", "comment_text": "\"But check out my asymptote!\""}, {"comment_author": "SkitzoRabbit", "comment_text": "Because all the answers are in the back?"}, {"comment_author": "Mission_Estate_6384", "comment_text": "The square root of 69 is 8 something i thought."}, {"comment_author": "dikinyoazz", "comment_text": "Lol. Boo."}, {"comment_author": "Worried-Session-4437", "comment_text": "You need remedial help cause you ain't anywhere close to getting to the \"O\" in any math problem in this book..."}, {"comment_author": "jtrades69", "comment_text": "?"}]}, {"post_title": "A boy asks his father, \"Can you tell me what a solar eclipse is?\"", "post_url": "https://www.reddit.com/r/Jokes/comments/1byz9qf/a_boy_asks_his_father_can_you_tell_me_what_a/", "post_main_text": "\"No, son.\"", "post_comments": [{"comment_author": "woodquest", "comment_text": "This one is kind of fonny"}, {"comment_author": "SirOleopanza", "comment_text": "Not a bright one..."}]}, {"post_title": "Odd day at the doctors office.", "post_url": "https://www.reddit.com/r/Jokes/comments/1byxxa6/odd_day_at_the_doctors_office/", "post_main_text": "Went to the doctors office the other day and as im sitting there I'm just kind of looking around reading the crap that they sometimes have on the walls. When the doctor came in, he told me to disrobe. Hesitantly, I did as he asked and then took a seat back on the exam table. He grabbed my testicle and told me to turn my head and cough and when I tried to protest he told me \"I'm the doctor, just do as I say!\" So I did and he continued his examination. Then he told me to assume the stance and bed over. Again, I tried to protest, but he stopped me and said \"Damn it, im the DOCTOR, do as I say!\" So, hesitantly, I did as he asked... after everything was done and over, I went out to my car and called my girlfriend to tell her what happened. Her only response was \"JESUS JERRY, WE REALLY NEED TO GET YOU A NEW DENTIST!\"", "post_comments": []}, {"post_title": "Why do melons get married in church?", "post_url": "https://www.reddit.com/r/Jokes/comments/1byyhsw/why_do_melons_get_married_in_church/", "post_main_text": "Because they cantaloupe.", "post_comments": [{"comment_author": "Amandasch44", "comment_text": "what would your Honeydew if they Cantaloupe?"}]}, {"post_title": "Two lawyers walk into a restaurant", "post_url": "https://www.reddit.com/r/Jokes/comments/1by1jb8/two_lawyers_walk_into_a_restaurant/", "post_main_text": "Two lawyers walk into a restaurant, sit down at a table, order a coffee and pull out sandwiches from their suitcases. An angry waitress approaches them, exclaiming \"Excuse me, you can't eat your own food here!\" The lawyers look at her, then at each other and exchange the sandwiches.", "post_comments": [{"comment_author": "Make_the_music_stop", "comment_text": "A lawyer woke up in the hospital after surgery. \nHe asked, “Why are all the blinds drawn in here?” The nurse answered, “There’s a huge fire across the street and we didn’t want you to think the operation had been a failure.”"}, {"comment_author": "No_Good_Cowboy", "comment_text": "The grim reaper walks into a lawyers office and says to the lawyer \n\n\"Your time's up, I'm taking you to the afterlife\"  \n\nThe lawyer responds,\n\n\"That can't be!  I'm so young, I must have much more time on earth. \"\n\nThe grim reaper sighs and says,\n\n\"Yeah? Well, according to your billable hours, you're 104\""}, {"comment_author": "cosumel", "comment_text": "God would sue the devil, but he doesn’t have any lawyers."}, {"comment_author": "CnH9588", "comment_text": "I never understood this joke"}, {"comment_author": "Illustrious-Way638", "comment_text": "There's a dead dog and a dead lawyer in the road whats the difference\nThere are skid marks infront of the dog"}, {"comment_author": "Make_the_music_stop", "comment_text": "Any religious lawyer knows deep down when they die they are going straight to hell."}, {"comment_author": "MeInMass", "comment_text": "I think the joke is that if the operation was a failure the lawyer would die, and end up in hell"}, {"comment_author": "Cystems", "comment_text": "I'll walk you through it.\n\nThere's a fire across the street from the hospital.\n\nHell is described as a place full of fire.\n\nIf the lawyer had seen the fire after waking up, there is a chance they would assume they had died during the operation and gone to hell (because lawyers go to hell). Hence, the staff closed the blinds."}, {"comment_author": "CnH9588", "comment_text": "😂"}, {"comment_author": "classifiedspam", "comment_text": "Because lawyer."}, {"comment_author": "CnH9588", "comment_text": "Thank you but I got it from the first reply on my comment"}, {"comment_author": "More-Introduction-61", "comment_text": "Will you guys please stop bashing lawyers? They're not all bad folk. It's just that 99% of them give the rest a bad name."}, {"comment_author": "grampa47", "comment_text": "Devil wants to sign a deal with a lawyer. \"I will grant you an eternal life in exchange for the souls of your wife, your kids and your parents\" . The lawyer hasitates a moment, than asks: \" OK, sounds good, so where is the catch?\""}, {"comment_author": "gthrees", "comment_text": "brilliant"}, {"comment_author": "Suspicious-gibbon", "comment_text": "…as they are eating, a man comes in to rob the place. He goes from table to table, and as he reaches the lawyers’ table, the first one reaches into his wallet. He passes the cash to the other lawyer. “Here’s the $1000 I owe you.”"}, {"comment_author": "Much-Resource-5054", "comment_text": "This is amazing"}, {"comment_author": "GuairdeanBeatha", "comment_text": "There are only two types of lawyers. Lying snakes, and mine."}, {"comment_author": "Major_Magazine8597", "comment_text": "\"Alright, men.   Time to change underwear.    Frank - you change with Bob ...\""}, {"comment_author": "leegunter", "comment_text": "'Ol #112, a personal favorite."}, {"comment_author": "figurative-trash", "comment_text": "Lovely male bonding experience"}, {"comment_author": "superdago", "comment_text": "As a lawyer, I appreciate that this sub has been posting some new lawyer jokes lately."}, {"comment_author": "Interesting_Role1201", "comment_text": "Why did the lawyer cross the road? \n\n>!I'd tell you but that'd be speculation.!<"}, {"comment_author": "boblamb58", "comment_text": "Leave it to the lawyers to find the loophole."}, {"comment_author": "Valuable-Paramedic93", "comment_text": "Lawyer ...liar ... difference is only in the pronunciation ...."}, {"comment_author": "Kylynara", "comment_text": "And spelling."}, {"comment_author": "Cold_Table8497", "comment_text": "and the occupat- oh wait."}, {"comment_author": "Finwolven", "comment_text": "Well yes, one is a bloviating ex-President, the other is defending him in court and not getting paid."}, {"comment_author": "Acrobatic-Eye-2971", "comment_text": "The real joke is always in the replies to the comments"}, {"comment_author": "dcmfox", "comment_text": "Order something or choose not to"}, {"comment_author": "PelmickJones", "comment_text": "Cw"}, {"comment_author": "Illustrious-Way638", "comment_text": "What do you call a million dead lawyers at the bottom of the ocean ?\nA good start!"}, {"comment_author": "NewGuy-1964", "comment_text": "The manager walks over with a smile for the waitress and says, \"I got this,\" and starts asking legal questions. The lawyers answer readily. As they're getting ready to leave, one of the lawyers mentions that the manager will get their bill. The manager smiles and says, \"I don't think so. You walk in, sit down, and use my table without paying for it, so I'm going to use your legal knowledge without paying for it either. I think I got the better end of the deal. Enjoy the rest of your day.\""}, {"comment_author": "pocklerahole", "comment_text": "Dumb"}, {"comment_author": "NewGuy-1964", "comment_text": "It sounds like I might need to explain it in little itty bitty words so you can understand it."}, {"comment_author": "pocklerahole", "comment_text": "I doubt you explaining it will make it any less stupid"}, {"comment_author": "ShadownetZero", "comment_text": "No, it was just a bad joke."}, {"comment_author": "joey__jojo", "comment_text": "No you're just bad at communicating.\n\nProbably a genetic condition.  Your entire family is just genetically uncool, it's permanently in your DNA.  You can't change it so it's not your fault.\n\nIt's this guy that's the asshole for not accepting that your lameness is genetic.  And not realizing what it's like to have been born into a whole family that is lame.  And the pain you go through each day knowing that women don't want to love you, because then their children would be born lame with your families terrible disease.\n\nI will pray for you."}, {"comment_author": "NewGuy-1964", "comment_text": "Aw. Aren't you special?"}, {"comment_author": "joey__jojo", "comment_text": "No I'm an effective communicator speaking with a genetic loser.  \n\nYou'd be surprised how often this happens!  \n\nMust have a lot of relatives, good for you!"}, {"comment_author": "NewGuy-1964", "comment_text": "It's funny how you think you're so smart and an effective communicator when you know precisely zero about me. And if this is how you communicate, your skills are not what you think they are. I'm half surprised that you know how to spell \"genetic\". But I'm only half surprised, because you probably used a spell checker. But you forgot to use a grammar checker. You can puzzle your little brain trying to figure that one out."}, {"comment_author": "joey__jojo", "comment_text": "You can't help it, it's okay."}, {"comment_author": "NewGuy-1964", "comment_text": "Wow. Such astonishing communication for one so skilled in it. I'm overwhelmed. \n\nBut you bore me. And it's not fair of me to try and have a battle of wits with an unarmed opponent."}, {"comment_author": "joey__jojo", "comment_text": "I am an advocate for lame people having parking passes, and this is the thanks I get."}, {"comment_author": "NewGuy-1964", "comment_text": "Well, if you're bright enough to know the *real* meaning of lame, thank you very much. It does apply, and I do have a parking pass."}, {"comment_author": "joey__jojo", "comment_text": "I'm sure your whole family does.  \n\nIt's probably a serious problem being born that way.  And it's wrong for people to think you could just one day start taking other people seriously and work on yourself.  You can't change the way you are!"}, {"comment_author": "NewGuy-1964", "comment_text": "smh... I'm tired of trying to find mind games with a Neanderthal. Go back to your cave and draw on the walls..."}, {"comment_author": "joey__jojo", "comment_text": "It's not my genetics making this impossible, lamo.\n\nMaybe don't start a game, if you cannot finish a game.  But I was born to smart people, likewise don't have to prove anything to people that cannot write jokes ..... on a joke platform."}, {"comment_author": "NewGuy-1964", "comment_text": "Well, since you and one other guy are the only ones who can't seem to figure it out, it's on you. And it's quite common that the ones who can't comprehend something also can't comprehend that it is on them.\n\nAnd intentionally tearing others down so you can assuage your own lack of self-esteem doesn't say good things about you."}, {"comment_author": "joey__jojo", "comment_text": "Who can't figure out that you're lame?"}, {"comment_author": "NewGuy-1964", "comment_text": "Everyone but you has figured out that I'm not."}, {"comment_author": "joey__jojo", "comment_text": "You mean everyone in your family tells you that you're normal?\n\nBecause you're genetically similar, they're lame too."}, {"comment_author": "NewGuy-1964", "comment_text": "Being an asshole to people online doesn't make you smart. It just makes you an asshole."}, {"comment_author": "joey__jojo", "comment_text": "Imagine being genetically incapable because your parents and ancestors were born that way!  That's gotta be even worse!  \n\nYou deserve that parking spot, like I said!"}, {"comment_author": "NewGuy-1964", "comment_text": "Did you forget to take your meds today? Or are you just always an asshole?"}, {"comment_author": "joey__jojo", "comment_text": "23andMe asking whether it's them or not.\n\nThe jokes just write themselves."}, {"comment_author": "NewGuy-1964", "comment_text": "I genuinely feel sorry for you. Life sucks so bad for you that you have to be such an asshole."}, {"comment_author": "joey__jojo", "comment_text": "Don't worry about this one guys. \n\nIf they get too lame, we'll just put them down outside behind the barn."}, {"comment_author": "Scary_Vanilla2932", "comment_text": "V             . .       \n           .\n@"}]}, {"post_title": "My doctor ordered me to take a blood test...", "post_url": "https://www.reddit.com/r/Jokes/comments/1byzphs/my_doctor_ordered_me_to_take_a_blood_test/", "post_main_text": "I got an A-. Not too bad, if I do say so myself.", "post_comments": []}, {"post_title": "What do you call a freeloading cow", "post_url": "https://www.reddit.com/r/Jokes/comments/1bynaqj/what_do_you_call_a_freeloading_cow/", "post_main_text": "A moocher", "post_comments": [{"comment_author": "Imaginary_Coat441", "comment_text": "Nice. He's milkin it."}, {"comment_author": "OlyScott", "comment_text": "I have no beef with this."}, {"comment_author": "Gramage", "comment_text": "What do you call an interrupting cow?\n\nI dunno wha- MOO"}, {"comment_author": "Funky_uncle-", "comment_text": "Masturbating cows are called beef stokenoff"}, {"comment_author": "Mission_Estate_6384", "comment_text": "I heard he was Stroganoff"}, {"comment_author": "dreyukr", "comment_text": "LOL"}, {"comment_author": "rickpoker", "comment_text": "Ex wife"}, {"comment_author": "timdawg40", "comment_text": "udderly hilarious."}, {"comment_author": "Waitsfornoone", "comment_text": "My mother-in-law."}, {"comment_author": "Even_Mechanic_4686", "comment_text": "Meat loaf"}]}, {"post_title": "A lesson in Marketing ", "post_url": "https://www.reddit.com/r/Jokes/comments/1byhneo/a_lesson_in_marketing/", "post_main_text": "Ran into the guy who played Captain Kirk.  After some small talk he began to tell me of a new business venture.  But it was failing.  I asked why he thought that was.  He said...  \"Well I wanted to assert myself in the business world by shedding the Captain Kirk thing and naming a business after myself.  But I should have avoided the designer clothing industry.\"\n\nReally, I asked?\n\n\"Yes, said the former Sci Fi star... Turns out that nobody wants to buy Shatner Pants\"", "post_comments": [{"comment_author": "Yaguajay", "comment_text": "Perfect when he expands the business into diapers."}, {"comment_author": "justsaguy", "comment_text": "Well, depends…"}, {"comment_author": "cmnorthauthor", "comment_text": "The free home delivery marketing didn’t help matters.\n\nShippin’ Shatner’s Pants"}, {"comment_author": "stpetesouza", "comment_text": "How about a joint venture with my toilet paper company, Asp - Viper?"}, {"comment_author": "Malalang", "comment_text": "I just shipped my pants!"}, {"comment_author": "Malalang", "comment_text": "They could also branch out into menswear. Shatnis Pants."}, {"comment_author": "cmnorthauthor", "comment_text": "That’s a good name for a plumbing company - after all, they’re always snaking drains!"}, {"comment_author": "joey__jojo", "comment_text": "If you're born with a long snake, you really have a limited number of options.  As most parents prefer you don't go into adult films."}, {"comment_author": "Toby1066", "comment_text": "Why did Nichelle Nichols leave the set of Star Trek? \n\nBecause William Shatner"}, {"comment_author": "Tonya_Lopez", "comment_text": "That's a good one"}]}]