["My wife just found out she's adopted. She's devastated and kept asking \"Why didnt they want me?\" I comforted her and after a while, still crying, she asked me to make love to her, which led to more tears. On reflection, banging her from behind and shouting \"WHO'S YOUR DADDY?!\" was a little insensitive.", "I adopted a dog from a locksmith.\nAs soon as we got home he made a bolt for the door.", "Blacksmith. You got your smiths mixed.", "The locksmith taught the dog how to make bolts?", "Maybe, but having the dog rekey a lock does not really ring", "Who are your and how did you get in here?!  \"I'm a locksmith, and, I'm a locksmith.\"", "'I got a dog from a locksmith. As soon as we got home he changed the locks and kicked me out '\n\nThere, I fixed it 😅😂", "An old one:\n\nMrs Jones:  What made you decide to take French lessons?\n\nMrs Smith:  We adopted a baby from Paris and want to be able to understand her when she starts to talk.", "True story. I moved to Quebec when I was about 22. The first time I saw a small kid (like 3 or 4) speak French I was all like \"how did they learn French so young??\"\n\n#facepalm.", "She just went oui oui", "I spent way too long trying to work out why the President’s wife was relevant to that joke", "That occurred to me. But I thought people would understand once they saw “second lady.”\n\nI will fix lol.", "Nah you’re all good Chief, no need to go changing anything just because I’m kinda dumb", "Thanks, but I already made the change. More than likely, this was how the original joke was written in the first place. And for the exact reason you mentioned.  It occurred to me too. Bottom line, you need to make it easy for people to get the joke.", "Son: \"Dad, Am I adopted\"?\n\nDad: \"Not yet. We still haven't found anyone who will take you.\"", "Or the alternative:\n\nMom: Son, your adopted.\n\nSon: what? Why didn't you tell me? Who are my parents?\n\nMom: I told you now because it just happened. We are your parents, your new family will be here in 10 minutes, pack your bag.", "Oh shit!", "😂", "My username...", "no turd ad but?", "Well I mean..", "Yeah, I hate shitty ads...", "Without an ad, that item isn't moving.", "Oh, so wrong but damn funny!! 🤣🤣🤣🤣🤣", "😂😂😂😭😂😂😂😂", "ANGRY UPVOTE", "\"Here is the situation,\" she said. \"A man is standing up in a boat in the middle of a river, fishing. He loses his balance, falls in, and begins splashing and yelling for help. His wife hears the commotion, knows he can't swim, and runs down to the bank. Why do you think she ran to the bank?\" A girl raised her hand and asked,\r  \n\"To draw out all his savings?\"\r  \n", "That girl is full of logic - you can bank on it. \n\nI'm pretty sure I see a pre-nup in her future.", "I see a murder investigation...", "He did lose his balance..", "Her mom is a Teller.", "What's the logic", "Bank = the dry land next to a river", "She seems to have internalized \"husbamd dying = money\" at a young age.", "Is it that the wife must be on the land (not the boat) to be able to run to the bank (instead of swim)?", "Better get the money out before it's tied up in probate after her husband drowns, or something like that... I agree with u/EudamonPrime", "And also where you keep your savings. I don't know if it's just late for me or what but I didn't get this at allll. Hahahaha.", "I think they are asking what's the actual logic, the answer the teacher wanted. Because I'm wondering as well.", "Or she's never heard of a riverbank.", "Feels like this joke was copy and pasted straight of some Boomer's Facebook...", "Feels like one of those boomer 'marriage sucks' jokes.", "Either to find the life saver ring or to jump in herself to save him", "To help him. Bank as in riverbank.", "The wife ran to the bank because once she entered the water she would be swimming to save her husband is probably the answer the teacher would expect.\n\nAnother logical answer would be the wife stopped at the bank of the river because she couldn't swim either.", "Sure but how is that a lesson in logic?", "That makes a lot of sense I didn't even think of \"riverbank\"", "These are children so the logic is more \"what's a reasonable action to take\" than the more advanced logic puzzles adults do", "Maybe she's running towards the river to save her husband, or maybe she's just thinking it's a nice day to take a swim. One is a logical conclusion from the story, the other is not.", "My child was taught logic in 3rd or 4th grade. It was logic. Simple logic problems, but still logic.", "\"To draw out all THEIR savings?\"\n\nFTFY.", "Some guy is in a bar and sees some attractive looking woman sitting there. Maybe 50 but with a killer body. \n\nHe buys her a drink. She asks him if he wants a deer hunter special.\n\nHe asks what that is. She says that her husband is away deer hunting for days. The deer hunter special is something she does during deer hunting season.  It is daughter and  mother sex with a stranger.\n\nHe says great and follows her to her home in his car. They walk into her house.\n\nShe yells up the stairs. \"He ma, you still up?\"\n\n&#x200B;", "Good old #2", "Ironically the same number of women I have done sex with. ", "Yep. I saw this one last week, but then it was the \"Sportsman Special.\"", "This guy does sex", "Ironically the same number of my hands I have done sex with.", "Average age of mates is 67", "Holy chopped liver filled jamjars Batman! I bet you kill all your food yourself and are extraordinarily good on a banjo. Am I right?", "Twice!", "r/thisguythisguys", "And yet the first one left you for your two-timing, Captain Hook.", "Benjamin Franklin would approve.", "\"MA! The meatloaf!\"", "Plot twist: guy is a gerontophile.", "An oldie but a goodie ( yes take it both ways) oops that’s made it worse, but you get where I’m coming from. 😂", "Haven’t heard that version.", "REVERSE THE BUTTON!", "when I worked in clubs there were tons of extra women in it during deer season.  I liked having the odds in my favor.", "No officer, it's hi how are you?", "“So my eyes are red, you think I’ve been smoking pot. Well, your eyes are glazed, I think you’ve been eating donuts”.", "You are right - and under arrest", "Thought I was in r/AskReddit for a second.", "except it wasn't about sex, so.", "sol loo.o\nm", "No that’s r/askredditafterdark", "No, that's r/askreddit", "5 feet & 11 inches.", "Hi, how are you?", "Best response", "I’m not as think as you stoned am", "That police officer was wasted", "Dare you to correct the anti-grammar police.", "I need you to blow this Breath Anallyzer", "Not high enough for this", "I'm good and you", "Malphabet", "I'M FINE , HOW ARE YOU ?", "High how are you?", "To the eyebrows… (no im not)", "About 3200 feet above sea level.", "364ft above sea level", "Alright McNulty, calm down.", "... and Doctor, that's the last thing I remember.\"", "I remember the first time I smoked a joint. I smoked half of it. ,I got so hungry. ,I ate the other half  !", "It grew up in the hood.", "Tell that to the circumcised and watch it go right over the head", "Ba dum tss", "Hey man! I’m circumcised but my penis deffo group up in the hood! That shit can happen too.\n\nEdit: For those who don’t get it, you can get circumcised later in life. It isn’t always done at birth.", "*I* got it....", "I'm one, not over... not under either 😥", "I pee what you did there", "Mine got beaten up by four skins.", "Why for you chop this?", "Ah, OK. At first I thought you were saying that you were always cold.", "FORE! \n\n\n\n\nskins", "It’s a cultural and religious thing where I’m from. Plus this was like.. 20yrs ago when it was less questioned.", "As an adult?", "Nah, as a kid. I can’t recall how old I was then. Maybe around 10-12yrs old?", "Wtf", "Mine got out of the hood early on. He went to university, got a good career, developed a passion for cave diving, visited caves all over  the whole world he did. And one day he decided to settle down in one very special cave and now he has children of his own.", "Be careful with with that excessive exotic cave diving. You might bring the jungle home with you", "Someone shoved a lasgana up it", "“I’m circumcised, cus I don’t cum from the hood”", "Tips are getting bigger every year", "I guess mine must have grown up in the suburbs", "You might get shafted", "Except for the Jewish ones. They're always looking for a percentage off!", "that's racist", "And you're dumb as fuck", "you’re*", "that's racist", "Because he used the \"r\" word to refer to racially and culturally specific barbaric practises? \n\nThere's really no need for any genital mutilation, irregardless of the gender classification of the victim.", "The kid replies, “What the fuck do you think?”", "Yeah I'd be pissed if I caught my kid drinking my cognac.\nTold the little bastard nothing above the third shelf.", "We share the pot pretty freely, but hands off the cubans little buddy", "You took this from a legit askreddit question post", "He worked it out with a pencil.", "Constipated accountant.  He couldn't budget so he worked it out with a pencil.", "Far better joke than the one above.", "Something about ancient writing implements & anal probing?", "What about the constipated accountant who couldn't budget?", "Really? A mathematician who couldn't work out a log?", "... pencil and paper.", "No shit.", "It was geometrically acute", "He 25.13274122871835", "Shortly after he was forced to reach for the abacus, he somehow discovered anal beads?", "Was it a number 2 pencil?", "Old but reliable.", "This is my joke", "So sorry, Mr. Pencil", "Not my name. You must have me confused with your partner", "We met online ", "Do you work together? That can be a real balancing act.", "Yea, things can be tense. It's not easy, but it can be taut.", "It's a big leap of faith.", "They walk a fine line", "Good thing you're both down to earth people", "I don't know, seems like they have their heads in the clouds", "Is that where she fell for you?", "He fell for her, her name is Annette", "They met after he lost his sweet Eileen.", "Yeah, she’s quite a catch.", "You’re both gonna end up as swingers eventually.", "Reddit should have kept those little medals and things we could hand out. \n\n\\^This comment deserved one.", "I’m sure you have a balanced marriage ", "You’d think so but their relationship is on the line almost every day.", "I heard they were having trouble making ends meet.", "I hear tightrope walkers are high strung. Is that true?", "Bad tightrope walkers..\n\nYou really met on the net", "Wire you telling us?", "I imagine there's a lot of tension between you two.", "You weren’t sure about her at first as she’s always late but it came down to the wire.", "You both fell, deeply in love.", "Talk about being high strung.....", "Are you the famous Indian tight rope artist Bhalan Singh?", "Don't side step around arguments !", "Is her name Annette?", "We're tight, even though there's no common ground between us.", "My wife and I are from Soviet Russia. While waiting for bread we met online.", "We met in the safety net—‘cause we’re pretty mediocre tightrope acrobats.", "Just don't try to meet in the middle..", "I know! You stole my dear Annette and now I have to do my act all alone. I wrote a book about it. It’s called… Without Annette.", "You need some slack", "What do yas do for foreplay tie each other up in netting and hop for the breast", "Ñ", "Neither I nor my wife are tightrope walkers. We met offline.", "A lot of tension in your relationship?", "Sounds like a hard act to follow", "And yet you just keep me hanging on..", "Treading a fine line with this joke.", "So that's how you roped her in!", "Always remember a good marriage has safety nets!", "😀", "What do you call a cow with no legs", ">!Ground meat!<, I'm guessing. My first answer was Beef on the Grass...I got there... eventually...", "Bard: You can count on me!\n\nDwarf: You can count on me!\n\nNecromancer: You can count on your brother!", "The one this is copied from goes like this:\n\n'Warrior: I swear I will have revenge for the death of my brother.\n\nElf: You have my bow\n\nDwarf: And my axe\n\nNecromancer: And your brother'", "Better version.", "As a dnd and Diablo player I appreciate this.", "Abacus: You can count on me!", "Gary: We must save my family!", "The Bandits are coming", "Bard: You can count on me!\n\nDwarf: You can count on me!\n\nNecromancer: You can count on me!\n\nBrother: You can count on me!", "Rogue: I will use your brother's gold to get a weapon and help!\n\nWhile the bard is hitting on the pretty serving girl describing his noble quest to avenge the fighter's brother", "They have little patience.", "This should be spelled patients...", "Or pensions ", "Have patience, you patience playing Haitian patients", "Why does the proctologist hate his job? Because all his patients are assholes.", "Because they keep getting their job title misspelled‽", "They don't like to kid around", "Because they are mad, they name their daughters Patience", "This is so cute!", "I hate when I'm texting and some pedestrian bounces off the hood of my car", "🤣", "Everyone pays 5% income tax. Rich or poor.", "He was the original Trip Advisor.", "He was your shroommate", "Oh my God they were shroommates", "How much did you peyote him for the advice?", "\"Gotta give up the toad! (Give up the toad now),\n\nOo' oo' oooooooooo!\"", "mm hm, mm hm... and where do you get such items now...?  asking for a friend", "When you went out did he pick up the tab?", "One's a crusty bus station, the others a busty crustacean.", "I've never tipped a bus station.", "What does being busy have to do with tits?", "It’s supposed to be a busty crustacean. Not busy.", "or \"..Cluttered with detail to the point of being distracting.\"", "Saw this in yeahmad. Still love the joke.", "What’s the difference between the dwarf branch of Mensa and a women’s cross country team.\nThe dwarves are a group of cunning runts.\n\nWhat’s the difference between a nun and a woman in a bath?\nThe nun has hope in her soul.\n\nThey’re called spoonerisms if you want to find more.", "I usually go home, hard.", "Maybe you should be more open and try the gay clubs... you know what they say, a hard man is good to find.", "My dad always told me if I'm not in bed by 1am I should go home.", "I wish my dad had told me that. \n\nIt would have saved a lot of 'last call' mistakes I've made over the years.", "\"I've invited you all to this press conference to tell you that my experiments in Parthian-genesis have proven highly successful.\"\n\n\"Professor, you mean parthenogenesis, right? Like in asexual reproduction?\"\n\n\"No, I didn't mean that at all. Why would you think that?\"\n\n\"But...\"\n\n\"Anyway, I also invited you to warn that Rome has better improve its defences pretty darn soon.\"", "A little help please?", "Parthenogenesis, literally \"virgin birth\", is when a creature gives birth asexually. Occurs in some species, could possibly be generated in humans?\n\nThe Parthians was a people that the ancient Romans had beefs with.\n\n\nSo Parthian-genesis would be birth or creation of Parthians...\n\nObscure pun, but it was stuck in my head", "Thanks for the kind explanation. \nI would have never understood it", "I dont think everyones gonna get it. But its a new one for me.", "I think the part that makes it confusing is that you have a professor of some kind (implied to be of history or biology given the title) holding a press conference to provide a warning to contemporary Roman society in a pre-Parthian era. The timelines don't match up.", "It was probably better in your head.", "Yes, I found this Roman pun rather byzantine.\n\nI tried to understand it, but it was all Greek to me.", "I got the joke the first time, and I still didn’t like it. It’s just that usually a pun has a humorous displacement — like puns are their own punchlines. There’s nothing inherently funny about two words sounding similar. Maybe if you set it up cleaner and focus on the misdirect, then the right audience would enjoy it.\n\nFor example:\n-Warn the Armenians! My parthian-genesis experiments are going too well…\n-Why would the Armenians care about unfertilized eggs reproducing?\n-So pedantic… Arsacid-genesis then", "Not really funny. Still nice to see", "\"Possibly generated in humans\"...\n\nNo dude.", "Just when I thought you missed the mark, you turn around and do a Parthian Shot.", "I laughed more at the explanation than the joke", "No, as I said, obscure stuff \n\nBut I've been giggling to myself about this pun since I came up with it, so I had to use it for something", "I don't think it even has a number assigned...", "You mean post-Parthian?\n\nThe joke is that he's brought the Parthians back", "I'm giving it the \"Amusing but not particularly funny\" credit. Can't say fairer than that.", "The word Parthenogenesis is actually Greek, so you're on to something", "Yeah, your suggestions make it better", "Sure, you're free to tinker with it. I don't think I'll be working more on this one.\n\nAlso, it's gotten many times the votes I'd expected, so it obviously worked for some 🙂", "Not now, no. But maybe the professor will manage to do it when he's done making Parthians", "Now that im re-reading it, its giving the justice the joke deserves.", "Thank you for the giggle. For both the joke and your user-name.", "The Parthians were not obscure. Anyone with a passable amount of history knowledge will get this joke.", "It needs work brah", "You take the number of upvotes, divide by the comments, multiply by word count and...", "Ah, that makes more sense. I took it as the professor creating the Parthians in the first place.", "Post-Parthian-Depression", "You're welcome, glad you liked it!", "Judging from my internet experience, they're probably too obscure for most people", "Youre just lame...\n\nBrah", "Ah, right, could be read that way, yes. But such a scenario would truly be absurd, can't have that 😛", "Haha, yeah, I've already had a similar thought. All the possibilities - I mean punsibilities - the Parthians give us!", "# “Think of how stupid the average person is, and realize half of them are stupider than that.”\n\n― George Carlin", "You ok brah? 5 thumbs up, going to say it's not just me", "Oh, well, if it's obscure niche jokes you want...\n\nFew people know it, but acclaimed symphony conductor Herbert von Karajan actually had a second career outside of music, he was also a famous luggage designer.\n\nI mean, surely you've heard of...Karajan Luggage?", "> Oh, well, if it's obscure niche jokes you want...\n\nThere is only one electron!", "Wheeee!!!!ler", "It's a bit of a long road to get to the punchline, but you know that they say about all roads...", "Wait, is this an original and funny joke?\n\nIn this sub-reddit?\n\nWell, it is a niche joke, but still ... what a wonderful day it is ...", "if i hadnt understood the joke id think that posting an original joke is the actual joke", "This is the quality stuff I'm here for.", "My own obscure \"history\" joke:\n\n  \nWhy did Oedipus cross the road?\n\nTo get to the >!Patricide!<", "Ouch! Nice one!", "My ecologist/history buff spouse cackled.", "There you have my target demographic!", "This has a very small target audience, but my opinion, that makes it better. I'm happily chuckling away here.", "😐 😑 😐", "Another history/biology joke:\n\nWhat does the H in Jesus H Christ stand for?\n\nHaploid", "Gotta explain that one, I'm afraid", "Haploid describes a cell, individual, or generation that has a single set of chromosomes.\n\n\nSingle set of chromosomes.\n\nIt's actually very funny", "Ok, that's good", "The bonus is that I learned a new, interesting word when I looked it up to 'get it' too haha", "The best jokes are those that teach you things", "I work at a zoo and I approve of this joke.", "Why did Athens win the Battle of Marathon?\n\nBecause Ions carry a charge.\n\n(Really, it should be Ionians, but that’s not as good of a joke.)", "I laughed", "I love it. I learned a little and laughed a little. My favorite 😍.", "Gives off xkcd vibes", "I used to read that religiously, so I'll consider it a compliment!", "Also, Carthage must be destroyed.", "I like it. Punchy and to the point.", "Thanks!", "I have no idea what any of this means, but it makes me happy As Fuck to know that other people do. Each and every one of you herewith receives the Gold Medal for Obscure Puns of Antiquity.", "Explanation to be found under the top comment, asking for help", "Oh I read that and I still didn't get it. Extra Gold Medals all around", "\"Professor, you are a biology professor, are you completely mad?\"\n\n\"Madness? THIS. IS. PARTHIANS !\"", "🤣", "You are correct that it is obscure.  However, I understood it on the first try, and thought it funny.  Probably because I am so old that I was there.", "Who can forget the Parthian defeat of Crassus, whereupon they used his head as a prop in a play", " Ceterum censeo Carthaginem esse delendam!", "That's a good one!", "Ah old #332", "You mean old #CCCXXXII", "I'm both scared and impressed if this joke is old news", "This has a very small target audience, but my opinion, that makes it better. I'm happily chuckling away here.", "A guy is taking a shower and notices that the soap is gone.  He yells from the tub, \"Honey, can you pass me a new bar of soap?\"\n\nHis wife pulls the shower curtain open and replies, \"No soap, radio.\"", "What?", "Huh?", "Classic.", "Gets funnier every time!", "Please, explain...", "Hehehe. I chuckled", "Oldie but a goodie!", "How many steroid would it take to cure autism?\n\n\nYes. ", "The kind of joke to tell just before you leave.", "Get in that hole daddy", "Wow, that hole looks big...", "What's your handicap?", "Wrong hole!", "I’m about 3 inches short", "I'm trying to finish in the least amount of strokes.", "Have you seen my ball?", "Bro I'm concerned why do u only have 1 ball?", "Because one is missing, obviously.", "That was awful, can I take a mulligan", "Sand traps suck.  They do!", "Playing the back nine", "What would Tiger do?", "Tiger is thinking of a Hole-in-One", "Mind if I play through?", "Fore.     ………… play", "Bite you c*cksucker,  bite!!", "I hit it in the rough.", "New balls please", "Your stiff shaft feels so good in my hand.", "You need to spread your legs a bit more", "Sure it looks easy, but you have to negotiate that water hazard in order to reach the hole.", "Put it in already!", "You said you had an 8 Wood!!!", "Hole in one.", "May I play through?", "Thats a 4 stroke hole", "Wait, why is the high school golf team hiding in my fiance's closet", "Funny how our balls always end up right next to each other.", "This hole is tight", "I’m gonna lay up.", "Let me pull out my driver.", "I’m good with my woods.", "If i ever make the open, I'm gonna come first, then I'll drink from the claret jug.", "I'm just gonna hit you with the head!", "Quiet, please.", "I use a sock to protect the head", "You missed the fucking putt, didn't you?", "I don't see the point of washing my balls unless I can see dirt on them.", "That will cost you a stroke", "This was done on [Whose Line](https://youtu.be/lGxg6VjmZ5c?si=Gebu1uhsAkeXVrxk)", "I've got the right club for any situation.", "I'm done, wanna beer?", "Looks like he's lost in the rough.", "Tiger Woods is so much better at this than you", "I can’t believe you’ve already done this 17 times today.", "Wrong hole", "A brick.", " “No thanks, I gestate.”", "Human fetuses are essentially the same as the creature from Alien. Only they take longer to gestate, and if they don't kill you while come out, they'll do it slowly over the course of years.\nMy mom says such silly things when she drinks.", "They don't kill you, they just make you wish they had.", "*Usually dont kill you", "I don’t get this joke? Why would the baby eat her?", "Probably shouldn't drink.", "Human version of Ripley's xenomorph being born is a C Section", "*The Menéndez brothers have entered the chat.*", "In the US, it's more than you'd think!", "Hello mah baby, hello mah darlin, hello my ragtime gal", "I’m kinda drunk & I picked up on that", "And more than it should be. 😥", "May the Schwartz be with you!", "Who's singing? The frog from WGN, or the alien from Spaceballs?", "[Michigan J Frog (Looney Toons) Dancing Frog](https://youtu.be/MsROL4Kf8QY?si=aMXm6E1h0EaGRRUh)", "You are a few weeks early.", "anyone can explain this joke? as a non native speaker that has no idea if gestate is even a real word, please help", "Gestate is to carry a fetus in the womb until it’s born. It sounds like “just ate”.", "Just ate == hick word of the day gestate", "Giraffes are known for leaf eating habits that boarders on gastronomy, as they take bites from leaves of different trees which have distinctly different chemical compositions. \n\n\nAlmost like they're tossing their own leafy green jambalaya. ", "That made me both sigh and chuckle. Surely a sign of a good joke.", "No shit, I just snickered while rolling my eyes. Good joke.", "Please explain it to me 😅", "To gestate is to carry an unborn, allowing it to develop before birth. It sounds like just ate in this context.", "No thanks, I just ate.", "\"I just ate\"", "Thanks i get it now", "Well, she gestate.", "Gestation jokes always bring out the kid in me", "Are you trying to instigestate?", "Groan.....or should that be wasaah!", "I just ate, so stop trying to gag me.", "Such a nice hubby. Always at his wife’s cervix.", "I sentence you to 9 months of uncomfortable suffering for telling this.", "Damn, and he'd made a nice cesarean salad for her too.", "Underrated comment. Good one", "I gestate waffles, a pint of ice cream, peanut butter, pickles, and french fries. We’re out of mayo.", "You have problems, if you gestate that.", "She preg", "And you will birth a colourful poo. Given gestation in humans is nine months your poo will have hair and I leave you to guess the race of the father.", "On the other hand, depending on how long it takes, if they gestate that, I think I might want to be married to them. There is that small issue of wanting to eat my children...", "Soubd of the contents", "you might have a cronus complex", "Either that, or I'm a hamster. Not sure which...", "I like this one", "Puns are the best, they're  just so punny.", "And puniful.", "And punishing.", "What do you call a cow with no legs?", "Ground beef - and I gestate a portion of ground beef and hour agai", "IDK why you got hate for this. Sorry.", "Doesn’t matter, it won’t come.", "That sounds amazing", "  Wait a minute are you talking about my wife here have you met her I’m sorry", "I guess she also looked kind of full as she said it", "that makes me want to gesticulate", "You Italien?", "Aye matey years old.\n\nDon't blame me.  Our conductor told it at a sea shanty concert this weekend.", "You just say, “Aye, matey.”", "That does work better.", "This joke is in my 6 year old sons joke book, was…\n\n‘What did the pirate say on his 80th birthday?’\n\n“Aye matey!”", "That does work better.", "I think you meant octogenarrrrian", "Good one.", "Ask him \"Arrrr you done with thArrrr bad puns captain\"", "Bless your heart…", "That’s why 80 is your Pirate Birthday!\n\nBut did you know that 82 is your Co-Pirate Birthday? Because your friend says “Aye, Matey!” and you say, “Aye, Matey, too!”", "These new sea shanties that the kids are making today are awful. Nothing like when I was a lad.", "Pretty good for second hand..lol", "Or, second hook.", "He told a bunch of bad pirate puns during the concert.  It's extra funny hearing a thousand plus people letting out a collective groan.", "When a man has been jacked of by an eighty year old, he finds ways to tell you. ", "I was going to add that but opted out 😆", "How do atheists celebrate Easter?", "We don't?", "By decorating eggs as gifts for the Goddess Ostara", "I had to cut it off with a semi-colon.", "Too funny!!!!!!! 😂", "A ; is way better than a .\n\nSource: woman", "This one reminds me of that really old one. The way it goes is this: do you know why turds are tapered at the end? It’s so your asshole doesn’t slam shut.", "Cop: Are you on drugs ? \r\n\nGuy: Why would I sit on drugs ?\r\n\n Cop: Have you taken any ? \r\n\nGuy: Taken them where ?\r\n\nCop: I meant used drugs. \r\n\nGuy: I prefer new.", "\"Tazered himself, then broke into a holding cell while  handcuffed and kicked himself to death? Let's just put \"natural causes\" then\"", "Cop draws gun...blam blam blam...stop resisting!!", "Is this Guy Leslie Nielsen?", "Hospital?", "Surely", "A hospital? what is it?", "Don't call me Shirley", "It's a big building with sick people. But that's not important right now.", "A guy is driving the wrong way on a one-way street in Calgary.\n\nA cop pulls him over and says \"You're going the wrong way, didn't you see the arrows?\"\n\nThe guy says \"arrows? I didn't even see any Indians\".", "Wow, a borscht belt classic.", "Why Calgary?", "Because every street in Calgary is one-way. Well...it's bad.", "Make sure to call the cop \"Ossifer.\"\n\nThey love that.", "I first read that as \"ossifier\" and I was trying to make the connection between police and turning to bone.", "Good evening ossifer, I’m not under the affluence of inckerhol.", "😂.", "You need to taze just enough.", "On drugs?  \n\"I mean narcotics, mind-altering substances - but that's not important right now\"", "Officer told me \"My dog is telling me you are on drugs\".\nI told him \"I'm on drugs? You're the one talking to dogs\".", "'Consumed', 'ingested', 'intoxicated'.", "Cop: \"Your eyes look red, have you been drinking?\".\n\n\nMe: \"Your eyes look glazed, have you been eating DONUTS???\".", "Acorn lands on car cop starts blasting doesn't hit the guy in the car\n\nCop must be a Storm Trooper", "What do you call a cow with no legs?", "Your mom", "it doesn't matter, it can't come anyway..."]