[{"post_title": "Got custom curtains that fold/pleat at set intervals. How do I prevent it from sticking to certain parts of the window? ", "post_url": "https://i.redd.it/9ntaz8epf5tc1.jpeg", "post_main_text": "", "post_comments": [{"comment_author": "qwertyzeke", "comment_text": "Spritz it with water.  If it releases from the wall, you have static electricity built up and can fix it by rubbing it with a dryer sheet or white vinegar. \n\nIf it doesn't release, you've got a draft.  Weather stripping in the window sill can help with that.  If it's not coming from the window, you might have a ceiling vent blowing directly on it."}, {"comment_author": "Good4nowbut", "comment_text": "This guy curtains."}, {"comment_author": "qtaetae", "comment_text": "I tried this, and it’s looking like I indeed have a draft from the window it’s clinging to. Hopefully this answer is helpful to others as well; I scoured Google and Reddit and couldn’t find anything previously for this issue. Thank you!!!"}, {"comment_author": "Euphoric-Blue-59", "comment_text": "Be very careful about applying vinegar. It can discolor some fabrics.\n\nThis is just static"}, {"comment_author": "doublescoopsaline", "comment_text": "This guy this guys☝️"}, {"comment_author": "qwertyzeke", "comment_text": "🫡"}, {"comment_author": "qwertyzeke", "comment_text": "No problem.  Worked as a general contractor for a while, so I've seen this before.  You can buy rolls of stick on weather stripping at your local hardware store.  I recommend the rubber style over foam.  Make sure you clean the surface with alcohol before trying to stick it on.  Otherwise you're replacing it in a few weeks.  If you never open this window, you can place simply tape the bottom edge and see if that helps."}, {"comment_author": "Reyox", "comment_text": "My curtains have a few screws and bolts inside the seams to weight them down."}, {"comment_author": "Good4nowbut", "comment_text": "🫡"}, {"comment_author": "Chef_Sewage_Mouth", "comment_text": "This guy \"this guys\" guys👆"}, {"comment_author": "TijayesPJs442", "comment_text": "Oh you guysssss"}, {"comment_author": "Physical_Stress_5683", "comment_text": "You can try spraying it with anti-static spray. In a pinch hairspray might work too, but it will leave a residue."}, {"comment_author": "liog2step", "comment_text": "I think that’s just static. The air is too dry in your house. A humidifier will help."}, {"comment_author": "pushing59_65", "comment_text": "You can get drapery weight to sew in the hem. Also, is your window open or just drafty?"}, {"comment_author": "elizardbreathjonston", "comment_text": "Looks more like you have a serious draft in those spots."}, {"comment_author": "Ok-Pie9995", "comment_text": "I'd go w curtain weights. You stick to the bottom of the curtain or slide in the bottom seam. or the seal to stop the draft, as said above. or another quick fix for now. Use 2 dryer sheets and sandwiche the curtain, one sheet on each side, and rub sheets in the static area. \n\nI would NOT use Sprite! As the other suggests, that would attract ants with the sugars!"}, {"comment_author": "TeeWatcher", "comment_text": "Anti static spray"}, {"comment_author": "m16hty", "comment_text": "We have something similar, we sewed in on bottom little weights"}, {"comment_author": "Adol214", "comment_text": "Check a fishing shop for small weight easy to attached to a thread"}, {"comment_author": "aadleft", "comment_text": "We put coins in the bottom hem"}, {"comment_author": "Outofoffice_421", "comment_text": "That’s genius! Saving this idea for future"}, {"comment_author": "Redbillywaza", "comment_text": "Dryer sheet"}, {"comment_author": "scram007-3", "comment_text": "Scotch  guard"}, {"comment_author": "DaRunningdead", "comment_text": "Starch it"}, {"comment_author": "iM00S3", "comment_text": "WD-40 sprayed and wiped clean on the glass."}, {"comment_author": "mikajade", "comment_text": "Rub a Dryer sheet there."}, {"comment_author": "Entire-Home-9464", "comment_text": "Is this competition to ask most ridicilous thing?"}, {"comment_author": "butterlytea", "comment_text": "Fabric softener sheets maybe"}, {"comment_author": "BobGnarly_", "comment_text": "Static cling. Rub that section with a dryer sheet when the curtain sticks."}, {"comment_author": "Sweet-Category-3452", "comment_text": "Call it a failure and say you’ll disown him if he doesn’t comply! Works everytime"}, {"comment_author": "Mobile_Laugh_9962", "comment_text": "If you have a spray bottle (like Windex or something) empty it, fill it with equal parts Sprite and water. Shake. Pour out the suds to ensure it's flat. Spray it on the curtains. Ta da.\n\nBonus: if you want to change the color of the curtains, just add food coloring!\n\nNote: 7up will not work and stay away from diet Sprite or those fancy flavored Sprites. Stick with the basic formula."}, {"comment_author": "bub-a-lub", "comment_text": "Can I ask how you know this works?"}, {"comment_author": "mikajade", "comment_text": "Are you an ant that lives in her home?"}]}, {"post_title": "Snagged my favorite pair of jeans :( they’re no longer made. Anything I can do to save them?", "post_url": "https://i.redd.it/jcw8ksxkl2tc1.jpeg", "post_main_text": "", "post_comments": [{"comment_author": "YourLifeCanBeGood", "comment_text": "You can push the snag through to the inside.  \n\nTake a needle and thread, and loop the snag through the thread (above the knot) and pull it through.\n\nYouTube should have vids for this, but it's very easy."}, {"comment_author": "Merfairydust", "comment_text": "That was my first thought, too. It's what my grandma always did. You don't even need a thread, you can just pull it through with a needle on the inside. That way you can use a thin needle and don't risk increasing the damage of the fabric (and you don't ruin your eyes trying to loop the snag through a needle 😆)"}, {"comment_author": "ginopono", "comment_text": "As pointed out by u/peri_5xg, there's a special needle you can get for exactly this purpose; it's called \"Snag Nab-It\", and it works really well.\n\nIt's like a simple needle, but the \"back\" end is textured in order to grab onto the snag and pull it through.\n\nI got one after my cat decided to go climbing in my closet and I thought a brand-new sport jacket was ruined."}, {"comment_author": "chocolatfortuncookie", "comment_text": "Exactly! But don't cut it!"}, {"comment_author": "latecraigy", "comment_text": "To add to this, push the needle through the jeans from the good side until just the part where you’d thread it is still on the good side. Then thread the snag through and pull through the jeans. You can get the shorter parts of the snag through this way. Hope this makes sense"}, {"comment_author": "Pvt-Snafu", "comment_text": "This is not the worst thing that could happen to jeans. Pushing the snag inside is the best advice."}, {"comment_author": "Wild_Replacement5880", "comment_text": "This ⬆️"}, {"comment_author": "YourLifeCanBeGood", "comment_text": "Easiest is best. No way would I thread the snag through the eye of the needle, though. It seemed simplest and safest for OP to catch the snag in the thread ends, to pull it through. Someone unaccustomed to wielding a needle and thread might tend to put a hole in the pants, using just the needle...that's what I was thinking.  \n\nAnd yes! There's even a tool for fixing snags. 🌞"}, {"comment_author": "curiously71", "comment_text": "I've used a toothpick 😆"}, {"comment_author": "mealzer", "comment_text": "Snaggletool?"}, {"comment_author": "idkwtfck", "comment_text": "Once you pull the snag ( a tiny crochet hook can work ) use an iron on patch on the inside to reinforce ( or if there is a more modern type of iron on)"}, {"comment_author": "TheFunkyBunchReturns", "comment_text": "I was thinking this too but I'm not sure how long modern jeans last? Probably not 20 years anymore...😔"}, {"comment_author": "DeniseBaudu", "comment_text": "Sure they do"}, {"comment_author": "therealdanfogelberg", "comment_text": "Not if they have spandex in them."}, {"comment_author": "kdp4srfn", "comment_text": "There is a special tool made just for snags like this. It’s called, unsurprisingly, a Snag-It. Pretty inexpensive. You can find it at Michael’s or JoAnn’s or online. Easy fix. Pay no attention to the those telling you to cut/shave/burn it, that’ll just ultimately enlarge the hole."}, {"comment_author": "Purple-Afternoon-104", "comment_text": "There is a small tool meant for threading a needle . Insert this tool from the inside of the jeans at the hole. Put the snag inside the diamond shaped wire and pull it through with that. On the inside, touch the snag and the hole lightly with clear nail polish."}, {"comment_author": "PressureMuch5340", "comment_text": "The cheap ones look like a dime to me!"}, {"comment_author": "peri_5xg", "comment_text": "Snag-Nab-it!\n\nhttps://youtu.be/iq3bHq-CAf4?si=1oyB9BMbw2TKEQP6"}, {"comment_author": "mizmaclean", "comment_text": "I thought you were making a clever play on words! This is great."}, {"comment_author": "Mrs_Gracie2001", "comment_text": "Take to a tailor"}, {"comment_author": "flavorsaid", "comment_text": "You could embroider a little something there ."}, {"comment_author": "Da_Plague22", "comment_text": "Tailors can fix em"}, {"comment_author": "snakesmother", "comment_text": "Definitely see how the tips here work for pulling the snag inward. If the small tear is still visible and bothers you, you could look up \"visible mending\" on YouTube for some really attractive stitching ideas to strengthen and decorate the flaw. Good luck!"}, {"comment_author": "lightbright1114", "comment_text": "Ugh, I hate when that happens! There are some great recommendations for fixing them above, I just wanted to add that poshmark will sometimes have what you’re looking for second hand, even if the jeans aren’t being produced anymore. Good luck!"}, {"comment_author": "mizmaclean", "comment_text": "Great idea- thanks!"}, {"comment_author": "Objective-Amount1379", "comment_text": "Yes, check ThredUp and e-bay too!"}, {"comment_author": "NoStringsMD", "comment_text": "There is a tool you can buy that will pull the snag to the inside and then forget about it. Go to a sewing shop."}, {"comment_author": "VenusMarmalade", "comment_text": "I second this. It has saved me many times."}, {"comment_author": "mizmaclean", "comment_text": "Is that the snag nab it everyone is mentioning?"}, {"comment_author": "Emotional-Craft4137", "comment_text": "\nKeep them out of the dryer"}, {"comment_author": "TheOnlyKirby90210", "comment_text": "If you don't mind some imperfection, try to get the open end of the snag into a needle and poke it through to the other side of the fabric. Snip off the excess and apply a dollop of fabric glue to secure it and prevent the tear from traveling. Also apply some fabric glue to the outward facing side of the tear and let it dry flat. This will help secure the other seams from pulling farther apart. At least in theory this will work."}, {"comment_author": "Maj_BeauKhaki", "comment_text": "Hook and pull the loose threads to the inside.  Trim excess and use an iron-on patch to reinforce the area from the inside."}, {"comment_author": "semi-nerd61", "comment_text": "If you have a needle threader, you can push it through from the back side, push the snag through the needle threader, and pull the needle shredder out."}, {"comment_author": "Northslider2020", "comment_text": "Recently had this. I threaded a needle then tied the thread around the snag then pulled the needle, thread, snag through the jean close to the snag."}, {"comment_author": "Somerset76", "comment_text": "Turn them inside out, pull the snag inside, knot it and trim."}, {"comment_author": "mizmaclean", "comment_text": "Greatly appreciate all of these suggestions. It’s not some thing I’ve done before, and I did not wanna make it worse."}, {"comment_author": "Grouchy-Engine1584", "comment_text": "Embrace the imperfection."}, {"comment_author": "Queen-of-meme", "comment_text": "This. I have imperfect favourite pants too."}, {"comment_author": "enola007", "comment_text": "Push it back thru"}, {"comment_author": "BadEgg1951", "comment_text": "Old-time jeans-patcher here. If this happened, it's pretty likely that the fabric is about worn out and you're going to start having other problems. Just sayin'. Once the fabric starts to get really worn, the whole shebang tends to go pretty much at the same time, all the wear surfaces on the fronts of the legs from mid-thigh to below the knee. \n\nSorry to be the bearer of bad news."}, {"comment_author": "Dandibear", "comment_text": "If you're not happy with the look after trying to fix it, r/visiblemending can help you spiff up the fixed area."}, {"comment_author": "alroc84", "comment_text": "Mentos moment…."}, {"comment_author": "ICEFIREZZZ", "comment_text": "Just get a DeLorean, install a flux concentrator and go back in time. Buy new jeans and return to your time line."}, {"comment_author": "The_camperdave", "comment_text": "> Buy new jeans and return to your time line.\n\nBest to get two.  I'm sure you could sell the second DeLorean."}, {"comment_author": "None", "comment_text": "[removed]"}, {"comment_author": "AutoModerator", "comment_text": "Comment removed, it seems to contain an amazon shortURL. Thanks\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/lifehacks) if you have any questions or concerns.*"}, {"comment_author": "Evening_Common2824", "comment_text": "It's a pair of jeans, couple of stitches..."}, {"comment_author": "Knocksveal", "comment_text": "Snag-Nap-It"}, {"comment_author": "Most_Researcher_9675", "comment_text": "I miss my overpriced 80's CK Jeans..."}, {"comment_author": "Orumpled", "comment_text": "I use a needle threader to fix snags. Cheap. Easy."}, {"comment_author": "hellure", "comment_text": "A tailor can take care of this too... You don't have to try and fix it yourself."}, {"comment_author": "psiprez", "comment_text": "Go to a tailor, or even a reweaver (they  fix holes in suit fabrics by reconstructing the fabric)."}, {"comment_author": "MrCheese357", "comment_text": "Pretty sure they still make jeans luv"}, {"comment_author": "mizmaclean", "comment_text": "I really gotta start remembering how pedantic reddit is."}, {"comment_author": "ladyinwaiting123", "comment_text": "Pedantic is the perfect word!!!"}, {"comment_author": "GreytOutdoors", "comment_text": "I’m not sure denim is ready for Christianity."}, {"comment_author": "mikeb2956", "comment_text": "Duct tape"}, {"comment_author": "MaybeBaby716", "comment_text": "Where’s a company called Denim Therapy that restores jeans. I’ve used them in the past whenever I got holes in my favorite jeans"}, {"comment_author": "genghislamb", "comment_text": "Have you checked on Poshmark to see if anyone is selling an identical pair?\n\n\nThat's how I replaced my favorite jeans when they ripped beyond repair."}, {"comment_author": "RoastedCornSal", "comment_text": "What’s the brand? I’ll find em"}, {"comment_author": "liberalthinker", "comment_text": "Get a ‘needle threader.’  It is a super thin diamond shaped wire loop on a handle.  You can push the wire loop through from the back, loop the snag through it, and then pull it to the backside of the fabric.\n\nThen knot the snag, and ideally put a dime dized iron on patch over it from the inside to keep the tiny hole from growing"}, {"comment_author": "jtd0000", "comment_text": "Pull the snag to other snag. Don’t cut it. Get a Jean patch from somewhere like Walmart and follow instructions. Good as new. Patch goes on wrong side."}, {"comment_author": "AK_grown_XX", "comment_text": "You can find anything on eBay"}, {"comment_author": "remxtc", "comment_text": "Might as well just burn 'em."}, {"comment_author": "bigmikey69er", "comment_text": "They still make jeans."}, {"comment_author": "King_of_the_Dot", "comment_text": "https://www.youtube.com/watch?v=iq3bHq-CAf4"}, {"comment_author": "hypebq-", "comment_text": "Jean shorts, but let the pockets hang out... always in fashion!"}, {"comment_author": "WoodenWood304", "comment_text": "If you really love these jeans, and want them restored properly, take them to a seamstress/tailor. You won't even be able to tell anything happened."}, {"comment_author": "Siam-Bill4U", "comment_text": "I thought snagged, frayed& jeans with holes were vogue?"}, {"comment_author": "saveourplanetrecycle", "comment_text": "They still are. Some of them look like they’ve seriously been attacked by a bear"}, {"comment_author": "HyPeRxColoRz", "comment_text": "Am I the only one that would just burn that little sucker off?"}, {"comment_author": "Tickly1", "comment_text": "you can just snip that; should be A-Ok"}, {"comment_author": "FredRN", "comment_text": "THEY NO LONGER MAKE JEANS?!"}, {"comment_author": "VioletChrome", "comment_text": "Who likes short shorts"}, {"comment_author": "-Dueck-", "comment_text": "I've always just cut the thread off and it's been fine"}, {"comment_author": "DrexXxor", "comment_text": "Cut flush, thin line of super glue"}, {"comment_author": "KelvinCavendish", "comment_text": "Lucky! People pay extra for that!!"}, {"comment_author": "Green_Sir_250", "comment_text": "Ask Siri"}, {"comment_author": "mizmaclean", "comment_text": "Luckily there were a lot of helpful people on this thread, so I didn’t need to."}, {"comment_author": "ShadeCrowStudios", "comment_text": "Oh I’m sorry was it not clear that I was judging you on your inability to just rip a stray snag off a pair of jeans?"}, {"comment_author": "mizmaclean", "comment_text": "Aww it’s you again! I’m constantly surprised by the number of people who have such a sorry sense of self that they have to get snarky over innocent questions.  You are contributing so much good to the world. Proud of you!"}, {"comment_author": "vyper01", "comment_text": "Run a shaving razor and it should be fine"}, {"comment_author": "wordup3825", "comment_text": "Cut them off just below the pockets and make them your favorite shorts"}, {"comment_author": "spectr312", "comment_text": "Don't machine wash them. Hilfiger recommends freezing them to kill the smell-producing bacteria. Machines and soaps degrade the fabric."}, {"comment_author": "glacierre2", "comment_text": "Wtf. Jeans were supposed to be miners clothes, standing wear and tear. Now you have to treat them better than lingerie? And on top of that just get thawed sweat out of it? Fuck that..."}, {"comment_author": "Anxious_Ad_3570", "comment_text": "Id just cut it and then burn what's left with a lighter. But I don't mind imperfections in my clothes."}, {"comment_author": "snakesmother", "comment_text": "Burning only seals frayed fabric if it's synthetic. Denim is cotton. This is going to fuck up OP's favorite jeans."}, {"comment_author": "Hating_life_69", "comment_text": "Cry."}, {"comment_author": "mizmaclean", "comment_text": "Piss off."}, {"comment_author": "notyourprobss", "comment_text": "Burn it with a lighter"}, {"comment_author": "ShadeCrowStudios", "comment_text": "Nope gotta throw them out. 🙄"}, {"comment_author": "mizmaclean", "comment_text": "What’s the point of snarky ass comments when I’m clearly asking for recommendations?"}, {"comment_author": "ladyinwaiting123", "comment_text": "Some people honestly think a comment like that is funny. I think it's a waste of everyone's time!!"}]}, {"post_title": "My Dad's solution to putting your toilet onto its floor bolts.", "post_url": "https://youtu.be/dGyUdDKi6a8", "post_main_text": "", "post_comments": [{"comment_author": "JustJay613", "comment_text": "I use two straws slid over the bolts. Much easier to line up higher off the floor and then just lower."}, {"comment_author": "Chomas", "comment_text": "Woah, that's a really good idea. I never would have thought of that."}, {"comment_author": "kissmydonkey", "comment_text": "The real LPT is always in the comments"}, {"comment_author": "telepaul2023", "comment_text": "\\^\\^This."}, {"comment_author": "Chomas", "comment_text": "About a year ago. My dad wanted me to \"share with the internet\", his solution to unclogging small drains. I shared it with this community and everyone seemed to really like my dad. So here he is again with another one of his personal tricks for doing something around the house."}, {"comment_author": "rickitytick", "comment_text": "Thanks fellas. Absolutely going to use this in the future"}, {"comment_author": "Chomas", "comment_text": "You're welcome. I hope it makes the process easier."}, {"comment_author": "Ex-maven", "comment_text": "Great advice/tips -- very smart.  Wish I saw this a few years ago when renovating my bathroom."}, {"comment_author": "Chomas", "comment_text": "Thank you. And hey now you know for next time."}, {"comment_author": "Billy_of_the_hills", "comment_text": "If I'm being honest this seems like more work than just lowering it on slowly to line it up."}, {"comment_author": "Chomas", "comment_text": "Yeah it does involve extra work making the boards. I think my Dad used it this time because he has had to move the toilet multiple times. If you're just one and done then this might not be for you."}, {"comment_author": "addamee", "comment_text": "I get that but I, like OP, have an almost identically small (and tiled) bathroom and can see the benefit of this (or the straws). Rather than posting some joke  about how OP had no where to disappear to when dad started talking, I was watching this with a grimace on my face because of how similar(ly tiny) my bathroom is "}, {"comment_author": "SeattleHasDied", "comment_text": "My Dad has also been a problem-solver for some remodeling issues I've had over the years. His years in the construction industry and his innate skill for coming up with interesting fixes saved my ass a LOT! Thanks to all our awesome Dads!!!!"}, {"comment_author": "Chomas", "comment_text": "Agreed! Having a Dad nearby is such a treasure. I'm very grateful for things like YouTube which allow us to share our Dads with people who might not have one available."}, {"comment_author": "FlorinidOro", "comment_text": "Good solution!\n\nSide note…these are some pretty brave dudes to not open that window while the drainage pipe is wide open lol"}, {"comment_author": "Chomas", "comment_text": "Hahaha! Thanks and yeah, once you're nose blind to the smell.. well I guess it's too late."}, {"comment_author": "bwoods519", "comment_text": "The best part is the timing when one of their phones *dings* right when he sets it down."}, {"comment_author": "Chomas", "comment_text": "Thank you! I was wondering how long it would take for someone to notice that. What is really fun about that is that it was not staged. That is my Dad's text message notification. It legitimately happened right at that moment. It wasn't until I was editing the video that I noticed how perfectly it timed out with the toilet being sent down. I figured someone might point it out and here we are 12 hours later after the video was posted that someone noticed it and commented. :)"}, {"comment_author": "bwoods519", "comment_text": "It’s awesome to see father and son working together. Too many people don’t have the option! I’m 42, and my dad was always eager to come help me with remodeling projects etc. He’s getting old now and can’t do much anymore, but I go spend a day with him and mom, and help with projects a couple times a month. This time spent building, learning and just being together is a blessing! Cherish it! All the best to you both <3"}, {"comment_author": "i_give_you_gum", "comment_text": "So that's why i always find two pieces of random 2x4s nailed together..."}, {"comment_author": "Chomas", "comment_text": "Haha, yeah. You should see his workshop. Tons of random stuff in there."}, {"comment_author": "OwnBunch4027", "comment_text": "I would measure it wrong and then have wasted all that time. Nah, this one's not for me."}, {"comment_author": "Buddyslime", "comment_text": "Get the boards fitted before you take it out."}, {"comment_author": "Chomas", "comment_text": "Yeah I could see that, but hey what works for one person won't necessarily work for the next person."}, {"comment_author": "Chomas", "comment_text": "Yup that's exactly the way to do it. Cut then check to make sure they fit, then remove the toilet."}, {"comment_author": "SOULJAR", "comment_text": "I’m confused - is this the same as marking the location with chalk instead of these spacers?"}, {"comment_author": "Chomas", "comment_text": "Same thing. He likes the finality of hitting the stoppers as he lowers the toilet. It removes any guess work or bending to see the chalk lines. I wouldn't say it's better or worse, it's just what he prefers."}, {"comment_author": "SOULJAR", "comment_text": "Ya I can understand that, it’s more tactile"}, {"comment_author": "Chomas", "comment_text": "Yep yep 👍"}, {"comment_author": "mariegriffiths", "comment_text": "Another example of American poor design.\n\nThe UK design the flang on the waste-pipe  just comes in from the side and you slide the toilet to fit and then attach the bowl to the floorboard with wood screws.\n\nNo chance of damaging the bolts by dropping it in and no change of having to replace the whole wastepipe if too much weight it put on the bowl."}, {"comment_author": "johnjohn4011", "comment_text": "So in the UK shit flows sideways instead of downhill? I guess that explains some things...... ;)"}, {"comment_author": "Chomas", "comment_text": "That's interesting. I've never seen anything like that but I have also never worked on a toilet outside of the US. I'm not surprised that different regions in the world would have different ways of doing things. If I ever make my way to the UK I will take a closer look at the toilets."}, {"comment_author": "mariegriffiths", "comment_text": "Lots of US plumbers downvoting as they can cream lots of money off customers for this unnecessarily badly designed system."}, {"comment_author": "mariegriffiths", "comment_text": "The US toilet also internally goes sideways. It is called a P trap."}, {"comment_author": "mariegriffiths", "comment_text": "Very easy installation no leaks.\n\n[https://www.youtube.com/watch?v=fucjJWQBxfI](https://www.youtube.com/watch?v=fucjJWQBxfI)\n\nand\n\nhttps://www.youtube.com/watch?v=a0KzGGzAM7Q"}, {"comment_author": "johnjohn4011", "comment_text": "Hunh, that's an interesting stretch of the imagination.\n\nThat said, at some point yes it does flow sideways-ish pretty much everywhere in the world."}]}, {"post_title": "[Question] Any (theoretical) online food ordering life hacks?", "post_url": "https://www.reddit.com/r/lifehacks/comments/1byorv0/question_any_theoretical_online_food_ordering/", "post_main_text": "I have noticed that a lot of companies will give you free discounts or even free food for signing up with rewards, doing surveys on receipts, coupons, etc. I was wondering if anyone knew of a life hack to take advantage of these offers, repeatedly, and eat for free?", "post_comments": []}, {"post_title": "Kittens peed on mattress + strong Oder", "post_url": "https://www.reddit.com/r/lifehacks/comments/1bypuio/kittens_peed_on_mattress_strong_oder/", "post_main_text": "As the tittle suggests, my kitten peed on my mattress several times. I cleaned it with all purpose cleaner but how do I deep clean it? There’s also strong odor in my room. I wish to get rid of it. \n\nPlease help😭", "post_comments": []}, {"post_title": "Perfect use for a kinder surprise", "post_url": "https://i.redd.it/hgdkqt79fwsc1.jpeg", "post_main_text": "", "post_comments": [{"comment_author": "Mr_Firley", "comment_text": "I put my weed in it."}, {"comment_author": "scroogedup", "comment_text": "I use the test strip container for my blood glucose meter.  They are water tight and smaller than 35mm canister.... if anyone remembers 35mm film canisters..."}, {"comment_author": "Right-Contest5264", "comment_text": "That’s a decent idea. I think that’s what the guy at speedway thought I was gonna pull out when I was laughing like an idiot"}, {"comment_author": "ResinJones76", "comment_text": "I came to say that you can also put your weed in there."}, {"comment_author": "Pvt-Snafu", "comment_text": "Now I want to check all the kinder surprises my teenager has."}, {"comment_author": "Christopher715", "comment_text": "That's why I roll b4 I leave home😊🙃👍"}, {"comment_author": "NewfieDawg", "comment_text": "I have about 20 aluminum 35mm film canisters and a bunch of plastic ones. But then again, I'm a dinosaur."}, {"comment_author": "Mr_Firley", "comment_text": "Lol!"}, {"comment_author": "SoulLeakage", "comment_text": "Adam Sandler intensifies"}, {"comment_author": "trumpskiisinjeans", "comment_text": "I also came here to say this"}, {"comment_author": "Right-Contest5264", "comment_text": "How you gonna fit an entire joint in a kinder toy?"}, {"comment_author": "scroogedup", "comment_text": "Aluminum that's awesome!"}, {"comment_author": "ResinJones76", "comment_text": "Nah, that was the dumber guy, Rob Schneider."}, {"comment_author": "Christopher715", "comment_text": "Just \"bend to fit\".... Joints are pretty flexible...."}, {"comment_author": "shampoothewhales", "comment_text": "My family would always do an Easter egg hunt with coins in the eggs! The ones that were harder to find were worth a whole quarter."}, {"comment_author": "Savi--", "comment_text": "This was the way we used to carry chang when we were in elementary. Some coins were too big tough."}, {"comment_author": "Direct_Jump3960", "comment_text": "[bro, what the fuck were you doing in school? ](https://imgur.com/a/2ofJXwY)"}, {"comment_author": "Savi--", "comment_text": "Eating off brand kinder suprise (because the original was more expensive than my weekly pocket money) and using the small container as a container for al sorts of daily supplies. What do you think"}, {"comment_author": "Sad_Safety4880", "comment_text": "I used these all the time in prison... very easy to put things in, and the oval shape makes it ideal for placing in tight places.  Definitely a life hack."}, {"comment_author": "Right-Contest5264", "comment_text": "Good to know"}, {"comment_author": "Pongpianskul", "comment_text": "Yep. The next time you do time you'll know what to do."}, {"comment_author": "Exact-Debt-3223", "comment_text": "Used this for years!"}, {"comment_author": "adam_c", "comment_text": "Don’t tell the Americans"}, {"comment_author": "TheUruz", "comment_text": "ah yes some good european supremacy"}, {"comment_author": "-Joli_Garcon-", "comment_text": "Have these in North America as well ya know"}, {"comment_author": "TheUruz", "comment_text": "you mean Canada and Mexico right? FDA banned thise in the US (at least up until 2022 afaik)"}, {"comment_author": "-Joli_Garcon-", "comment_text": "Yes which are in North America..."}, {"comment_author": "TheUruz", "comment_text": "yes they are.. mb mine was the evergreen joke about US + kinder eggs. it was not clear enough"}, {"comment_author": "MommaGuy", "comment_text": "I use an empty gum container (the kind that fit into a cup holder) for change and small bills so when I need to feed a parking meter or get some coffee I don’t need to charge it."}, {"comment_author": "Garrhvador91", "comment_text": "Almost exclusively used for plugging Class A drugs too"}, {"comment_author": "LonelyDadbod4U", "comment_text": "a dual use as prison wallet in future. 🫣"}, {"comment_author": "Live__Fast", "comment_text": "Timely"}, {"comment_author": "akurgo", "comment_text": "When I was you age (*waves my pipe*), the two pieces were separate (not hinged), and you could use them to make little bombs with water and baking powder."}, {"comment_author": "Smoking-_Krills", "comment_text": "Give it to a homeless person as a suprise"}, {"comment_author": "-Joli_Garcon-", "comment_text": "Not if you're American. ;p"}, {"comment_author": "ludfi888", "comment_text": "no idea with that mate haha"}, {"comment_author": "mt-egypt", "comment_text": "I have a life hack: Throw out all your change. It’s useless"}, {"comment_author": "Right-Contest5264", "comment_text": "It’s money"}, {"comment_author": "mt-egypt", "comment_text": "Okay boomer"}, {"comment_author": "Different-Penalty-78", "comment_text": "used them for making smoke bombs"}, {"comment_author": "Right-Contest5264", "comment_text": "Interesting is that why they are banned?"}, {"comment_author": "theweebird", "comment_text": "To the best of my knowledge, Kinder Suprise is only banned in the USA.\n\n------\n\"Kinder Surprise eggs are banned in the US because of safety concerns related to having a “non-nutritive object” like a plastic capsule inside a confectionary product. According to the 1938 Food, Drug, and Cosmetic Act, this makes Kinder Surprise eggs an “adulterated food” and thus illegal to import and sell\" \n- Source: https://fee.org/articles/why-these-popular-chocolate-easter-eggs-are-banned-in-the-us-despite-being-legal-almost-everywhere-else/  \n------\n\nIt's just a side-benefit that kids in America have one less pre-fab material to make DIY weaponry with, I guess?"}, {"comment_author": "latecraigy", "comment_text": "I heard kids were choking on them when they ate the chocolate egg part"}, {"comment_author": "Different-Penalty-78", "comment_text": "guess so hahahahahaha"}, {"comment_author": "Right-Contest5264", "comment_text": "Yeah. I was thinking of going to get some from the Serbian store that doesn’t give a fuck and then walking past the police station smoking a joint. Kinda curious which has a bigger fine"}, {"comment_author": "Right-Contest5264", "comment_text": "Well yeah. Doesn’t mean that shouldn’t be allowed as long as it’s labeled properly."}, {"comment_author": "markowithak", "comment_text": "Wait, what Serbian store? Where?"}, {"comment_author": "Right-Contest5264", "comment_text": "Midwest town wirh a large Serbian diaspora"}, {"comment_author": "markowithak", "comment_text": "Oh wow :) I'm always surprised to hear about Serb diaspora in US. I hope they are polite people..if not..tell them shame on your ancestors from motherland :D"}]}, {"post_title": "When desperate times call for desperate measures", "post_url": "https://v.redd.it/excec08aiksc1", "post_main_text": "", "post_comments": [{"comment_author": "Independent-Deal-192", "comment_text": "Clever 👌🏻"}, {"comment_author": "Zeusurself", "comment_text": "It totally fucking is. It's so simple too."}, {"comment_author": "JVT32", "comment_text": "I used to do this with my lanyard in high school. Didn’t have a belt, and my jeans were way too big in the waist so I looped it through the two loops on the side of my jeans and made a slip knot so my keys hung back into my pocket."}, {"comment_author": "DaRunningdead", "comment_text": "The answer lies in question itself"}, {"comment_author": "Unbundle3606", "comment_text": "Except it will destroy the trousers loops eventually. \n\nAlso the belt being completely folded on itself in the middle will ruin it in a few days."}, {"comment_author": "lady_deathx", "comment_text": "If he'd threaded the belt through the rear instead of the front loops, the trousers could more quickly/easily be removed without faffing with the belt"}, {"comment_author": "EngineerBill", "comment_text": "Not clever - it's fucking brilliant!"}, {"comment_author": "flavius-", "comment_text": "It ruins the belt and the pant loops. Neither were made to bend or act in the way those video suggests."}, {"comment_author": "Repulsive_Ad3681", "comment_text": "Tried it, works for me \n\nNow those old smaller belts I had from years ago are gonna be used finally 🗿"}, {"comment_author": "fotofortress", "comment_text": "I feel like a \"hack\" implies it's not meant as a permanent solution. I don't think anyone is seeing this and going \"you know what, I'm going to buy pants to big and belts too small moving forward.\""}, {"comment_author": "fotofortress", "comment_text": "A \"hack\" isn't designed to be the final solution. Eventually people lose weight or by a larger size....you hack in a pinch."}, {"comment_author": "Willing-Plastic-5122", "comment_text": "Noooo!!! You can’t be serious! You mean the earth will explote and we’re all going to die?"}, {"comment_author": "alldayfiddla", "comment_text": "Simple yet effective thought process!"}, {"comment_author": "Exemus", "comment_text": "> you hack in a pinch\n\nWhy does this feel like you're insulting me? lol\n\nNO! *YOU* HACK IN A PINCH"}, {"comment_author": "flavius-", "comment_text": "No, not at all. Appropriate reaction, though. Take it tot he absolute extreme on a statement that was very much normal. Classic Reddit moment."}, {"comment_author": "fotofortress", "comment_text": "I do. My coworkers love that about me because I can mend their clothes for the day. It’s not meant to hold like a proper tailor."}, {"comment_author": "Bert_Nurny", "comment_text": "Wow I would have never thought to do that.. smart!"}, {"comment_author": "anon-mally", "comment_text": "Give this dude a nobel prize in Gastro Physics hes found simple solution in waist string theory and observable gastro belt."}, {"comment_author": "ScienceJamie76", "comment_text": "🤣🤣🤣"}, {"comment_author": "McPorkums", "comment_text": "HA.  wouldnt work for me, I have no ass #hankhillass"}, {"comment_author": "idreamofgreenie", "comment_text": "DGS. Diminished Gluteal Syndrome."}, {"comment_author": "Artarious", "comment_text": "Same. Lemme know if you wanna join of our support group, we usually meet up in the back of the local TV/VCR repair place."}, {"comment_author": "slippingparadox", "comment_text": "I’m considering some nice overalls for this very reason"}, {"comment_author": "bolerobell", "comment_text": "I prefer MPAL- Male Pattern Ass Loss"}, {"comment_author": "Comfortable-Jelly833", "comment_text": "Wouldn't it work better in this case? No ass to pop out and reveal the secret"}, {"comment_author": "xproofx", "comment_text": "My dad said I offered from Noassatall."}, {"comment_author": "blarghable", "comment_text": "You should meet up at the gym and do squats."}, {"comment_author": "SocialistArkansan", "comment_text": "Or suspenders"}, {"comment_author": "SocialistArkansan", "comment_text": "No. Pants won't have a place to naturally stop, so you end up with plumber's crack. Pulling them back up is futile in the long run."}, {"comment_author": "Artarious", "comment_text": " I think you misunderstand how deminished gulterial syndrome aka #Hankhillass works. There is no muscle to build and the only support we get is from each other and our swanky fake ass orthotic inserts. If you'd like to join our group sometime we'd love to educate you, let me give you my card."}, {"comment_author": "BaylisAscaris", "comment_text": "This will damage belt loops and leather belts, but would work temporarily in an emergency."}, {"comment_author": "OcelotFunny9069", "comment_text": "By the look of the belt it's not the first time he did this."}, {"comment_author": "jimbobkarma", "comment_text": "Those two loops working double overtime, without extra pay."}, {"comment_author": "verstohlen", "comment_text": "Those loops, they a cannot hold much longa, Captin!!  They weren't designed ta take that kinda pressure!!"}, {"comment_author": "Sped-Connection", "comment_text": "Did this with a hay string when I was a kid"}, {"comment_author": "Day_Bow_Bow", "comment_text": "It cracks me up that you called twine \"hay string.\""}, {"comment_author": "HassanMoRiT", "comment_text": "I did it with a metal coat hanger"}, {"comment_author": "hutchins_moustache", "comment_text": "Hay string is not uncommon slang for bailing twine in these-here parts, mister."}, {"comment_author": "AdoptedOne01", "comment_text": "Hay string is the appropriate term. 'Twine' sounds too formal and 'citified' lol"}, {"comment_author": "Zero-to-36", "comment_text": "*yall* !!!"}, {"comment_author": "Interesting-Bison108", "comment_text": "Ha! Brilliant!"}, {"comment_author": "facelessindividual", "comment_text": "You can do this with the button and the first belt loop if you don't have a belt\n\nEdit: [Image](https://i.imgur.com/X26SrY8.jpeg)"}, {"comment_author": "kingofmankind", "comment_text": "BOND, James Bond 😎"}, {"comment_author": "itbittitcommit", "comment_text": "This might be the new fashion trend"}, {"comment_author": "Noimenglish", "comment_text": "Take my like, dammit"}, {"comment_author": "TickTockM", "comment_text": "damn. thats a game changer right there"}, {"comment_author": "jdehjdeh", "comment_text": "Guy should work for NASA"}, {"comment_author": "SatansMoisture", "comment_text": "Nice!!!"}, {"comment_author": "SluggishPrey", "comment_text": "I've been doing something similar with elastics"}, {"comment_author": "therealscottenorman", "comment_text": "Genius"}, {"comment_author": "Vengeance752", "comment_text": "That is absolute genius!"}, {"comment_author": "Eddie_the_red", "comment_text": "Belt loops won’t last long… still cool though"}, {"comment_author": "TheKarmaFiend", "comment_text": "It’s not meant for every day use. It’s just a temporary solution."}, {"comment_author": "Tegrity1911", "comment_text": "Plus the belt already too small for him anyway. This the only real use he'll have for it unless he give it to somebody"}, {"comment_author": "lakersmike", "comment_text": "That’s a great bar bet"}, {"comment_author": "herder_of_pigeons", "comment_text": "Now I know!"}, {"comment_author": "WeedLMT69", "comment_text": "This is how I tie my robe, game changer, def try it!"}, {"comment_author": "bebopblues", "comment_text": "My belt holds my pants up, but the belt loops hold my belt up. I don't really know what's happening down there. Who is the real hero? \n\n\\- Mitch Hedberg."}, {"comment_author": "3_14-r8", "comment_text": "Not gonna lie, that seems like it would be more comfortable as well, someone should start manufacturacting front only belts."}, {"comment_author": "toasted_gogi", "comment_text": "Fucking brilliant"}, {"comment_author": "2much2often", "comment_text": "Genius!"}, {"comment_author": "Abbycat1962", "comment_text": "Came here to say that. I knew someone had beat me to it."}, {"comment_author": "ConsistentCustomer37", "comment_text": "Damn!"}, {"comment_author": "allflippedout", "comment_text": "TIL, wow..."}, {"comment_author": "j007jayesh", "comment_text": "That's really smart!"}, {"comment_author": "LostNfoundshoe", "comment_text": "Just tried it. It checks out. Very nice move"}, {"comment_author": "RashPatch", "comment_text": "New Skill unlocked. Thank you brother."}, {"comment_author": "MeGoBoom57", "comment_text": "Okay… props to the homie!"}, {"comment_author": "XX-redacted-XX", "comment_text": "Approved!"}, {"comment_author": "RyunWould", "comment_text": "It's actually brilliant."}, {"comment_author": "johnsonsantidote", "comment_text": "That's great and thanx 4 sharing. i only just threw abelt out coz it was too small. Lucky it's still in the bin and i'll retrieve it."}, {"comment_author": "Madi_Scientist", "comment_text": "I did this at work once, but instead of a belt it was two zip ties between two belt loops. My belt broke and I was incredibly desperate."}, {"comment_author": "Greeneyes-", "comment_text": "This man is going places"}, {"comment_author": "TopFishing5094", "comment_text": "Genius"}, {"comment_author": "Indylatino", "comment_text": "Mexican ingenuity at its finest, I love my people lol"}, {"comment_author": "tkap13", "comment_text": "Looks like you don’t need the belt to hold those pants up"}, {"comment_author": "ProzacJM", "comment_text": "That’s brilliant!!"}, {"comment_author": "triggz", "comment_text": "this actually works better in some cases, like house robe belts."}, {"comment_author": "KaleidoscopeFun9782", "comment_text": "Damn he looks like a fat karl anthony towns"}, {"comment_author": "irrelevanth7", "comment_text": "Darth Vader holding the phone"}, {"comment_author": "Fair-Advantage9539", "comment_text": "Genius"}, {"comment_author": "Clemson1313", "comment_text": "Genius 😘"}, {"comment_author": "Wonderful-Fishing857", "comment_text": "Now that is actually genius!"}, {"comment_author": "Italiancrazybread1", "comment_text": "Now he's ready for his job interview"}, {"comment_author": "WTF_aquaman", "comment_text": "Mind blown.  I’m going back to bed now."}, {"comment_author": "psichodrome", "comment_text": "Do that for 2 hours with mild movements and you'll rip your belt-loops and put a permanent kink in your belt.   Acceptable in an emergency."}, {"comment_author": "KhalArj", "comment_text": "r/BetterEveryLoop"}, {"comment_author": "DaRunningdead", "comment_text": "NASA already hired him."}, {"comment_author": "New-Neighborhood30", "comment_text": "Slow clap."}, {"comment_author": "Ok_Potential359", "comment_text": "Does it actually tighten your waste though?"}, {"comment_author": "HighVoltageFerret", "comment_text": "Zip ties also"}, {"comment_author": "TheTanith1st", "comment_text": "This is Brilliant!! Haha"}, {"comment_author": "gatsbyhoudini1", "comment_text": "If you don't have a belt, you can use the 'handle' area of a plastic bag. Cut it, pass It through any two loops of your pants and tie it."}, {"comment_author": "FreneticAmbivalence", "comment_text": "I was pretty poor growing up and We would use string, hanky or a sock to do this over a hoop or two. Nostalgia!"}, {"comment_author": "Knocksveal", "comment_text": "Genius"}, {"comment_author": "MercykillNJ", "comment_text": "At work I take a piece of string and tie two of my belt loops together and that works just as well as any belt I've ever used."}, {"comment_author": "PsychologicalLink390", "comment_text": "Mind blown!"}, {"comment_author": "mattjouff", "comment_text": "trend setter right there."}, {"comment_author": "tacomayne07", "comment_text": "Lmao hell yeah bro that's what's up"}, {"comment_author": "Additional-Help7920", "comment_text": "They're now selling short \"belts\" that use the two belt loops on either side of your jeans to do essentially the same thing."}, {"comment_author": "bout-tree-fitty", "comment_text": "It’s like a mullet for your pants.    \n   Business up front.   \n    Party in the back."}, {"comment_author": "nicannkay", "comment_text": "I used to do this at FedEx with zip ties. One on each side on the days I left without my belt."}, {"comment_author": "Prudent-Ad2877", "comment_text": "Smart 🤓"}, {"comment_author": "justglassin317", "comment_text": "This reminds me of junior high when losers insisted on drooping their pants (violating dress code). Hall monitors would pull them aside and kindly ask them to fix their pants. If they refused (or couldn't because they're wearing size 42 pants with a 29\" waist), the monitors would zip tie their belt loops together."}, {"comment_author": "Chemical-Money-3469", "comment_text": "🤔………….A win is a win 🤷🏾‍♂️🙌🏾🎊😂"}, {"comment_author": "DustyElderberry", "comment_text": "Brilliant!!!"}, {"comment_author": "balenbro", "comment_text": "He ate, then he cooked"}, {"comment_author": "Duffman_ohyea", "comment_text": "That cackle from that lady in the background is hilarious 😆"}, {"comment_author": "VivisClone", "comment_text": "I do this with key chain holders from time to time. The short ones with a ring and (at least the ones I have) clips. Put em through 2 loops patch it. Instant belt"}, {"comment_author": "troyberber", "comment_text": "Dolce & Gabbana figured this shit out back in the 90s. They had specific pants and then the belts that go with them just for this purpose. \nOverpriced and inaccessible? Yes. Not a social media hack tho."}, {"comment_author": "ScallionSufficient74", "comment_text": "Real men of genius!"}, {"comment_author": "Blaqu1", "comment_text": "Ingenious"}, {"comment_author": "NotThatAngel", "comment_text": "This is genius."}, {"comment_author": "Apalebluedot1324", "comment_text": "Brilliant"}, {"comment_author": "Der_Gallier", "comment_text": "The upper Belt is gonna slip up and be over the Jeans"}, {"comment_author": "congressmanalex", "comment_text": "Can always reloop on the front loops"}, {"comment_author": "savvyGuy124", "comment_text": "LIKE A BOSS"}, {"comment_author": "adegreeofdifference1", "comment_text": "That’s hilarious."}, {"comment_author": "ChokyWilliam", "comment_text": "I used to do this with my lanyard in high school. Didn’t have a belt, and my jeans were way too big in the waist so I looped it through the two loops on the side of my jeans and made a slip knot so my keys hung back into my pocket."}, {"comment_author": "dm-rino", "comment_text": "Whats the point in wearing a belt with low hanging trowsers?! He looks like a sausage now"}, {"comment_author": "GrucoGuravi", "comment_text": "this is the way"}, {"comment_author": "RaindropsAndCrickets", "comment_text": "Literally Genius!"}, {"comment_author": "calishamrock", "comment_text": "Yes sir"}, {"comment_author": "King_Krong", "comment_text": "I can’t be the only one who doesn’t understand wtf is happening here."}, {"comment_author": "scooterable", "comment_text": "He puts the middle of the belt through the front loops, then folds/pulls forward the ends that are hanging off to meet in the middle at the front. It then looks like he has a belt on normally, even though it’s actually only on the front half of his pants."}, {"comment_author": "momentum77", "comment_text": "Narrator: But he was."}, {"comment_author": "Doktor_Vem", "comment_text": "You definitely weren't, thanks for asking so I didn't have to lmao"}, {"comment_author": "TheKarmaFiend", "comment_text": "When pulled together it tightens the waistband keeping the pants up"}, {"comment_author": "Penguinase", "comment_text": "lol the belt is way too small so he improvises to still have the belt look"}, {"comment_author": "King_Krong", "comment_text": "Thank you."}, {"comment_author": "maxkmiller", "comment_text": "it doesn't tighten anything, it's just for show because they're going out and he wants to look nicer"}, {"comment_author": "Senior_Fart_Director", "comment_text": "but why does he have such a small belt"}, {"comment_author": "TheKarmaFiend", "comment_text": "Lmao, test it for yourself then instead of spouting some random bs"}, {"comment_author": "Penguinase", "comment_text": "he says at the beginning he's in a pinch and his cousin has some small belt to use because he forgot his own\n\ni.e. he's borrowing a small belt from someone and making it fit for cosmetic purposes"}, {"comment_author": "Nayte76", "comment_text": "Had a feeling this was where he was going, nicely done."}, {"comment_author": "WittyBonkah", "comment_text": "He’s so handsome"}, {"comment_author": "djmonize13", "comment_text": "You don't need a belt if you buy pants that fit! \n\n  \n- Wayne from Letterkenny"}, {"comment_author": "cricardo65", "comment_text": "Lose some weight 🤔"}, {"comment_author": "e_man11", "comment_text": "Or just buy a new belt....."}, {"comment_author": "PuddingJumpy8995", "comment_text": "If you have to do this, maybe buy some gym shorts and a gym membership."}]}, {"post_title": "Trying To Find A Good Hack To Recreate Discontinued Mrs. Meyer's Liquid Laundry Detergent in Geranium Scent!", "post_url": "https://www.reddit.com/r/lifehacks/comments/1bx1air/trying_to_find_a_good_hack_to_recreate/", "post_main_text": "It took awhile to find more natural cleaning products in a scent that everyone could tolerate and a few years ago, we discovered Mrs. Meyer's Geranium scented liquid detergent and fabric softener and life was good. We also use the dish liquid, spray cleaner and hand soap. Started running out of the laundry detergent and softener a couple years ago and discovered it had been discontinued without any notice. Crap. Not liking the Lavender or the Rain or the Peony. So then we thought maybe we could hack something ourselves with another brand's unscented liquid detergent and maybe use the Geranium dish soap or the hand soap (which haven't been discontinued) and mix it in. Tried calling Mrs. Meyer's to ask for advice and that was a complete dead end and no, they aren't planning on bringing it back.\n\nSo, to any of you more scientific hackers out there, do you think the formulation of the dish soap or the hand soap would work better in the unscented liquid detergent? Figuring people smarter than us might recommend one over the other for some reason or another. ", "post_comments": [{"comment_author": "Unfair_Finger5531", "comment_text": "Sad they discontinued this scent, it’s my fav."}, {"comment_author": "horsesarecool512", "comment_text": "I use unscented detergent and then add drops of essential oil to wool dryer balls and it’s the perfect amount of scent. Maybe find a close match in the oil section and try that?"}, {"comment_author": "SeattleHasDied", "comment_text": "Not a bad idea."}, {"comment_author": "Grockssocks", "comment_text": "Me and the family started making our own around Christmas 2022. $40 worth of dry ingredients and we only ran out *last week*. I think it cleans the clothes better, too. You could probably just carefully mix in geranium oil, perhaps to the whole batch or drops into each measured scoop before adding.  \n\nA&H baking soda+A&H super washing soda, 4 fells naphtha bars grated, borax, oxiclean versatile stain remover powder. Add downy unstoppable or something similar if you like a nice scent.  \n\nIt's mind-blowingly cheaper and legit I think it cleans the clothes better."}, {"comment_author": "graysquirrel14", "comment_text": "I hate saying this but if you have an old bottle with the ingredients listed, plug it into ChatGPT and ask for a natural ingredient supplement and measurements?\nWorked for a cookie recipe I wanted lol"}, {"comment_author": "HouseSandwich", "comment_text": "What cookie recipe?"}, {"comment_author": "Physical_Stress_5683", "comment_text": "Here's the ingredient list, why not try mixing some essential oils with those scents? Then once you nail the blend you can add it to your cleaner."}, {"comment_author": "aclinejr", "comment_text": "Make sure the essential oils are skin-safe. People get burns and allergic reactions not knowing most essential oils are not safe for skin."}, {"comment_author": "bluecat2001", "comment_text": "They will be literally washed away."}, {"comment_author": "MezzanineSoprano", "comment_text": "You can buy rosé geranium essential oil & add some to non-scented products."}, {"comment_author": "CandylandCanada", "comment_text": "Add geranium essential oil to an unscented soap. Problem solved."}, {"comment_author": "SeattleHasDied", "comment_text": "Actually did try some essential oils, but it didn't fly so that's why we thought using the Geranium dish soap or hand soap in some unscented laundry detergent might be the way to go."}, {"comment_author": "Pyxnotix", "comment_text": "Did you try wool dryer balls with a few drops of geranium oil? \n\nI find the smell to be suffocating so this cracks me up to suggest. I cannot stand the geranium line although it smells pleasant for a few seconds before the suffering starts haha."}, {"comment_author": "alluvium_fire", "comment_text": "Did you try geranium oil?"}, {"comment_author": "SeattleHasDied", "comment_text": "That's kind of funny in that it was the least offensive to everyone, but still modestly pleasant, lol!"}, {"comment_author": "Caranath128", "comment_text": "Funny, I hated geranium.  I’d buy every single fresh cut grass though….."}, {"comment_author": "PrissySobotka", "comment_text": "I use \"country save\" powder and mix in geranium oil"}, {"comment_author": "SeattleHasDied", "comment_text": "I'm just wondering if the essential oil (if we ever find one that matches the Mrs. Meyer's Geranium) itself will mess with the detergent's qualities... Guess I'll have to work on the science some more...  DAMN YOU, MRS. MEYER'S!!!!!! (shakes fist at the sky, lol!)."}, {"comment_author": "healmeier", "comment_text": "FYI... Mrs. Meyers is not natural. They use fragrance. Just a sales pitch."}]}, {"post_title": "Thanks in advance", "post_url": "https://www.reddit.com/r/lifehacks/comments/1bxnzp4/thanks_in_advance/", "post_main_text": "There is this document that i need yo memorize ..i tried  multiple tips /tools and nothing yet \n\nAny advice!!!!", "post_comments": [{"comment_author": "mindofamy", "comment_text": "Record it and listen to it over and over and over again. Also memorize it in sections. Good luck!  Let us know how it goes."}, {"comment_author": "Both-Pack8730", "comment_text": "Can you put key words to make a song in your head?"}, {"comment_author": "Eureka18osa", "comment_text": "i did that one ,thanks"}, {"comment_author": "thephilistine_", "comment_text": "Tattoo it on your arm."}, {"comment_author": "Eureka18osa", "comment_text": "i wish ..34 pages"}, {"comment_author": "thephilistine_", "comment_text": "You need to memorize 34 pages of shit?  Good luck."}, {"comment_author": "NorthReading", "comment_text": "Say it out loud and visualize the words as you go.\n\nAt new paragraphs visualize a bridge between words\n\nRepeat out loud.\n\nrepeat"}, {"comment_author": "Sleepy_Panda0_0", "comment_text": "pretend you explaining it as a teacher to your plushies always works for me"}, {"comment_author": "just-me-again2022", "comment_text": "I’ve always done best with things like this by writing it out. \n\nJust the act of writing helps put it in your head. And depending what kind of document it is, you can format it in a way that might make it easier as well. \n\nFor instance, maybe a portion can be broken down into bullet points, and then when you’re recalling it, you can remember how many bullet points there are, to know if you’re missing anything."}, {"comment_author": "Scat_fiend", "comment_text": "Don't only listen to it but say it out loud. Mix it up and say it in different ways. But by far the most effective way to remember something is to teach it. Explain it to a friend."}, {"comment_author": "droffowsneb", "comment_text": "Ask ChatGPT to turn it into a common song maybe?"}, {"comment_author": "HiCo21", "comment_text": "Write it down over and over again. Writing it will retain the memory of it"}, {"comment_author": "arthorpendragon", "comment_text": "better strategy than memorisation is to become an expert on a particular area. the best public speakers speak from expertise not memory. if you are an expert in an area then you can talk off the top of your head without having to memorise anything. get to understand the document as an expert in that area and you will impress much more than boring regurgitation."}, {"comment_author": "surferuncle", "comment_text": "make it a song, 100%  that always helps me.\n\nit’s also helpful to listen to someone read it (if possible) on youtube and just repeat it over and over and over again, both while paying attention to it and with it playing in the background. \n\ngood luck!"}, {"comment_author": "Solrackai", "comment_text": "Read it 75 times in a row"}, {"comment_author": "HunterTimely204", "comment_text": "Make it into a rap song, but you have to rap it like biggie smalls."}, {"comment_author": "pjh16", "comment_text": "I remember things better if I write or type them. You could break it into smaller pieces also."}, {"comment_author": "Dzz_Nuggz", "comment_text": "Do this. Works best if you chunk it out into blocks of 4-6 sentences. Write the first letter of each word as you see it in the sentence. Capitalize and punctuate exactly as it is written. Now, read what you wrote a couple of times and then recite it. It works. Good luck!"}, {"comment_author": "Euphoric_Jam", "comment_text": "Write it down yourself using pen and paper then study with it. It works wonders."}, {"comment_author": "aclinejr", "comment_text": "If it's a list you turn the words into a story and the crazier the better. Just go over it a few times and then once a day for a week and you will never forget it. Also, don't worry about memorizing word for word. Chunk it into sections making your own story. The main thing is getting a hook created so your brain can easily retrieve the information. Your brain memorizes by linking information.\n\nExample:\n\nTomatoes, Avacados, carrots, flour, and butter.\n\nI was in a tomato field and for some reason, they were still green and shaped like avocados. I noticed something odd coming out of the ground and thought it was a weed and pulled it, but it was a carrot. I look over at the house and a lady is baking and is covered in flour and trying to cut frozen butter."}, {"comment_author": "elnina999", "comment_text": "Read loud yourself. \nFocus when reading."}, {"comment_author": "Itburns138", "comment_text": "Anki cards?"}, {"comment_author": "Klekd2", "comment_text": "Record and listen to it while you sleep."}]}, {"post_title": "Put dish soap in you hand soap dispenser.", "post_url": "https://www.reddit.com/r/lifehacks/comments/1by74qm/put_dish_soap_in_you_hand_soap_dispenser/", "post_main_text": "I tried this by accident and realized that because dish soap is so thick, you only need one pump and that is enough to clean your hands. \n", "post_comments": [{"comment_author": "Zora74", "comment_text": "I only need one pump of hand soap to clean my hands, so I don’t see the benefit."}, {"comment_author": "1Steelghost1", "comment_text": "Please don't do this!! There is an important reason it is called DISH soap and not hand soap. It is a de-greaser and is made to remove oils. Hey guess what, your hands/ skin have very important oils on them that protect it from turning to sandpaper. Seriously guys what the hell?!?😵🙄"}, {"comment_author": "stinky_pinky_brain", "comment_text": "Yea this sub has either drastically gone downhill or I just need to spend less time on the internet"}, {"comment_author": "TootsNYC", "comment_text": "I knew someone in high school who regularly used dish soap to wash her hair.\n\nHer hair was really dull and awful looking."}, {"comment_author": "ThatGuavaJam", "comment_text": "Yeah there’s reason I use dish gloves when I do the dishes. If you need a soap lifehack body soap could work but I didn’t know no one already knew that"}, {"comment_author": "CoolWhipMonkey", "comment_text": "I always use dish soap for my hands when I’m in the kitchen. I can’t imagine bothering to have separate hand soap."}, {"comment_author": "2samplet", "comment_text": "It went downhill but then found a trapdoor to a well and fell even further"}, {"comment_author": "Physical_Stress_5683", "comment_text": "Don't say that. Then I'll have to rethink my Internet time and get shit done in IRL."}, {"comment_author": "DarkGreenSedai", "comment_text": "I just flashbacked to middle school when my father told me to “just use the soap” so I washed my hair with Irish spring soap… that wasn’t a good outcome."}, {"comment_author": "Zora74", "comment_text": "I’ve tried that too when I ran out of shampoo. \n\nI will never take shampoo for granted again."}, {"comment_author": "deathclonic", "comment_text": "Put ketchup in your shampoo bottle"}, {"comment_author": "Fergalicious-def", "comment_text": "Only do this if you're a redhead"}, {"comment_author": "Physical_Stress_5683", "comment_text": "Or want to be one very briefly. Or are acting out a Little Mermaid fantasy which I have totally never ever done in the shower."}, {"comment_author": "Zora74", "comment_text": "Or the prom scene from Carrie."}, {"comment_author": "m1ndweaver", "comment_text": "Dish soap dries my skin out. Find a good hand soap where one pump does the trick."}, {"comment_author": "Herr_Jott", "comment_text": ">where one pump does the trick"}, {"comment_author": "Cundalinisstump", "comment_text": "does the trick"}, {"comment_author": "BF1shY", "comment_text": "the"}, {"comment_author": "EngineeringNo5587", "comment_text": "Pump"}, {"comment_author": "oeco123", "comment_text": "r/shittylifeprotips"}, {"comment_author": "Outofoffice_421", "comment_text": "Dish soap will ruin your skin in the long term. It strips all the oils and dries out skin. Be careful"}, {"comment_author": "Lilly6916", "comment_text": "My hands get dried out enough already. No thanks."}, {"comment_author": "PugetSoundingRods", "comment_text": "Life hacks is a garbage subreddit full of idiotic advice like this"}, {"comment_author": "Ichthius", "comment_text": "What is your better life hack?  Please post it."}, {"comment_author": "SteveForDOC", "comment_text": "Wash your hands with hand soap."}, {"comment_author": "PugetSoundingRods", "comment_text": "Life hack: don’t wash your fucking hands with dish soap"}, {"comment_author": "CoolWhipMonkey", "comment_text": "Why lol? I’ve done it my whole life."}, {"comment_author": "Background-Potato153", "comment_text": "contact dermatitis is not cute"}, {"comment_author": "bulamae", "comment_text": "Or better yet get a foam pump and way reduce soap use. Dish soap like Palmolive aren't as harsh on hands but Dawn or Mrs. Meyers will strip your skin!"}, {"comment_author": "AdoptedOne01", "comment_text": "Yes, I buy foaming hand soap pumps and refill them with a mix of Palmolive, water, and a bit of glycerin. I reuse the bottles several times until the pump mechanism starts to fail, then buy a new one. Reduces waste!"}, {"comment_author": "puzzled-seeker", "comment_text": "I do the same thing except that I only use water an Dawn dish soap. Has been working extremely well for both dishes and hand washing for over a year. No issues with dry skin or greasy dishes either."}, {"comment_author": "DaRunningdead", "comment_text": "this is the reason AI will easily take over humanity"}, {"comment_author": "SewCarrieous", "comment_text": "Ouch! No way!"}, {"comment_author": "TheOnlyKirby90210", "comment_text": "the dish soap will make your hands dry and cracked. There are cheap soaps at dollar stores if there is a concern about your budget."}, {"comment_author": "ForestGremlin2", "comment_text": "I do this in my kitchen, not for hand-washing reasons (tho I also use it for that because I don’t care enough), but so I can just do pumps of dish soap onto my sponge instead of hauling out the big bottle of dish soap from under the sink every time I want to wash a dish. Plus, I got a pretty glass soap dispenser that looks lovely with the blue dish soap in it - much nicer on my counter than a plastic bottle of dish soap "}, {"comment_author": "ossimo", "comment_text": "Exactly! I do this as well and assumed this is what OP was talking about."}, {"comment_author": "desnudopenguino", "comment_text": "Yeah. This is how I use this setup. Though I just reused a plastic hand soap dispenser."}, {"comment_author": "jme518", "comment_text": "Yo what???? Dish soap is for dish. Hand soap is for hand. Dish soap destroys hands lol"}, {"comment_author": "Kahnza", "comment_text": "My entire adult life I have only ever used dish soap. Never had an issue with it."}, {"comment_author": "CashgrassorNopass", "comment_text": "May be better off using shampoo. I used Suave because it was the cheapest thing for twice the amount of liquid you get for soft soap."}, {"comment_author": "nightcap965", "comment_text": "No, but I did put my favorite fragrance of Harry’s Body Wash in my hand soap dispenser."}, {"comment_author": "Birdywoman4", "comment_text": "I use green Palmolive dish soap and use a foamer dispenser and make sure it mixed well. It only takes a small bit of soap that way. I have 3 pumps, one in each bathroom and one at the kitchen sink. It does not crack or dry my hands."}, {"comment_author": "val319", "comment_text": "I did this by accident. I buy Meyer’s hand soap. The dish soap and hand soap containers look exactly the same. It’s not a really strong soap so I’ll finish it out and then buy the right stuff. I’m not endorsing it. It’s not dawn but I like something it’s moist."}, {"comment_author": "sonicsludge", "comment_text": "OP was almost right. I put it in the hand pump but use it on dishes so I don't have to look at the ugly bottle. If I use it on my hand it's definitely not a whole pump, more like a drop."}, {"comment_author": "penniless_witch", "comment_text": "We recently moved into a house with only a shower stall (no bathtub) in the bathroom. I still had bubble bath gifts from Christmas so I used it in the soap dispenser. Works well."}, {"comment_author": "2samplet", "comment_text": "Wow, what a lifehack!"}]}, {"post_title": "You can use your pocket knife as a pill splitter in a pinch", "post_url": "https://i.redd.it/0bua15e0fisc1.jpeg", "post_main_text": "", "post_comments": [{"comment_author": "CK_CoffeeCat", "comment_text": "If a pill has a built-in score mark like this and a round bottom, you can split it with no tools. Set it on a hard surface, put a fingertip on opposite sides of the scoring mark, and press down."}, {"comment_author": "NashCp21", "comment_text": "So easy without any tools. I can do it one handed with thumb on the smooth side and index/middle finger lines up with the scored side"}, {"comment_author": "wizard_interrogative", "comment_text": "the most annoying thing is when you get a score mark but no round bottom"}, {"comment_author": "Galaxy-High", "comment_text": "Correct. It's kind of how it was designed."}, {"comment_author": "unknown00021", "comment_text": "That’s literally what I do."}, {"comment_author": "andthendirksaid", "comment_text": "This is how it's done. Anything flat works and ya just push and it snaps."}, {"comment_author": "Super_Ad9995", "comment_text": "Make sure you can split it, though. Just because it has a mark there doesn't mean that you can split it to take it as 2 smaller pills."}, {"comment_author": "No_Confection_8384", "comment_text": "This is the way. Even works for unscored tablets  (e.g. my dogs famotidine)… not as precise as it would be on a scored tablet but depending on the med and the situation, it’ll do."}, {"comment_author": "fuck_peeps_not_sheep", "comment_text": "That's all well and good but due to arthritis my finger tips are numb 24/7 and I have no pressure control, pills either ping away or turn to dust piles."}, {"comment_author": "HoldingOntoAHandle", "comment_text": "Agreed. The original hack was the score line, not a recommended line to cut on!"}, {"comment_author": "Electronic_Term_9728", "comment_text": "some of the \"continus\" (wax like time release mechanism) pills such as- Dihydrocodeine (60/90/120 only) or Morphine Sulphate need a 9LB hammer to just flatten them, but any other pill is a 2 second job like you describe."}, {"comment_author": "iluvsporks", "comment_text": "There is no spoon"}, {"comment_author": "royalpyroz", "comment_text": "Sush..let OP use his cute little toy"}, {"comment_author": "GardenPeep", "comment_text": "Sorry, some pills are too hard to split. This is a useful lifehack"}, {"comment_author": "Necrotitis", "comment_text": "Not true for all pills.\n\nI was on metforming and when I tried to break them this way they just shattered everywhere."}, {"comment_author": "projektorfotze", "comment_text": "This"}, {"comment_author": "MaterialComplete6896", "comment_text": "It's so easy I can do it simply by thinking about the pill splitting in half"}, {"comment_author": "Simmi_86", "comment_text": "Thumb and first finger on a hard surface"}, {"comment_author": "Ancient_Ad7587", "comment_text": "Depends on the pill. I've had certain tablets that hard as coffin nails and practically to actually impossible in certain cases. Then there are pills that crumble under the slightest pressure. Doesn't seem to have a pattern so it really seems to be a case by case basis."}, {"comment_author": "WolfOfPort", "comment_text": "Unless youre weak and need pills"}, {"comment_author": "christinextine", "comment_text": "The pill splitter lobbyists peddling their plastic pill splitters don’t want you to know this one easy hack."}, {"comment_author": "Electronic_Term_9728", "comment_text": "unless it's an MST lol"}, {"comment_author": "osirisrebel", "comment_text": "Also depends on the pill, some are like breaking a cracker, and others are laced with vibranium."}, {"comment_author": "Royalchariot", "comment_text": "I have pills that are triangle shaped and scored down the middle for half dose. Thing is, it never breaks clean."}, {"comment_author": "Sprengles", "comment_text": "I find a twist as opposed to a snap works well"}, {"comment_author": "andthendirksaid", "comment_text": "Ight so I figured this one out pretty recently. So yknow how the round pill needs that flat surface? The effect works both ways. \n\nIf you can find anything round, something large preferably, line up the score straight up and down, basically let the score be the center marker for where the contact is made on the round surface.  Same thing, fingers one each side and push down, using the curve to let the score do its thing. Try not to drop it.\n\nThe side of the bottle (or cap if the bottle has too much give) is the go-to, obviously if you have the bottle on you. I've done it using a knuckle on the opposite hand as the surface in a pinch. Use ya jawbone idfk. It's doable though."}, {"comment_author": "dalekaup", "comment_text": "could you use  a toothpick to raise the ends off of the surface?"}, {"comment_author": "chatterwrack", "comment_text": "I take one with no score and is flat on both sides. I have to split it every other day. I slide it to the edge of my nightstand and press, snapping half of it off. It’s been working pretty well"}, {"comment_author": "42069161", "comment_text": "Those ones can be split easily by putting them into a snap lock bag and using the blunt side of a knife to split it. Bag ensures no pill parts break and go flying."}, {"comment_author": "CK_CoffeeCat", "comment_text": "Yep, that’s what I figured."}, {"comment_author": "Kolada", "comment_text": "Like obviously it depends on how the Dr prescribes it, but iirc having that line means that it does have equal amounts of active ingredient on each side (whereas no line means there's no promises). So like if your Dr prescribes 100mg and it's cheaper to buy 200mg tablets and split them, that's fine to do."}, {"comment_author": "CK_CoffeeCat", "comment_text": "Merely suggesting another method, not intending any censure. 😁"}, {"comment_author": "CK_CoffeeCat", "comment_text": "Metformin tablets are flat though. This works on round bottom pills best."}, {"comment_author": "IDatedSuccubi", "comment_text": "It's so easy I didn't have to think about it, you already did it for me"}, {"comment_author": "BremFM", "comment_text": "It's so easy I don't even have to break it. I simply place the pill directly on the skin, and my body absorbs the chemical components directly into my bloodstream, becoming all-powerful"}, {"comment_author": "yung-gummi", "comment_text": "Look mom! No hands!"}, {"comment_author": "amitygoodtogo", "comment_text": "My pills come split out the bottle"}, {"comment_author": "Renoxide", "comment_text": "I’ve had ones I’d need to put one edge of the pill and my body weight into it leaning into the countertop for it to snap it and others you could break by finger"}, {"comment_author": "Electronic_Term_9728", "comment_text": "bro, everyone forgetting about the time release pills full of that waxy stuff that is pure solid."}, {"comment_author": "betarad", "comment_text": "laced you say.... what might vibranium intake do for my health ?"}, {"comment_author": "dream-smasher", "comment_text": "I've never had a triangle shaped pill before, so straight away I went googling to figure out what it was for...."}, {"comment_author": "MidnightDragon99", "comment_text": "Mine is a shield shape 😭 it’s so hard not to get it to split into three pieces!!"}, {"comment_author": "tbt10f", "comment_text": "Always a twist at the end, no snap."}, {"comment_author": "wizard_interrogative", "comment_text": "back of a spoon would probably work nicely. good call"}, {"comment_author": "Electronic_Term_9728", "comment_text": "from what i've seen if you're smashing pills up.\nit's to get high, i've been on valium my whole life and have never seen anyone get prescribed 1 and a half pills, but i have seen hospital staff give someone an actual pill splitter for bursting up waxy time release meds for getting high."}, {"comment_author": "Baitrix", "comment_text": "Yes johnny, thats why you need to take your pain medication."}, {"comment_author": "42069161", "comment_text": "Those tough ones can be split easily by putting them into a snap lock bag and using the blunt side of a knife to split it. Bag ensures no pill parts break and go flying. Alternatively you can put the pill in a bag or on a plate and use the flat end of a sturdy glass or something similar to just crush it. Split the powder evenly and take it. No bastard pill is gonna make me struggle to split it."}, {"comment_author": "osirisrebel", "comment_text": "Replaces the iron, making you superhuman, and not feel as cold in a mildly air conditioned room."}, {"comment_author": "Royalchariot", "comment_text": "There’s a ton of triangular shaped pills"}, {"comment_author": "Royalchariot", "comment_text": "Who the heck is making these crazy shapes"}, {"comment_author": "andthendirksaid", "comment_text": "Ye that's a good pick.  Nearly always something will be within 5 feet of you, but if you're somehow in the woods with just the pills no bottle, then I guess use whatever, including yourself for a surface. Just a little lverboard to prove the point. lol that would be better tho. I was just saying bc it technically requires no tools. A lighter is pretty ideal, especially being if one or both ends comes out your grip you can hold it (or the spoon) in your palm so you're unlikely to lose them."}, {"comment_author": "TheGreatBarin", "comment_text": "Suboxone doctors prescribe theirs in quarter doses to wean people off of the medication. If you're on two a day they will cut it down to one and three quarter for a few months then cut another quarter to taper off."}, {"comment_author": "Better-Service-6008", "comment_text": "Freaking dark humor 💀"}, {"comment_author": "dream-smasher", "comment_text": "I know!!"}, {"comment_author": "Wallabite", "comment_text": "Often the triangular is your heavy duty controlled substance. Leave it at no name."}, {"comment_author": "TheGreatBarin", "comment_text": "Plenty of other medications that don't come in certain doses as well. If the medication doesn't come in 15mg they can either write you a 10mg and 5mg which you'll have to pay for two prescriptions or they will write you one for 30mg and say take half at a time so you only have to pay for one prescription."}, {"comment_author": "Electronic_Term_9728", "comment_text": "funny you should mention that as i'm on buprenorphine (the hydrochloride only, minus the garbage in subutex/suboxone) rn, i started on 16mg @ 2x8mg and i'm down to 12mg atm so i get an 8mg plus two 2mg for each day, \nthey come in 2mg/4mg/8mg doeses and they wean you off in 2mg doses, so i've still never seen anyone get told to half a 10mg to get 5mg or a 2mg to get 1mg \n\nlike everyone i've been prescribed multiple different mg of the same tablet to get to whatever mg the dose is. but it's probably different where you are, especially if you're in the US, like, i've never had to pay for a prescription or Dr appointment in my life as they are free here."}, {"comment_author": "Royalchariot", "comment_text": "I’m not taking drugs like that if that’s what you’re implying"}, {"comment_author": "Electronic_Term_9728", "comment_text": "i know that all kinds of mg pills are frequently used together to equal an exact dose, such as the mentioned 10mg + 5 mg to make a 15mg  dose, \n\nbut i've never seen anyone be told to half a 10mg tab to obtain the 5mg to go with the 10mg, but i'm sure it happens somewhere."}, {"comment_author": "RichGrinchlea", "comment_text": "Have fun finding the two sides as they fling across the room"}, {"comment_author": "mohawk_67", "comment_text": "Or if one side turns to dust, but that could be fun too."}, {"comment_author": "Either_Room6642", "comment_text": "I put the pill under a napkin or cloth so the pieces don’t go flying."}, {"comment_author": "awalktojericho", "comment_text": "Stick them in a sandwich bag first.  Contains the fling.  Learned that in the 70s.  Don't ask."}, {"comment_author": "CurveOfTheUniverse", "comment_text": "I cut my pills with a paring knife. I cup my hand over the top and push down so that my hand catches the two pieces."}, {"comment_author": "fuck_peeps_not_sheep", "comment_text": "Cup the other hand around. I've been doing thsi for years as due to numbness in my fingers I can't just pop them in two half's"}, {"comment_author": "ChaosRainbow23", "comment_text": "That dust isn't gonna snort itself!"}, {"comment_author": "rohobian", "comment_text": "That’s my experience too with trying to split pills. Usually you get one side quite a bit bigger than the other and the other side is not only smaller of course, but also in multiple pieces."}, {"comment_author": "Lonesomewhistle83", "comment_text": "Exactly"}, {"comment_author": "Ifakorede23", "comment_text": "This"}, {"comment_author": "CurveOfTheUniverse", "comment_text": "Oh we don't need to."}, {"comment_author": "DiligentDaughter", "comment_text": "I mean, I'm fairly certain that this *is* generic Adderall, after all."}, {"comment_author": "MutedBrilliant1593", "comment_text": "\"You can use a pocket knife to cut something in a pinch.\"\n\nThanks, captain obvious."}, {"comment_author": "Brendo_Extendo", "comment_text": "I'll snap my pills with my finger tips, thanks tho"}, {"comment_author": "SirArthurDime", "comment_text": "Life hack: You can use a can opener to open cans!"}, {"comment_author": "Dufo1989", "comment_text": "If you run the top of the can back and forth on concrete for a few minutes you can open the can without a can opener. Ive never done it but i saw it on a survival show. It shaves the lip down and the top just comes off like a lid."}, {"comment_author": "SirArthurDime", "comment_text": "That one’s actually useful thanks!"}, {"comment_author": "GizmoddoDragon", "comment_text": "A slight modification on this: when I was homeless, I'd find a sharp corner like metal or concrete and repeatedly slam the top of the can into it until a hole formed. Then I'd shake it up and down to get it out and slurp it down."}, {"comment_author": "Direct_Jump3960", "comment_text": "You can use a knife for it's intended purpose? Colour me shocked."}, {"comment_author": "Idontliketalking2u", "comment_text": "Lpt a knife can cut things."}, {"comment_author": "ranalavanda", "comment_text": "#lifehack lmao"}, {"comment_author": "entr0py3", "comment_text": "And yet over 200 people upvoted. \"Knife sharp!? 😵‍💫 omg, me try now\""}, {"comment_author": "CricketKneeEyeball", "comment_text": "Guarantee you're gonna be chasing at least one of those halves under the refrigerator."}, {"comment_author": "Funwithfun14", "comment_text": "This should be the top comment."}, {"comment_author": "Jwzbb", "comment_text": "Where your kid or pet will find it and OD on it."}, {"comment_author": "LastoftheSummerWine", "comment_text": "You can cut things with a knife??? Fucking brilliant"}, {"comment_author": "LiveFreeDieRepeat", "comment_text": "Can also be used to eat steak.  Knives can do lots, similar to a Swiss Army … , uh, thingy"}, {"comment_author": "IvoryLaps", "comment_text": "You could also use it to clean your nails"}, {"comment_author": "iliketolurk77", "comment_text": "Your very own toe knife."}, {"comment_author": "AcceptableOwl9", "comment_text": "I use mine as a poop knife"}, {"comment_author": "Key_Study8422", "comment_text": "Did you know a pen can leave ink stains?"}, {"comment_author": "lguy421", "comment_text": "These comments are out of control!!! 😂"}, {"comment_author": "Personal-Ad7920", "comment_text": "Tech here, cut pills a lot.  (skilled nursing home RX) If pill is scored you can snap them evenly with fingers.  (depending on pill shape size etc) Or if the pill is scored you can use a credit card with force down the middle snapping pill evenly. I would use the knife as last option. (Risk getting cut) Most importantly never cut an extended release type pill in 1/2 because it makes the pill no longer work."}, {"comment_author": "dynamoterrordynastes", "comment_text": "Are there XR pills with score marks???"}, {"comment_author": "Far-Wasabi6814", "comment_text": "My knife is now depression free"}, {"comment_author": "B3ASTW0LF", "comment_text": "😂😂😂😂"}, {"comment_author": "prashanth1337", "comment_text": "Holy shit, a sharp tool cutting through an object? I’d have never known"}, {"comment_author": "ChikiBriki_Enjoyer", "comment_text": "No thanks I have hands."}, {"comment_author": "sivve95_kul", "comment_text": "You could also do it in a literal pinch"}, {"comment_author": "Average_Reacher", "comment_text": "Keys open doors."}, {"comment_author": "RockingMAC", "comment_text": "Keys also LOCK doors."}, {"comment_author": "Average_Reacher", "comment_text": "Shit, all this time?!"}, {"comment_author": "dagobahh", "comment_text": "That would be diarrhea"}, {"comment_author": "Major_OwlBowler", "comment_text": "How???"}, {"comment_author": "Average_Reacher", "comment_text": "No key?"}, {"comment_author": "UnderstandingTrue463", "comment_text": "Gross, I don’t want to get blood from neighborhood cats on my pills."}, {"comment_author": "AcceptableOwl9", "comment_text": "r/holup"}, {"comment_author": "CanadianAndroid", "comment_text": "Were you stabbing them before?"}, {"comment_author": "dblhockeysticksAMA", "comment_text": "Gerber Zilch! A pretty decent knife if you’re on a tight budget."}, {"comment_author": "GreytOutdoors", "comment_text": "Was… was this a revelation for you?"}, {"comment_author": "BreadlinesOrBust", "comment_text": "Life hack: use a knife to cut things"}, {"comment_author": "w0bbble", "comment_text": "Can use your teeth also"}, {"comment_author": "vhs_streetlife", "comment_text": "This way the chance is high that it will shoot somewhere you will never find it."}, {"comment_author": "Mindless-Bedroom9820", "comment_text": "You can also use your handy knife to get the dirt from under your finger nails!"}, {"comment_author": "DanfromCalgary", "comment_text": "A knife that doubles as a knife"}, {"comment_author": "IncontestableClimb", "comment_text": "Use it to cut the pill in half... then use the dull side to smash the other half."}, {"comment_author": "DecapitatesYourBaby", "comment_text": "Just be careful not to cut yourself when you snort off the blade."}, {"comment_author": "IncontestableClimb", "comment_text": "If your at this point where your cutting and breaking stuff down, Hopefully your  professional enough to not cut your nose."}, {"comment_author": "Lugie_of_the_Abyss", "comment_text": "I would do it upside down and gradually to try to keep the dust out of the sheathe"}, {"comment_author": "migukau", "comment_text": "Now I just need a pocket knife to cut this pill that is already easy as fuck to split."}, {"comment_author": "karateninjazombie", "comment_text": "You can use your pocket knife as a pill LAUNCHER in a pinch.\n\n\nThere you go. Fixed your title for you :)"}, {"comment_author": "Ifakorede23", "comment_text": "With the backing/support of the stde of a pen... NOPE"}, {"comment_author": "Jonfu", "comment_text": "Pill shatters. Pieces hit the ground. Pig-like pup instantly devours. Emergency vet visit. No thanks."}, {"comment_author": "Wise-Half-9482", "comment_text": "'You can use a knife to cut stuff'\n\nDamn, for real?"}, {"comment_author": "fanny12440975", "comment_text": "You can also place most scored tablets on a flat surface and press on the edges to break them."}, {"comment_author": "MommyBurton", "comment_text": "Methocarbamol eh?"}, {"comment_author": "Randall_Hickey", "comment_text": "Also your scissors"}, {"comment_author": "Medical-Lemon-4833", "comment_text": "Personally, I like to use a chainsaw"}, {"comment_author": "Diligent-Sprinkles-3", "comment_text": "Already seeing half of  my xtc breaking in pieces and crumbling into my knife"}, {"comment_author": "Jedi-Quixote-", "comment_text": "Using a knife to cut something, that’s a life hack!"}, {"comment_author": "backroom42069", "comment_text": "Or you could...just break it in half with your fingers?"}, {"comment_author": "QuickShotMan", "comment_text": "yes"}, {"comment_author": "Nickdanger1990", "comment_text": "What knife is that ?"}, {"comment_author": "FJWagg", "comment_text": "Bummer said the OTF user."}, {"comment_author": "Comfortable-Term2291", "comment_text": "How about a nail clipper though?"}, {"comment_author": "ErdTheBird99", "comment_text": "I don't carry a pocket knife. I do, however, have fingers"}, {"comment_author": "sapper4lyfe", "comment_text": "Clean pocket knife.... Clean lol."}, {"comment_author": "Freshouttapatience", "comment_text": "I wouldn’t - my pocket knives get cleaned and oiled so I’m not using them on my food."}, {"comment_author": "cheeba2992", "comment_text": "Or you can just use the edge of anything square"}, {"comment_author": "Slyapple", "comment_text": "A pinch?"}, {"comment_author": "CrabslayerT", "comment_text": "We use to just bite them in half. The first one anyway, just to make sure they weren't too strong. After that it all went a bit pete tong 🤷"}, {"comment_author": "monkehmolesto", "comment_text": "That line on the pill makes it easy to do it by hand though."}, {"comment_author": "mtmcpher", "comment_text": "It is a scored tablet, break with your fingers"}, {"comment_author": "Historical-Scale-332", "comment_text": "Life hack. Bite it if you can’t break it."}, {"comment_author": "g1vethepeopleair", "comment_text": "How often are you guys taking pills?"}, {"comment_author": "CK_CoffeeCat", "comment_text": "Personally about 20 medications daily. None that need to be split though."}, {"comment_author": "EmptyDrawer2023", "comment_text": "You mean a knife... can *cut* things?"}, {"comment_author": "mezz7778", "comment_text": "Life hack* a knife can be used to cut things that are already scored to be cut......."}, {"comment_author": "No-Professional-3043", "comment_text": "*with a pinch"}, {"comment_author": "returnofthequack92", "comment_text": "Thank you!"}, {"comment_author": "Rogueplayer100", "comment_text": "This life hack is terrible lmao. I’ve split 10mg pills in half with bare fingers literally anyone can do it."}, {"comment_author": "AlamoSimon", "comment_text": "10mg? Those are rookie numbers. Try 400mg next time"}, {"comment_author": "Rogueplayer100", "comment_text": "Those ones are even easier to get apart lol…"}, {"comment_author": "GreytOutdoors", "comment_text": "Lifehack: use a knife to cut something.  🙄"}, {"comment_author": "ind3pend0nt", "comment_text": "This is not a good way to split pills. Pills that have a break point are made to be split without tools. Pills that don’t have a break point are not designed to be split."}, {"comment_author": "sean_cleric", "comment_text": "Or if you don't have a pocket knife you can just split it if line anyway"}, {"comment_author": "ElectricalTuna", "comment_text": "Crush it and sniff it like a real man"}, {"comment_author": "Dramatic_Tax4695", "comment_text": "Thanks! This is actually really useful for me."}, {"comment_author": "Beneficial_Soup6000", "comment_text": "be a man take it all"}, {"comment_author": "Tricks1969", "comment_text": "Yep I for sure only carry my knife around to split tabs....ociffer!"}, {"comment_author": "Fwumpy", "comment_text": "Nice! Now I don't have to make such a mess with my grinder! The dust makes the cats act kind of crazy..."}, {"comment_author": "JigenMamo", "comment_text": "If you don't have any teeth left, sure."}, {"comment_author": "Qwertyguy35", "comment_text": "\"Bro you can use a knife to cut something btw\""}, {"comment_author": "Swimming-Bullfrog190", "comment_text": "Or do it the chaotic way and bite it in half"}, {"comment_author": "moopsie_kishus", "comment_text": "Obvi does not work as a nail clipper"}, {"comment_author": "Revolutionary-Rip-40", "comment_text": "And you get to go search for the half that flies across the room too."}, {"comment_author": "R3stl3SSW4rr1or", "comment_text": "MDMA. Half a pill is enough"}, {"comment_author": "MarcMax1", "comment_text": "LOL  I have that little Ninja Pocket knife !    I luv mine so much... clips on my pants    small weighs nothing"}, {"comment_author": "Crotch-Monster", "comment_text": "True. Works great when I split my Suboxone pills."}, {"comment_author": "hickdog896", "comment_text": "Arms like pocket knives aren't as much of a thing anymore.  I was with my older son (30's), and some of his friends,  and when a need arose, I handed someone my pocket knife. Friend: why do you have a knife?!\"\nMe: (pause) why *don't* you?!"}, {"comment_author": "GhostDweller", "comment_text": "I'd i only had some pills to split"}, {"comment_author": "hooskerdooski", "comment_text": "As a pharmacy tech in a hospital, iv been informed im not allowed to do this. Worth the ask though."}, {"comment_author": "TheRebelNM", "comment_text": "TIL you can use a knife to cut something in half"}, {"comment_author": "Norweirdian", "comment_text": "I use my teeth😬"}, {"comment_author": "dixoncn", "comment_text": "Bic lighter never fails to do the trick"}, {"comment_author": "220DRUER220", "comment_text": "Yeah but the pill in the pic doesn’t have the m30 stamp 🤣🤣🤣"}, {"comment_author": "magotomas", "comment_text": "Cat nail trimmer works like charm too!"}, {"comment_author": "Howthehelldoido", "comment_text": "This is a super American Problem / situation right?\n\nMost of us aren't carrying around weapons and prescription drugs buddy."}, {"comment_author": "snowthearcticfox1", "comment_text": "People calling a small pocket knife a weapon will never not be funny to me. It's no more a weapon then a screwdriver or a big rock and no more dangerousthen either."}, {"comment_author": "BleedMeAnOceanAB", "comment_text": "yknow pocket knives are tools too right?"}, {"comment_author": "Ordinary_Airport_717", "comment_text": "Knives work as knives. Life hack"}, {"comment_author": "CurrentlyAltered", "comment_text": "“If they’re pre-scored and you’re quick about it you’ll get an almost perfect cut every time”"}, {"comment_author": "QuiXiuQ", "comment_text": "lol, keep trying."}, {"comment_author": "Available-Tea-982", "comment_text": "I use the same razor blade to cut my cocaine up..  My hack is better..."}, {"comment_author": "DudePDude", "comment_text": "I wouldn't use it that way\n You would have very little control over the blade\nLay the pill on a hard surface, press the point of the knife straight down in front of the pill and hold it against that surface as you slowly bear down on the pill"}, {"comment_author": "karateninjazombie", "comment_text": "You can use your pocket knife as a pill LAUNCHER in a pinch.\n\n\nThere you go. Fixed your title for you :)"}, {"comment_author": "TWJop", "comment_text": "I have many times."}, {"comment_author": "Ifakorede23", "comment_text": "There's 5 dollar pill splitters online"}, {"comment_author": "RaspingHaddock", "comment_text": "That's called a zoomer doomer now"}, {"comment_author": "sherloq758", "comment_text": "I’d have to have a pocket knife to start"}, {"comment_author": "JustDave62", "comment_text": "Which half ends up under the fridge?"}, {"comment_author": "ReeferMadness814", "comment_text": "Are those subs?"}, {"comment_author": "QuantumButtz", "comment_text": "My imaginary friend taught me this years ago. Haven't seen him since tho..."}, {"comment_author": "Laarye", "comment_text": "*slides the paper-cutter off to the side*\n\nPocket knife you say...?"}, {"comment_author": "Outofoffice_421", "comment_text": "If it has the line in the middle you can just break in half with your fingers lol no knife needed"}, {"comment_author": "lovetyrannicalreddit", "comment_text": "This is not a lifehack, it's just using a multi-purpose tool."}, {"comment_author": "ily300099", "comment_text": "Or the back of a spoon."}, {"comment_author": "Personal_Anxiety2232", "comment_text": "No thanks. I’ll just bite it in half with my teeth."}, {"comment_author": "Broad_Bodybuilder_94", "comment_text": "Omg. I can't thank you enough for this. Up until now I was chewing the whole. Spitting it out. Dividing in halve with my knife. And snorting one halve."}, {"comment_author": "Difficult_Counter449", "comment_text": "..."}, {"comment_author": "Potential-Finger-200", "comment_text": "It wouldnt work for my cheeseburger sized oxis"}, {"comment_author": "_Bon_Vivant_", "comment_text": "A knife as a pill splitter?  Whoda thunk it.  \n\nWhy I oughta.... Moe slap you across the back of your head."}, {"comment_author": "COOCH27", "comment_text": "Wow"}, {"comment_author": "donwiththebullshit", "comment_text": "just take 2"}, {"comment_author": "SrCalavera94", "comment_text": "Life hack you can use your pocket knife to cut things WOW."}, {"comment_author": "4x4is16Legs", "comment_text": "I bite it… haha"}, {"comment_author": "pplpuncher", "comment_text": "That pretty chill but you can also use your teeth."}, {"comment_author": "NikolitRistissa", "comment_text": "It’s scored. Surely you could just snap it in half, as intended."}, {"comment_author": "celticdude234", "comment_text": "Didn't work, the pill was too stiff for some reason. Besides, that's not the point. This will work with non-scored pills as well."}, {"comment_author": "NikolitRistissa", "comment_text": "It didn’t just shatter and send the halves flying, if it’s that hard? Glad it worked though."}, {"comment_author": "celticdude234", "comment_text": "I enclosed my hand around it as I pressed. Fingers were clear of the blade and the pill split evenly.\n\nI posted a broad comment addressing the most prevalent gripes and sarcasm, but your interest seemed more genuinely curious so I figured I'd respond directly. I don't know why the first instinct in a lot of people is to be hateful toward someone trying to offer helpful advice but it's a knee jerk reaction to point out stupidity when we see it on the internet. I certainly catch myself doing the same."}, {"comment_author": "albertsteinstein", "comment_text": "You can use your pocket knife as a pill pincher in a split."}, {"comment_author": "Bludiamond56", "comment_text": "Just get a pill splitter. They're cheap enough. Leave it near the pills."}, {"comment_author": "Valuable-Guest9334", "comment_text": "You could actually just use the knife normally"}, {"comment_author": "Kairenne", "comment_text": "I bite the pill in half and set it on the lid for next day."}, {"comment_author": "OGAnnie", "comment_text": "You don’t need a knife. They’re easy to break along the score line."}, {"comment_author": "CramWellington", "comment_text": "You can also use it to clean your nails."}, {"comment_author": "UndendingGloom", "comment_text": "How is this superior to just snapping it in half, as it is designed for?"}, {"comment_author": "Deadpool-77", "comment_text": "why do you have a knife in your pocket?"}, {"comment_author": "celticdude234", "comment_text": "A million and one uses, this included?"}, {"comment_author": "Deadpool-77", "comment_text": "Take it easy McGyver..."}, {"comment_author": "m945050", "comment_text": "How many people carry a pocket knife with them in today's world? A 2\" Swiss Army knife can be considered as carrying a concealed weapon."}, {"comment_author": "celticdude234", "comment_text": "/r/EDC is 500k strong"}, {"comment_author": "Begotten912", "comment_text": "LPT: you can cut things with a knife in a pinch"}, {"comment_author": "liwlowe", "comment_text": "Yeah. And you can also do it on a hard surface with your hand pressing down instead of risk cutting yourself and send the pill parts flying like this"}, {"comment_author": "celticdude234", "comment_text": "Obviously this sparked enough attention through genuine interest that it brought a minority out to bitch about it. So, for the record:\n\n* I tried the fingernail/table press method with this pill and it didn't work; pill was too stiff.\n* Halves going flying would be a concern, but obviously enclosing the knife and pressing with the same hand is both safe and solves this.\n* We get it, knives cut things. But how often have you seen a pocket knife used in guillotine fashion? This works better than a standard cutting board approach and isn't immediately obvious. {see post submission rules for this sub}\n* Clearly enough people found this useful enough to spark community engagement, otherwise y'all wouldn't be here hating for no reason.\n\nIn the end, no one posts here with ill intent. We find solutions for our problems that might help others with theirs and we share them. Idk why the energy in the comments is always so toxic, especially when proposed solutions are harmless.\n\nYou don't like a post? Move on and don't be a dick 🤷‍♂️"}, {"comment_author": "kw5112", "comment_text": "I just bite them"}, {"comment_author": "Ok_Chocolate9075", "comment_text": "Am I only one that can split pills accurately with his teeth?"}, {"comment_author": "Jlietz93", "comment_text": "I always just break mine in half with my fingers. Not that hard"}, {"comment_author": "lofiplaysguitar", "comment_text": "Gerber ftw"}, {"comment_author": "coffinflopCCTV", "comment_text": "Why not just crush it up and snort it?"}, {"comment_author": "Brownhog", "comment_text": "You can use your fingers as a pill splitter with a pinch"}, {"comment_author": "Fragglepusss", "comment_text": "You can pinch a pill to split it if you don't have a pocket knife."}, {"comment_author": "SkiSTX", "comment_text": "Or you can just cut it with any knife"}, {"comment_author": "MrFatNuts420", "comment_text": "no fucking way i’ve been using a hammer on my pills and praying for a clean break when i couldvw just used a knife to cut them"}, {"comment_author": "Distracted_Vinni", "comment_text": "Note that not all pills are supposed to be halved even though they might have a line on them. The distribution of actual medicine is not necessarily evenly distributed throughout the pill."}, {"comment_author": "Augustus-2485", "comment_text": "I’m a whole pill kind of guy myself"}, {"comment_author": "Wallabite", "comment_text": "Nope. One or both halves will fly across the room immediately at cutting. Won’t find the flung half and patient will be shorted several tablets as the RPH tried and failed this technique earlier."}, {"comment_author": "celticdude234", "comment_text": "[don't be a dick ✌️](https://old.reddit.com/comments/1bvvfid/comment/ky7lcm2?context=3)"}, {"comment_author": "Wazuu", "comment_text": "Not really in a pinch if you have the necessary tools available."}, {"comment_author": "Thimbleweeds", "comment_text": "Please tell me this is satire"}, {"comment_author": "rusty1991", "comment_text": "Life hacks in America 2024"}, {"comment_author": "prettyinthecityy", "comment_text": "i love adderal 😅🥰"}, {"comment_author": "Maleficent-Ad9010", "comment_text": "But I want the whole muscle relaxer not just half!!"}, {"comment_author": "h846p262", "comment_text": "Just use your canine teeth lol"}, {"comment_author": "Vinocall", "comment_text": "Use it to clean your fugging fingernails…"}, {"comment_author": "Sandberg231984", "comment_text": "Bite in half in case you don’t have a pocket knife."}, {"comment_author": "dragonlord9000", "comment_text": "Could you use it to cut a piece of toast as well?"}, {"comment_author": "H0rHAE", "comment_text": "All my pocket knives are OTF automatics."}, {"comment_author": "Claubk", "comment_text": "You don't say? Really, this is your first day on earth right?"}, {"comment_author": "TillaciousG", "comment_text": "As a knife enthusiast I approve this hack. Rule no. 9, folks"}, {"comment_author": "_DudeWhat", "comment_text": "Just smash it and snort half like the rest of us goons /s"}, {"comment_author": "ThrowRA020204", "comment_text": "People still carry around pocket knives? I don't mean this in an offensive way I'm just kinda astonished.. most people over here where I live just stopped carrying pocket knives at public at some point"}, {"comment_author": "Giskard-Reventlov", "comment_text": "Where is “over here”?"}, {"comment_author": "wouterv101", "comment_text": "Nice, that will come in handy when I buy and carry a pocket knife everywhere I go"}, {"comment_author": "deadbeef1a4", "comment_text": "“You can use a general blade as a specialized blade in a pinch”"}, {"comment_author": "Cake_Donut1301", "comment_text": "You can even do it if you’re not in a pinch, since this is a knife, and we use knives generally to cut things."}, {"comment_author": "bugibangbang", "comment_text": "Sorry to ask… but do you people go around with a pocket knife?.. is this.. normal?"}, {"comment_author": "unstableB", "comment_text": "That's how you can peacefully take your medicine"}, {"comment_author": "boli99", "comment_text": "after todays revelation that a knife can cut things, make sure to tune in tomorrow when we show how water can be used to make things wet.\n\nlike and follow this channel for more insane life hacks."}, {"comment_author": "FooFargles3", "comment_text": " ..... No fucking way"}, {"comment_author": "Dusty9081", "comment_text": "A pill splitter with a centering device is only around $4: [Pill Splitter ](https://amzn.to/49nLHvU)"}, {"comment_author": "Gramage", "comment_text": "Curved blade not so great for chopping it into neat lines thoooooh damn wrong sub"}, {"comment_author": "Laze_ee", "comment_text": "People carry pocket knives still?"}, {"comment_author": "dblhockeysticksAMA", "comment_text": "Excuse me sir or madam please to enjoy r/knifeclub and r/knives"}, {"comment_author": "BleedMeAnOceanAB", "comment_text": "i can tell that you don’t do much handy work"}, {"comment_author": "thebirdmun", "comment_text": "Poop knife works too. Or any knife because that's what knives are for"}, {"comment_author": "iDreadNoughtus", "comment_text": "Life hack lolz"}, {"comment_author": "peekuhchu707", "comment_text": "Or just respect the production of a score line and split it freehand as meant to be. Smh."}, {"comment_author": "Educational_Ad_2619", "comment_text": "You can also cut things with a knife. \n\nYou are welcome."}, {"comment_author": "Rm25222537", "comment_text": "Well thank you for this information  👽👾💀👿"}, {"comment_author": "Accomplished_Sea6471", "comment_text": "Good to know ✅"}, {"comment_author": "nanny2359", "comment_text": "Fixed it for you:\n\nLife hack: Use sharp things to cut"}, {"comment_author": "millenniumxl-200", "comment_text": "[Wow](https://media.makeameme.org/created/wow-just-wow-dzoen1.jpg)"}, {"comment_author": "Roflattack", "comment_text": "So meta"}, {"comment_author": "Wandaxstruck", "comment_text": "Wow!"}, {"comment_author": "iHazit4u", "comment_text": "Life hack: breathe air for more energy! I have lots more"}, {"comment_author": "M4dcap", "comment_text": "Breaking News: Knife cuts objects!"}, {"comment_author": "SadAcanthocephala521", "comment_text": "In other news, the sky is blue."}, {"comment_author": "Rivetingcactus", "comment_text": "Use knife to cut things. Got it. Thank you so much internet stranger."}, {"comment_author": "crackersncheeseman", "comment_text": "Is that a Suboxone tablet?"}, {"comment_author": "drfunkensteinberger", "comment_text": " A knife can cut things?!?"}, {"comment_author": "Specialist_Bet5534", "comment_text": "Wire cutters"}, {"comment_author": "NewPointOfView", "comment_text": "You can use a regular knife too!!"}, {"comment_author": "220DRUER220", "comment_text": "Is that a topamax tablet ??"}, {"comment_author": "Otherwise-Battle-444", "comment_text": "*in a pinch* 🤏 excellent word play, sir. Bravo 🙌"}, {"comment_author": "reneeyay", "comment_text": "Who would’ve thought a knife would be useful to cut something"}, {"comment_author": "Halflife37", "comment_text": "Alternatively, you can also use this method as a make shift sling shot for both halves of the pill "}, {"comment_author": "Willr2645", "comment_text": "“You can use a tool designed to cut things, to cut a thing that doesn’t need a tool designed to cut things to cut it “"}, {"comment_author": "pichael289", "comment_text": "Pill splitters/crushers are great. A crushed pill kicks in significantly faster."}, {"comment_author": "Awkward_Reflection14", "comment_text": "So unless your medication is purpose built to be crushed, or dissolved under the tongue, doing so can be incredibly dangerous.\n\nLots of medication have protective coatings that are designed to slow down the metabolization of the medication. Crushing or chewing the pill effectively nullifies this coating and can lead to overdoses.\n\nDo not do this unless your doctor explicitly tells you it is safe to do so."}, {"comment_author": "samc_5898", "comment_text": "This sounds like some crack shit honestly"}, {"comment_author": "Limp6781", "comment_text": "Does this apply for ecstasy pills?"}, {"comment_author": "pichael289", "comment_text": "I'm talking about like Tylenol man. Why is everyone mad at me?"}, {"comment_author": "pichael289", "comment_text": "Bro I just meant like Tylenol for a headache and what not. Why so many downvotes?  I know not everything can be crushed up but for the ones that can be it's nice to have it take effect a good ten minutes earlier. I'm a diabetic, dissolved sugar in water is much faster than a glucose tablet. Why all the hate?"}, {"comment_author": "Cheap_Turnover1717", "comment_text": "Dude what the fuck no"}]}, {"post_title": "Removing yellow sun stains from white plastic", "post_url": "https://www.reddit.com/r/lifehacks/comments/1bwh93f/removing_yellow_sun_stains_from_white_plastic/", "post_main_text": "Hi\n\nCan anyone offer any advice on removing yellowed sun stains from white plastic? I read and saw the odd video about using hydrogen peroxide and submerging them in it with cling film on top.\n\nHowever, the results have been very poor. It doesn't look to have done anything. :( I get the impression that method only works with general aging of plastics. I haven't really found anything specifically for sun stained plastic.\n\nHas anyone had any success with this? Any tips they can offer? Thanks.\n\nhttps://preview.redd.it/5g003zeodvsc1.jpg?width=4032&format=pjpg&auto=webp&s=b89db48eed14bb1420b181d8ffa43cc387081022", "post_comments": [{"comment_author": "Prudent_Falafel_7265", "comment_text": "You probably won't be successful unfortunately .  \n\nYellowing plastic is an indication of cheaper, polystyrene or polyethylene -based plastic, which is highly sensitive to UV light.  It ages with UV exposure.  It's permanently aged by the UV and won't recover.  \n\nAcrylic-based, HDPE, and some other plastics won't experience the same yellowing."}, {"comment_author": "SVT6522", "comment_text": "Excellent answer explained in a better way than I was going to attempt."}, {"comment_author": "DustyShinigami", "comment_text": "Ahhh. That sucks. I can’t imagine it’s ‘cheap’ plastic though. These pieces are bases to Japanese PVC anime figures…? Such a shame though. They weren’t exactly in direct sun light as they were in a case, and the window is at an angle from it.\n\nBut thanks anyway"}, {"comment_author": "thedrunkLemon", "comment_text": "You should check out r/actionfigures. They have a lot of posts like this and a lot of people who know their stuff."}, {"comment_author": "DustyShinigami", "comment_text": "Thanks. If I haven’t already joined, I soon will do. :)"}, {"comment_author": "MavisBeaconSexTape", "comment_text": "If you look into SNES systems and their yellowing you may find some ideas.  They're famous for turning a sickly yellow due to flame retardant chemicals or something. Peroxide with baking soda and maybe Oxy Clean? Haven't read up on it in a while \n\nhttps://www.reddit.com/r/nintendo/s/3L1pujiaXC"}, {"comment_author": "Kahnza", "comment_text": "What kind of hydrogen peroxide did you use? The stuff you find in a pharmacy isn't strong enough. You need like 40%, not the 3% stuff. Also, wear gloves with the strong stuff!"}, {"comment_author": "DustyShinigami", "comment_text": "Ahhhh. That could be why. It’s this one I ordered from Amazon, which is only 3%.\n\nhttps://amzn.eu/d/7yffgZg"}, {"comment_author": "-Monero", "comment_text": "30% is enough."}, {"comment_author": "Kahnza", "comment_text": "Here is some more information for you\n\nhttps://en.wikipedia.org/wiki/Retrobright"}, {"comment_author": "kv4268", "comment_text": "Hair developer is what is commonly used, 40 volume."}, {"comment_author": "DustyShinigami", "comment_text": "Thanks for the link :)"}, {"comment_author": "Educational-Signal47", "comment_text": "After you put it on,  put cling wrap over it, and put it in the sun. Magic!!"}, {"comment_author": "DustyShinigami", "comment_text": "Yeah, I did that. Twice. But I’m hoping a stronger percentage solution will help as I was only using 3%. I imagine the stains are here to stay though."}, {"comment_author": "Educational-Signal47", "comment_text": "Sorry I didn't explain. I got 40% from the beauty supply store."}, {"comment_author": "6th_Quadrant", "comment_text": "I've read (but don't recall) some solutions in various Lego forums, as this is a common issue with builds on display. And those folks (AFOF, adult fans of Lego) tend to be very helpful and pleasant."}, {"comment_author": "DustyShinigami", "comment_text": "Awesome. Thanks for the tip. I’ve started collecting Lego again actually, particularly adult sets. And dug out all the old Lego from when I was a kid. :) Is that on the official forum or their Reddit group? Thanks."}, {"comment_author": "6th_Quadrant", "comment_text": "Umm… I don't think it was on Reddit, but may have been, it was just something I ran across a year or so ago. I bet just googling \"how to bleach white Lego\" would work. And yeah, Lego's great. I've been buying a few adult sets here and there, I'd be broke if I had room to display more (plus I keep my place pretty minimal). The design & engineering of certain sets really amazes me."}, {"comment_author": "DustyShinigami", "comment_text": "Okay. I’ll have to ask around. I’ll try on the Reddit group first. :) But yes, the design of some of the sets out there are very cool. Space is definitely becoming an issue here. 😅 I’m hoping I can get a small cabinet to put them in."}, {"comment_author": "Persimmonsassafrass", "comment_text": "If it's discolored from sun damage, you might want to look at auto care products used for sun and weather damaged vinyl, plastic, and paint. Auto polishing compounds or cleaners for restoring oxidized headlights might help, or extremely high grit sandpaper, used to buff out small scratches on auto paint. Good luck!"}, {"comment_author": "amburroni", "comment_text": "I’ve heard of the product salon care used to whiten plastic that has yellowed in the sun. [This video](https://youtu.be/Cz-HSjGj0ek?si=vRIDbRt8kpx0svD1) has a demo."}, {"comment_author": "Rhubarb-pie-", "comment_text": "I did something similar to this and it worked!"}, {"comment_author": "crunchyshamster", "comment_text": "Check out retro bright videos like this. Never tried it, but from what I recall they submerge in hydrogen peroxide and leave it under UV lights (ETA link)\n\nhttps://youtu.be/qZYbchvSUDY?si=sXEXkXFe_K1XtQsq"}, {"comment_author": "GooeyInterface", "comment_text": "I think it’s the peroxide from beauty supply store that’s used to remove yellowing from plastic. After applying, wrap in plastic and lay out for a few hours in bright sunlight.* May take more than one treatment to completely remove.\n*Can also use an LED light box, instead of sunlight. Instructions online."}, {"comment_author": "gigashadowwolf", "comment_text": "The hydrogen peroxide trick is called retro brite and it also requires UV or sunlight to work. \n\nIt does make the plastic more brittle though, but it does work. I did it to my refrigerator a few weeks ago.\n\nIt also works better in a glass or clear plastic box than it does in just cling wrap."}, {"comment_author": "DustyShinigami", "comment_text": "Yeah, I used a glass container. Specifically what we use to make pasta in, which is long and rectangular."}, {"comment_author": "ijuiceman", "comment_text": "Glass blocks UV. I have done it with peroxide cream 4%. Wipe it over the part and put some plastic wrap to stop it drying out and leave in the sun.\nI tried a few parts and then found the results a bit uneven.\nEnded up sanding the piece and spraying white paint, which gave a better result"}, {"comment_author": "DustyShinigami", "comment_text": "I’ll have to see if I can attach the pics of what the stands look like in the original post."}, {"comment_author": "Kitsune_sits", "comment_text": "12% hydrogen peroxide, fully submerged no need for cling film, place in sunlight for like an hour. I’ve done many super yellowed gameboys this way, and from the look of that plastic I’d say it should work really well on it."}, {"comment_author": "snoopy4life_", "comment_text": "I heard using the hair dye developer that blondes use and a uv light 🤷🏻‍♀️"}, {"comment_author": "None", "comment_text": "[removed]"}, {"comment_author": "Churchbushonk", "comment_text": "The sun changes the composition of the material itself. Once it yellows, it is now yellow"}, {"comment_author": "DustyShinigami", "comment_text": "😢"}, {"comment_author": "TheOnlyKirby90210", "comment_text": "The yellowing is a naturally occurring thing, that is basically low grade sunburn that happens over a long time. There's nothing you really do about it. Surfaces will darken over time from sun exposure."}, {"comment_author": "Big_Sympathy1017", "comment_text": "Deet worked for my yellowed headlights. Applied then rubbed off the yellow with a dry cloth"}, {"comment_author": "Lilly6916", "comment_text": "There is a brand of spray paint specifically for painting plastic. Maybe you can just paint it. Check Home Depot."}, {"comment_author": "DustyShinigami", "comment_text": "That would be great as a last resort, however these stands/bases all have patterns and writing on them 😬"}, {"comment_author": "DustyShinigami", "comment_text": "Updated the original post with a photo of the type of plastic stands they are."}, {"comment_author": "lucky7sean", "comment_text": "Try \"Magic eraser\""}, {"comment_author": "Superb_Health9413", "comment_text": "You might try WD-40. It works to bring our plastic patio furniture back.\n\nDo a test before you go all in with the spray."}]}, {"post_title": "When I can't find my phone I loudly say ok Google set a timer for 3 seconds", "post_url": "https://www.reddit.com/r/lifehacks/comments/1bvyima/when_i_cant_find_my_phone_i_loudly_say_ok_google/", "post_main_text": "Really helpful in my car", "post_comments": [{"comment_author": "denythemcreeps", "comment_text": "Can also just say “hey google where is my phone”\n\nOr \n\n“Hey Siri where is my phone” if you’re on the other team."}, {"comment_author": "grilledcheesybreezy", "comment_text": "I am waiting to see OP's comment on this actual life hack"}, {"comment_author": "Independent-Cod-6061", "comment_text": ">the other team.\n\nLaughed too hard at this"}, {"comment_author": "SUPRVLLAN", "comment_text": "Siri: *here’s what I found on the web for William Trombone*."}, {"comment_author": "BWWFC", "comment_text": "this isn't r/LifeProTips here be hacks"}, {"comment_author": "soyamoyzeng", "comment_text": "The better thing to say for Siri is “ hey siri set a timer for 1 second” that way it works at volume and when the phone is faced down"}, {"comment_author": "xerrabyte", "comment_text": "Tried this, it works on Siri but not as expected.\n\nI'm unable to find the phone I'm using, only other phones connected to my iCloud."}, {"comment_author": "courtesyflesh", "comment_text": "If your ringer is off this won't work."}, {"comment_author": "mr_claw", "comment_text": "Hang on a min, he's looking for his phone"}, {"comment_author": "1OO1OO1S0S", "comment_text": "I love the dumb life hacks because the people were definitely proud of themselves for coming up with such a convoluted way of finding their phone lol"}, {"comment_author": "iAmRiight", "comment_text": "I was able to. It initially popped up like it was going to search for other devices, then after a couple seconds of my not doing anything it started sounding an alarm"}, {"comment_author": "denythemcreeps", "comment_text": "It does. Try it."}, {"comment_author": "courtesyflesh", "comment_text": "I do and it doesn't"}, {"comment_author": "denythemcreeps", "comment_text": "You’re trying wrong."}, {"comment_author": "MorkSal", "comment_text": "It's supposed to go off on full volume.\n\n\nIt's it possible you have your ringtone set to something like none, instead of a tone with the volume at zero?"}, {"comment_author": "courtesyflesh", "comment_text": "Ok"}, {"comment_author": "courtesyflesh", "comment_text": "I keep it off with no vibrate."}, {"comment_author": "MorkSal", "comment_text": "Mine has a tone, but the volume is turned off. It goes to full volume for me."}, {"comment_author": "courtesyflesh", "comment_text": "I tried it with the phone open and closed. \n\nOpen, it says \"this is the only phone that we have under your name\" or something like that\n\nClosed, it lights up my fingerprint unlock screen. No noise"}, {"comment_author": "MorkSal", "comment_text": "Odd"}, {"comment_author": "krpfine", "comment_text": "That's what mine does too.  I'll have to try the 3 second timer thing."}, {"comment_author": "courtesyflesh", "comment_text": "I tried the 3 second timer thing and it worked perfectly. A definite life hack!!"}, {"comment_author": "lookslikeyoureSOL", "comment_text": "Can Google \"find my phone\" and it will start ringing"}, {"comment_author": "No_Bee4231", "comment_text": "It's saying I have to sign in to make this work"}, {"comment_author": "quicksilver_foxheart", "comment_text": "I have a speech impediment so google hardly ever recognized my voice so I go onto my laptop-find my device by google and since I have my gmail on both devices it'll ring the phone for me regardless of volume."}, {"comment_author": "SquidwardWoodward", "comment_text": "Oh I don't know about that, I understood you just fine!"}, {"comment_author": "alwaystired707", "comment_text": "You lost your phone in your car?   \n\"Hey Google, am I stoned?\""}, {"comment_author": "Pokemaster23765", "comment_text": "I say, “Hey Siri, tell me a story.” I always find my phone before she gets to the end of her stories, so I don’t know how any of them end."}, {"comment_author": "ScottsFavoriteTott", "comment_text": "I do the same hahaha works perfectly. However, I usually say “short story” and once I was actually intrigued and listened to its entirety 😂 was not disappointed. Oh however, I just started using my watch to locate it if I’m wearing it. Always forget about that function"}, {"comment_author": "Redshirt2386", "comment_text": "I literally just say “hey Siri where are you”"}, {"comment_author": "Temporary_Job5893", "comment_text": "I have Siri disabled"}, {"comment_author": "mtflyer05", "comment_text": "Amen. I will NEVER consent voluntarily to having my phone constantly listening to everything I say, collecting and selling the data to God only knows who"}, {"comment_author": "nournnn", "comment_text": "Just becuz u don't give them ur data _voluntarily_ doesn't mean they don't get ur data in some way or another (it could still be using ur mic even if u disabled Siri)"}, {"comment_author": "ProfessionalVelliety", "comment_text": "No one has the data storage capacity for sound recording every phone. That’s bonkers."}, {"comment_author": "GentleCrank", "comment_text": "Just because you turned your Siri off, doesn’t mean they’ve stopped listening"}, {"comment_author": "Temporary_Job5893", "comment_text": "Because of the features that a phone has (call, voice command, dictation, etc) the microphone is usualy turned on at all times. I'm not sure disabling all these features will automaticaly turn the microphone off. If you have apps like Facebook installed you will most likely see commercials for products that you mentioned perhaps when talking with someone, or related content."}, {"comment_author": "SUPRVLLAN", "comment_text": "You consented when you activated the phone and your accounts, like it or not. \n\n> *No I didn’t!*\n\nYeah, you did."}, {"comment_author": "mtflyer05", "comment_text": "Could doesn't mean legally is. I didn't read that its always able to be on and collecting data, especially not to sell, in the terms and conditions when I started the thing up. \n\nI'm not naive enough to think they might not be doing it, but actively consenting to it, continuously, by using something designed specifically to do that, especially when they can then legally sell it to God knows who, for literally any use, is another beast entirely."}, {"comment_author": "mtflyer05", "comment_text": "It means they have legally stopped listening, when I turn off the access from all apps to my microphone when not using them. They can still listen, sure, but can't sell what they hear legally"}, {"comment_author": "mtflyer05", "comment_text": "To have my microphone always on and collecting data, which they can them legally sell? I did not read that in the terms and conditions. Also, what accounts are you talking about? I have all apps besides a voice recorder that specifically only has access when I am using the app set to not even be able to access the microphone, and they still ask somewhat regularly. \n\nIf they fuck me, they'll have to do it without my consent, which is definitely illegal. \n\nEven if they can do it, which I definitely did not read that in the terms and conditions (all of it), I would still say that actively consenting to it, continuously, by using something designed specifically to do that, especially when they can then legally sell it to God knows who, for literally any use, is still a fucking terrible idea. \n\n\"Just because I am possibly already being raped, I should just consent to even more rape\". Thats how it seems to me."}, {"comment_author": "nournnn", "comment_text": "Oh no it is DEFINITELY not legal, but it's just the situation we are _forced_ to live in basically"}, {"comment_author": "GentleCrank", "comment_text": ":)"}, {"comment_author": "mtflyer05", "comment_text": "I mean, you can always use a flip phone, or have a cheap smartphone you only use for work, if you need the apps."}, {"comment_author": "1OO1OO1S0S", "comment_text": "I just used to find my phone function on Google like a normal person"}, {"comment_author": "No_Bee4231", "comment_text": "I'm far from normal. Also sure with some other handy devices. This works without those."}, {"comment_author": "DelayNumerous3253", "comment_text": "I say, “ hey Siri, turn on my torch “ best thing you can do as well as play music"}, {"comment_author": "Soft_Suspect_4817", "comment_text": "“Hey Google set a timer for 3 seconds” “okay!” There she issss!!"}, {"comment_author": "FunkCityband", "comment_text": "This is a common problem....Genuinely about three times a week I ask Alexa to 'phone my phone'"}, {"comment_author": "vanlassie", "comment_text": "I ask my Fitbit where my phone is."}, {"comment_author": "Top_Measurement9076", "comment_text": "😂😂"}, {"comment_author": "MySportsTeamsAreSad", "comment_text": "Brilliant"}, {"comment_author": "LVMom", "comment_text": "Or just use “find my” for apple devices"}, {"comment_author": "Mediocre-Catch9580", "comment_text": "Google is the evil empire"}, {"comment_author": "koz152", "comment_text": "This reminds me of the Hi Bixby Korean Samsung ad."}, {"comment_author": "PNWest01", "comment_text": " Holy crap that’s brilliant"}, {"comment_author": "No_Bee4231", "comment_text": "Thanks"}, {"comment_author": "TheRealBingBing", "comment_text": "I say hey Google tell me a joke.\n\nOr I use my find my phone feature on my watch"}, {"comment_author": "None", "comment_text": "[removed]"}, {"comment_author": "Suspiciously_Ugly", "comment_text": "request away but I can't guarantee anything!"}]}, {"post_title": "Securing a tow hitch cover", "post_url": "https://www.reddit.com/gallery/1bxcfy9", "post_main_text": "I found a tow hitch cover I liked, but it is just a rubber plug with no ability to secure with a locking hitch pin. To help keep it from falling out or being stolen I drilled 2 holes in it and looped a zip tie through. This provides a loop to slide a locking hitch pin through and keep your town hitch cover in place.", "post_comments": [{"comment_author": "SulkyVirus", "comment_text": "LPT - zip ties can hold things together"}, {"comment_author": "ronniecalberta", "comment_text": "You found it because the locking mechanism has broken off."}, {"comment_author": "Fore-right-", "comment_text": "I instinctively cleaned the camera on my phone when I saw this picture"}, {"comment_author": "Father__Thyme", "comment_text": "Or buy one that looks [like this](https://m.media-amazon.com/images/I/51OHAQ-uglL.jpg) from your favorite online retailer"}]}, {"post_title": "How To Quickly, Always Speak To A Human Customer Service Person", "post_url": "https://www.reddit.com/r/lifehacks/comments/1bw5izy/how_to_quickly_always_speak_to_a_human_customer/", "post_main_text": "It's out of control, honestly, I have cable w / a big company, but they all do it...you call with a problem, and you know that it's not something some chatbot, or auto-talk prompt can answer: but to get an actual human on the line takes forever, or is almost impossible....  \nThat's cuz companies don't make any money off customer service, so they outsource it or staff it as little as possible. You know where companies do have fully staffed? Sales. If you need to talk to a human, call the SALES number, and when they pick up, just tell them you need customer service. Now.  If you want to maybe even get offered a deal, tell how surprised you are the sales number goes directly to a person. Say, angry or hurt, since clearly they care more about selling to new people than helping their actual customers. Threaten to end service, even. You will get immediately to Customer Service, and possibly someone will remember how they can offer you some 'speacial deal' you qualify for.  \nAlso, in general, if you don't like your service or if a temporary deal, like how some places do cable for $40 for the first year then it goes to 100....Just call sales, again, and threaten to cancel service but for some unrelated reason. They will offer you a deal, likely.", "post_comments": [{"comment_author": "happyharrell", "comment_text": "This depends on the company. I’ve worked multiple places where sales would have no idea how to transfer you to customer service."}, {"comment_author": "Busy_Mortgage4556", "comment_text": "The sales team will give you the customer service number and tell you to call them."}, {"comment_author": "BlueCanary1993", "comment_text": "Saying the word “representative” when in autohell repeatedly often works."}, {"comment_author": "late2theparty24", "comment_text": "My job involves calling health & dental insurance companies CONSTANTLY. Things that have worked for me are pressing the zero button or saying “representative”, “help”, “customer service”, “agent”, and things of the like. I’ve gotten a person before simply by exclaiming “UUGGHHHH” into the phone out of exasperation. There have also been times where I ranted to the automated system without a pause, like Chevy Chase in Christmas Vacation. That has worked as well at times 🤣"}, {"comment_author": "WaitingForMrFusion", "comment_text": "\"Agent\" sometimes works too."}, {"comment_author": "SpeakerCareless", "comment_text": "This is sometimes a bad idea. In the call center I worked in, this would get you to the most commonly used option, but also to the line with the most trainees, interns, and generally most useless agents. If you had a more involved question that was under  a different menu option but chose the “default” rather than listening to your 5 choices, there is a good chance you waited on hold up to an hour to talk to someone who has no idea how to answer your question and maybe has a 50% chance of transferring you to the correct line. Where you get to wait on hold again."}, {"comment_author": "sacredkhaos", "comment_text": "Until its response is \"I see you'd like to speak to an agent, but let me see if I can help you first\" and refuses to connect no matter how many attempts 😭"}, {"comment_author": "WaitingForMrFusion", "comment_text": "That's true too. I just say \"agent‘ instead of \"representative\" because it's fewer syllables. May as well do less work if the outcome is the same anyway."}, {"comment_author": "sacredkhaos", "comment_text": "Oh I use \"agent\" vs \"representative\" too, and it does work with the ones not programmed to refuse requests to talk to a human. But the ones that are programmed that way have refused both words lol"}, {"comment_author": "Serious-Rutabaga-603", "comment_text": "Sometimes swearing at the robot works"}, {"comment_author": "Redtailcatfish", "comment_text": "This is a real thing. It also feels nice"}, {"comment_author": "perrydolia", "comment_text": "The quickest way to a human is to mumble something unintelligible every time the bot asks you a question.  It only takes two or three cycles of mumbling to get the \"let me connect you to someone who can help\" message."}, {"comment_author": "Rachemsachem", "comment_text": "I feel like this gets me eventually hung up on... that \"....Goodbye.\""}, {"comment_author": "rabbits_dig_deep", "comment_text": "Can confirm, worked for me."}, {"comment_author": "AMLPYPLD", "comment_text": "I worked for a very large cable company for quite some time and people would do this- doesn’t work for every company because they’d just transfer you to the dept I worked in which was retention and this trick only works for so long. They set up their systems to only allow so much to be done by the agents especially if you “abuse” the “deal” aka call every year demanding the same price\n\nI don’t even have cable so I’m not defending these business practices but really all this will create is exactly what I dealt with for years- everyone thinking they’re entitled to something and demanding it from the pee ons of the company in such a way that they are being abused regularly. \n\nJust say cancel, that’s it. They’ll offer you something or you can switch to another company with cheaper prices and probably crappier service and you have a new company to yell at in a year. lol"}, {"comment_author": "Kahnza", "comment_text": "I just press 0 a bunch of times"}, {"comment_author": "Nemesis-89-", "comment_text": "I’ve tried this but the companies are now hanging up on you when you do this"}, {"comment_author": "laughing_cat", "comment_text": "Sometimes and other times: \"I'm sorry I didn't recognize your response. Please try again.\""}, {"comment_author": "kaleburnet", "comment_text": "PRO TIP: I work in IT at a large company. Never call at the end of an hour bc even if you got the right department and that person gets off in 2 minutes, you will get transferred LOL. I don't do it but we are usually the catch all for all the dumped calls. These people want to clock out and go home rather than be on a call past their time for 20 minutes."}, {"comment_author": "icollectcatwhiskers", "comment_text": "EXCELLENT inside info.  thank you for sharing."}, {"comment_author": "Chad_Hooper", "comment_text": "Another way to get to a real person in those phone menus is sometimes to press #0#0.  It confuses some of the phone software and makes it send you to a live human who can parse the signal."}, {"comment_author": "-Monero", "comment_text": "Last i called courier services and was greeted by their automated system, simple * was enough."}, {"comment_author": "laughing_cat", "comment_text": "I've been doing this a while and lots of companies are on to this and will just send you back to oblivion. But,  did not think to try the tactic of being dissatisfied and affronted about it. Will try that. Thanks!"}, {"comment_author": "6poundpuppy", "comment_text": "Yeah, no.  This obviously worked for OP…but like what..once?  At one particular company?  Most are guaranteed to give you the number you’re trying to get around or simply transfer you there and let the robo-roundabout begin."}, {"comment_author": "Rachemsachem", "comment_text": "It's a way to quickly speak to a human, not necessarily to solve the issue. For when if you have an issue you know the AI can't fix, or need to explain something it won't get. I think w/ chat bots it'll get a lot harder to ever talk to a person. xfinity now ends the robo call by either you saying the problem is fixed, or if you'd like to talk to an agent, you can get a text, and it'll hang up, and the text goes to a chatbot where it makes you go through a lot more, before letting you talk to human. It took an hour. And it still didn't give me the option, just tried to send at technician to my house. It's def. a last-ditch thing to do...."}, {"comment_author": "skriblethekid", "comment_text": "Ask for the retention department.. do it once a year, they will give you a lower rate for about 6 months normally.."}, {"comment_author": "Simple_Conference516", "comment_text": "Drives me NUTS!! You have to enter all your information then when you FINALLY get a human they ask you for the exact same shit you just entered in!!!😳"}, {"comment_author": "SherbertTemporary150", "comment_text": "My husband has the best hack getting to talk to the right person right away and not waste anyone’s time. I’ve seen him do it multiple times with different services that decided to jack up prices on him. \n\nWhen customer service answers he calm & sternly tells them “I know your training has not prepared you to speak with a customer who is as upset as I am, so please put me on the phone with the person who has.” And immediately he gets the top top manager who always immediately transfers him to the top sales person who honors previously pricing or their current best promotion. I’ve seen this work for my husband with major cable companies and insurance providers. It always shocks me how well it works. It pays to be nice but there’s definitely something magical in the words he uses. Hope this helps!"}, {"comment_author": "BlazasAndQuasars", "comment_text": "Its not only condecending, its articulated as a threat..\n\"I'm so upset right now, you better transfer me to a more important person... or else!\"\n\nIn the customer service jobs I've worked there's no magic guy I can transfer the extra upset customers to. Lord knows I'd want that. But no... \n\nAnd when I have no other choise than to reject these \"friendly\" requests, the customer always feels justified in letting all their anger out on whoever was unlucky enough to get them on the line."}, {"comment_author": "jimigo", "comment_text": "I pound zero like a psychopath whenever a robot comes on.  I didn't stop until a person answers."}, {"comment_author": "Adol214", "comment_text": "mumbling"}, {"comment_author": "NP_Wanderer", "comment_text": "I've actually had some very good experiences with customer service humans recently.  These include:\n\n1. Medicare - getting my wife's termination date corrected in under half an hour.\n2. Verizon - Getting a new sim installed in my phone after the in-store guy fouled it up in about 40 minutes\n3. Cathay Pacific - Cancelled flight rebooked and overnight hotel provided in 45 minutes.\n4. NYC MTA - verified that eticket lost could not be refunded in 10 minutes.\n5. American Express - cancelled a credit card in 20 minutes\n6. Northwell Health Billing - got my insurance coverage updated in 10 minutes.\n\nI consider tasks completed in one call in under a half hour a win.  More complex things may take more time.  Also, I'm not including time spent on hold, which wasn't very much in these cases.  I just hold and watch TV, eat lunch, whatever."}, {"comment_author": "Crafty_Witch_1230", "comment_text": "Just keep repeating either 'agent' or 'representative.'  It always works for me and then be very nice to the human on the phone and you'll generally get what you want."}, {"comment_author": "OlderSprout", "comment_text": "Say need disabled assistance."}, {"comment_author": "Vanhacked", "comment_text": "Sales person here. Try that with me and you will get anywhere but  customer service."}, {"comment_author": "tomnan24", "comment_text": "Say cancel service."}, {"comment_author": "DevanteWeary", "comment_text": "I just speak jibberish. Works everytime."}, {"comment_author": "Prestigious-Moose345", "comment_text": "Gethumam.com gives you the best number to dial"}, {"comment_author": "badcompany8519", "comment_text": "#0#0#0\nWorks fine"}, {"comment_author": "vanlassie", "comment_text": "I recently said “reporting fraud” and got thru fast."}]}, {"post_title": "How to prevent air loss when plugging inflatable toy", "post_url": "https://www.reddit.com/r/lifehacks/comments/1bwuxbe/how_to_prevent_air_loss_when_plugging_inflatable/", "post_main_text": "I bought cheap inflatable microphones for my kiddo and her friends for her birthday party. I have to manually inflate them, and then manually plug them. That's fine, that's what I expected. Problem is though, the air comes out so quickly that in the moments it takes me to try to get the stupid plug in, they immediately begin looking saggy and sad. \n\nClearly I should've spent more, but now that they're here I'm determined to make them work. Any ideas?", "post_comments": [{"comment_author": "HazardousCloset", "comment_text": "I plug it with my tongue while it’s inside my mouth. \n\nAs you may or may not do, I hold my tongue over the hole while I’m drawing a breath. \n\nI over inflate, and on the last exhale, I cover the hole with my tongue.\n\nThen, I get my bearings and flip the plug over into the hole with my tongue and press it down as much as I can.\n\nIf the plug is proving stubborn, I quickly finish by hand. The plug partially inserted will still reduce the loss of air. \n\nIt may take a bit of practice, but not hard at all."}, {"comment_author": "_CopperBoom", "comment_text": "Thank you!"}, {"comment_author": "HazardousCloset", "comment_text": "Happy to help. \n\nI’m sure either way, your daughter will be most excited and appreciative of the love and effort you put in for her- regardless of price tag and or floppy mics. Quirks add another layer of silly and fun anyways! \n\nBest of luck, and happy Birth Day to the Mama, too."}]}, {"post_title": "Opening a cable tie with a safety pin", "post_url": "https://i.redd.it/3qs91mhg9isc1.jpeg", "post_main_text": "Insert the safety pin in the hole, leave it there, and now pull the cube.", "post_comments": [{"comment_author": "glacierre2", "comment_text": "Many cable ties you can just bend the tip around and use it to hold the ratchet open (far easier if you have an extra zip tie)"}, {"comment_author": "Sunburnt_Hobo", "comment_text": "Or fingernails if you have ones with a bit of an edge."}, {"comment_author": "Tkdakat", "comment_text": "Reuse as needed ?"}]}, {"post_title": "Fabric Protectant For Lampshade", "post_url": "https://www.reddit.com/r/lifehacks/comments/1bw9ocm/fabric_protectant_for_lampshade/", "post_main_text": "Fabric Protectant For Lampshade\n\nHi! Bought new white lampshades and wanted to protect them from dust. Is there a spray I could use? \n\nSame thing for rugs…I have some faux fur and shaggy that are white and I want to protect than from dirt. \n\n\nAny suggestions? Thanks all!", "post_comments": []}, {"post_title": "[Request for help] Remove plastic bag from zipper", "post_url": "https://i.redd.it/xk3xunx69fsc1.jpeg", "post_main_text": "Any ideas how to save this zipper? It’s completely stuck and doesn’t move one inch. I already tried oil but it doesn’t help:( and the plastic bag just tears apart when I’m trying to pull it out.", "post_comments": [{"comment_author": "thunderfocks", "comment_text": "I suggest blunt force. It’s what helped me in such Situations"}, {"comment_author": "mandelbrot_wurst", "comment_text": "Tweezers and a tiny bit of WD40"}, {"comment_author": "HappyHiker2381", "comment_text": "Came here to say tweezers and patience."}, {"comment_author": "GanethLey_art", "comment_text": "I’d start with pliers and move to tweezers once the big pieces are all gone; you’ll probably be able to get a better grip initially"}, {"comment_author": "kaleidoscopelyf", "comment_text": "Did this to my foreskin once. Wouldn't recommend"}, {"comment_author": "PerspectiveInner9660", "comment_text": "Mazel tov"}, {"comment_author": "yeahwellokay", "comment_text": "\"Oh man! How'd you get the beans above the frank?\""}, {"comment_author": "sillypicture", "comment_text": "I still have flashbacks"}, {"comment_author": "None", "comment_text": "[removed]"}, {"comment_author": "cjuneau1", "comment_text": "I remember not being able to get it out, and I had to ask my mother for help. I'm still embarrassed about it to this day."}, {"comment_author": "glech001", "comment_text": "had to updoot the \"Something about Mary\" reference"}, {"comment_author": "Dandibear", "comment_text": "###FRANK AND BEANS!!!"}, {"comment_author": "AutoModerator", "comment_text": "To prevent trolling, accounts with less than -100 comment karma are not allowed to post in /r/lifehacks.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/lifehacks) if you have any questions or concerns.*"}, {"comment_author": "kaleidoscopelyf", "comment_text": "I was between ages 3-5 and it was close to Christmas. It was a dinosaur(I believe) zip up onesie. I still haventhe scar as well... never4get"}, {"comment_author": "Gemini-yogi-bullyluv", "comment_text": "Omg! My son did the same thing. He thought it was a good idea to go commando and zipped himself up. I had to unzip him! So horrifying!"}, {"comment_author": "mchljm", "comment_text": "Tweezers to pull the bulk out, then run the zipper up and down until the teeth are clean."}, {"comment_author": "JustAGoldfishCracker", "comment_text": "Instructions unclear, filed my teeth down to the nerve, and don't have insurance."}, {"comment_author": "GrannysLilStinker", "comment_text": "Oof, I just read that TIFU story."}, {"comment_author": "GanethLey_art", "comment_text": "How dare you point me towards that story 😭"}, {"comment_author": "JustAGoldfishCracker", "comment_text": "That's exactly why I said it lol I'm still cringing"}, {"comment_author": "Shrimpsmann", "comment_text": "I just kinda forgot it. Damn. What an idiot."}, {"comment_author": "SquidwardWoodward", "comment_text": "We got a bleeder!"}, {"comment_author": "gjs31", "comment_text": "Franks and beans!"}, {"comment_author": "JuGGieG84", "comment_text": "How'd you get the beans above the frank?"}, {"comment_author": "say-what-how-why", "comment_text": "\"It's just like pulling off a bandaid...\""}, {"comment_author": "Smokey-McSmoke-Smoke", "comment_text": "Burn it"}, {"comment_author": "Euphoric-Blue-59", "comment_text": "The zipper itself looks plastic. So no"}, {"comment_author": "Crazy-Seaweed-1832", "comment_text": "The bag will melt faster than the zipper will this was my thought to. Keep the lighter several inches away and make slow passes back and forth. It'll melt the bag enough that you can pull some of it out. Then try moving the zipper."}, {"comment_author": "PerspectiveInner9660", "comment_text": "Carefully :p"}, {"comment_author": "GamebyNumbers", "comment_text": "Freeze it"}, {"comment_author": "bshensky", "comment_text": "A heat gun would be even better."}, {"comment_author": "PerspectiveInner9660", "comment_text": "Yes, it would."}, {"comment_author": "Mela777", "comment_text": "Try to remove as much of the plastic as possible from under the zipper pull, where the zipper is closed, and work to pull it down. Use tweezers or whatever you’ve got on hand to get the plastic out. You can also use the pliers to give you better grip on the zipper pull to open it back up - make sure to grasp the open part of the zipper firmly while pulling it open."}, {"comment_author": "Ujame", "comment_text": "I second this and advise against using any heat/fire, as the zipper itself is made of plastic, not metal. You'd risk burning either the bag remains and/or the zipper to a lump and ruin it. Tweezers, pliers, good lighting and patience should do the trick."}, {"comment_author": "CatfromLongIsland", "comment_text": "Tweezers + Time"}, {"comment_author": "TruthSeekerLeet", "comment_text": "Hi! This is the 5RCz zipper from YKK. This 5mm RC (Racquet coil) zipper is heat tolerant up to 160 degrees C or about 320 degrees F. The polyurethane bag stuck inside the zipper will begin to soften at 195 degrees F. You have 125 degrees F of wiggle room to heat the zipper with boiling water (212 degrees F). Good luck!"}, {"comment_author": "Mahariri", "comment_text": "Graphite from a pencil. Actually works."}, {"comment_author": "Father__Thyme", "comment_text": "Graphite lubricant (used for locks) to help the zipper move, and just keep pulling out plastic with tweezers as much as you can"}, {"comment_author": "Gryffindorphins", "comment_text": "I’d keep pulling the plastic out with tweezers. Sorry I can’t suggest anything else."}, {"comment_author": "Worried-Possible7529", "comment_text": "I agree with you, tweezers, gently, in tiny bits until zipper gives either up or down to release the rest. It is a nylon zipper, please leave chemicals out of it."}, {"comment_author": "dim-mak-ufo", "comment_text": "hot water and needle"}, {"comment_author": "Ray-Gamma", "comment_text": "Get a safety pin hot with a lighter. Poke bag where it’s stuck. Pin should melt enough of the plastic to be able to move it."}, {"comment_author": "EclecticallySound", "comment_text": "Tweezers."}, {"comment_author": "Lutherkiss3", "comment_text": "Needle nose plyers"}, {"comment_author": "Anxious-Midnight-155", "comment_text": "I’d use **dish soap** instead of oil. Tweezers can get the bulk out and start moving the zipper up and down until it moves."}, {"comment_author": "awalktojericho", "comment_text": "Nail scissors and tweezers."}, {"comment_author": "twist3d7", "comment_text": "Pry the gap on the slider wider with a thin flat sided screwdriver.  Remove plastic bag.  Close the gap on the slider with pliers."}, {"comment_author": "Adol214", "comment_text": "That is the last resort solution.\n\nYou can \"open' the zipper moving pieces. This can allow you to completely remove the moving piece if necessary. \n\nThe whole process is easier that he look. But you may break it if you open it too much or back and forth."}, {"comment_author": "FairyFartDaydreams", "comment_text": "Pull the plastic in bits. Use needle nose pliers and eventually tweezers. It will take time but you need to debulk as mush plastic as possible"}, {"comment_author": "Royalchariot", "comment_text": "Bar soap or oil, tweezers and tiny scissors, bright light, and patience"}, {"comment_author": "nazteg76", "comment_text": "Sharp scalpel with a stitch cutter blade perhaps"}, {"comment_author": "eekamuse", "comment_text": "I was thinking box cutter too. Hold the zipper with a monkey wrench or something though. Not your fingers.\n\nAnd try to go inside the zipper to cut the plastic that's wrapped up in there. Not the plastic that's outside that you will grip to pull it out."}, {"comment_author": "aTinyFart", "comment_text": "Lighter"}, {"comment_author": "cocochini_2760", "comment_text": "pull it and then cut it..."}, {"comment_author": "muylindoperrito", "comment_text": "Pen"}, {"comment_author": "Critical-Meringue-48", "comment_text": "Very carefully"}, {"comment_author": "Trailman80", "comment_text": "Small threaded needle cut both sides and push the other end through."}, {"comment_author": "Bored_Boi326", "comment_text": "2 options \n\n1.try to pick out as much as possible and back up the zipper to try to free the rest\n\n2. Watch a NileRed video where he dissolves plastic and just use the same chemicals that he did"}, {"comment_author": "Blockboxx", "comment_text": "Just pull the zipper down and pass it through. You can use candle wax as lube"}, {"comment_author": "Available-Tea-982", "comment_text": "Toothe paste, vinegar and Monistat7"}, {"comment_author": "Authentic_VG", "comment_text": "Safety pin can also be used to remove it"}, {"comment_author": "ImNotARobot_ImADroid", "comment_text": "Bic lighter, propane torch, flame thrower, etc."}, {"comment_author": "mawxmawx", "comment_text": "Just let it rest for a while.\n\nPlastic will decompose in about 400 years and you'll have your zipper back!"}, {"comment_author": "SpaceSpy", "comment_text": "I am hulk it."}, {"comment_author": "PhlashMcDaniel", "comment_text": "Acetone?"}, {"comment_author": "DaRunningdead", "comment_text": "that is one risky zipper. eliminate it before it catches something else"}, {"comment_author": "Without_the_fez", "comment_text": "Soften the plastic with a hair dryer, then try moving the zipper."}, {"comment_author": "DevChan93", "comment_text": "🔥"}, {"comment_author": "Status_sandy9111", "comment_text": "Al menos no te agarro los pelos del pito"}, {"comment_author": "PepperjacksSocks", "comment_text": "A bar of soap rubbed on the zipper can help dislodge debris stuck in the pull. It can take a few tries but it works well."}, {"comment_author": "GenXDedah", "comment_text": "You’re supposed to take the condom off first"}, {"comment_author": "TopFishing5094", "comment_text": "Use a lighter"}, {"comment_author": "Captaintbone_1966", "comment_text": "How about a lighter.   Melt it and move it"}, {"comment_author": "tumerder", "comment_text": "Burn it little by little"}, {"comment_author": "phollas00", "comment_text": "DO NOT DO THAT, why would you put clothes near fire?!"}, {"comment_author": "RareMeowth", "comment_text": "Can burn it with incense sticks to contain the fire"}, {"comment_author": "Clatuu1337", "comment_text": "To make the fire bigger ofc."}, {"comment_author": "Missue-35", "comment_text": "I’d the zipper pull plastic or metal?"}, {"comment_author": "read9it", "comment_text": "Acetone or some other chemical to dissolve the plastic maybe?"}, {"comment_author": "CalmJellyfish666", "comment_text": "Burn it"}, {"comment_author": "Hataitai1977", "comment_text": "Move to New Zealand, you’ll never have that problem again. (We banned single use plastic bags years ago)."}, {"comment_author": "mandelbrot_wurst", "comment_text": "Tweezers and a tiny bit of WD40"}, {"comment_author": "Due_Dragonfruit_6789", "comment_text": "You may have to break the slider off and replace with a new one."}, {"comment_author": "mandelbrot_wurst", "comment_text": "Tweezers and a tiny bit of WD40"}, {"comment_author": "GaulteriaBerries", "comment_text": "Fire"}, {"comment_author": "VastDragonfruit847", "comment_text": "Water"}, {"comment_author": "semi-nerd61", "comment_text": "Earth"}, {"comment_author": "semi-nerd61", "comment_text": "Air."}, {"comment_author": "El_Morgos", "comment_text": "Hair dryer?"}, {"comment_author": "ajs_5280", "comment_text": "Fire?"}, {"comment_author": "Sensitive-Salary724", "comment_text": "Since it is plastic .. use a lighter to put some flames on it carefully and not for long time like for 1 or 2 secs not to damage the zipper or the cloth and stop .. do it 2 or 3 times it will shrink and fade .. maybe this will help"}, {"comment_author": "Adriendel", "comment_text": "Usually zippers are made of synthetic fabric. I would keep flames away."}, {"comment_author": "Sad_cerea1", "comment_text": "I don’t think you realize how long 2 seconds is, in fire. You’re not sparking a bowl."}, {"comment_author": "Sensitive-Salary724", "comment_text": "Well, plastic is more sensitive to fire than fabric so 1 or 2 secs wud shrink the plastic but the fabric won't be affected"}, {"comment_author": "Sensitive-Salary724", "comment_text": "I said 1 or 2 secs so 1 sec will do"}, {"comment_author": "Adriendel", "comment_text": "Heat gun/hair dryer might be an option as well. And yeah, a good set of pliers."}, {"comment_author": "Sensitive-Salary724", "comment_text": "Nice idea, but hair dryer effect wud need more time on both fabric and plastic which cud affect the zipper as well plus it is not surgeical enough like a lighter or a light match"}, {"comment_author": "Adriendel", "comment_text": "You’re probably right for the hair dryer. I doubt most people have a heat gun so this might be an option if pliers are not enough."}, {"comment_author": "Right_Draft3673", "comment_text": "Lighter?"}, {"comment_author": "cupid_stunt_4000", "comment_text": "Rub a bit of anchovies oil on it then use a match to light it ."}]}]