[{"post_title": "Weekly help me be productive/I need advice thread", "post_url": "https://www.reddit.com/r/productivity/comments/1byog51/weekly_help_me_be_productivei_need_advice_thread/", "post_main_text": "If you’re looking for specific advice for your situation, please post here.", "post_comments": []}, {"post_title": "Don't scroll your phone if you want to remain productive", "post_url": "https://www.reddit.com/r/productivity/comments/1byz36i/dont_scroll_your_phone_if_you_want_to_remain/", "post_main_text": "The single best thing I ever did for my productivity, mental health, and overall quality of life was to get off my phone.\r  \n\r  \nI used to constantly scroll my phone, racking up 7+ hours of screen time every day.\r  \n\r  \nWhat this does is overstimulate you with dopamine (the \"motivator\" chemical) making you unmotivated to do anything else besides scroll. When you're overstimulated, even normal tasks like cooking or working out seem borderline unbearable. It ruins your productivity but also your enjoyment of life.\r  \n\r  \nIf you have any desire to improve your life, the best place to start is by reducing your screen time. It is the one bad habit that blocks all other good habits you might have.", "post_comments": [{"comment_author": "Lambor14", "comment_text": "First you need to figure out what to do with the regained time. Without set goals it's easy to spiral back into scrolling because of boredom.  \n  \nA few tips that make scrolling less appealing:\n\nGrayscale mode\n\nSetting screen time limits (that you can bypass, but they're gonna break up your scrolling into 15 min chunks and add friction)\n\nUninstalling social media and browsing it on the browser (it's much more clumsy and less appealing)"}, {"comment_author": "tre-marley", "comment_text": "It would be cool if there was some sort of setting on our phones to make scrolling difficult. So it can be a deterrent.\n\nIt may be easy to set an androids scroll speed extra low. Has anyone tried this?"}, {"comment_author": "zubeye", "comment_text": "only way to do this is address the root cause though. sometimes people address the root cause and find the extra strength to stop scrolling, and attribute the phone as the root cause.\n\nIt's very easy to not do something. in fact it takes negative energy to not do something.\n\nHowever if you scroll because you are depressed for some other reason, simply deciding to stop scrolling is not really actionable advice"}]}, {"post_title": "Do you make over 10k a month?", "post_url": "https://www.reddit.com/r/productivity/comments/1bywadq/do_you_make_over_10k_a_month/", "post_main_text": "Hi, I'm pretty much still trying to figure out things in life, do you make over $10k a month profit, and If you do can you go into detail about what you do, which skills you've acquired to achieve this? What advice you would give a 18 year old trying to figure things out? And how long it did take to achieve those results?\n\nDid you randomly came across this business/hustle or have you have previous experiences, like past jobs?\n\nAnd most importantly, how did the money change your life?", "post_comments": [{"comment_author": "fattylimes", "comment_text": "This question puts the cart way before the horse."}, {"comment_author": "-Joseeey-", "comment_text": "One of the topics in The 7 Habits of Highly Effective People is - begin with the end in mind."}, {"comment_author": "fattylimes", "comment_text": "fine, sure, but x money per y time is a bad end to begin with because it’s completely arbitrary and doesn’t spring from any existing opportunities or resources. \n\nbegin with the end in mind all you want; it doesnt matter if your end leaves you no place to begin (or _every_ place to begin, which is just about as bad)."}, {"comment_author": "WonderChemical5089", "comment_text": "Many many careers you can hit 120k fairly easily. This money can be downright luxurious or barely cutting it entirely based on here you living but most  places it’s comfortable specially if your spouse also works. You don’t have to sweat the little details and it’s amazing. \nTo get there you will need a solid plan, and 18 is the perfect time. You will either need college for the easiest reach, trade school and small business also works but i think that’s a harder path. You need to pick an industry you want to work at. Ensure they have good prospect in the next 20-40 years and work backwards from there. Try make industry insider and friends, you will need them. No matter what you will need to pair hustle with everything. people go to college in default and graduate and then start applying and then realize they can’t get a job. You need to start making connections starting your second year, or as early as possible. Use the summers to do internships etc. you need to have 2-3 prospect before you get to graduation."}, {"comment_author": "MaxGaav", "comment_text": "Becoming rich is a by-product of being good at things others want/need. Solve *pains*, help with *gains*.\n\nTo be good at something you need to like it. Otherwise you will not be able to do it day in day out. So find out what you like to do that has (or can have) economic value.\n\nBooks to read:\n\n* 'Ikigai: The Japanese Secret to a Long and Happy Life' by Héctor García and Francesc Miralles\n* 'HOW TO GET RICH: (without getting lucky)' by Naval Ravikant\n* 'I Will Teach You to Be Rich: No Guilt. No Excuses. No B.S. Just a 6-Week Program That Works' by Ramit Sethi"}, {"comment_author": "FleetingChuckle", "comment_text": "Second Ramit’s book. I read it over a decade ago and I’ve also taken many of his courses and they’ve been instrumental in helping me build an online business that’s given me freedom to work and earn where I want when I want."}, {"comment_author": "Upper-Plane5653", "comment_text": "Learn about money\nI am clearing 20k a month\nI scrimped and saved in my teens and twenties\nI learnt that it’s no use ballin out in twenties only to be in debt in 40s\nAll the best 🙌🏻"}, {"comment_author": "82jon1911", "comment_text": "This"}, {"comment_author": "82jon1911", "comment_text": "Are you talking gross or net? $10k/m gross is $120k/year. Net...I have no idea as it would depend on your tax bracket and other factors that I really don't care to think about. I'm in the first category. \n\nAdvice for an 18 year old, don't go to college right now. Go learn a trade: electrical, plumbing, welding. You can make decent money starting out, probably get your training paid for because companies are so hard up for workers, and its something you'll always have a need for (maybe not so much welding, but its fun). Do that for a couple years, maybe you enjoy it and maybe you don't. If you do, go to your local community college, take some business courses, then start your own business with that trade you know. If you don't like it enough to make a career, at least you have a way to earn a decent living while you figure out what you do want to do. If you want to do something that requires college, work and go to school. Graduate with as little debt as possible. Its doable. I worked full time and went through a masters program full time. \n\nAs for what I do, I'm a cloud security engineer. About to hit my second year in this role, my next one should move me into that second category...or close to it. I've worked in IT, in some form or fashion, since I was in college (about 10 years, as I had a break for military service). I'm also starting an equipment rental business on the side."}, {"comment_author": "disputeaz", "comment_text": "If you can enjoy a 10k salary the same way you enjoy a 5k salary, it will make no difference."}, {"comment_author": "AUTOMATED_RUNNER", "comment_text": "i'm earning USD $ 3500 and I'm in some spot where I'm drowning in debt and I cannot even apply for food stamps because the borderline is USD $ 3400."}, {"comment_author": "SpliffKillah", "comment_text": "Stay strong man, it shall pass."}, {"comment_author": "-Joseeey-", "comment_text": "Im a senior software engineer. Salary is $161K, and I get RSUs (stock) as well, which will be about $240K this year. Skill: iOS software engineering\n\nMy advice is pick a degree that has great career prospects. Don’t go into crazy debt. You don’t need to attend the most prestigious school at all. Decide what you want to work in. \n\nDo NOT focus all your time, money, and energy on 1 business. Majority of the time they will fail, so don’t see them as a one way ticket to getting rich. A great job can fund many businesses. \n\nIf you want to get into the right mindset, read biographies of very successful people like Warren Buffet or Richard Branson. They started looking at ways to make money when they were kids. \n\nRead self improvement books too like Atomic Habits, The 7 Habits of Highly Effective People, etc."}, {"comment_author": "_GALVEN_", "comment_text": "That piece of info is useless to you, 120k a year can mean you're anything from a king to a pauper, depending on things that have nothing to do with how much you make."}, {"comment_author": "Ok-Ice1531", "comment_text": "Be humble."}, {"comment_author": "blopiter", "comment_text": "I made about that working software by 26. But idk who else needs to hear this but you will never be happy chasing more and more money. In fact I was significantly better mentally and happier when I was making half that at 22. \n\nAfter a certain amount of money (which varies depending on your lifestyle and expenses) making more money doesn’t really do much other than add on extra responsibilities. \n\nPeople seem to want to make lots and lots of money to get what they “actually” want in life but it’s a little ridiculous to do all that in such a round about way don’t you think? Do something I don’t actually want to do (job) to get something I don’t actually want (money) so I can exchange it for potentially getting the thing I want? (Happiness?) it is as stupid as it sounds and people figure this out a bit too late"}, {"comment_author": "Kittensandpuppies14", "comment_text": "Yes.  Software engineer"}, {"comment_author": "MyNamesArise", "comment_text": "No lmao"}, {"comment_author": "megamorphg", "comment_text": "Just major in gender studies lol. Honestly hard to say, best is any of the STEM careers and then supplement with investments"}, {"comment_author": "7_of_Pentacles", "comment_text": "Here are basically all the options. (Specific titles are examples)  \n1. Doctors (Surgeon, Psychiatrist, Dentist)  \n2. Hotshot lawyer (Big Law, Corporate, IP,)  \n3. Technologist (Talented Software Engineer, Project / Product Manger, Data Scientist)  \n4. Finance (IB, PE, HF, Talented Financial Advisor)  \n5. C-suite (many many industries e.g. healthcare, business, government, education, CEO, COO, CTO, CFO)  \n6. Sales (Talented sales exec in high value industry, high end real estate brokers)  \n7. Business owners / Entrepreneurs (basically any industry)  \n8. Engineer (Petro, Nuclear, Aerospace)  \n9. Real estate developer  \n10. Consultant (MBB, Big 4, Boutique, Strategy)  \n11. Entertainer (talent is key, very competitive, Producers, Directors, Actors, Musicians, Authors, whatever gets you ad revenue on social media)  \n12. Academia / Research / Inventors (talented professors at top universities in high-paying fields creating cutting edge research, creators of IP, etc.)  \n13. Pilot (experienced, private, international)  \n14. Already rich so you just collect revenue from ownership of assets  \n15. Criminal (thief, corrupt politician)  \n16. Super niche skillset (top athletes, coaches, subject matter experts who are also top performers in top industries)"}, {"comment_author": "Minimum_Hearing_7563", "comment_text": "Find a skill or a salary that can yield that. I made that owning my own trucks but that isn’t for everyone. My advice would be to find some that you’re good at and go IN! Or you could sports bet!"}, {"comment_author": "ilovechoralmusic", "comment_text": "I was working for far less 80 % of my career until the right opportunity came up. Then I was lucky enough to be in the right place in the right time with a good attitude, humor and the right energy for the interview. There are people far more talented, that grind harder, work harder and work better then me. But I’m doing the job because I got lucky. It’s survivorship bias. We look at the people who have the job and then we think that there is a pattern. It’s not. It’s luck. Take that from a guy in his 50. it’s pure luck. We like to lie to ourself to make us feel better: I deserve this, because I’m good at what I’m doing and I made the right decision. Guess what? You don’t, you don’t deserve it more than person X. You just got lucky that you had the right teachers, met the right persons and that you were born on the right patch of dirt. It’s the lie capitalism tells us so that the poor feel bad about them selfes and don’t stop grinding for the rich."}, {"comment_author": "Gabru_here", "comment_text": "I respect your opinion but that doesn't make much sense to me. If that's the case why are we having new millionaires?"}, {"comment_author": "ilovechoralmusic", "comment_text": "I see that I was not really clear in the way I expressed myself. I’m in music. There are just a few spots, positions, jobs where you can really make serious cash. In the same time I have been teaching for 30 years and i have been a professor for more than a decade. If have helped thousands of students to grow, to learn and to become professionals. Who later made it and who not was totally random. There was absolutely no way to predict who will be successful. Because everyone is good, that’s how you get to study it and to be professional. Some have been more reliable, more charismatic, some had this little spark, but there was no way to predict it. When I look back at the maybe 100 former students who habe a great career, they have nothing in common. It’s completely random. I tell you from experience: it is luck. We do our best to be ready for opportunities but it’s thousands of random encounters and coincidences that decide your professional success. Because we need other people to trust us, to help us, to buy our product, to listen to us, to support us."}]}, {"post_title": "People who struggle to wake up early, your answer is food!", "post_url": "https://www.reddit.com/r/productivity/comments/1by667o/people_who_struggle_to_wake_up_early_your_answer/", "post_main_text": "Yep you read it correctly, it’s food. Because digestion is a humongous task your body does, it requires a lot of energy. This can directly affect your sleep, which in turn affects how dull or fresh you feel in the morning. Here are 3 tips that will make it easier for you to wake up in the morning. \n\nChew your food. Sounds simple, but it isn’t. Our digestion process starts from our mouth itself, where the digestive enzymes in our saliva are supposed to break our food down, and our stomach is expecting this half digested food. This way, the energy required by our stomach for digestion will be significantly less. But let’s face it, most of us don’t chew enough, and this is why this is the very first tip. \n\nDon’t stuff yourself with food. This is plain and simple - if you’re overeating, your stomach hates you for making it work overtime! Don’t starve yourself obviously, but also don’t eat like a pig! Interestingly enough, chewing your food well will naturally make sure you don’t eat too much, because we only have so much patience to chew so much food, right?\n\nDon’t Sleep Right After You Eat.  You will observe that our body becomes dull right after we eat. So it may make sense to make use of that dullness and sleep right away. Well, not if you want to get up feeling fresh in the morning! If you keep sufficient gap, where this temporary dullness caused by food has subsided, and then sleep, you will see you will feel much more fresh in the morning when your alarm rings. So have a gap of around 2 hours between dinner and sleep.\n\nMy experience with these tips : So I heard about these tips from Sadhguru last week, and after giving it some thought I was like “why not?”. I decided I’ll do it for a week. I'm still baffled to say that I woke up at 5, four times this week! It’s a pretty huge deal for me! I won’t lie though, it feels weird, because I am used to going to bed feeling absolutely dull and sleepy. But I’m so glad I’m able to experience that morning high again!", "post_comments": [{"comment_author": "your-so-skibidii", "comment_text": "I’m eating wrong \n\nI’m sleeping wrong \n\nI’m drinking wrong \n\nI’m shitting wrong \n\nEveryday I see posts on reddit or youtube telling me I’m doing almost everything wrong."}, {"comment_author": "zerry47", "comment_text": "I think you also breathe wrong if you do it from your mouth"}, {"comment_author": "Shyam09", "comment_text": "You’re right about doing everything wrong. \n\nPositivity ༼∩☉ل͜☉༽⊃━☆ﾟ. * ･ ｡ﾟ"}, {"comment_author": "Koltaia30", "comment_text": "All you had to do was eat shit sleep. Can't even do that smh"}, {"comment_author": "Enfors", "comment_text": "No, you're reading those posts wrong."}, {"comment_author": "squiddlumckinnon", "comment_text": "I don’t get it, wild animals instinctively know how to do all this shit. Why don’t we??"}, {"comment_author": "air_about_me", "comment_text": "Have you also considered that you're breathing wrong? Just stop and you won't have eating, sleeping, drinking, or shitting problems ever again! problems solved."}, {"comment_author": "cweaver", "comment_text": "I mean, that's one way to look at it.  Another way to look at it would be to get excited about all these things you could be getting better at, without a lot of work. \n\nIn video game terms, you've just learned that there's a bunch of really important skills that you could power level really easily."}, {"comment_author": "HarajukuLoverG_1924", "comment_text": "Also you might be blinking too much. Need to conserve energy."}, {"comment_author": "-Joseeey-", "comment_text": "Living your life… “it’s KILLING your gains!”"}, {"comment_author": "EspurrTheMagnificent", "comment_text": "Honestly, I've accepted the fact that everything I do is wrong and just do what I want. If I'm slowly killing myself, I may aswell enjoy it as best as I can"}, {"comment_author": "Kng_Wzrd0715", "comment_text": "You posted wrong, sorry."}, {"comment_author": "BetterBiscuits", "comment_text": "You probably typed that wrong"}, {"comment_author": "I1lII1l", "comment_text": "In actuality: you are redditing and youtubing wrong. :P"}, {"comment_author": "bg_a90", "comment_text": "Half the people say one thing the other half say the opposite and both get their info from grifters looking to monetize said “strategy”"}, {"comment_author": "Sweet_Computer_7116", "comment_text": "Honestly I've tried and given up so much of my attempts to control my sleep I've just decided on trying go get into freelancing so I can frigging sleep when I'm tired and wake up when my body tells me to.\n\nI'm tired of conforming to the 8 to 5 life."}, {"comment_author": "Vahsi-Las", "comment_text": "Because It makes money to someone else...Thats the gap!"}, {"comment_author": "plasmasun", "comment_text": "And maybe that's how they make money and generate views."}, {"comment_author": "Sasquatchzrevenge", "comment_text": "Congratulations your posture is wrong, stop slouching!"}, {"comment_author": "CompetitionLate7944", "comment_text": "is your life right? If yes then ignore everything. \n\nIf not then we need to figure out what it is tht needs fixing"}, {"comment_author": "Moanerloner", "comment_text": "Marr jaana chaiye hum sab ko."}, {"comment_author": "Sweaty_Peanut_Kid", "comment_text": "There’s actually significant evidence to support that breathing through your nose is much healthier for brain and bodily function."}, {"comment_author": "SirWalrusTheGrand", "comment_text": "Have you tried \"Why We Sleep\" by Mathew Walker? That book was a game changer for me"}, {"comment_author": "Sweet_Computer_7116", "comment_text": "Nope but added to my list. Thankz"}, {"comment_author": "Queen-of-meme", "comment_text": ">Don’t starve yourself obviously,\n\nDammit! 😂\nI am a starver. Which is why I need to emergency eat something before bed after forgetting to eat for six hours. Now I have an alarm telling me to eat 2h before bed. It helps!"}, {"comment_author": "ReedCentury", "comment_text": "Brooo that emergency eat is relatable 😭😭 \n\n\nI live alone too, so I forget to eat easily when I'm engrossed in doing something"}, {"comment_author": "SideLow2446", "comment_text": "Reminds of that SpongeBob scene where Patrick has an alarm set for like 3am for eating."}, {"comment_author": "Queen-of-meme", "comment_text": "Lmao 😂 accurate"}, {"comment_author": "lemmeEngineer", "comment_text": "Some people are just night owls that struggle with how our modern way of living suits the ones that can wake up early. \n\nI’ve been struggling with difficulties to fall asleep and wake up all my life. Medically I’m fine nothing is wrong. I’ve tried everything under the sun in terms of tips. Makes small difference. \n\nFor some of us it’s just natural to fall asleep very late at night and wake up at midday."}, {"comment_author": "Equivalent-Wheel-529", "comment_text": "Yeah - it is so annoying how people think of early rising as such a virtue and how corporate world is set up around it.  What difference does it make whether I work 6:30 to 3:00 or 8 to 5 or 10 to 7. Wouldn't it be more productive to let people work when they are at their peak energy levels?"}, {"comment_author": "ender278", "comment_text": "My crazy conspiracy theory about that is that some peoples ancestors had jobs like night watchman  all their lIves, and that somehow got passed down in their DNA\n\nSource: Trust me bro"}, {"comment_author": "SideLow2446", "comment_text": "I have trouble falling asleep, it usually takes me 1-2 hrs to fall asleep. I counter that by going to bed at 7pm."}, {"comment_author": "lemmeEngineer", "comment_text": "Exactly!\n\nI work a very typical 09:00-17:00. And I happen to live very close to work. So if I’ve already packed my lunch from the night before I can literally wake up at 08:30 and be in time. And I still struggle with if it feels too early. I barely manage to fall asleep before 01:00. And even with almost 8h of sleep I still feel shit in the morning. And my mind doesn’t wake up until 10:30+\n\nMeanwhile in the weekends if I don’t have anything to do and don’t set any alarms my natural timing it to fall asleep at 04:00-05:00 and wake up naturally at ~11:00-12:00. Not to mention the peak mental clarity in the 22:00-03:00 windows. I can definitely say I did over half of the unis assignments in those late hours."}, {"comment_author": "lemmeEngineer", "comment_text": "Its not even that crazy of a thought. Millenia ago when we were living in the caves and in the forests, you'd probably need someone keeping an eye out for animals, keeping the fire going etc. Makes sense to have some percentage of the population being nightowls to protect and take care of the rest during the night. And then let them sleep when the others wake up. At least is sounds beneficial to everyone."}, {"comment_author": "ZenJen87", "comment_text": "It’s not even a crazy conspiracy! It’s an actual gene mutation for this very reason. https://www.discovermagazine.com/planet-earth/chronotypes-evolution-explains-night-owls-and-early-birds"}, {"comment_author": "ender278", "comment_text": "That's so cool, thank you for the info!"}, {"comment_author": "AverySmooth80", "comment_text": "You're like 2 months away from joining a cult or pyramid scheme."}, {"comment_author": "passivevigilante", "comment_text": "Lol this sounds like he is already a member or a recruiter."}, {"comment_author": "space_fly", "comment_text": "For me it's really simple. I can't wake up early because I don't go to sleep early. I don't go to sleep early because of (1) my lack of discipline, (2) i feel that the days are too short for how much shit I want to do and (3) I'm putting off going to sleep because I don't want the day to end, because I'm not looking forward to morning when I have to go to work"}, {"comment_author": "Equivalent-Wheel-529", "comment_text": "Lol you had me until you mentioned Sadhguru.  Anyone who follows that quack/scam artist has 0 critical thinking skills. \n\nIt is always impressive how confidently people peddle pseudoscience. Just rewording popular indian grandma wisdom and charging $400 for the session - Sadhguru is a crook - not an expert or enlightened person. \n\nIncreasing your energy levels takes a lot of healthy habits. Avoiding eating right before bed is often recommended - but it isn't a cure-all. See your physician and follow their advice."}, {"comment_author": "surnamenamesurname", "comment_text": "Did you know that if you don’t eat at all, you can sleep forever?"}, {"comment_author": "MediaApprehensive833", "comment_text": "Ah..Sadhguru. Dont take him seriously..He is an imposter and a charlatan.\nYour points may be right..\nEven dead clock show right time twice a day."}, {"comment_author": "DeliberatelyInsane", "comment_text": "Chewing food until it turns into mush in your mouth is something that helped me lose 30 kgs within a year while doing very moderate exercise- like 20 mins a day, four-five times a week."}, {"comment_author": "deltadeep", "comment_text": "more chewing = slower eating = more time for stomach to register \"i'm full\" to the brain which takes a while. is that the idea?"}, {"comment_author": "DeliberatelyInsane", "comment_text": "I can guess yes. Because I sure did eat lesser when I chewed the way I mentioned. I used to be the kinds to finish a pizza by myself. Once I started chewing more, even half a pizza became difficult to eat."}, {"comment_author": "lactoseadept", "comment_text": "Aside: sunlight exposure, hydration"}, {"comment_author": "LurkingArachnid", "comment_text": "And sleep hygiene"}, {"comment_author": "aprabhu86", "comment_text": "What works for you may or may not work for others."}, {"comment_author": "Glayshyer", "comment_text": "I think Sadhguru may have killed his wife, or covered up her suicide when she found out he was cheating.\n\nThey claim she died by deliberately transferring her soul into the spirit realm. He did not let her father see her body. "}, {"comment_author": "darkspear1987", "comment_text": "Aiming for a min 10k steps and no screens an hour before bedtime does it for me"}, {"comment_author": "Katatoniczka", "comment_text": "This is completely true in my experience. If I don’t eat much in the evening, I naturally wake up earlier and more refreshed. If I eat in the evening, especially if it’s something greasy, I rest much worse."}, {"comment_author": "pydry", "comment_text": "I feel like you missed the most important one: eat breakfast as soon as you wake up.\n\n\nI didn't do this for years because I was never hungry. I actually felt repulsed by the idea of eating as soon as I woke up. I forced myself to do it. It became less repulsive but I still wouldnt say I enjoy it.\n\n\nIt did help program my body to wake up at the right time though, and to fall asleep a little easier.\n\n\nPeople go on about it being the most important meal of the day or whatever and that's bullshit I think. However, its existence (or not) does program your sleep cycle."}, {"comment_author": "DrummerFantasti", "comment_text": "Have you thought about not having enough sleep be the cause of struggling to wake up early..."}, {"comment_author": "deltadeep", "comment_text": "So you've had success for one week with a new habit and now it's THE WAY. I think a few months minimum is required to make it credible. The success could be simply your increased attention on the issue of sleep and that you're putting some new effort to change into it. If you eat 3 meals a day plus a snack or two, try repeating the mantra \"I'll wake up early and refreshed!\" to yourself 3x a day for \\~30min each plus a 4th time for 10min. It might have the same effect."}, {"comment_author": "jugglingsleights", "comment_text": "Also, people who struggle to wake up early: have children. \n\nThen be grateful for whatever time you can finally have dinner, go to bed on a full stomach and get woken up early."}, {"comment_author": "Doting_mum", "comment_text": "Yep this. Have not slept passed 6.30 since my son was born 6 1/2 years ago. \n\nAlthough as he usually wakes at 5.30 it certainly does not improve my productivity! "}, {"comment_author": "asphodeliac", "comment_text": "Why does he not get up after 6:30?"}, {"comment_author": "Sufficient-Will3644", "comment_text": "Add to this the extended nighttime chores of more laundry, more dishes, lunch prep and maybe trying to steal 30-60 minutes for yourself and you are probably going to be bed later than pre-kids. That’s what my wife and I noticed. We used to sleep at least 7 hours a night and now we are at 6 or less."}, {"comment_author": "Doting_mum", "comment_text": "He’s an early riser; 5-6am every morning in life - it’s a good thing he’s so cute! (Have managed 6.30 on less than 5 occasions) "}, {"comment_author": "Doting_mum", "comment_text": "I’ve just gone with lowering my standards instead 😂. \n\nI’m an emergency medicine doctor so shifts are all over the place, so when I’m at home for 7.30pm bedtime, I’m going to bed with my boy and that’ll be me until the morning! "}, {"comment_author": "asphodeliac", "comment_text": "Sheesh can he teach me?"}, {"comment_author": "Doting_mum", "comment_text": "Oh I’m positive that it won’t last - I’m sure the teenage years will see me dragging him out of bed at 3pm 😂"}, {"comment_author": "asphodeliac", "comment_text": "He should enjoy it while it lasts 😂😂"}, {"comment_author": "badass_vegan", "comment_text": "This is very true. For the same reason I stopped snacking between meals."}, {"comment_author": "poosebunger", "comment_text": "I struggle to wake up early due to pretty much everything I choose to do/ not do"}, {"comment_author": "Loma_Hope", "comment_text": "That's also why I do OMAD"}, {"comment_author": "LongSchlongdonf", "comment_text": "I have GERD and chewing more has actually helped a little"}, {"comment_author": "LuckJealous3775", "comment_text": "This is bs lol. Some people are just naturally night owls and aren't conditioned to wake up early."}, {"comment_author": "RenKuHaiRu", "comment_text": "This is seriously down playing the problem. The problem with sleep and wakefulness is a very complex one involve many different aspects and mechanics within ourselves and the environment.\n\nThis post is a one fit all approach, which skip all the necessary diagnose steps. Not to say this advice is bad, but to fix each individual problem, some \"guru\" advice is not enough, especially from someone who is not a medical expert."}, {"comment_author": "tcanbreathe", "comment_text": "If we’re not supposed to sleep after we eat a big meal why do we go into “rest and digest”?\nHard to believe that humans evolved any differently to other animals which enjoy a lack of natural predators? Show me a lion that doesn’t sleep off its meals.\nIf it takes all this energy to digest why try do it whilst you’re awake?"}, {"comment_author": "ConstantlyPooped", "comment_text": "This is also the same way I've been thinking for some time now, based on how sluggish we get after a meal, I would think sleeping after eating would be the best time to sleep. Eating in the afternoon and then having midday crash when that's supposed to be the most productive time in our Society just doesn't make sense. Our society does focus on overworking so makes sense that past humans would probably nap more through the day, eat in a secure location and nap after a meals when they're bodies cannot run with a full stomach/sluggish against predators or other humans. That being said, I'm definitely curious about it and wouldn't mind trying it to see if eating earlier helps."}, {"comment_author": "tcanbreathe", "comment_text": "Having been eating one meal a day (omad), after everything else is done for the day and immediately before sleeping, for around the past 5 years now - I can say it’s incredible how easily I wake up every morning.\nAdditionally, I had a Bupa health screening about 6 months ago with my work and they couldn’t suggest a single lifestyle adjustment to improve my results."}, {"comment_author": "surnaturel4529", "comment_text": "It can have a great impact on you but the big guest reason is people don’t sleep enough5 hour. You can wake up at any hour of the day and feel super good as long as you slept enought"}, {"comment_author": "TechDidThis", "comment_text": "This and if you walk atleast 2hrs a day 👌"}, {"comment_author": "LilacAndElderberries", "comment_text": "Doesn't make a difference for me, eating right before bed is definitely a problem whether I eat 1 hour or 5 hours before I go to bed, I get terrible sleep and often wake up several times at night. Worst part is waking up 3 hours later to feel completely fresh, then roll around in bed for another 3 hours before you finally get sleepy enough but then the alarm rings after 30 mins.\n\nI think main thing is what you eat, I ate the fattest and sweetest cookie and it gave me a headache and made sleeping impossible. The next day I still had a headache.\n\nWhat has helped improve my ability to fall asleep and get better quality sleep is when I started taking zinc + copper, magnesium, and vitamin D3 supplements every day"}, {"comment_author": "catinterpreter", "comment_text": "Sugar/insulin accounts for so many problems."}, {"comment_author": "LuckyJury6620", "comment_text": "Not me having my last meal at 5pm, having small meals and basically following these tips and still struggling to wake up at 9am lol"}, {"comment_author": "yuvaap", "comment_text": "I love that enthusiasm for morning vibes! 😊 food really does play a huge role in how we feel, doesn't it? Your experience is super inspiring and aligns perfectly with yuvaap’s philosophy.  \nchewing properly and not overeating are simple yet powerful steps towards better digestion and, consequently, better sleep. it’s all about listening to your body and giving it what it needs without going overboard. Adding to your tips, focusing on lighter, easily digestible dinners can also help. think steamed veggies, soups, or a light salad. and yep, that gap between dinner and bedtime is golden.  \nit’s amazing you’re feeling the difference! this is what happens when we tune in to our bodies and make those small changes. keep exploring and see what other tweaks can boost your wellbeing.  \nfun fact: did you know that the time you eat can affect your circadian rhythm, which controls your sleep-wake cycle? how do you plan to tweak your dinner routine next?"}, {"comment_author": "cardbored96", "comment_text": "how do people combat feeling hungry before going to bed. i’m always like damn i’m PECKISH and usually always have some kind of snack beside me, sometimes i’ll find it hard to sleep if i have that little voice sayin “mmm crackers”"}, {"comment_author": "MedicineConstant7130", "comment_text": "Good reminder! Was just told some tips to helping me wake up would be a high protein breakfast in the morning- but nothing about the night before- I’m going to try this!"}, {"comment_author": "Equivalent-Wheel-529", "comment_text": "You have never heard - dont eat immediately before sleeping? It is a very common advice. \n\nHere is another one - go for a walk after eating. It will help with digestion. Very common practice in Europe.\n\nAlso, breakfast is NOT the most important meal. Listen to your body - eat when it is hungry."}, {"comment_author": "Fluidlyflux", "comment_text": "Ok I will try it starting tonight"}, {"comment_author": "sir-algo", "comment_text": "One additional thought that seems consistent with this; Bryan Johnson specifically says he only eats in the morning through noon specifically because fasting the rest of the day dramatically improves his sleep."}, {"comment_author": "InterNetting", "comment_text": "Thanks Chatgpt!"}, {"comment_author": "Mommyera1", "comment_text": "I thought the post was about stress.. guess I was wrong"}]}, {"post_title": "What single change to your daily routine had the biggest positive impact on your productivity, and how did you implement it?", "post_url": "https://www.reddit.com/r/productivity/comments/1byx2rd/what_single_change_to_your_daily_routine_had_the/", "post_main_text": "For me it was definitely no phone use for the first and the last 30 minutes of the day. Implementing this made me sleep like a baby and that goes hand in hand with being happier, less stressed, more productive,... honestly i could keep going. I really recommend you give it a try :)", "post_comments": [{"comment_author": "unchainedandfree1", "comment_text": "Setting reminders for everything I need to do routine wise and night before for work day plans or  handhops plans"}, {"comment_author": "Luka1607", "comment_text": "do you use a special app for that?"}, {"comment_author": "Petro1313", "comment_text": "I'm not who you asked, but I use the stock iOS Reminders app for the same thing. Literally every little thing that pops into my head that I need to do, I open up Reminders and add it as a task. It takes a little bit to get in the habit of doing and it can seem a little obtrusive at first, but eventually it takes about 15 seconds to do and lets me continue with whatever task I was doing when I got distracted by the thought of it. I find it keeps my mental bandwidth from getting tied up by trying to remember everything I need to do later in the day, and prevents me from trying to task switch or multitask while I'm doing something else at work. And when I say every little thing, I do mean every little thing, from flip the laundry to take out the trash. When I first started it seemed like I had a huge list of things to put in there, but as you get things put in there (and ideally scheduled), the backlog naturally decreases and it really helps lighten the mental load. You can also partially automate a lot of things by making them recurring daily/weekly/biweekly etc, for example our recycling is collected every second week, so I have a recurring biweekly reminder for the night before to get it all bagged and put out by the curb.\n\nIt might seem really excessive and onerous, but having things put down somewhere that can keep you accountable and also acts as a list of tasks that you can do at any given time when you have some downtime and you'd like to be productive is really convenient. I'm sure there's an equivalent (or better) Android app if you're not on iOS."}, {"comment_author": "Level-Evidence-9886", "comment_text": "not touching my mobile in morning and giving a gap of an hour to any screen before sleeping"}, {"comment_author": "fattylimes", "comment_text": "Interesting! for me, it’s not using the phone for [x] time before bed and [y] time waking up!!"}]}, {"post_title": "How to stop planning and actually doing after 10 wasted years ?\n", "post_url": "https://www.reddit.com/r/productivity/comments/1byp0t6/how_to_stop_planning_and_actually_doing_after_10/", "post_main_text": "\nI just realized it has been 10 years since I write texts on how to be a better person, entire programs on how to take control of my life, detailing all aspects of life, goals, behaviour rules, routines etc, since I was as a teenager, I even described the person I would like to be, perfect, in all aspects, physical, moral, etc. And I don't do anything! I just write and write the same things for ten years and never take action. Help me I feel like I'm psychotic or something. ", "post_comments": [{"comment_author": "Luka1607", "comment_text": "Here is what i think would help. Write SMART goals. \n\nS - specific\n\nM - measurable\n\nA - achievable\n\nR - reachable\n\nT - time-bound\n\nDon't write to many, for start 2-3 should be enough (ex. start a blog and post daily, excersise 4 times a week and lose 10 kg in the next 6 months --> but they have to be specific to you).\n\nThen break up those goals into smaller, easier to-do tasks and just get to work man. That's it.\n\nI'll hear from you in 6 months when you transform your life ;)"}, {"comment_author": "kung-phucious", "comment_text": "Are you addicted to screens like YouTube, Netflix, video games, scrolling on social media?"}, {"comment_author": "LillithSanguinum", "comment_text": "Yes"}, {"comment_author": "kung-phucious", "comment_text": "Every time you set goals you get excited. But then when you actually take a step toward your goal, even a small one like sitting down to plan, you probably get overwhelmed and stressed right?"}, {"comment_author": "LillithSanguinum", "comment_text": "Yes, and I prefer going take a nap..."}, {"comment_author": "kung-phucious", "comment_text": "So you are probably stuck in a loop. You set goals, get overwhelmed, then instead of working through the stress you go to your phone or laptop for quick hit of dopamine. Then you take a nap. Rinse and repeat for ten years. \n\nRead [this post](https://www.reddit.com/r/getdisciplined/comments/1btbwtr/advice_reflections_on_a_month_of_dopamine_fasting/) slowly and carefully. Understand every part of what he wrote and then reflect on your behavior."}, {"comment_author": "LillithSanguinum", "comment_text": "Thank you"}, {"comment_author": "Nooties", "comment_text": "Stop planning. You have identified the problem, it’s your obsession with writing and creating plans. Put down the pen. Put away the documents. You know what to do already. Lock away your plans for a good six months and commit to just doing without planning it all out. People plan so as to not make a mistake. Guess what? You’re not going to do it perfectly the first time, no one does. We learn from the mistakes we make. That’s where real growth comes from, the experience gained from overcoming things. Put down the pen. Put away the plans. Commit to just doing it and whatever happens.. you’re going to be miles ahead of where you are now."}, {"comment_author": "LillithSanguinum", "comment_text": "Thanks"}, {"comment_author": "Pure_Highlight_9545", "comment_text": "It’s very cliche but honestly starting small and just taking that leap does the job. Plans will only ever be plans until you put action behind it. Have faith in yourself and your abilities. No one can make you fulfill your plans besides the person you see in the mirror. You can do it!"}, {"comment_author": "MemoryFit6175", "comment_text": "Oh I feel ya fellow over thinker, it's our curse I guess. I was like that, I recently found this app mylifequest.io (it's from desktop) and it's like a cool way to help sift through literally EVERYTHING inife - like dreams and goals and fears and all and it's step by step and at the end you just have it all structured and in a plan and you can come back to it and add things, honestly I just love it! Good luck, you're not alone 💪"}, {"comment_author": "thth18", "comment_text": "Sometimes you just need to turn off your emotions and just go do the thing you tell yourself you will do. Do first, think later. Small progress matters as you prob. already know. The hardest part is starting and most of the time \"we dont feel like it\" and \"would rather do x than z\", so thats why turn off your emotions n just GO DO IT. \nSounds simple enough but it sure needs discipline. Mindfulness meditation helps you block out those emotions so maybe start from there."}, {"comment_author": "zubeye", "comment_text": "maybe writing isn't helping, and you need to just concentrate on action\n\nI know writing can be useful for some, but perhaps it's not useful for all"}, {"comment_author": "monkey-seat", "comment_text": "There is something going on.  Is mercury in retrograde?  I keep reading posts that I had just written in my head.  \n\nIs everyone losing it at the same time? Getdisciplined and other such subs - everyone is at the end of their rope."}, {"comment_author": "Prism-Rin", "comment_text": "Yes it is in retrograde in Aries (hence why we’re all in our heads and reviewing old goals). This eclipse tomorrow will also be doling out energy for massive transformations, and with Aries being naturally associated to first house themes,  it makes sense that a lot of us want to get our shit together and get ourselves on track for the transformations coming down the line."}, {"comment_author": "B00tsB00ts", "comment_text": "Sit down and make a list of 50 things you've accomplished in the past 10 years. I suspect you'll discover that you've changed a lot."}, {"comment_author": "naevorc", "comment_text": "Hey I know this is another book. But it's short, to the point, and immediately actionable. If you can, check out solving the procrastination puzzle by Pychyl."}, {"comment_author": "LillithSanguinum", "comment_text": "Thank you :)"}, {"comment_author": "theExplodingGradient", "comment_text": "Download Skilltree, it literally gives you step-by-step goals to level up every aspect of your life, starting from the smallest goal possible and improving your mental/physical health, without getting burnt out or getting stuck in decision paralysis. It also gamifies everything so your improvement is easy to track and addictive. I use it every day for self-improvement"}, {"comment_author": "Windwavepiranha", "comment_text": "Focus on what you can do literally Rignt Now.\nThen start planning what you’ll do in 1 hour. 3 hours. Once you can follow through, make the planning further ahead."}, {"comment_author": "AverageJane7000", "comment_text": "Planning is a tool to use as needed. It shouldn't be necessary for regular days, and it shouldn't be sexy. Stick to the basics. Write appointments and deadlines in a calendar. Check it daily. Keep a to do list with only 5 things allowed to be on it. That's it."}]}, {"post_title": "Gaming Addiction taking up almost 4 hours every day", "post_url": "https://www.reddit.com/r/productivity/comments/1bytkce/gaming_addiction_taking_up_almost_4_hours_every/", "post_main_text": "I have always played many video games. I track that I usually spend at least 25 hours a week playing. I have never really struggled academically, but I do feel like I don't get to try other new things and it might slightly be starting to impact my social life. I am starting med school soon, and I am trying to get rid of this habit so I can start fresh, any tips on how to achieve this?", "post_comments": [{"comment_author": "SpotTheAurora", "comment_text": "If 4hrs a day is addiction im due for a AA meeting soon"}, {"comment_author": "NoxArtCZ", "comment_text": "On one hand - nowadays it's a self-improv trend of going overboard - sugar is killing you, watching a movie on sunday will destroy your brain, listening to music ruins your life etc.\n\nOn the other hand - perception is important, if he believes he does something too much and struggles to drop it may be a valid label. It may depend, like ... if he'd be playing 1h a week and call it an addiction, that might be weird, but 4h/day is more believable"}, {"comment_author": "NoxArtCZ", "comment_text": "Also set yourself up for success\n\n1/ make it harder to start gaming\n\n2/ make it easier to do any replacement activity\n\nKeep exploring what else makes you have fun\n\nFor example I replaced a large portion of gaming with gym, swimming, walks in nature, board games ... I have a bag for swimming prepared and the pool is 10min by a bus, so it's very easy to start this activity"}, {"comment_author": "chavez_ding2001", "comment_text": "I went cold turkey during university and it really paid off for me both socially and academically. Now I’m back to playing on my free time at home. It still feels like taking over too much of my free time but I have my life on track so it doesn’t feel stakes are as high."}, {"comment_author": "Kaoru1011", "comment_text": "Damn I need to do this because my academics are good and social life is good but I haven’t put any time into actually learning and joining clubs from my major"}, {"comment_author": "ElectricStings", "comment_text": "Would a reward system work for you? Gaming inherently isn't a bad activity; it's fun, develops hand eye coordination, team building skills, problem solving skills. All of these are benefits. The issue is the time. \n\nCould the gaming be seen as reward for you? So you get up, do your lectures, do some work on assignments, do some exercise plus whatever goals are important to you, then some hours of gaming is your reward. \n\nI can't promise it's the right way of doing things but taking away something you enjoy is gonna feel like a punishment and demotivating. How often has punishing yourself into doing something worked out for you?"}, {"comment_author": "pleasegivemealife", "comment_text": "What game are you playing? Sometimes your ocd is the root cause. Gaming suppose to keep you entertained and destress. But if you are wired to get happy from gaming, you can set a goal I will only play after I go to the gym or went out. That way you will be trained to reward after a productivity day.\n\nIf you can’t do that, the best is to uninstall or set a lock time limit, I’m not fond of that because it feels like a punishment but some people benefit from that.\n\nWish you all the best."}, {"comment_author": "KANYESUPERAFAN420", "comment_text": ">power\n\nI play valorant lol and like random games on steam with my mates"}, {"comment_author": "NoxArtCZ", "comment_text": "I believe it may be very important to provide your expectations and boundaries to your mates so you don't get regularly pressured into playing when you had enough, so it doesn't undermine your change"}, {"comment_author": "Kyleeee", "comment_text": "I sold my gaming PC and bought a guitar rig with it in college. That did the trick."}, {"comment_author": "ergashhh", "comment_text": "To break a bad habit you need to make it impossible to do so, like you could delete the game right after you feel bad about it, or tell someone to lock your pc put a password, or just go to the library and sit there till like 7 pm, once you get bored, you will pick up some books and start reading eventually, just make it so difficult to play that you will not want to do it anymore."}, {"comment_author": "Grade-Long", "comment_text": "Get a K-Safe and lock your controller or power cable away. Set it to “unlock” hours after you’ve woken up so you get all your work done before you can play"}, {"comment_author": "AspectForsaken7619", "comment_text": "I’ve found that when it comes to my addictions, taking a deep breath and reminding myself that I am in here in this moment right now (while opening and closing my hand and being aware of the fact that I have control over myself) and that I get to make this choice with intention. And I remind myself of my goals and see if this fits with them, and if I do choose this I will periodically take breaths and repeat the process to maintain self awareness and control"}, {"comment_author": "HelloHi9999", "comment_text": "Prioritize balance. I too have played video games for many years. However, I know it’s just as important to do other things. Such as working out or spending time with family and friends. \n\nThis is why I play video games a few times a week. I would say the average is 8-10 hours. Btw I barely played video games when I was studying. The ratio was like 0 - 4 hours a month. I would wait until summers where I had some more free time. \n\nIt is clear by this post that balance is important to you, keep that in mind as you work to reset your priorities."}]}, {"post_title": "I cannot sit still - how do you deal with toxic productivity? ", "post_url": "https://www.reddit.com/r/productivity/comments/1byzij4/i_cannot_sit_still_how_do_you_deal_with_toxic/", "post_main_text": "Hi everyone I am about to start a new job and i’m noticing that I keep on finding new things to do and cannot ever sit still. On the one hand it’s keeping me occupied which is really nice because I do get a lot done and I have higher productivity than most people I know. On the other hand I start noticing that I cannot really sit still and do nothing or do some thing that is not too productive. \n\nGoing back to the workforce now after a break of two months I really need to calm down because this sort of toxic approach has been affecting me physically and mentally. \n\nNo I thought this could be a good place to ask on how you manage being productive with taking it easy and if anybody has any sort of advice that has recently worked for them I would be very grateful \n\nLet’s share it and  support each other 🙏", "post_comments": [{"comment_author": "Icy-Scientist-6673", "comment_text": "we are not supposed to sit still and we cant. Also moving a bit every half an hour is beneficial to health preventing laziness, back pain, better cognition, ... my suggestion is to refer pomodoro technique, avoid notifications until you get break if you feel distracted"}, {"comment_author": "noduslabs", "comment_text": "Surprisingly, the best way I found to combat this problem is to actually push myself to lie down, stay immobile and rest. You can even do the Nidra Yoga deep sleep protocol of Dr Huberman or self-applied cranio-sacral therapy. In fact, once you make yourself still for a moment, you will get more productive after, so it works surprisingly well!"}, {"comment_author": "CloudSephiroth999", "comment_text": "If you're actually being productive it isn't toxic, but there is such a thing as \"lazy busy\" where you fill your time with pointless tasks instead of being effective. \n\nIf I had your challenge I would be \"toxically\" trying to buy out companies and flip them. It's oversimplifying it to say you just have to make hundreds or thousands of phone calls looking for investors / financing or businesses for sale by owner, for health reasons for example willing to accept owner finance but they exist. You can buy a company with no money down and pay for it from the profits of the business itself. most of those companies are not doing everything they can to increase revenue such as advertising, especially if it's owned by older people who aren't very savvy. If you have a TON of nervous energy you could be looking for opportunities like this and by the time you finally settle down, do it with a huge cushion of cash and a ton of business XP under your belt."}]}, {"post_title": "What does one do in order to get into a state of flow?", "post_url": "https://www.reddit.com/r/productivity/comments/1byunb1/what_does_one_do_in_order_to_get_into_a_state_of/", "post_main_text": "It's been a while since I've been in a state of flow for longer than 1 hour. I wanna achieve it for maybe 5 hours a day. Does anyone know how to do this? What are your rituals? Do you turn the wifi off? Do you listen to ambient music? ", "post_comments": [{"comment_author": "Lotadlotadlatod", "comment_text": "A few things that have helped me immensely:\n\n\n- Create a system to get tasks done. The more tasks are out of your head, the more you can focus on flow. My task system consists of a spreadsheet with tasks that repeat weekly (watering plants, changing bedsheets, etc.), a planner for future tasks and a daily to do list. Try to finish as big of a chunk as possible of your to do list at the beginning of the day. You will be amazed how much mental space for flow this frees up.\n\n\n- Sleep is vital! Schedule in 9 hours for it if you need lots of sleep like me. You'll often end up sleeping only 7,5 hours of it anyway. On the topic of health, eating and drinking healthy enough and working out add to your vitality and help achieve flow through a healthy body and mind.\n\n\n- Assign a physical place to your task that needs flow. If I do schoolwork at home, I get distracted very fast. If I do them at school, it's easier to get into the flow.\n\n\nHope these help :)"}, {"comment_author": "quietblur", "comment_text": "Im really bad at time management. My urge to work comes in random bursts. Idk how to use to-do lists effectively lmao."}, {"comment_author": "Dismal-Quantity-2013", "comment_text": "This is what you need to do- \n\n1. Write down your to-do list before you sleep.   \n2. Drink something while you're working. This will create a pattern in your brain to become active whenever that drink is tasted by you.   \n3. Sleep 8 hours   \n4. Practice being productive- try reading a book for an hour straight with all the focus you can give it.   \n5. Join the gym \n\nThese all are super helpful. And they are not too hard or complicated to do. \n\nAlso checkout r/HighQualityLiving if you can."}, {"comment_author": "quietblur", "comment_text": "What drink do you suggest? I try to avoid coffee as much as possible. It makes my anxiety 100x worse."}, {"comment_author": "Dismal-Quantity-2013", "comment_text": "i dont drink coffee anymore either. you can easily find decaf coffee though its just for the taste. and just by having a ritual attached to work can trigger a habit change in your mind more easily."}]}, {"post_title": "App block reward system", "post_url": "https://www.reddit.com/r/productivity/comments/1byxx38/app_block_reward_system/", "post_main_text": "I'm looking for an app blocker that works as a reward system. So, that would allow me to block disturbing applications except when I've completed certain tasks. For example, if I workout, I check the box and it would grant me a certain time of access to Facebook.", "post_comments": []}, {"post_title": "How to stop that feeling of being behind in life ?", "post_url": "https://www.reddit.com/r/productivity/comments/1byiz6v/how_to_stop_that_feeling_of_being_behind_in_life/", "post_main_text": "\nAs a 27 yr old, I’m feeling like I’m not only constantly being harsh on myself but people around me somehow someway tend to critize me based on my age. I keep hearing taunts like oh you’re not there where you’re supposed to be based on your age. And for the most part I’m fully agreeing on them. I’m indeed not performing at my age level. I think the more I’m digging in myself the bitter truth I’m realizing is that I’m not living life and taking action based on it. I’m actually scared to take actions and risks. I’m scared of discomfort. I tend to easily get anxious and overwhlemed. There is always intense amount of confusion , overthinking and I’m not really sure what’s happening with me. Why do I have so much difficulty believing in myself . If I’m so aware of my problems then why am I not doing the things I should be. What am I waiting for. Why do I keep delaying things. How come I not know my purpose and goals\n", "post_comments": [{"comment_author": "Dull_Main_7342", "comment_text": "Sit with yourself and ask: Is this where I want to be? How do I get to the place I want? Why am I afraid to take risks? What do I want to become? What do I need to do to be where I want to be and be the person I want? What do you want me to do? What is my goal?"}, {"comment_author": "Artistic-Cat577", "comment_text": "I see many posts these days about 27 years old people. I am also 27, but feel like 16. I think we never outgrew teenagehood. 27 years olds of past generation were having children, family, bigger responsibilities. The reason is we still feel like 16, we haven't noticed the passage of time and now as 27 we think we are  reaching 30 and we haven't done anything for our lives."}, {"comment_author": "PurpleNo7", "comment_text": "Thissss!"}, {"comment_author": "J3MMeditation", "comment_text": "It can take time to figure \"everything\" out. Take small steps. Journaling or meditation might help you recenter and figure out your purpose and goals. And keep in mind, those things can and likely will change throughout your life.\n\nAs for delaying things and worrying, one thing that convinced me to take a big leap and chance in life was a talk over a decade ago by TV personal trainer, Jillian Michaels. What I took from it was, if you want something to happen in your life, YOU are the person who has to make it happen. If you want change, do something about it. It won't happen just sitting around. It won't magically happen for you.\n\nThat advice convinced me to take a leap and move to another country, where I still live more than a decade later.\n\n27 is so young still. I wish I'd understood that more in my 20s. This is the perfect time in your life to try new things, see what you like (and don't like), take risks, etc.\n\nI highly recommend you tune into Gary Vee's content - he's always motivating people to go for what they want in life, at any age.\n\nGood luck!"}, {"comment_author": "Wanderlustwizard3518", "comment_text": "Remember, it's never too late to start. Take small steps, be kind to yourself, and trust the process. You've got this!"}, {"comment_author": "dravacotron", "comment_text": "You're exactly where you're supposed to be, which is right here, right now. Everything has brought you to this point, which is now, the only moment that exists, the only time that can exist. \n\nThe only decision that matters is what you do with right now."}, {"comment_author": "may-gu", "comment_text": "Where are you hearing these taunts? From whom?"}, {"comment_author": "ialwayswonderif", "comment_text": "hey that's a really hard place to be! on the plus side - you've identified what's going on, so you know where you want to be, and what you need to overcome. that's a really great place to start with a therapist, coach or mentor, who can help you learn skills like dealing with anxiety in the moment, and work through questions like, what's the worst thing that can happen?\n\nfwiw I got my first \"real\" job at 30, and in my first week one of the partners asked me if I didn't think I was too old for the role. All the other stuff I'd done ended up being useful in unexpected ways, so I progressed faster than the rest of my cohort, but tbh I quickly learned not to care about where I was relative to everyone else b/c the time I spent doing non-career-advancing things was more important to me than rungs on the ladder.\n\nYou might find David Epstein's book \"Range\" a good read. His starting point was with a cohort of veterans who were worried about their late post-military start on new careers, so he got interested in stand-out performance and learned that over the long haul in most environments, broad experience and slower early progression work better than really narrow focus aimed at rapid early achievement."}, {"comment_author": "ChefXCIX", "comment_text": "It sounds like you didn't grow up with a good upbringing of both of your parents.  \n  \nYou are only feeling behind because your mind made this reality by listening and comparing with other people. Feeling behind is only possible if you are comparing others who seems \"getting forward\" in your eyes. Focus on yourself and the Creator, try to obtain patience, create a purpose in life and get your morals and values up. Only this will make you a great man. All that what is in your heart and how you navigate this world with your gut as compass. Good luck! And a nice book to dive deeper into yourself is: The superior Way of Man."}, {"comment_author": "Sami250ch", "comment_text": "A few things come to mind when reading this: don't compare yourself to others unfairly, instead use yourself vs yourself as a starting point; allot time during the week to focus on personal development (goal-creating, journaling, reading, finding your purpose, listing your interests, trying new hobbies, socialising with others, etc.); lastly, separate action and knowledge. Knowing is one thing, taking action is another thing, so dedicate a fair amount of time for both things."}, {"comment_author": "MaxGaav", "comment_text": "My experiences with low self-worth, low self-esteem:\n\n**Symptoms**\n\n* Having thoughts/feelings that you are less than other people.\n* Feelings of shame, unworthiness, not being capable, being stupid, ugly, unattractive etc.\n* Thinking you need to please other people.\n* Feeling obliged to do what others expect. Or what you think they expect.\n* Thinking other people think negative about you.\n* Note the things you think/feel can seem very real and can even be confirmed somewhat by people around you. Reason: people react on your behaviour, on your communication. In a way you get back what you send yourself. A self-fulfilling prophecy.\n\n**Good to know**\n\n* You were not born like this. The way you feel now is 'learned'.\n* Usually this is done to you by your parents. You are a victim of their own problematic personalities. By their authoritarian or emotionally neglective upbringing\n* You can easily have the idea you grew up in a normal way while you didn't.\n* The good news: you can overcome this and lead a great life. Since it is learned, it can be unlearned.\n* Millions of people have this problem, you're not alone!\n\n**Healing**\n\n* How unfair as it is, you are the only one who can heal your poisoned brain. And in the end, you have to do the work yourself.\n* Healing will take time and effort, but it can be done. Millions and millions of people did so - and you can too.\n* Start with accepting your current position. This is it. You have to start here and make progress.\n* Be constantly aware things can always be changed. Always.\n* If your parents have caused this, break with them until you are strong enough and aware enough of their behaviour/communication. Go living on your own if possible. Don't listen to anything they say anymore. They are mentally, well, ill.\n* You may seek help from a good therapist.\n* Read books on self-esteem, self-love, self-worth. This can help you tremendously.\n* Start writing. Write down your thoughts in this respect. Everything. Daily. This is necessary for several reasons: To step out the constant thinking in circles. To be able to read things back. To find solutions for the problems. To see progress. To release tension.\n* Take good care of yourself. This is paramount. Eat healthy, exercise, take care of good sleep. Avoid drugs and alcohol.\n* Consider joining a yoga-class. Or a martial arts class, preferably Krav Maga or Muay Thai, as they are realistic and gradually building your confidence.\n* Important for healing: the competence-confidence loop (Google it) and factchecking your fears on being true (99% sure most are not).\n* Set goals for yourself in the main areas of your life and design plans to make them true.\n\n**Advantages of being someone who needs to heal mentally**\n\nThere's a very, very big advantage too, of being someone who needs to heal mentally: Once you start the proces of healing, you will get insight after insight in yourself, the human psyche in general and, if the case, the distorted brains of your parents. Once you're there, you will have a deep understanding of many things, which will give you a big advantage over other people. It can lead to a very successful life in relationships, love, work etc."}, {"comment_author": "No_Astronaut6105", "comment_text": "Therapy?"}, {"comment_author": "InfiniteDataFinder", "comment_text": "Read a book. It will help alot"}, {"comment_author": "Level-Evidence-9886", "comment_text": "by start doing shit and overpass them right there"}]}, {"post_title": "Do you know any tracker (web)apps that track multiple things, e.g habits / mood / etc?", "post_url": "https://www.reddit.com/r/productivity/comments/1byw2c3/do_you_know_any_tracker_webapps_that_track/", "post_main_text": "Hey!\n\nSeems like so many life trackers focus on one thing. I have several apps right now for different things. Stoic comes the closest, but it would be nice to have a web version as well.\n\nDo you know any apps like this? Thanks!", "post_comments": [{"comment_author": "hellohabit", "comment_text": "Check out HelloHabit. We’ll be adding more tracking types over time, including a mood tracker"}, {"comment_author": "kavakravata", "comment_text": "Awesome! Congrats on the launch. Just curious, how many users do you have? Also, what do I get for upgrading to a paid account, and what pricing options do you have? Making an account right now! :)"}, {"comment_author": "hellohabit", "comment_text": "Thanks, let us know if you have any feedback!\n\nSince launching last month, we have had about 25,000 unique authenticated users join HelloHabit! Every HelloHabit feature is free to use within a 5 Habit limit, including timer, stats, journal, calendar, cross-device sync, and more. Unlimited access is $1.99/month or $9.99/year, following a 1 week free trial! You will be presented with this information after you complete the short onboarding flow!"}, {"comment_author": "nerdymomocat", "comment_text": "Habitify?"}]}, {"post_title": "2 OE jobs, 2 kids, a startup, and a side business - would like to replace OmniFocus to stay productive ", "post_url": "https://www.reddit.com/r/productivity/comments/1bz0rwz/2_oe_jobs_2_kids_a_startup_and_a_side_business/", "post_main_text": "Hey everyone! For a few years now I’ve had to highly optimize my workflow since I currently OE with two jobs, and on the side I run a small software startup that I’m building up, and also a web development business for data integrations that is slowly gaining momentum. On top of that, I have two kids who have various appointments for after school activities and currently use OmniFocus which is ok, but doesn’t have a native Windows version and I have to switch between Windows and Mac a few times a day. \n\nIm looking for something that can meet the following use cases: \n- Can support multiple “projects” like my work tasks, kid tasks, business tasks, life events, etc.\n- Can sync with my calendar for notifications of upcoming appointments\n- Works across Mac and PC\n- Allows invites to view/edit lists on a granular level, for example my wife could see the kids tasks, my subcontractor could view my Work 1 tasks\n\nI’ve tried Todoist and it’s too light on features..Clickup seems great but mostly software focused, Notion has no calendar integration and seems a bit rigid with the project lists, I’m at a loss! Is there a combination of tools you would recommend? \n\n\n", "post_comments": []}, {"post_title": "In Search of Effective Daily Reflection, to Plan Better for Tomorrow", "post_url": "https://www.reddit.com/r/productivity/comments/1bz0rg5/in_search_of_effective_daily_reflection_to_plan/", "post_main_text": "I make a habit of laying out a plan for my day, and after following it, I just ignore it and start planning for tomorrow. It got me thinking, there has to be a more constructive way to utilize these plans instead of just tossing them away\n\nQuite a few people advocate daily reflections through journaling, taking a qualitative approach. Others lean more towards quantitative approach and measure the success of their day in numbers - be it hours spent working or the number of tasks checked off.\n\n  \nhow do you guys measure the success of your day? Do you keep track of the hours spent working or base it on the number of to-do tasks completed? journaling ? Do you find more value in one method over the other?", "post_comments": []}, {"post_title": "Alternatives to Omnifocus for project management, to dos and daily agenda - does one exist?", "post_url": "https://www.reddit.com/r/productivity/comments/1bz005x/alternatives_to_omnifocus_for_project_management/", "post_main_text": "Hello y’all. I’m new to this sub but have been an avid productivity geek for 20+ years. \n\nI’ve been an omnifocus user since its inception and unfortunately when I upgraded to omni 4 and a new MacBook, I lost my database. I’ve done all the tech support and can’t save/debug it. \n\n😑😞\n\nThat being said, in the last 6-12 months I wasn’t so diligent after having my second child (bad move) so it’s not as huge a loss as it could be. \n\nBefore I rebuild my database, I wanted to get thoughts on other options. I am looking for an alternative if there is one that is useful for:\n\n-project management\n-to dos\n-calendar/daily agenda\n-ideally the ability to integrate with another user so my husband and I can share family tasks\n-and if possible automatic missed task reorganization \n\nI was looking at Motion because of its AI ability to move tasks around. Their marketing seems to focus on its ability to be like a personal assistant. But reviews are horrible. \n\nI’ve been causally looking at:\n-structured - daily planner\n-notion\n-todoist\n-ticktick\n\nI am looking for something robust. And I’m fine with a steep learning curve as long as the app is functional and will make my life more organized. \n\nI would like to use it for my personal life, family life and our family business that has multiple moving parts. \n\nFor reference on the personal front I am using Evernote, reminders, iCal. For business our team uses asana and the Google suite. \n\nI welcome and appreciate your recommendations. Please share your thoughts. Thank you!", "post_comments": []}, {"post_title": "Trying to get into a sleep schedule", "post_url": "https://www.reddit.com/r/productivity/comments/1byzukr/trying_to_get_into_a_sleep_schedule/", "post_main_text": "Hey guys. I have done some research on this but I can't seem to get a conclusion. What happens is, during the week, I will wake up at 5:00 AM for gym on mondays, wednesdays and fridays. Tuesdays and thursdays I wake up at 6 AM. Saturday e sunday I don't set an alarm but I always wake up around 8:30 to 9:30 AM and go to the gym later.\n\nShould I keep waking up at 5 AM every day or such schedule like I mentioned isn't bad? Very confused here.", "post_comments": [{"comment_author": "Icy-Scientist-6673", "comment_text": "Yes, consistency is the key. when will attain deeper sleep stages very quickly when we sleep early, you can plan to roughly at 6am for the weekends to balance the routine and weekend"}]}, {"post_title": "What are some productive/easy ways to study for final exams?", "post_url": "https://www.reddit.com/r/productivity/comments/1byyqd6/what_are_some_productiveeasy_ways_to_study_for/", "post_main_text": "Im currently attending uni and I’m entering final exams in about a week and 1/2. I’m planning to study for my finals ahead of time so I won’t be as stressed during exam week. Im taking 5 classes in which 2 are fairly easy for me and the rest are somewhat challenging (teachers are kinda hard markers) and I don’t know where to start. I wanna get at least c’s and B’s, I’m open to try any suggestions. :)", "post_comments": []}, {"post_title": "Looking for the perfect productivity app. Something like ClickUp but not ClickUp.", "post_url": "https://www.reddit.com/r/productivity/comments/1byquik/looking_for_the_perfect_productivity_app/", "post_main_text": "ClickUp is excellent in terms of the features it has, but it runs slow and is so clunky, with constant little bugs driving me crazy. It's to the point where I can barely use it without getting mad.\n\nI love Todoist in terms of speed and stability, but it's so feature light that I can't do anything beyond the most basic task management which doesn't work for my needs.\n\nMy favorite features of ClickUp are:\n\n* Ability to have lists within lists (or projects within projects), so that clicking the \"parent\" list shows tasks in all the lists below it.\n* Extremely customizable views. For example, I can group tasks by status, date, tag, etc. then sort them by another criteria, then also filter out things by due date, etc. \n* Subtasks within subtasks.\n* Ability to show subtasks as their own tasks, so that subtasks can have their own due dates and show up in view filters based on those dates. \n\nI've tried multiple other apps like Trello, Asana, or Monday but none of them come close to the features of ClickUp. They are, however, more stable and so much more pleasant to use so I figure there must be some app I don't know about that's as robust as ClickUp without the clunkiness.\n\nThank you!", "post_comments": [{"comment_author": "ias_87", "comment_text": "There is no such thing as the perfect productivity app."}, {"comment_author": "PunchSmackCow", "comment_text": "I know but I'm looking for the best one I can find."}, {"comment_author": "elephant_ua", "comment_text": "You may find TickTick useful. It has what you need. Like it personally"}, {"comment_author": "crabofthewoods", "comment_text": "Have you tried updating it? And updating your computer?"}, {"comment_author": "MaxGaav", "comment_text": "Have the same quest. I came from ClickUp, use [GoodDay.work](https://GoodDay.work) now, but that has its quirks too. [Ora.pm](https://Ora.pm) might be interesting, as is [Height.app](https://Height.app) and [UpBase.io](https://UpBase.io). But since v.3. I find ClickUp very tempting again."}]}, {"post_title": "Morgen vs. Motion", "post_url": "https://www.reddit.com/r/productivity/comments/1byyf5p/morgen_vs_motion/", "post_main_text": "I am currently using Morgen but considering switching over to Morgen. I need a little more project management functionality than Morgen offers. Has anyone made the switch? Motion, has been pushing out big changes it looks like, what do you love about it?", "post_comments": []}]