[{"post_title": "Weekly help me be productive/I need advice thread", "post_url": "https://www.reddit.com/r/productivity/comments/1byog51/weekly_help_me_be_productivei_need_advice_thread/", "post_main_text": "If you’re looking for specific advice for your situation, please post here.", "post_comments": []}, {"post_title": "People who struggle to wake up early, your answer is food!", "post_url": "https://www.reddit.com/r/productivity/comments/1by667o/people_who_struggle_to_wake_up_early_your_answer/", "post_main_text": "Yep you read it correctly, it’s food. Because digestion is a humongous task your body does, it requires a lot of energy. This can directly affect your sleep, which in turn affects how dull or fresh you feel in the morning. Here are 3 tips that will make it easier for you to wake up in the morning. \n\nChew your food. Sounds simple, but it isn’t. Our digestion process starts from our mouth itself, where the digestive enzymes in our saliva are supposed to break our food down, and our stomach is expecting this half digested food. This way, the energy required by our stomach for digestion will be significantly less. But let’s face it, most of us don’t chew enough, and this is why this is the very first tip. \n\nDon’t stuff yourself with food. This is plain and simple - if you’re overeating, your stomach hates you for making it work overtime! Don’t starve yourself obviously, but also don’t eat like a pig! Interestingly enough, chewing your food well will naturally make sure you don’t eat too much, because we only have so much patience to chew so much food, right?\n\nDon’t Sleep Right After You Eat.  You will observe that our body becomes dull right after we eat. So it may make sense to make use of that dullness and sleep right away. Well, not if you want to get up feeling fresh in the morning! If you keep sufficient gap, where this temporary dullness caused by food has subsided, and then sleep, you will see you will feel much more fresh in the morning when your alarm rings. So have a gap of around 2 hours between dinner and sleep.\n\nMy experience with these tips : So I heard about these tips from Sadhguru last week, and after giving it some thought I was like “why not?”. I decided I’ll do it for a week. I'm still baffled to say that I woke up at 5, four times this week! It’s a pretty huge deal for me! I won’t lie though, it feels weird, because I am used to going to bed feeling absolutely dull and sleepy. But I’m so glad I’m able to experience that morning high again!", "post_comments": [{"comment_author": "your-so-skibidii", "comment_text": "I’m eating wrong \n\nI’m sleeping wrong \n\nI’m drinking wrong \n\nI’m shitting wrong \n\nEveryday I see posts on reddit or youtube telling me I’m doing almost everything wrong."}, {"comment_author": "zerry47", "comment_text": "I think you also breathe wrong if you do it from your mouth"}, {"comment_author": "Koltaia30", "comment_text": "All you had to do was eat shit sleep. Can't even do that smh"}, {"comment_author": "Shyam09", "comment_text": "You’re right about doing everything wrong. \n\nPositivity ༼∩☉ل͜☉༽⊃━☆ﾟ. * ･ ｡ﾟ"}, {"comment_author": "Enfors", "comment_text": "No, you're reading those posts wrong."}, {"comment_author": "squiddlumckinnon", "comment_text": "I don’t get it, wild animals instinctively know how to do all this shit. Why don’t we??"}, {"comment_author": "air_about_me", "comment_text": "Have you also considered that you're breathing wrong? Just stop and you won't have eating, sleeping, drinking, or shitting problems ever again! problems solved."}, {"comment_author": "cweaver", "comment_text": "I mean, that's one way to look at it.  Another way to look at it would be to get excited about all these things you could be getting better at, without a lot of work. \n\nIn video game terms, you've just learned that there's a bunch of really important skills that you could power level really easily."}, {"comment_author": "HarajukuLoverG_1924", "comment_text": "Also you might be blinking too much. Need to conserve energy."}, {"comment_author": "-Joseeey-", "comment_text": "Living your life… “it’s KILLING your gains!”"}, {"comment_author": "EspurrTheMagnificent", "comment_text": "Honestly, I've accepted the fact that everything I do is wrong and just do what I want. If I'm slowly killing myself, I may aswell enjoy it as best as I can"}, {"comment_author": "BetterBiscuits", "comment_text": "You probably typed that wrong"}, {"comment_author": "I1lII1l", "comment_text": "In actuality: you are redditing and youtubing wrong. :P"}, {"comment_author": "Kng_Wzrd0715", "comment_text": "You posted wrong, sorry."}, {"comment_author": "bg_a90", "comment_text": "Half the people say one thing the other half say the opposite and both get their info from grifters looking to monetize said “strategy”"}, {"comment_author": "Sweet_Computer_7116", "comment_text": "Honestly I've tried and given up so much of my attempts to control my sleep I've just decided on trying go get into freelancing so I can frigging sleep when I'm tired and wake up when my body tells me to.\n\nI'm tired of conforming to the 8 to 5 life."}, {"comment_author": "Vahsi-Las", "comment_text": "Because It makes money to someone else...Thats the gap!"}, {"comment_author": "plasmasun", "comment_text": "And maybe that's how they make money and generate views."}, {"comment_author": "Sasquatchzrevenge", "comment_text": "Congratulations your posture is wrong, stop slouching!"}, {"comment_author": "Moanerloner", "comment_text": "Marr jaana chaiye hum sab ko."}, {"comment_author": "Queen-of-meme", "comment_text": ">Don’t starve yourself obviously,\n\nDammit! 😂\nI am a starver. Which is why I need to emergency eat something before bed after forgetting to eat for six hours. Now I have an alarm telling me to eat 2h before bed. It helps!"}, {"comment_author": "ReedCentury", "comment_text": "Brooo that emergency eat is relatable 😭😭 \n\n\nI live alone too, so I forget to eat easily when I'm engrossed in doing something"}, {"comment_author": "SideLow2446", "comment_text": "Reminds of that SpongeBob scene where Patrick has an alarm set for like 3am for eating."}, {"comment_author": "Queen-of-meme", "comment_text": "Lmao 😂 accurate"}, {"comment_author": "lemmeEngineer", "comment_text": "Some people are just night owls that struggle with how our modern way of living suits the ones that can wake up early. \n\nI’ve been struggling with difficulties to fall asleep and wake up all my life. Medically I’m fine nothing is wrong. I’ve tried everything under the sun in terms of tips. Makes small difference. \n\nFor some of us it’s just natural to fall asleep very late at night and wake up at midday."}, {"comment_author": "Equivalent-Wheel-529", "comment_text": "Yeah - it is so annoying how people think of early rising as such a virtue and how corporate world is set up around it.  What difference does it make whether I work 6:30 to 3:00 or 8 to 5 or 10 to 7. Wouldn't it be more productive to let people work when they are at their peak energy levels?"}, {"comment_author": "ender278", "comment_text": "My crazy conspiracy theory about that is that some peoples ancestors had jobs like night watchman  all their lIves, and that somehow got passed down in their DNA\n\nSource: Trust me bro"}, {"comment_author": "SideLow2446", "comment_text": "I have trouble falling asleep, it usually takes me 1-2 hrs to fall asleep. I counter that by going to bed at 7pm."}, {"comment_author": "lemmeEngineer", "comment_text": "Exactly!\n\nI work a very typical 09:00-17:00. And I happen to live very close to work. So if I’ve already packed my lunch from the night before I can literally wake up at 08:30 and be in time. And I still struggle with if it feels too early. I barely manage to fall asleep before 01:00. And even with almost 8h of sleep I still feel shit in the morning. And my mind doesn’t wake up until 10:30+\n\nMeanwhile in the weekends if I don’t have anything to do and don’t set any alarms my natural timing it to fall asleep at 04:00-05:00 and wake up naturally at ~11:00-12:00. Not to mention the peak mental clarity in the 22:00-03:00 windows. I can definitely say I did over half of the unis assignments in those late hours."}, {"comment_author": "ZenJen87", "comment_text": "It’s not even a crazy conspiracy! It’s an actual gene mutation for this very reason. https://www.discovermagazine.com/planet-earth/chronotypes-evolution-explains-night-owls-and-early-birds"}, {"comment_author": "lemmeEngineer", "comment_text": "Its not even that crazy of a thought. Millenia ago when we were living in the caves and in the forests, you'd probably need someone keeping an eye out for animals, keeping the fire going etc. Makes sense to have some percentage of the population being nightowls to protect and take care of the rest during the night. And then let them sleep when the others wake up. At least is sounds beneficial to everyone."}, {"comment_author": "ender278", "comment_text": "That's so cool, thank you for the info!"}, {"comment_author": "AverySmooth80", "comment_text": "You're like 2 months away from joining a cult or pyramid scheme."}, {"comment_author": "passivevigilante", "comment_text": "Lol this sounds like he is already a member or a recruiter."}, {"comment_author": "space_fly", "comment_text": "For me it's really simple. I can't wake up early because I don't go to sleep early. I don't go to sleep early because of (1) my lack of discipline, (2) i feel that the days are too short for how much shit I want to do and (3) I'm putting off going to sleep because I don't want the day to end, because I'm not looking forward to morning when I have to go to work"}, {"comment_author": "Equivalent-Wheel-529", "comment_text": "Lol you had me until you mentioned Sadhguru.  Anyone who follows that quack/scam artist has 0 critical thinking skills. \n\nIt is always impressive how confidently people peddle pseudoscience. Just rewording popular indian grandma wisdom and charging $400 for the session - Sadhguru is a crook - not an expert or enlightened person. \n\nIncreasing your energy levels takes a lot of healthy habits. Avoiding eating right before bed is often recommended - but it isn't a cure-all. See your physician and follow their advice."}, {"comment_author": "surnamenamesurname", "comment_text": "Did you know that if you don’t eat at all, you can sleep forever?"}, {"comment_author": "MediaApprehensive833", "comment_text": "Ah..Sadhguru. Dont take him seriously..He is an imposter and a charlatan.\nYour points may be right..\nEven dead clock show right time twice a day."}, {"comment_author": "DeliberatelyInsane", "comment_text": "Chewing food until it turns into mush in your mouth is something that helped me lose 30 kgs within a year while doing very moderate exercise- like 20 mins a day, four-five times a week."}, {"comment_author": "deltadeep", "comment_text": "more chewing = slower eating = more time for stomach to register \"i'm full\" to the brain which takes a while. is that the idea?"}, {"comment_author": "DeliberatelyInsane", "comment_text": "I can guess yes. Because I sure did eat lesser when I chewed the way I mentioned. I used to be the kinds to finish a pizza by myself. Once I started chewing more, even half a pizza became difficult to eat."}, {"comment_author": "lactoseadept", "comment_text": "Aside: sunlight exposure, hydration"}, {"comment_author": "LurkingArachnid", "comment_text": "And sleep hygiene"}, {"comment_author": "darkspear1987", "comment_text": "Aiming for a min 10k steps and no screens an hour before bedtime does it for me"}, {"comment_author": "aprabhu86", "comment_text": "What works for you may or may not work for others."}, {"comment_author": "Katatoniczka", "comment_text": "This is completely true in my experience. If I don’t eat much in the evening, I naturally wake up earlier and more refreshed. If I eat in the evening, especially if it’s something greasy, I rest much worse."}, {"comment_author": "pydry", "comment_text": "I feel like you missed the most important one: eat breakfast as soon as you wake up.\n\n\nI didn't do this for years because I was never hungry. I actually felt repulsed by the idea of eating as soon as I woke up. I forced myself to do it. It became less repulsive but I still wouldnt say I enjoy it.\n\n\nIt did help program my body to wake up at the right time though, and to fall asleep a little easier.\n\n\nPeople go on about it being the most important meal of the day or whatever and that's bullshit I think. However, its existence (or not) does program your sleep cycle."}, {"comment_author": "Glayshyer", "comment_text": "I think Sadhguru may have killed his wife, or covered up her suicide when she found out he was cheating.\n\nThey claim she died by deliberately transferring her soul into the spirit realm. He did not let her father see her body. "}, {"comment_author": "DrummerFantasti", "comment_text": "Have you thought about not having enough sleep be the cause of struggling to wake up early..."}, {"comment_author": "jugglingsleights", "comment_text": "Also, people who struggle to wake up early: have children. \n\nThen be grateful for whatever time you can finally have dinner, go to bed on a full stomach and get woken up early."}, {"comment_author": "Doting_mum", "comment_text": "Yep this. Have not slept passed 6.30 since my son was born 6 1/2 years ago. \n\nAlthough as he usually wakes at 5.30 it certainly does not improve my productivity! "}, {"comment_author": "asphodeliac", "comment_text": "Why does he not get up after 6:30?"}, {"comment_author": "Doting_mum", "comment_text": "He’s an early riser; 5-6am every morning in life - it’s a good thing he’s so cute! (Have managed 6.30 on less than 5 occasions) "}, {"comment_author": "asphodeliac", "comment_text": "Sheesh can he teach me?"}, {"comment_author": "Doting_mum", "comment_text": "Oh I’m positive that it won’t last - I’m sure the teenage years will see me dragging him out of bed at 3pm 😂"}, {"comment_author": "asphodeliac", "comment_text": "He should enjoy it while it lasts 😂😂"}, {"comment_author": "badass_vegan", "comment_text": "This is very true. For the same reason I stopped snacking between meals."}, {"comment_author": "poosebunger", "comment_text": "I struggle to wake up early due to pretty much everything I choose to do/ not do"}, {"comment_author": "Loma_Hope", "comment_text": "That's also why I do OMAD"}, {"comment_author": "LongSchlongdonf", "comment_text": "I have GERD and chewing more has actually helped a little"}, {"comment_author": "LuckJealous3775", "comment_text": "This is bs lol. Some people are just naturally night owls and aren't conditioned to wake up early."}, {"comment_author": "deltadeep", "comment_text": "So you've had success for one week with a new habit and now it's THE WAY. I think a few months minimum is required to make it credible. The success could be simply your increased attention on the issue of sleep and that you're putting some new effort to change into it. If you eat 3 meals a day plus a snack or two, try repeating the mantra \"I'll wake up early and refreshed!\" to yourself 3x a day for \\~30min each plus a 4th time for 10min. It might have the same effect."}, {"comment_author": "tcanbreathe", "comment_text": "If we’re not supposed to sleep after we eat a big meal why do we go into “rest and digest”?\nHard to believe that humans evolved any differently to other animals which enjoy a lack of natural predators? Show me a lion that doesn’t sleep off its meals.\nIf it takes all this energy to digest why try do it whilst you’re awake?"}, {"comment_author": "ConstantlyPooped", "comment_text": "This is also the same way I've been thinking for some time now, based on how sluggish we get after a meal, I would think sleeping after eating would be the best time to sleep. Eating in the afternoon and then having midday crash when that's supposed to be the most productive time in our Society just doesn't make sense. Our society does focus on overworking so makes sense that past humans would probably nap more through the day, eat in a secure location and nap after a meals when they're bodies cannot run with a full stomach/sluggish against predators or other humans. That being said, I'm definitely curious about it and wouldn't mind trying it to see if eating earlier helps."}, {"comment_author": "tcanbreathe", "comment_text": "Having been eating one meal a day (omad), after everything else is done for the day and immediately before sleeping, for around the past 5 years now - I can say it’s incredible how easily I wake up every morning.\nAdditionally, I had a Bupa health screening about 6 months ago with my work and they couldn’t suggest a single lifestyle adjustment to improve my results."}, {"comment_author": "surnaturel4529", "comment_text": "It can have a great impact on you but the big guest reason is people don’t sleep enough5 hour. You can wake up at any hour of the day and feel super good as long as you slept enought"}, {"comment_author": "TechDidThis", "comment_text": "This and if you walk atleast 2hrs a day 👌"}, {"comment_author": "LilacAndElderberries", "comment_text": "Doesn't make a difference for me, eating right before bed is definitely a problem whether I eat 1 hour or 5 hours before I go to bed, I get terrible sleep and often wake up several times at night. Worst part is waking up 3 hours later to feel completely fresh, then roll around in bed for another 3 hours before you finally get sleepy enough but then the alarm rings after 30 mins.\n\nI think main thing is what you eat, I ate the fattest and sweetest cookie and it gave me a headache and made sleeping impossible. The next day I still had a headache.\n\nWhat has helped improve my ability to fall asleep and get better quality sleep is when I started taking zinc + copper, magnesium, and vitamin D3 supplements every day"}, {"comment_author": "catinterpreter", "comment_text": "Sugar/insulin accounts for so many problems."}, {"comment_author": "LuckyJury6620", "comment_text": "Not me having my last meal at 5pm, having small meals and basically following these tips and still struggling to wake up at 9am lol"}, {"comment_author": "yuvaap", "comment_text": "I love that enthusiasm for morning vibes! 😊 food really does play a huge role in how we feel, doesn't it? Your experience is super inspiring and aligns perfectly with yuvaap’s philosophy.  \nchewing properly and not overeating are simple yet powerful steps towards better digestion and, consequently, better sleep. it’s all about listening to your body and giving it what it needs without going overboard. Adding to your tips, focusing on lighter, easily digestible dinners can also help. think steamed veggies, soups, or a light salad. and yep, that gap between dinner and bedtime is golden.  \nit’s amazing you’re feeling the difference! this is what happens when we tune in to our bodies and make those small changes. keep exploring and see what other tweaks can boost your wellbeing.  \nfun fact: did you know that the time you eat can affect your circadian rhythm, which controls your sleep-wake cycle? how do you plan to tweak your dinner routine next?"}, {"comment_author": "RenKuHaiRu", "comment_text": "This is seriously down playing the problem. The problem with sleep and wakefulness is a very complex one involve many different aspects and mechanics within ourselves and the environment."}, {"comment_author": "MedicineConstant7130", "comment_text": "Good reminder! Was just told some tips to helping me wake up would be a high protein breakfast in the morning- but nothing about the night before- I’m going to try this!"}, {"comment_author": "Equivalent-Wheel-529", "comment_text": "You have never heard - dont eat immediately before sleeping? It is a very common advice. \n\nHere is another one - go for a walk after eating. It will help with digestion. Very common practice in Europe.\n\nAlso, breakfast is NOT the most important meal. Listen to your body - eat when it is hungry."}, {"comment_author": "Fluidlyflux", "comment_text": "Ok I will try it starting tonight"}, {"comment_author": "sir-algo", "comment_text": "One additional thought that seems consistent with this; Bryan Johnson specifically says he only eats in the morning through noon specifically because fasting the rest of the day dramatically improves his sleep."}]}, {"post_title": "How to stop planning and actually doing after 10 wasted years ?\n", "post_url": "https://www.reddit.com/r/productivity/comments/1byp0t6/how_to_stop_planning_and_actually_doing_after_10/", "post_main_text": "\nI just realized it has been 10 years since I write texts on how to be a better person, entire programs on how to take control of my life, detailing all aspects of life, goals, behaviour rules, routines etc, since I was as a teenager, I even described the person I would like to be, perfect, in all aspects, physical, moral, etc. And I don't do anything! I just write and write the same things for ten years and never take action. Help me I feel like I'm psychotic or something. ", "post_comments": [{"comment_author": "Luka1607", "comment_text": "Here is what i think would help. Write SMART goals. \n\nS - specific\n\nM - measurable\n\nA - achievable\n\nR - reachable\n\nT - time-bound\n\nDon't write to many, for start 2-3 should be enough (ex. start a blog and post daily, excersise 4 times a week and lose 10 kg in the next 6 months --> but they have to be specific to you).\n\nThen break up those goals into smaller, easier to-do tasks and just get to work man. That's it.\n\nI'll hear from you in 6 months when you transform your life ;)"}, {"comment_author": "Pure_Highlight_9545", "comment_text": "It’s very cliche but honestly starting small and just taking that leap does the job. Plans will only ever be plans until you put action behind it. Have faith in yourself and your abilities. No one can make you fulfill your plans besides the person you see in the mirror. You can do it!"}, {"comment_author": "kung-phucious", "comment_text": "Are you addicted to screens like YouTube, Netflix, video games, scrolling on social media?"}, {"comment_author": "LillithSanguinum", "comment_text": "Yes"}, {"comment_author": "kung-phucious", "comment_text": "Every time you set goals you get excited. But then when you actually take a step toward your goal, even a small one like sitting down to plan, you probably get overwhelmed and stressed right?"}, {"comment_author": "LillithSanguinum", "comment_text": "Yes, and I prefer going take a nap..."}, {"comment_author": "kung-phucious", "comment_text": "So you are probably stuck in a loop. You set goals, get overwhelmed, then instead of working through the stress you go to your phone or laptop for quick hit of dopamine. Then you take a nap. Rinse and repeat for ten years. \n\nRead [this post](https://www.reddit.com/r/getdisciplined/comments/1btbwtr/advice_reflections_on_a_month_of_dopamine_fasting/) slowly and carefully. Understand every part of what he wrote and then reflect on your behavior."}, {"comment_author": "LillithSanguinum", "comment_text": "Thank you"}, {"comment_author": "Nooties", "comment_text": "Stop planning. You have identified the problem, it’s your obsession with writing and creating plans. Put down the pen. Put away the documents. You know what to do already. Lock away your plans for a good six months and commit to just doing without planning it all out. People plan so as to not make a mistake. Guess what? You’re not going to do it perfectly the first time, no one does. We learn from the mistakes we make. That’s where real growth comes from, the experience gained from overcoming things. Put down the pen. Put away the plans. Commit to just doing it and whatever happens.. you’re going to be miles ahead of where you are now."}, {"comment_author": "LillithSanguinum", "comment_text": "Thanks"}, {"comment_author": "MemoryFit6175", "comment_text": "Oh I feel ya fellow over thinker, it's our curse I guess. I was like that, I recently found this app mylifequest.io (it's from desktop) and it's like a cool way to help sift through literally EVERYTHING inife - like dreams and goals and fears and all and it's step by step and at the end you just have it all structured and in a plan and you can come back to it and add things, honestly I just love it! Good luck, you're not alone 💪"}, {"comment_author": "thth18", "comment_text": "Sometimes you just need to turn off your emotions and just go do the thing you tell yourself you will do. Do first, think later. Small progress matters as you prob. already know. The hardest part is starting and most of the time \"we dont feel like it\" and \"would rather do x than z\", so thats why turn off your emotions n just GO DO IT. \nSounds simple enough but it sure needs discipline. Mindfulness meditation helps you block out those emotions so maybe start from there."}, {"comment_author": "zubeye", "comment_text": "maybe writing isn't helping, and you need to just concentrate on action\n\nI know writing can be useful for some, but perhaps it's not useful for all"}, {"comment_author": "monkey-seat", "comment_text": "There is something going on.  Is mercury in retrograde?  I keep reading posts that I had just written in my head.  \n\nIs everyone losing it at the same time? Getdisciplined and other such subs - everyone is at the end of their rope."}, {"comment_author": "Prism-Rin", "comment_text": "Yes it is in retrograde in Aries (hence why we’re all in our heads and reviewing old goals). This eclipse tomorrow will also be doling out energy for massive transformations, and with Aries being naturally associated to first house themes,  it makes sense that a lot of us want to get our shit together and get ourselves on track for the transformations coming down the line."}, {"comment_author": "B00tsB00ts", "comment_text": "Sit down and make a list of 50 things you've accomplished in the past 10 years. I suspect you'll discover that you've changed a lot."}, {"comment_author": "naevorc", "comment_text": "Hey I know this is another book. But it's short, to the point, and immediately actionable. If you can, check out solving the procrastination puzzle by Pychyl."}, {"comment_author": "LillithSanguinum", "comment_text": "Thank you :)"}]}, {"post_title": "How to stop that feeling of being behind in life ?", "post_url": "https://www.reddit.com/r/productivity/comments/1byiz6v/how_to_stop_that_feeling_of_being_behind_in_life/", "post_main_text": "\nAs a 27 yr old, I’m feeling like I’m not only constantly being harsh on myself but people around me somehow someway tend to critize me based on my age. I keep hearing taunts like oh you’re not there where you’re supposed to be based on your age. And for the most part I’m fully agreeing on them. I’m indeed not performing at my age level. I think the more I’m digging in myself the bitter truth I’m realizing is that I’m not living life and taking action based on it. I’m actually scared to take actions and risks. I’m scared of discomfort. I tend to easily get anxious and overwhlemed. There is always intense amount of confusion , overthinking and I’m not really sure what’s happening with me. Why do I have so much difficulty believing in myself . If I’m so aware of my problems then why am I not doing the things I should be. What am I waiting for. Why do I keep delaying things. How come I not know my purpose and goals\n", "post_comments": [{"comment_author": "Dull_Main_7342", "comment_text": "Sit with yourself and ask: Is this where I want to be? How do I get to the place I want? Why am I afraid to take risks? What do I want to become? What do I need to do to be where I want to be and be the person I want? What do you want me to do? What is my goal?"}, {"comment_author": "Artistic-Cat577", "comment_text": "I see many posts these days about 27 years old people. I am also 27, but feel like 16. I think we never outgrew teenagehood. 27 years olds of past generation were having children, family, bigger responsibilities. The reason is we still feel like 16, we haven't noticed the passage of time and now as 27 we think we are  reaching 30 and we haven't done anything for our lives."}, {"comment_author": "PurpleNo7", "comment_text": "Thissss!"}, {"comment_author": "J3MMeditation", "comment_text": "It can take time to figure \"everything\" out. Take small steps. Journaling or meditation might help you recenter and figure out your purpose and goals. And keep in mind, those things can and likely will change throughout your life.\n\nAs for delaying things and worrying, one thing that convinced me to take a big leap and chance in life was a talk over a decade ago by TV personal trainer, Jillian Michaels. What I took from it was, if you want something to happen in your life, YOU are the person who has to make it happen. If you want change, do something about it. It won't happen just sitting around. It won't magically happen for you.\n\nThat advice convinced me to take a leap and move to another country, where I still live more than a decade later.\n\n27 is so young still. I wish I'd understood that more in my 20s. This is the perfect time in your life to try new things, see what you like (and don't like), take risks, etc.\n\nI highly recommend you tune into Gary Vee's content - he's always motivating people to go for what they want in life, at any age.\n\nGood luck!"}, {"comment_author": "Wanderlustwizard3518", "comment_text": "Remember, it's never too late to start. Take small steps, be kind to yourself, and trust the process. You've got this!"}, {"comment_author": "dravacotron", "comment_text": "You're exactly where you're supposed to be, which is right here, right now. Everything has brought you to this point, which is now, the only moment that exists, the only time that can exist. \n\nThe only decision that matters is what you do with right now."}, {"comment_author": "may-gu", "comment_text": "Where are you hearing these taunts? From whom?"}, {"comment_author": "ialwayswonderif", "comment_text": "hey that's a really hard place to be! on the plus side - you've identified what's going on, so you know where you want to be, and what you need to overcome. that's a really great place to start with a therapist, coach or mentor, who can help you learn skills like dealing with anxiety in the moment, and work through questions like, what's the worst thing that can happen?\n\nfwiw I got my first \"real\" job at 30, and in my first week one of the partners asked me if I didn't think I was too old for the role. All the other stuff I'd done ended up being useful in unexpected ways, so I progressed faster than the rest of my cohort, but tbh I quickly learned not to care about where I was relative to everyone else b/c the time I spent doing non-career-advancing things was more important to me than rungs on the ladder.\n\nYou might find David Epstein's book \"Range\" a good read. His starting point was with a cohort of veterans who were worried about their late post-military start on new careers, so he got interested in stand-out performance and learned that over the long haul in most environments, broad experience and slower early progression work better than really narrow focus aimed at rapid early achievement."}, {"comment_author": "ChefXCIX", "comment_text": "It sounds like you didn't grow up with a good upbringing of both of your parents.  \n  \nYou are only feeling behind because your mind made this reality by listening and comparing with other people. Feeling behind is only possible if you are comparing others who seems \"getting forward\" in your eyes. Focus on yourself and the Creator, try to obtain patience, create a purpose in life and get your morals and values up. Only this will make you a great man. All that what is in your heart and how you navigate this world with your gut as compass. Good luck! And a nice book to dive deeper into yourself is: The superior Way of Man."}, {"comment_author": "No_Astronaut6105", "comment_text": "Therapy?"}, {"comment_author": "InfiniteDataFinder", "comment_text": "Read a book. It will help alot"}, {"comment_author": "Level-Evidence-9886", "comment_text": "by start doing shit and overpass them right there"}]}, {"post_title": "What does one do in order to get into a state of flow?", "post_url": "https://www.reddit.com/r/productivity/comments/1byunb1/what_does_one_do_in_order_to_get_into_a_state_of/", "post_main_text": "It's been a while since I've been in a state of flow for longer than 1 hour. I wanna achieve it for maybe 5 hours a day. Does anyone know how to do this? What are your rituals? Do you turn the wifi off? Do you listen to ambient music? ", "post_comments": [{"comment_author": "Lotadlotadlatod", "comment_text": "A few things that have helped me immensely:\n\n\n- Create a system to get tasks done. The more tasks are out of your head, the more you can focus on flow. My task system consists of a spreadsheet with tasks that repeat weekly (watering plants, changing bedsheets, etc.), a planner for future tasks and a daily to do list. Try to finish as big of a chunk as possible of your to do list at the beginning of the day. You will be amazed how much mental space for flow this frees up.\n\n\n- Sleep is vital! Schedule in 9 hours for it if you need lots of sleep like me. You'll often end up sleeping only 7,5 hours of it anyway. On the topic of health, eating and drinking healthy enough and working out add to your vitality and help achieve flow through a healthy body and mind.\n\n\n- Assign a physical place to your task that needs flow. If I do schoolwork at home, I get distracted very fast. If I do them at school, it's easier to get into the flow.\n\n\nHope these help :)"}, {"comment_author": "Dismal-Quantity-2013", "comment_text": "This is what you need to do- \n\n1. Write down your to-do list before you sleep.   \n2. Drink something while you're working. This will create a pattern in your brain to become active whenever that drink is tasted by you.   \n3. Sleep 8 hours   \n4. Practice being productive- try reading a book for an hour straight with all the focus you can give it.   \n5. Join the gym \n\nThese all are super helpful. And they are not too hard or complicated to do. \n\nAlso checkout r/HighQualityLiving if you can."}]}, {"post_title": "Gaming Addiction taking up almost 4 hours every day", "post_url": "https://www.reddit.com/r/productivity/comments/1bytkce/gaming_addiction_taking_up_almost_4_hours_every/", "post_main_text": "I have always played many video games. I track that I usually spend at least 25 hours a week playing. I have never really struggled academically, but I do feel like I don't get to try other new things and it might slightly be starting to impact my social life. I am starting med school soon, and I am trying to get rid of this habit so I can start fresh, any tips on how to achieve this?", "post_comments": [{"comment_author": "Grade-Long", "comment_text": "Get a K-Safe and lock your controller or power cable away. Set it to “unlock” hours after you’ve woken up so you get all your work done before you can play"}]}, {"post_title": "Looking for the perfect productivity app. Something like ClickUp but not ClickUp.", "post_url": "https://www.reddit.com/r/productivity/comments/1byquik/looking_for_the_perfect_productivity_app/", "post_main_text": "ClickUp is excellent in terms of the features it has, but it runs slow and is so clunky, with constant little bugs driving me crazy. It's to the point where I can barely use it without getting mad.\n\nI love Todoist in terms of speed and stability, but it's so feature light that I can't do anything beyond the most basic task management which doesn't work for my needs.\n\nMy favorite features of ClickUp are:\n\n* Ability to have lists within lists (or projects within projects), so that clicking the \"parent\" list shows tasks in all the lists below it.\n* Extremely customizable views. For example, I can group tasks by status, date, tag, etc. then sort them by another criteria, then also filter out things by due date, etc. \n* Subtasks within subtasks.\n* Ability to show subtasks as their own tasks, so that subtasks can have their own due dates and show up in view filters based on those dates. \n\nI've tried multiple other apps like Trello, Asana, or Monday but none of them come close to the features of ClickUp. They are, however, more stable and so much more pleasant to use so I figure there must be some app I don't know about that's as robust as ClickUp without the clunkiness.\n\nThank you!", "post_comments": [{"comment_author": "ias_87", "comment_text": "There is no such thing as the perfect productivity app."}, {"comment_author": "PunchSmackCow", "comment_text": "I know but I'm looking for the best one I can find."}, {"comment_author": "elephant_ua", "comment_text": "You may find TickTick useful. It has what you need. Like it personally"}, {"comment_author": "crabofthewoods", "comment_text": "Have you tried updating it? And updating your computer?"}, {"comment_author": "MaxGaav", "comment_text": "Have the same quest. I use [GoodDay.work](https://GoodDay.work) now, but that has its quirks too. [Ora.pm](https://Ora.pm) maybe is interesting, as is [Height.app](https://Height.app) and [UpBase.io](https://UpBase.io). But since v.3. I find ClickUp very tempting again."}]}, {"post_title": "How can I plan for test week?", "post_url": "https://www.reddit.com/r/productivity/comments/1byun1d/how_can_i_plan_for_test_week/", "post_main_text": "I write once a day for a week (excluding Friday, 4 times), in the first week of May. Till then I have daily lectures and assignments and in that test week I still have lectures and submissions.\n\n\nHow should I begin to prepare? In the week I’ve got 8-4 filled with classes - so the preparation would be either on the weekend or the evening… and I would like to have at least my Saturday off. ", "post_comments": []}, {"post_title": "What is your most effective App/Method for controlling phone usage and minimizing distractions while working or studying?", "post_url": "https://www.reddit.com/r/productivity/comments/1byudnk/what_is_your_most_effective_appmethod_for/", "post_main_text": "I would love to hear your tricks!", "post_comments": [{"comment_author": "R3dAt0mz3", "comment_text": "There ain't any app for this.\nYou have to fix your own addiction.\n\nBest is to discharge mobile completely and then get to do other things..."}]}, {"post_title": "I made printable Cal Newport time-block planners, thought I'd share them", "post_url": "https://www.reddit.com/r/productivity/comments/1bydrkw/i_made_printable_cal_newport_timeblock_planners/", "post_main_text": "I recently read Cal Newport's \"Deep Work\", in which he explains the concept of time blocking and it's benefits. I decided to try it out, so I made some generic printable versions of his layout, and they've worked well for me for the past two weeks. I thought I'd share them incase anyone found use for them.  \n\n\nThe prints can be found here: https://imgur.com/a/sdf33rN  \n\n\n**The size is standard A4. It's made to print 8 pages a week.**  \nI played with the darkness of the lines a bit until I found a nice balance for visibility, so if they're too dark for you, I recommend changing the black levels in any photo editing software, I personally used gimp (the effect is under Colors->Levels).  \n\n\nThe original design was made by drewish on github, found here: [https://github.com/drewish/planner?tab=readme-ov-file](https://github.com/drewish/planner?tab=readme-ov-file)  \nIt creates printable versions for the week automatically, complete with dates and week numbers. I personally didn't want to use this as I wanted to simplify the process as much as possible, and I didn't want to print so many pages each week (check list and time blocks are on two separate pages, so that would double the amount of printed pages).", "post_comments": [{"comment_author": "Nice_Rule_4523", "comment_text": "You Rock!!"}]}, {"post_title": "What are your 'atomic habits'", "post_url": "https://www.reddit.com/r/productivity/comments/1bxoc6v/what_are_your_atomic_habits/", "post_main_text": "Which habits do you have that are very simple and don't require a lot of effort but pay off in the long run?", "post_comments": [{"comment_author": "Beginning-North7202", "comment_text": "Putting things where they belong immediately instead of just leaving them sit and quickly pile up."}, {"comment_author": "azzot_68", "comment_text": "\"Don't put it down, put it away\" -Marie Kondō"}, {"comment_author": "humanatwork", "comment_text": "This. Easy win. Works wonders when you add a little presence to the task — what was “just putting the bottle back in the fridge” is transformed into a “I made the effort and can immediately see the reward and feel good about myself.” It’s not bulletproof, but it certainly helps build a good foundation… and keeps the house clean even if your mind is not"}, {"comment_author": "redditnoap", "comment_text": "I also have to do this or I get annoyed. I might be lackluster in cleaning/wiping things regularly, but there will never be food, trash, or objects laying around if I'm around.\n\nWhat also makes things way easier is spending 2 seconds putting away the thing you just used rather than a long time at the end of the day putting everything away. Same goes for washing dishes."}, {"comment_author": "Squishy-blueberry", "comment_text": "“Don’t be a messy hoe, clean up as you go”"}, {"comment_author": "Agreeable-Dog-1131", "comment_text": "like microdosing that feeling of joy you get from cleaning an entire room, i love it"}, {"comment_author": "Personal_CPA_Manager", "comment_text": "\"As quickly as you type, don't forget to wipe\""}, {"comment_author": "knister7", "comment_text": "\"Saying woohoo to your hoohoo\""}, {"comment_author": "Oberon_Swanson", "comment_text": "prepare my morning activities the evening before\n\nwhen cleaning one thing, use that cleaning stuff to clean other things it could clean. cleaning the stovetop? clean the microwave. cleaning the bathroom mirror? clean the bathroom window too."}, {"comment_author": "huntsyea", "comment_text": "Walking outside every day for at least 20 minutes."}, {"comment_author": "randompanda687", "comment_text": "Its so crazy how good this habit is. I didn't want to accept the thought that something so simple could be so helpful but I co-sign this big time."}, {"comment_author": "kjupdz", "comment_text": "SO TRUE!!! Today I finally got over myself and went for a nice little walk in the morning and gosh it felt so amazing! I felt so pumped and happy!"}, {"comment_author": "reddmdp", "comment_text": "I just started doing this myself a few weeks ago, and there are a surprising number of benefits!"}, {"comment_author": "HANYAAA", "comment_text": "My grandmother lived to 102, and I belted outs bc she walked every day."}, {"comment_author": "positive_only54", "comment_text": "What time do you usually walk? Morning? Or afternoons will do also? I'm planning to do this as well."}, {"comment_author": "Polieston", "comment_text": "I'm actually addicted to it. I usually go to a shop tho and waste some money, need to learn to go, listen to music and ignore all the shops around."}, {"comment_author": "huntsyea", "comment_text": "It's usually the simple things which is wild. Walking and running has changed my mental state completely, let alone physical benefits."}, {"comment_author": "Excellent-Delay-9654", "comment_text": "Congrats! I'm trying to work up the confidence to start walking in the morning. Anxiety really sucks sometimes."}, {"comment_author": "huntsyea", "comment_text": "That’s awesome!"}, {"comment_author": "huntsyea", "comment_text": "It’s crazy how simple but helpful it actually is."}, {"comment_author": "L0LSL0W", "comment_text": "i’m going to start walking in the mornings after i drop my daughters off at school!"}, {"comment_author": "huntsyea", "comment_text": "I do it about twice a day. Morning then either lunch or evening time."}, {"comment_author": "Noodletwin", "comment_text": "I used to listen to music but I’ve since stopped. Walking around and forcing myself to acknowledge the sounds/sights (colors of trees, characteristics of houses or cars, animals I see, etc) has been very relaxing and calming for my mind which I have trouble “turning-off”."}, {"comment_author": "Janezo", "comment_text": "What mental and physical benefits have you noticed?"}, {"comment_author": "Niha_d", "comment_text": "How much distance you run every day?"}, {"comment_author": "kjupdz", "comment_text": "hehe thanks! :D"}, {"comment_author": "positive_only54", "comment_text": "Nice. Will do this too 🙂"}, {"comment_author": "huntsyea", "comment_text": "Keeps metabolism up. Get lots of sun on good days which helps with both mental health and Vitamin D. Mental clarity and energy went way"}, {"comment_author": "MethodNew2470", "comment_text": "For me, maintaining weight, and mood enhancement..."}, {"comment_author": "Noodletwin", "comment_text": "It’s improved my sleep in addition to the benefits others have mentioned."}, {"comment_author": "huntsyea", "comment_text": "I try and walk 12k steps at a minimum. If I run it’s around 3-5 miles. I didn’t start there though. I try and run longer distance 10-12 miles 3 times a month. I highly recommend checking out the MAF method. It changed my outlook on running. Essentially you identify target heart and whatever distance is you keep your HR below that. When I started I would have to walk over half to keep heart rate below but about 3 weeks in I started having to walk less and less."}, {"comment_author": "JarndyceJarndyce", "comment_text": "Prep healthy meals in advance, so I always have something nourishing and filling on hand. :)"}, {"comment_author": "Trick-Ad-7158", "comment_text": "Would be very interesting to hear what you prepare!!!"}, {"comment_author": "saransh8891", "comment_text": "I am outside, will buy fruits with me for hostel. Thanks"}, {"comment_author": "Free99SugarDaddy", "comment_text": "maybe this is just a reflection of how deeply unproductive i’ve been lately, but this one isn’t really “simple.” planning, buying the right ingredients, cooking, and the subsequent cleaning is a pretty involved, time-consuming process.\n\nit does seem like an awesome habit to build though!"}, {"comment_author": "haloarh", "comment_text": "I prep healthy snack in advance by cutting up things like celery and cucumbers and putting them in Tupperware for when I want a snack."}, {"comment_author": "Secure_Papaya1670", "comment_text": "Hug my dog when return from school 🥰"}, {"comment_author": "rubberchicken143", "comment_text": "love this one"}, {"comment_author": "Jobdriaan", "comment_text": "Getting out of bed immediately"}, {"comment_author": "elepug", "comment_text": "how do you manage to not keep snoozing your alarm??? It doesn't matter if I put it in a corner far from my bed, I'll allways get up to snooze it and come back to bed :("}, {"comment_author": "Pure-for-life", "comment_text": "I will try this\n\nEdit: I tried this today, it was very helpful for my [insomnia](https://www.reddit.com/r/sleep/s/tasbBzDnCF)"}, {"comment_author": "VokN", "comment_text": "Turns out I’m very good at falling asleep on the floor with my duvet"}, {"comment_author": "herendzer", "comment_text": "Whoooa…. without exaggeration I spent like 2 hrs in bed after I woke up before I get out of bed"}, {"comment_author": "Jobdriaan", "comment_text": "So chugging the glass of water helps wake me up. Also, do you sleep 8 hours and sleep on regular times?"}, {"comment_author": "Jobdriaan", "comment_text": "Working wonders for me! I turn off my phone, set an alarm on my iPad, put it in the other corner of my room next to a glass of water, and then go to bed. Usually I read a part of my book before i fall asleep."}, {"comment_author": "Jobdriaan", "comment_text": "Would you like to make a change?"}, {"comment_author": "elepug", "comment_text": "ohh that makes sense!! Well, I actually have been investigating about \"sleeping cycles\" and trying to find the aprox amount of hours that will make me feel better when waking up... so I started to feel like snoozing my alarm in the lornings has more to do with kind of an inherent laziness of mine, than the quality of my sleep hahaha \nbut drinking water right after waking up sounds like a good idea, I'll give it a try, thanks!!!!!"}, {"comment_author": "sweetlevels", "comment_text": "doesn't the water taste weird after sitting overnight or is that just the water where i live"}, {"comment_author": "knoblejr1", "comment_text": "Hey I know this is totally off topic but I would get that word \"inherent\" out of your vocabulary when describing yourself. We are all flexible beings and we are capable of change. Your laziness does not define who you are, nor is it permanent"}, {"comment_author": "Jobdriaan", "comment_text": "Do you go to bed the same time ecery day? Game changer! \n\nDont over complicate it. Pick the time u want to wake up, go to bed 8 hours before. If waking up is still too hard add a 1 or 2 hour buffer at the start. Slowly you circadian rhythm will change and in a month orso you will probably even wake up before your alarm. Only then you can experiment cutting it down!"}, {"comment_author": "Electrical_Baseball5", "comment_text": "I typically go to bed with a metal bottle of ice water."}, {"comment_author": "Jobdriaan", "comment_text": "You can also use a bottle of you like. I’ve never had a problem with this though. Especially after living off of streetfood in India for a couple of months nothing is too crazy hahah!"}, {"comment_author": "TheDollyMomma", "comment_text": "Been doing this my whole life & have never had an issue. 12+ hours or straight up tap water? Absolutely there’s a flavor difference. But any less than that and there’s no noticeable change. We have a fancy water filtration system though (the tap water is an abomination here unless you have one)."}, {"comment_author": "elepug", "comment_text": "you're right!! I've been really harsh on myself lately because I'm not managing to get done the things I'd like, and so I tend to forget the importance of talking with compassion to/about myself. That was a great reminder, thank you!!! I appreciate it🫶"}, {"comment_author": "Jobdriaan", "comment_text": "Period!"}, {"comment_author": "Pure-for-life", "comment_text": "Brushing my teeth every night. I’ve been tracking it for a few months, starting January I think. It’s not much to accomplish by brushing every night. But it’s your whole world when you have painful cavities."}, {"comment_author": "sweetlevels", "comment_text": "well done! dental hygiene is so important."}, {"comment_author": "bluedreamz333", "comment_text": "You should be really proud of yourself! As someone who neglected their health & dental hygiene as a result of depression and about to get dentures, you are doing amazing!!\n\nYou’ve made a commitment to your health and a new habit, you’ve developed discipline. You’re not in as much pain as before and I’m sure this new routine has helped boost your self-esteem (as it should!), which is now contributing to a much more positive, disciplined, & regulated mindset! You’re doing fantastic, I hope you realize how huge of a step forward this is! Celebrate, be proud of yourself and keep up the great work :D"}, {"comment_author": "AggyResult", "comment_text": "Do people really not brush their teeth twice a day?"}, {"comment_author": "Pure-for-life", "comment_text": "Thank you sweetlevels. Yeah I’m really proud of it too. I don’t have much to talk about when it comes to my accomplishments, but I really am proud of my commitment and discipline when it comes to my teeth. Even though it’s not twice a day, I make sure to floss at least twice on both the bottom and top, and I make sure to brush at least 5 seconds each side of the tooth and then go back around with the tooth brush. \n\nI’ve seen some improvements after I started brushing daily and not skipping as often, like when I grind my teeth, it just feels like it’s moving, and I feel no pain or soreness. I enjoy hot and cold foods/ drinks despite some sensitivity, although it’s just that I spit too much afterwards, and didn’t let the toothpaste stay in my mouth"}, {"comment_author": "Pure-for-life", "comment_text": "Thank you so much, this means a lot to me ❤️ yes it was a struggle. I’ve neglected showering many times but I refused to give up my dental hygiene XD"}, {"comment_author": "Pure-for-life", "comment_text": "I’m already struggling with depression as is, as long as I actually brush well it’s already a win. It says on google that it’s fine but slightly risky, but if you brush and floss properly it’s fine."}, {"comment_author": "mdm222", "comment_text": "Thank you for this! I also have to try that bc I also have problems with it, meanwhile it’s getting better but I don’t even know why this is so hard for me especially at night when it’s the most important…"}, {"comment_author": "Pure-for-life", "comment_text": "You’re doing great. Keep brushing. Especially keep at it when you don’t feel like brushing your teeth, that’s the most important aspect of this."}, {"comment_author": "jackardian", "comment_text": "Journalling  (gratitude in the morning, what I did well in the evening) and meditation (along with exercise and cold showers, but that does take effort, but their payoff is so big in my life, I'd highly recommend them)."}, {"comment_author": "MisterGalaxyMeowMeow", "comment_text": "Picking up my kindle at least once a day. \n\nThe thought of reading can feel exhausting if you’re thinking about the amount of pages a book has, but I find that just picking it up and reading even just a few words really helps jumpstart a nice reading session."}, {"comment_author": "emsfunn", "comment_text": "I noticed the weeks I do this I tend to feel much happier and end up more productive than if I hadn’t taken that 20 or so minutes out of my day to read."}, {"comment_author": "MisterGalaxyMeowMeow", "comment_text": "It really makes a huge difference, no matter how small it may seem"}, {"comment_author": "CitiBoy95", "comment_text": "skincare, walking outside, drinking water."}, {"comment_author": "stopmirringbruh", "comment_text": "- Daily reading habit (30 pages of a book related to personal goals + something related to the skills I want to perfect)\n\n\n- Meditation (at least 10 minutes per day)\n\n\n- Daily discomfort (something that really sucks. Growth is where friction is. During week, I incorporate this with cold showers after my training routine. It could be anything that you really don't enjoy doing but you know that will improve your life.\n\n\n- Training at least 5x a week, non-negotiable (Cycling, weights, bodyweight exercices, running, hiking, etc...) \n\n\n- Min. 2 hours of daily deep focus. (Highly structured focus based on at least 4 pomodoro sessions (25/5). Training your mind to do only one task at the time without getting distracted is a skill. Focus is something I am working hard on.)\n\nEdit : I just noticed that you mentioned simple but all of those that I mentioned can be performed at a lower scale and highly improve anyone's life."}, {"comment_author": "shirleywhirley3691", "comment_text": "Daily discomfort. I really like that. It could work nice for learning how to manage the physical anxiety symptoms in the long term. If that makes sense."}, {"comment_author": "withac2", "comment_text": "Can daily discomfort and training 5x a week be combined?"}, {"comment_author": "gogodboss", "comment_text": "3 books you would recommend?"}, {"comment_author": "k_rocker", "comment_text": "Daily discomforts sounds interesting, but how do you find enough? Or are they small enough that they count (ie I don’t want to work on project ‘c’ at work…?)"}, {"comment_author": "lclives", "comment_text": "Do you use deep focus for just work related things or are there other spots in your life you use it?"}, {"comment_author": "stopmirringbruh", "comment_text": "Absolutely! That's what I do."}, {"comment_author": "stopmirringbruh", "comment_text": "Depends on what you like to read but those are three books I can \"universally\" recommend.\n\nMeditations - Marcus Aurelius\n\nIn a man's search for meaning - Viktor Frankl\n\n7 Habits of highly effective people - Stephen Covey"}, {"comment_author": "stopmirringbruh", "comment_text": "It can really be anything, just make sure its somewhat quantifiable. Are you procrastinating from training? Do 10 pushups today. Anything is better than 0. \n\nTackle anything that is full of friction, that you are avoiding or simply dont like doing but it contributes to a higher quality of your life.\n\nOnce you get past those things and integrate them into your routine, find other stuff that you are scared of. I say scared because procrastination is directly correlated to fear. It's a problem with emotional regulation. \n\nGrowth is where friction is and we all know what we have been avoiding for such a long time."}, {"comment_author": "stopmirringbruh", "comment_text": "I constantly work on leveling up my skills and learning new things so I apply deep focus to that. \n\nBut I also work this way, if there is a particular task to be done, I tackle it and only do that until its finished. It's like a muscle that needs to be trained."}, {"comment_author": "gogodboss", "comment_text": "I read the first one. The book with the biggest change for me was Digital Minimalism by Cal Newport."}, {"comment_author": "stopmirringbruh", "comment_text": "Did you have a chance to read Deep Work by Cal? His work is truly outstanding."}, {"comment_author": "gogodboss", "comment_text": "I will be reading Deep Work this summer before I resume university in the fall. I owe a lot to the dude. His one book had a huge domino effect on my life and the way I live.  "}, {"comment_author": "DeliriumTrigger", "comment_text": "ITT: People who don't understand \"atomic habits\".\n\nGoing on a 20-minute walk isn't an atomic habit; putting on your shoes is. Reading 30 pages of a book isn't an atomic habit; picking up the book is. Weight-lifting five times a week isn't; touching the weights is. If it requires effort or motivation to execute, it's not atomic.\n\nAs for my habit: I go to the bathroom before bed. Once I'm there, I'm inclined to floss, since I already find myself at the sink, which then triggers the rest of my stacked habits."}, {"comment_author": "Signal-Secret4184", "comment_text": "Its good that you clarified the term “atomic habits”"}, {"comment_author": "Cat_Psychology", "comment_text": "THANK YOU that was driving me nuts. Have they really not read the book?!"}, {"comment_author": "randompanda687", "comment_text": ">Which habits do you have that are very simple and don't require a lot of effort but pay off in the long run?\n\nThis was the question OP asked. No need to be so pedantic."}, {"comment_author": "DeliriumTrigger", "comment_text": "Yes. OP isn't the one I'm having issue with; they asked exactly the right question. Weightlifting five times a week isn't \"very simple and doesn't require a lot of effort\".\n\n\nThey asked about atomic habits, so the responses should be things that meet the criteria. If someone asked about Notion templates, giving them bullet journal notebook recommendations wouldn't answer the question."}, {"comment_author": "kjupdz", "comment_text": "I hop in the shower 5-15 minutes after I get up, I am so proud of myself for making it a habit because before when I would start my day and do things unbathed I felt foggy and hazy. I also now begin my days listening to my current fave song, because it really puts me in a high vibe and sets a good tone for the day. Additionally, I now am beginning to desensitize(?) myself from cold water as I aim for higher and higher number of seconds spent standing in cold water after a nice hot shower! I began last month at a measly 15 seconds, and now I have worked my way up to about a minute and a half hehe"}, {"comment_author": "Lambor14", "comment_text": "Congrats! I can definitely co-sign this. Changing into normal clothes is an unbelievably simple way to boost productivity."}, {"comment_author": "SmoothIndependent416", "comment_text": "Study for at least 5 minutes daily to get better in my career."}, {"comment_author": "sweetlevels", "comment_text": "what do you study?"}, {"comment_author": "Pure-for-life", "comment_text": "I do this. It’s true"}, {"comment_author": "SmoothIndependent416", "comment_text": "Now CompTIA, for IT. It certifies you to maintain various aspects of IT infrastructure."}, {"comment_author": "Coulson_01", "comment_text": "Wake up 1 minute before my wfh starts🤝"}, {"comment_author": "Coulson_01", "comment_text": "Correction: wake up exactly when my shift starts*"}, {"comment_author": "Misak192", "comment_text": "I used to do this and hated it. I used to wake up 855, rushed to the loo, rushed to turn my laptop on, 900 daily work meeting, brain still sleeping, face still sleeping .. terrible\n\nNow I get up around 7, go for a walk and call my friend for 40 min who is just  driving to work, I say hi to the ducks along the river, read news, have breakfast, meditate, sometimes yoga and then realise i still have 30 min before work starts. \n\nI fully work from home and having those 2 extra hours every morning made a huge difference for me"}, {"comment_author": "SideLow2446", "comment_text": "Not biting on my nails. I've had the habit of biting my nails ever since I was a little kid and it carried over to my 20s, but I've slowly broken away from it. It was kind of difficult because it's a mindless habit, like I'd just start biting on my nails without even realizing it. Slowly over time I started catching myself biting nails and then I'd stop, and now the mindless habit is the other one - I barely notice when I catch myself biting my nails and stopping haha.\n\nIt might not seem like a huge accomplishment, but it was my first real habit that I developed by myself so I'm really proud of it and it has paved me the way for developing other habits!\n\nEdit: here are some other habits, albeit not quite atomic:\n\n* **Going to sleep early**. Again as a kid and teen I would often go to sleep very late or even have all nighters. Some time ago I developed a habit of going to sleep very early, like 7pm. I know this might be a bit extreme for some but personally I really like sleeping and also sleep for like 10-12 hours so it's important for me to get a full rest.\n\n* **Spending less time on phone and computer**. Spending less time on social media and videogames has drastically improved my mental health. The most valuable thing I got from it is getting my time back. Nowadays when I play a game or sit on my phone for too long I get this itchy urge like \"Why am I wasting my time on this, I should go do something productive!\", whereas when I still had the addiction it was the opposite - \"I need more time to finish this level!\"\n\n* **Staying clean and tidy**. When I was a kid I really hated baths/showers and cleaning up my room. Sometime during my teens I started loving them and developed a habit and affection for staying clean and tidy. This is a great habit to have IMO because working and living in a tidy environment can have a significant impact on your well-being."}, {"comment_author": "Pure-for-life", "comment_text": "I stopped biting my nails after C0V and I agree it’s worth it"}, {"comment_author": "dylansden", "comment_text": "Was there anything in particular that helped in stopping the nail-biting. I'm currently trying to kick it and can sometimes for a week or two then suddenly I'm back to square one."}, {"comment_author": "Free99SugarDaddy", "comment_text": "cannot imagine going to bed that early 🥲 do folks like you just forgo social lives entirely? most people i know hang out in the evening after dinner. for me, getting to bed by 11-12 each night is the goal. and even then i’m choosing to sacrifice late night activities with friends. then again, i do live in nyc.\n\nhappy for you that you’ve found something that works, though!"}, {"comment_author": "SideLow2446", "comment_text": "It was the same for me, sometimes I'd consistently avoid nail biting for weeks but then would start again. But as I kept returning to not-nail-biting I would be able to hold on for longer periods of time. So I think it's ok to give in occasionally, it's just important to get back into the not-biting-nails when you have the willpower to do it again. There was nothing in particular that helped me though, just my desire to stop biting nails."}, {"comment_author": "SideLow2446", "comment_text": "Haha yeah my social life is non existent, I literally haven't had any friends since leaving school and I only hang out with my family. But I'm an introvert so it works for me! And yes going to bed at 11-12 is good as well, as long as you're getting enough sleep!"}, {"comment_author": "Lambor14", "comment_text": "Putting sunscreen on my face even when the UV index is low. It's too early for me to see the benefits but I'm 100% sure I'll be able to 30 years down the road."}, {"comment_author": "wootwootbang", "comment_text": "Keep it up! You will reap the benefits later."}, {"comment_author": "Babyskelloson", "comment_text": "some very simple ones i do are brushing my teeth and washing my face as soon as i get out of bed, this allows me to not get back into bed; not eating out an entire chocolate bar, no matter how much i want to finish it, practice some sort of restraint; drinking water, its quite easy, just drink more water; movement, any sort, try to incorporate it, fill your bottle with water at work from the dispenser thats all the way outside of your office"}, {"comment_author": "riemsesy", "comment_text": "When I wake up I make my bed. I won’t go back into it."}, {"comment_author": "Pure-for-life", "comment_text": "I will try this"}, {"comment_author": "TheDollyMomma", "comment_text": "I fold my laundry as I pull it out of the dryer. If I don’t, it ends up in a wrinkled pile"}, {"comment_author": "IEmincan", "comment_text": "I close my eyes and think about what I will be doing or writing for my story while resting my eyes for a minute. It also helps to reset my mind if I feel my sense of time is off, like if time passes too fast or too slow."}, {"comment_author": "protonlife", "comment_text": "Not to snooze the alarm. Make bed when waking up. Go to bathroom and wash my face with water to wake my self. Do what i need like make coffee/breakfast. \n\nMe doing this makes the rest of tasks easier through out the day"}, {"comment_author": "alligatorman01", "comment_text": "Breathing exercises. They take less than 5 minutes and relax your breathing for hours"}, {"comment_author": "Strict-Aardvark-5522", "comment_text": "Any links?"}, {"comment_author": "cosmococoa", "comment_text": "Cleaning dishes/putting them in the dishwasher as I use them. At the very least, making sure the sink is empty before I go to bed."}, {"comment_author": "hdodov", "comment_text": "Eat dinner alone, windows closed, no sound, no phone, nothing. Just silence, a good meal, and thoughts about the past day. What went good, what went wrong..."}, {"comment_author": "Unusual-Gas-1898", "comment_text": "Lose breath 3 times a week (run lmao)"}, {"comment_author": "rapgamebonjovi", "comment_text": "I pick up my paint brushes or guitar/bass once a day."}, {"comment_author": "hilltheo", "comment_text": "tracking my health :) it makes my life as well as my doctor's life easier bc i just have to recite my careclinic app to her"}, {"comment_author": "potatodrinker", "comment_text": "Block time at the end of the day to reflect on work done, plan for the next day. Sounds obvious - hard to override that time with life admin or urgent work task"}, {"comment_author": "Cigarette-arms", "comment_text": "A small change that’s helped me a lot is having a physical alarm clock across my room. It makes it so that I have to physically get up and turn it off, no snooze! I then use that momentum to make my coffee and sit down to set “theme” my day based on 6 different type of day templates I created for myself!"}, {"comment_author": "Firm_Mulberry6319", "comment_text": "The themes are so interesting! Can you elaborate on them? I just plan my day by what type of productivity I think I have, for example The Perfect day, Mid day, and Low Effort day.\n\nAlso +1 on the no snooze, I found that I wake up when I immediately get out of bed instead of laying in bed scrolling on social media."}, {"comment_author": "Cigarette-arms", "comment_text": "Yeah totally, there’s this video on YouTube called the Sandwich Method (I think) and it talks about it more in depth, but basically your mornings are the bread, your day is the meat, unwind time is the cheese, and the other slice of bread is for sleep. Ik it sounds silly but stay with me 😭🙏 with the meat, that’s kind of all your tasks and obligations so you’re supposed to build 6 different types of days so that when you wake up you can ask yourself “okay what type of sandwich day am I having?” And choose one of the 6 that suits your day best. The cheese is for unwinding like I said, so you essentially write down things that you enjoy that relax you and schedule a time for them after the meat. They didn’t talk about this in the video, but I broke down my cheese into 3 categories: energy givers, neutral, and energy takers. For example, social media time would be an energy taker, TV would be neutral, and drawing would be a giver. I like to pick a couple from different categories to get a balance in my day so I don’t spend all my relaxation time on instagram lol! The two slices of bread basically are for the things that you always do in the morning (wake up brush your teeth make coffee etc.) and at night (wash your face, change, typical bedtime routine stuff). Lastly, there’s “potato days” as the video put it, where you create a type of day for stuff that you like (not necessarily meant to relax you like the cheese) this could be hiking, traveling, seeing friends etc.) \n\nOnce I have all my sandwich ingredients ready, I wake up in the morning and fill out a small column for every category. Today’s example would be…\nbread: at 9am, make coffee, make my bed, plan day. \nMeat: chore/ menial task day: clean bathroom, review flash cards, etc. \ncheese: work on manuscript, watch tv, social media. \nSleep: skincare, shower, etc. \n\nSorry that’s a lot I didn’t realize till I was nearly done typing 😭 but I hope that makes a little bit of sense?"}, {"comment_author": "kram--", "comment_text": "Oh i love this question. Making my bed is my favorite one, but I have some others good ones too."}, {"comment_author": "SteelRevanchist", "comment_text": "Clean as you cook"}, {"comment_author": "supsusup", "comment_text": "20 minutes walk, reflection and journaling"}, {"comment_author": "masterofnone_", "comment_text": "Stretch everyday"}, {"comment_author": "MsSchuwaby", "comment_text": "Drinking water as soon as i wake up ❤️"}, {"comment_author": "CatLoliUwu", "comment_text": "Sunscreen, cleaning up trash/dishes immediately before it piles up and i get overwhelmed so i push it back further. always place your things in their designated spots so you’re never stressing over trying to find them, an example being putting your keys right next to the door. easy to put there and easy to get them."}, {"comment_author": "rosienomade", "comment_text": "Making my bed immediately after I get out of it"}, {"comment_author": "Brave_Cable_6951", "comment_text": "I hope everyone reading this becomes successful!"}, {"comment_author": "Positive-Dimension75", "comment_text": "Emptying the dishwasher while my coffee brews in the morning.  The kitchen is set for the day and I'm rewarded with coffee for getting it done."}, {"comment_author": "yours_truly_1976", "comment_text": "Intermittent fasting. 20 hour fast with a four window for breakfast and lunch. No snacking."}, {"comment_author": "Lambor14", "comment_text": "What are the benefits in your case?"}, {"comment_author": "Freefromcrazy", "comment_text": "Riding my bike everyday."}, {"comment_author": "KaterDost", "comment_text": "Always doing sth productive in bath (where I can be max 15 min )"}, {"comment_author": "Lambor14", "comment_text": "Does it still feel relaxing to you when you need to devote your attention to something productive?"}, {"comment_author": "KaterDost", "comment_text": "Yes. Still i am relaxed and enjoying bath .. At worst, I start to feel bored and my brain starts to drift off into daydreaming.  In that case, I change the activity to a productive activity that is more pleasant for my brain at that moment."}, {"comment_author": "bangyushi", "comment_text": "practicing mental abacus for five minutes to improve memory"}, {"comment_author": "SokkaHaikuBot", "comment_text": "^[Sokka-Haiku](https://www.reddit.com/r/SokkaHaikuBot/comments/15kyv9r/what_is_a_sokka_haiku/) ^by ^bangyushi:\n\n*Practicing mental*\n\n*Abacus for five minutes*\n\n*To improve memory*\n\n---\n^Remember ^that ^one ^time ^Sokka ^accidentally ^used ^an ^extra ^syllable ^in ^that ^Haiku ^Battle ^in ^Ba ^Sing ^Se? ^That ^was ^a ^Sokka ^Haiku ^and ^you ^just ^made ^one."}, {"comment_author": "sebastiansmit", "comment_text": "For the last few months it's been working out. I'm not necessarily doing the most hardcore workouts, but they allow me to do them everyday. It has done wonders for me, I feel so much better and my shitty joints have gotten better as well."}, {"comment_author": "Lambor14", "comment_text": "Starting getting ready for bed every work day at 9PM. My optimal bedtime is 10PM but if I need to work longer, that's completely fine and when I'm finished I can hop straight into bed since everything is waiting for me already.\n\nIt decreases unnecessary friction when you're already tired (thus feeling lots of friction)"}, {"comment_author": "Wellthereyogogo", "comment_text": "I put my Kindle Scribe on my vanity desk so as soon as I'm dressed, hair and makeup done, I journal. Also open the Calm app on my tablet the night before, so when I'm finished journalling and open my tablet, I'm ready to meditate. I habits stack so as soon as I finish meditation and journalling, I read a chapter of a self help book. This is all done first thing in the morning, and makes a positive impact on my day."}, {"comment_author": "AlwaysOneLove", "comment_text": "At least 10 minutes of Yoga every day."}, {"comment_author": "Prudent_Series_4285", "comment_text": "Morning walk, porridge.\nJust makes the day clearer"}, {"comment_author": "Glum-Net-9774", "comment_text": "duolingo"}, {"comment_author": "aechrapre", "comment_text": "Brushing teeth"}, {"comment_author": "apimpnamedjabroni", "comment_text": "Walking a 2 mile route while habit stacking by reading an audio book, also putting my phone in a safe at night"}, {"comment_author": "blinkssb", "comment_text": "drinking water from my smart water bottle"}, {"comment_author": "Beluma999", "comment_text": "20 minutes of walking while doing my language lessons and prepping coffee the night before."}, {"comment_author": "juniperwool", "comment_text": "I'm trying to start some, my first one is to stick my head out of my window every morning first thing after waking up. I know it sounds weird, but it feels oddly invigorating."}, {"comment_author": "puurpleeraain", "comment_text": "60 minutes reading : I tried 30 minutes before, but it wasn't effective. 60 minutes is optimal for reading.\n\nBrushing teeth before going to sleep : I sleep better.\n\n20 Minutes to study the language : It's okay."}, {"comment_author": "Space-raccoon224", "comment_text": "Drink a tall glass of water first thing in the morning"}, {"comment_author": "gwntim92", "comment_text": "Bottle of water next to me when im working"}, {"comment_author": "MyExclusiveUsername", "comment_text": "Not setting goals at all. Just tune processes."}, {"comment_author": "shalva97", "comment_text": "reading at least one paragraph from any book"}, {"comment_author": "haloarh", "comment_text": "I clean up as I'm cooking, instead of waiting until I'm done."}, {"comment_author": "Stevoo23232323", "comment_text": "Consistent quality sleep coupled with a small healthy breakfast every morning, usually boiled eggs and  a banana to set me up for the day has really changed me the last few years , also keeping to one coffee early in the day"}, {"comment_author": "dolceviva", "comment_text": "Making my bed immediately after getting up \nNever leaving dishes in the sink \nMaking sure my  living room is tidy before bed \nPreparing outfits the day before\nDrinking water while I get dressed and ready"}, {"comment_author": "validate_me_pls", "comment_text": "Breath focus meditation right after waking while still in bed. Starts the day off right and the meditation is usually successful because your mind isn't zooming with all the day's thoughts and activities yet."}, {"comment_author": "steveturkel", "comment_text": "Might as well. \n\nIf I'm doing something and it's convenient or efficient to do something else at the same time or right after, I just do it.\n\nRearranging the motorcycles in the garage to access one for service? Might as well sweep and hit the area with the shop vac. Driving past costco on the way from work and we have a list? Might as well run in and grab those things. Cooking dinner and have time between steps? Might as well prep breakfasts for us for tomorrow."}, {"comment_author": "kaidomac", "comment_text": "I do a thing called \"study stacks\", which is a 15-minute session about a particular topic, made up of 5 topics of 3 minutes each.  The structure is typically:\n\n1. Learn history\n2. Learn current events\n3. Learn something new\n4. Do something new\n5. Hone something\n\nI use this for things like learning the guitar, baking, 3D printing, etc.  You can do them daily or every other day or once a week.  For example, with the guitar:\n\n1. **Learn something new about guitar history:** Paul H. Tutmarc created the very first electric guitar in 1931 by using magnets paired with wire coils, which amplified the vibration of the strings, which increased the volume.  This method was inspired by how telephones at the time used magnets to create vocal vibrations!\n2. **Learn current events:** Ernie Ball Music Man just launched The Custom Design Experience, which lets you make a custom 4 or 5-string bass guitar, which is similar to the Fender Mod Shop for custom guitars (which has like over 70,000 combinations available, lol).  Pretty neat option for a highly personalized instrument!\n3. **Learn something new:** Could be a technique, or learn how a piece of hardware works, or learn more about a particular musician, etc.\n4. **Do something new:** Try out a new song or a new technique.  This is different than just jamming for fun; this is for the specific purpose of doing something new to add to your brain!\n5. **Hone something:** Refine something you've been working on, such as a line in a song or a technique.\n\nThis all capitalizes on the **magic power of compounding interest over time**.  I like this story to explain the value of the profound consequences of the \"accumulation effect\":\n\n* [https://www.reddit.com/r/kaidomac/comments/17u2sv3/goldflaking\\_story/](https://www.reddit.com/r/kaidomac/comments/17u2sv3/goldflaking_story/)\n\nEach \"flake\" in that story is important because it represents progress:\n\n* [https://www.reddit.com/r/kaidomac/comments/17u2vnf/starfish\\_story/](https://www.reddit.com/r/kaidomac/comments/17u2vnf/starfish_story/)\n\nThe purpose of this is to have **purposely time-limited interactions** with personal progress: you're doing small bits each day, which are like Lego pieces that build up to a beautiful finished model over time!"}, {"comment_author": "pseudoscience_", "comment_text": "Making my bed"}, {"comment_author": "DoesNotSleepAtNight", "comment_text": "Write down three things I'm grateful for when I wake up, since Gratitude doesn't come naturally to me at all. It seems to help on day 100 with some missed days"}, {"comment_author": "MediumGas3750", "comment_text": "I have 2 things that I'm cureently doing for my atomic habits. I am slowly building up a 2 minute rule for doing work and I am trying to do stuff with intention. \n\nFor doing stuff with intention, I just mean trying to be aware of what I'm doing and why. This has helped me so far in not procrastinating as much because I'm not just mindlessly procrastinating and for whatever reason it helps me feel like doing work."}, {"comment_author": "80HDTV5", "comment_text": "Getting joy out of small moments I can count on in my day. Like taking a moment to greet my Dorothy (golden girls) magnet on the fridge in the morning, or playing with the jibbitz on my crocs as I put on my shoes, saying hi to the geese on the way into work, making sure I PERFORM a song in the car before I leave or when I arrive at my destination. \n\nI have raging ADHD and maintaining any sort of habit or routine is a near unmanageable task for me. But creating moments to look forward to that only happen when I go to do productive stuff is the ticket. I struggle to wash my face and brush my teeth (sensory issues) but ever since I got this plush headband I just focus myself on looking forward to putting on my headband before getting into the routine. I even take a second to run it through my fingers and just enjoy the softness of it, i vogue in the mirror after putting it on. \n\nThis is something I did naturally as a kid but I sort of got lost in everyone trying to tell me how to fix my issues. My parents/teachers/mentors would always get on me about doing this stuff because they saw it all as a distraction and “you need to get away from that if you want to get things done.” Which is fine and all, but it backfired and made tasks more stressful than they already were because I felt like I couldn’t even do them in a way that was at all enjoyable. So it became impossible to do anything at all. I just had to realize that no one else is in my head, only I am. And if *I* know that such “distractions” are actually what makes me get shit done, then let people judge it as stupid. I know it actually helps and that has to be enough. \n\nLearning to do it again was hard and people judge me as childish and think it’s materialistic. But it’s not like I’m going out buying tons of stuff to get joy from it, I’m getting joy out of loving the things I do own for a long time. And as far as the childish thing goes I just don’t give a fuck. Maybe it is childish but so what yanno? My SpongeBob socks make me happy and I will wiggle my toes and watch Patrick’s face contort if I damn well please! \n\nIt also helps me stay more mindful and grounded. I live with my head perpetually in the clouds. I am at all times four seconds and a gust of wind away from blowing away. But during these little moments I’m not looking at my phone, or thinking about the million things that need to get done, or trying to solve every injustice in the world. For ten seconds, I’m just a silly 21 year old girl laughing at her crocs and I’m completely in the moment and with myself.\n\nETA: if you can’t tell I also struggle heavily with caring too much about other peoples opinions 😭😭 I’m working on it.\n\nETAA: OH I also put up little charts everywhere and I give myself a tally every time I do something. You can put a reward system onto it if you want, but for me it’s enough to just see the tally’s add up. I originally just put one in my car for me to tally when I make good driving decisions and it has single handedly improved my driving in every way. I love watching the good choices add up all around me. (I guess this isn’t really an atomic habit as it requires set up. But once the charts are put up it’s takes like 5 extra seconds to do.)"}, {"comment_author": "emsfunn", "comment_text": "Morning: brush my tongue. If I do this, I’m more inclined to wash my face, then more inclined to make a choose a good outfit, and on and on. \n\nEvening: recently started charging my phone in the closet. Having to intentionally set it down in another room where I have to get out of my cozy bed to get it makes me more likely to have better in-bed routine and sleep better!"}, {"comment_author": "ABraveLittle_Toaster", "comment_text": "Hand washing."}, {"comment_author": "Luka1607", "comment_text": "Eating healthy and meal-prepping. Sure meal-prepping takes a long time at the beginning but once you figure it out it's a piece of cake and it's soooo benefical for you and your health. I honestly don't know how people who eat crap every day even function and get stuff done."}, {"comment_author": "duvagin", "comment_text": "i don't eat meat or diary. it's simply *not* doing something, so it's easy to do and promotes overall good human healthspan"}, {"comment_author": "Idontgiveafuck79", "comment_text": "Brushing my teeth everynight"}, {"comment_author": "ApeCapitalGroup", "comment_text": "Wake up at 3 am"}, {"comment_author": "FalseChoose", "comment_text": "When do you go to bed? I think 9pm seems reasonable with 6 hours of sleep"}, {"comment_author": "ApeCapitalGroup", "comment_text": "8:30 lol. I'm much more productive during early hours vs late into the day"}, {"comment_author": "FalseChoose", "comment_text": "Makes sense. I wish I was that kind of productive person"}, {"comment_author": "ApeCapitalGroup", "comment_text": "It doesn't come easy for sure. I've had to play with my sleep to figure out what works for me"}, {"comment_author": "fill_of_biplob", "comment_text": "Mewing"}, {"comment_author": "Westernsteakk31", "comment_text": "Taking $H!T everyday without fail"}, {"comment_author": "WattsianLives", "comment_text": "Not to read books like Atomic Habits."}, {"comment_author": "Medium_Surprise_814", "comment_text": "Make sure the carpet is clean, make sure my gun is in working order, make sure my locks work."}, {"comment_author": "singnadine", "comment_text": "Fuck atomic habits"}, {"comment_author": "maytheroadrisewithU", "comment_text": "😂"}]}, {"post_title": "Unable on start studying", "post_url": "https://www.reddit.com/r/productivity/comments/1byt9js/unable_on_start_studying/", "post_main_text": "i am unable to concentrate on studying , even though when i actually start studying i keep studying for a long time  , however when i stop studying i find starting to study again very difficult. I Love what i study but find myself distracted by dopamine rich activities. Can someone Help me with this problem ?   \n\n\nsorry english is not my first language ", "post_comments": [{"comment_author": "GroundbreakingMenu32", "comment_text": "You have to force yourself even if you don’t want to. Like you said, when you get going it’s much easier"}]}, {"post_title": "Any App Suggestions Similar To Logseq?", "post_url": "https://www.reddit.com/r/productivity/comments/1byses0/any_app_suggestions_similar_to_logseq/", "post_main_text": "Hey guys,\n\nI have started to use Logseq recently as a note taking app. Since I am reading a lot of research articles, the native Zotero plugin and PDF annotation features are perfect fit to me.\n\nBefore I built all my system (and fighting with learning curve) I want to discover other apps too. I tried Obsidian few years ago so I am not aware if any update or recent plugin can mimick the Logseq features. \n\nIs there any app has what I like in Logseq?\n", "post_comments": []}, {"post_title": "Productivity tools?", "post_url": "https://www.reddit.com/r/productivity/comments/1byrvbj/productivity_tools/", "post_main_text": "Hey,\n\nI was wondering what everyone else uses as a tool to keep yourself productive?\n\nMicrosoft to do?\n\nNotion?\n\nCalendars?\n\n  \n\n\nI recently switched from Microsoft To do in to Outlook where I can post all my \"to do\"s as an activity in the calendar.\n\n(Originally i used apple notes)\n\n  \n\n\nI feel like it's really tedious to keep on posting new “activities” for everything I need to do though.\n\n  \n\n\nI think my personal dream feature would be:\n\nAn integrated app with Outlook that uses AI to plan your days for you.\n\nFunctions it should have:\n\n* 50% of your day is open for different fires you need to extinguish during your day.\n* Create automatic activities automatically from different mail and also appreciate the time it should take to finish that task.\n\nDoes anyone know of something like this?\n\n  \n\n\nI’d love to hear other ways to stay productive as well.\n\n\n\n//Nicke", "post_comments": []}, {"post_title": "I haven’t slept a calm 8 hour sleep in a long time. I go to bed at 3 a.m - 4 a.m staying up late for no reason. Any guidance?", "post_url": "https://www.reddit.com/r/productivity/comments/1by42k9/i_havent_slept_a_calm_8_hour_sleep_in_a_long_time/", "post_main_text": "Is it a digital detox I should do? \nBrainfog is severe I feel.\n", "post_comments": [{"comment_author": "sunnbus", "comment_text": "poor sleep hygiene is one of the major causes of poor quality sleep and daytime fatigue. First step would be to exercise and be active during the day, avoid foods and activities that may result in preventing sleep (including digital activities), and going to sleep earlier. Then be consistent with sleep."}, {"comment_author": "wilhelmtherealm", "comment_text": "Switch off phone at 10 pm.\n\nThe first couple of days is gonna be a struggle. You'll  then be falling asleep coz of the sheer boredom 😂\n\nMost self proclaimed 'night owls' just have extremely unhealthy screen time and it fucks with their sleep. Take away their screens and it's very likely that they'll fall back to a normal schedule.\n\nNow genuine night owls do exist, I don't deny that but I feel most people are just in the category I described above."}, {"comment_author": "makingtacosrightnow", "comment_text": "True night owls may have DSPD\n\nhttps://en.m.wikipedia.org/wiki/Delayed_sleep_phase_disorder"}, {"comment_author": "Belatorius", "comment_text": "At one point I was reading before bed instead of using the phone, the sleep was top tier"}, {"comment_author": "Sad_Result_615B", "comment_text": "Try not drinking coffee for a week. Aim to be in bed around 9-9.30.\n\nEdit: no caffeine"}, {"comment_author": "SirPoopsiclesMcGee", "comment_text": "I am the same, been trying to fix that for 2 decades, I just don't like going to sleep so I delay it. Anyway, if you drink coffee stop 10-12 hours before bedtime. But more importantly, how does your day look? Do you lounge around a lot? U sit on the computer mostly? You stay in a lot? Idk how your average day goes but usually when you have full active days with walking outside, doing things around the house, work, cooking, maybe working out, whatever, as long is its quite busy regularly, sleeping goes a lot better, even when you go to bed at 3-4 am. That's been my experience."}, {"comment_author": "gageeked", "comment_text": "Avoid any caffeine, occasional melatonin helps me resync my sleep schedule when it goes off the rails. I am quite sensitive to it though and use <0.5g doses."}, {"comment_author": "helldogskris", "comment_text": "\"staying up late for no reason\" - maybe just don't do that? 😅"}, {"comment_author": "altruistic_summer", "comment_text": "That’s what I’m struggling with. But trying."}, {"comment_author": "Big_Assist879", "comment_text": "Wake up early. It will exhaust you throughout the day, and you will have no choice but to sleep early as a result."}, {"comment_author": "unchainedandfree1", "comment_text": "Nice"}, {"comment_author": "irishfury0", "comment_text": "My winning combination is taking Diphenhydramine aka Benadryl which makes me sleepy and listening to boring books on LibriVox which distracts my mind from the endless tangential thoughts that otherwise keep me awake."}, {"comment_author": "OminOus_PancakeS", "comment_text": "I doubt you'll change anything until you become motivated.\n\n\nYou'll keep doing what you're doing until you wake up and realise how much life you're missing out on, or how much damage you're doing to your health and your career and your future and your relationships etc. Maybe you'll need to hit rock bottom before you act. Unfortunately, some rock bottoms can be irreparable.\n\n\nYou know what you have to do: set the alarm, get up early, get into sunlight early, get to bed by midnight, stop escaping your anxiety with endless scrolling and other distractions.\n\n\nWhat you have to do will not be cued by your current behaviour. You are passive. You have to act. That action must come from _you._"}, {"comment_author": "LedZappelin", "comment_text": "Work out eat and no stimulants"}, {"comment_author": "Clint_Cosgrove", "comment_text": "I have problems sleeping, but I also go to bed at  3-4am on nights that I could’ve slept early. For me… This stemmed from working long hours, 7 days a week, holidays… you name it. \n\nI realized the reason for staying up late was because the 12-4am sweet spot was the only time that I actually felt in control of my time/life. I could read, listen to music, watch a movie or play a video game without feeling guilty. I traded sleep for control and enjoyment. \n\nOnce identifying my “no reason” for staying awake, I started to be ok with it. If you can operate without a ton if sleep, why not?"}, {"comment_author": "roomforacookie", "comment_text": "I used to stay awake even though it was really late because it was the only free time I had and just getting to bed and going to sleep felt like having no life of my own at all. It´s apparently called \"revenge bedtime procrastination\" \n\nThe usual solutions were given - no screens an hour before bed, no mobiles in the bedroom, no caffeine, get to bed with a book and lights out at the same time each night."}, {"comment_author": "deafhec", "comment_text": "Take a day at the weekend and just spend the whole time outdoors, either exercising or preferably doing some manual chores, cleaning cars, windows, mowing the lawn... even just a lot of walking but get outside and try and tire yourself out. It seems to reset me and I sleep well. Worth a shot"}, {"comment_author": "blah1blah1blah", "comment_text": "2 tablespoons of natural calm."}, {"comment_author": "ahmadzahid__", "comment_text": "You can try jogging or brisk walking in the evening for 45 minutes to ensure you're tired enough. I'm confident you'll sleep early due to exhaustion and wake up early in the morning. I've been doing this for myself for around 3-4 years, and it works."}, {"comment_author": "ALTR_Airworks", "comment_text": "Are you trying to get that last moment of leisure? Do you feel like you finally have some time for yourself at night?"}]}, {"post_title": "Productivity app for iOS + PC", "post_url": "https://www.reddit.com/r/productivity/comments/1byqlnn/productivity_app_for_ios_pc/", "post_main_text": "Hello all!! I’m looking for an app that is good for logging all of my daily tasks and to-dos. I’m making a post about it because I’m specifically looking for one that allows me to add time sensitive tasks, while also being able to add general to-dos that don’t have a specific time and can be marked as done. Thank you all in advance!!", "post_comments": []}, {"post_title": "Feeling like a failure at 23", "post_url": "https://www.reddit.com/r/productivity/comments/1by6zyt/feeling_like_a_failure_at_23/", "post_main_text": "I remember crying a few days back in here about feeling stuck in life. I would like to thank those who shared their positive advice with me.\n\nI was sad that I don’t have a job , car and an apartment by my age… and that I’ve been struggling with getting a job, launching my fashion business ,how I always get played in relationships and how my dad didn’t want to help with the tuition of furthering my studies. \n\nI’ve just remembered that I also have an Electrical engineering qualification on top of my fashion design degree. I totally forgot about it. \n\nAgain thank you so much for the insightful advices I’ve received in here. \n \n\n\n", "post_comments": [{"comment_author": "zeroperfectionism", "comment_text": "IF ONE PART OR TWO PARTS FROM YOUR LIFE ARE \"FAILURES\", THAT DOESN\"T MEAN THAT YOUR W-H-O-L-E LIFE IS A FAILURE. \n\nget my point?"}, {"comment_author": "unchainedandfree1", "comment_text": "You have chosen a creative field. The path isn’t linear at all. \n\nAnd your father, I don’t know how he is as a person. But if you are asking someone to invest in a business they don’t understand they won’t. That’s just reality. \n\nDo you have a portfolio have you been putting yourself out there networking selling items online. As you’ve chosen a creative field the paths aren’t conventional and you have to do more to get visibility.\n\nThere seems to be some confusion between what it is you want and what you are willing to do to get it. That and your expectations given the work you are currently putting in."}]}, {"post_title": "Collection of notes for life optimization", "post_url": "https://www.reddit.com/r/productivity/comments/1byput2/collection_of_notes_for_life_optimization/", "post_main_text": "I read a ton and I have collected an assortment of ideas/principles for productivity and optimization. These come from books, articles, and Twitter threads. Looking back I wish I would have wrote the source.\n\n***Disclaimer:** Some of these may be common sense and some of them may be anecdotal. Take what you want and leave the rest.*\n\n## Productivity\n1. Wear similar outfits every week (Rotation of 14-21 outfits) to reduce decision fatigue.\n2. Turn your phone's airplane mode on until lunchtime every day to focus.\n3. Get rid of most of your objects and possessions that you don't use on a regular basis (To increase cognitive/attention resources of the brain).\n4. Delete all apps on your phone that you don't use regularly (At least every week).\n5. Delete all bookmarks on your computer browser that you don't use regularly (At least every week).\n6. Clean up your computer desktop of files and organize into folders every quarter.\n7. Track what you do with your time every 30min throughout your day for several weeks to eliminate wasted time.\n8. Automate, delegate, or eliminate tasks that don't need to be done by you (meal prep, chores, etc): Can use apps like Instacart, TaskRabbit, DoorDash, Upwork, etc for delegating.\n9. Reset your dopamine levels by reducing stimulus (Consistently sit quietly alone and let your mind relax).\n10. Text an accountability partner daily to ensure you stay on track to achieve your goals.\n11. Unsubscribe from all email lists, YouTube subscriptions, podcasts, magazines, social feeds, accounts, etc., and then resubscribe to only 10 of your absolute favorites.\n12. Download Google Chrome extensions to increase focus: AdBlock for YouTube, DF Tube (limiter for YouTube), News Feed Eradicator (limiter for Facebook).\n13. Write out your Mission/Goals, Your Why statement, your Hourly Schedule, and your Identity/Values on a Google Docs sheet, then print it out and place it in your field of view while you work.\n14. Use online digital apps like Google Docs, Google Keep notes, and Notion to manage and organize your personal life all in one place, helps with ease of access on your phone or computer.\n15. To do 4 hours of deep work during the day, set a timer to work for 80 minutes then take a 15-minute break, and do this 4 times.\n16. Download Freedom.to app and also Webtime Activity Tracker for Google Chrome to block sites during deep work time and also review where most of your screen time is being spent.\n\n## Sleep/Wake\n1. Take magnesium glycinate supplements, organic valerian root tea, organic chamomile tea before bed for better REM sleep.\n2. No blue light 1 hour before bed (Get blue light blocking glasses) to better produce melatonin.\n3. Don't eat 2 hours before bed, don't drink water 1 hour before bed.\n4. Wake up at the same time every day to fix circadian rhythm.\n5. Get an alarm clock that uses synthetic sunlight to wake you up easily out of your REM state.\n6. Get blackout curtains to keep the bedroom very dark or pitch black when sleeping to increase melatonin.\n7. Keep your bedroom at a temperature around 72 degrees when sleeping.\n8. Get 15min of sunlight within 15min of waking up.\n9. Use an Oura Ring or Whoop sleep tracker to monitor your sleep quality score.\n10. Wake up no later than 5 am every day.\n11. There's no such thing as \"catching up\" on sleep. Make sure you get proper sleep every night since it's the most important thing for recovery and healing.\n12. Have a consistent wind-down routine to ease yourself into rest mode and getting to sleep faster.\n\n## Nutrition/Exercise/Diet\n1. Eat similar meals weekly (Rotation of 7-14 meals).\n2. Eat only whole foods that are unprocessed (1 ingredient foods).\n3. Drink enough water (about 2-3 Liters per day, 0.5L right after waking up).\n4. Drink high-quality \"spring water\" if you can, it still includes essential minerals real water naturally has in it.\n5. Add electrolytes to your water in the morning to rehydrate your body.\n6. Exercise for at least 30min per day (preferably in the morning).\n7. Stick to a diet/eating plan (no cheat days) that includes enough protein, fats, carbs, vitamins, and minerals for your specific situation.\n8. Eat organic natural foods when possible that don't include pesticides when they were farmed or grown.\n9. Take a picture of every meal before you eat it to make sure you're consciously aware of the nutrition of your food. It makes you think twice before you consume.\n10. Don't do grocery shopping while hungry because it might encourage you to buy unhealthy unnecessary foods.\n11. Take a food allergy test to see what foods create inflammation in your body, then avoid those foods.\n12. Drink water at least 30min before or 30 minutes after (not during/while) eating a meal, as this helps with improving stomach acid and digestion.\n\n## Mindfulness/Self-Reflection\n1. Meditate/pray daily for 10 minutes (5 minutes in the morning and 5min at night) using binaural ambient calming music.\n2. Write in a journal for 15min daily (3 things you're grateful for, 3 essential tasks/priorities for tomorrow, and 3 reflections/thoughts about your day).\n3. Read non-fiction helpful books regularly related to your goals (About one per month minimum).\n4. Visualize a recreated yourself and update your identity to your new goals - How you do anything is how you do everything.\n5. Take all Personality Tests and see common similarities between your results. Personality tests include the PrinciplesYou test from Ray Dalio, the Gallup StrengthsFinder 2.0 test, Hexaco test, the Humantrends Sales personality test, Myers Briggs 16 Personalities test.\n6. Take a 20-minute bath with 300g+ of magnesium sulfate to relax and ease muscle tension.\n7. Practice doubling. Count down from 10, doubling your relaxation level with each count. Surrender in your body.\n\n## Finances\n1. Check your bank account daily to keep track of where every dollar goes so it's more intentional.\n\n## Health/Environment \n1. Get water filters for your shower and refrigerator tap water.\n2. Get an EMF (electromagnetic frequency) meter to measure and confirm you're reducing the radiation you interact with as much as possible.\n\n## Social/Relationships\n1. Do something social with friends or family at least once a week for connection and community.\n", "post_comments": []}, {"post_title": "Burnout kills me at the same time every year…", "post_url": "https://www.reddit.com/r/productivity/comments/1byboxy/burnout_kills_me_at_the_same_time_every_year/", "post_main_text": "I just hit a year at my new job and I want to quit so badly. I’m 22 and I work for an automotive company doing audits over night. The job itself is actually very cushy, we get some days remote, and it’s not all that busy all the time. \n\nBut the same way I would hit a year at my previous jobs and start looking elsewhere, I can’t really do that here no matter how hard I try.\n\nI go to school full time for CS and the night shift works perfect with my school schedule during the day. And leaving this job is just not realistic unless I can either find an internship or be a undergrad TA while stocking shelves at a grocery store on weekends or something. \n\nMy slowing in performance isn’t really showing at work. But it’s showing to me. I spend 80 percent of the night doing my homework and when I don’t have that to do, or I can’t do it, i’m just aimlessly browsing slack channels and waiting for something to happen.  \n\nA part of me just wants to quit, move back in with my parents and finish school but even without rent, utilities and groceries I still have things to pay for. \n\nI don’t know how to get out of this rut. ", "post_comments": [{"comment_author": "destinyesque", "comment_text": "i get burnout around this time of the year as well. this year I realized that it’s easy to think it comes from work/school and obligations, but it usually comes from our physical or mental environment. Take some time to yourself instead of being on Slack. When you do your homework try a different genre of music to listen to and when you are getting ready try a new soap or something. My mom always told me it’s the little things in life that gets you through it; and it’s true. Life is up and down all the time and there is no way to escape the cycle, it’s about how you handle it. So get some fuzzy socks and find a silly show and when you want some salty chips, go buy salty chips. Working and bills are inevitable, but that’s a small portion of the big life we get to live!!"}, {"comment_author": "UmpireProud8598", "comment_text": "Stack up on vitamine D, lack of sun for a long time can give u a depressing feeling. \nSpecially during the winter i would get these side effects of feeling tired without work or not motivated to work further for myself when i got home but when the summer slowly showed up it took the depression too"}]}]