["If you’re looking for specific advice for your situation, please post here.", "When you're setting a goal, especially a sMart goal (i.e. measurable), how do you at least provisionally come up with a number or range.\n\nFor example, if it is how many words I think I can write in this report per day. Assuming I've never written this kind of report before and for the sake of argument let's say I don't know what my WPM typing speed is. How would I go about setting a metric or goal, at least at first?\n\nAnother example might be I've just started a project and began contacting a lot of people, I get up this morning and see I have X amount of emails \"how long will it take to answer all these emails?\" - remember, I don't know how detailed they are, nor what the variance is. Some might be bounced back. Some might be detailed responses that require careful reading. Others might just be acknowledgement. Some may require little immediate action, some might require a lot of thinking and decision making. I don't know. But to organize my day surely I need to set a goal about how many emails I can answer, and from that how many I *should* answer.\n\nBut again, how do I determine that number ahead of time? Hindsight is always 20-20 but what do you do to set a provisional goal?", "i (27f) feel so burnt out and like i’m killing myself slowly… i feel like no matter what i do i can’t catch up. i am always stressed because of work or life or tasks or whatever and i never sleep…. i haven’t slept more than four hours in the past three months. i feel like shit, i’m always sick, im always tired, my short term memory is awful, my cognitive decline is scaring me… \n\ni feel like this is causing me all of these physical health problems and making all of the mental health ones worse. i already take too many meds… \n\ni eat horribly, dont exercise, barely drink water… there just isn’t enough time in the day!!! every night when i go to bed at 4 am i tell myself im killing myself i need to make a change and then i just simply do not have time. i wake up and just do tasks until 4 am and then repeat…\n\ni’m also struggling with having close friends and money right now and then i just get so anxious about all of these things that the cycle just repeats\n\ni genuinely feel like i am going to die young if i don’t make a change. it just feels like no matter how hard i try i just don’t have enough time to do it. i don’t even know where to start but i know my health is deteriorating and fast…\n\nplease help me :(", "Start by doing what you can to regulate your nervous system. I would recommend trying breathing exercises like Wim Hoff’s technique. Get you some lemon balm tea and drink more water. Some other supplements that have helped me are magnesium bisglycinate and ashwaganda. It’s very hard to get out of cycles like this so realize that and give yourself some grace. Keep reminders of what you’re trying to do for yourself around you. Maybe sticky notes reminding  you to drink more water and just take a copule seconds to breathe and be mindful throughout the day. Start small, the habits will start to be ingrained. Make yourself a priority. Your health matters, you matter. I wish you luck on this journey", "How many annual leave days do you have from your employer?\n\nIf you have some leave, why don't you take time off from work to relax, chill, and catch up on other things?", "Well WHY is it all like this?", "probably because of lack of sleep and taking on too much", "So you know where to start!", "😭", "What is it that’s making you this stressed? Work? Life? Uni? If it’s one of these I’d recommend getting yourself into a schedule, if it’s mostly work I’d maybe even consider leaving if it’s really that strenuous that ur not sleeping. \n\nYou already know the problem. Sleep is the most important thing, gradually try to eat better and drink more water overtime, don’t rush urself but it’ll get better", "It is mostly a mental change that needs to occur, you can't view these things as menial or not worth the time. Try to enjoy taking care of yourself, and make yourself a priority.", "Back to basics. \n\n* Throw out everything you can throw out. Be strict.\n* Make a plan for healthy eating, learn cooking etc. YouTube is your friend.\n* Make a plan for exercise. Some stretching, some strength, go for a walk every day. Again, - YouTube is your friend.\n* If possible, find someone to do these things together. \n\nDon't overdo, start small, start slowly. Babysteps.\n\nOnce you are in calmer waters you can start to build. Do what you want to do, not what others want you to do (or what *you think* others want you to do).", "Hey there, everyone! How's it going? I'm a 20-year-old female who's on the lookout for some awesome productivity buddies. It would be great if you guys are just a bit older than me and can help me stay on track and accountable. I used to be super productive before, but lately, I feel like I'm losing my touch and just falling into tge rabvit hole of reels and social media and I really don't want that to happen. So, if any of you are growth-oriented and love to make progress, let's connect!\n\nLet me share a bit about my interests, and you can see if we vibe. I'm really open to learning new things, and I'm especially keen on exploring opportunities to earn money online and become more stable and independent. I'm currently studying interior design, and I'm super passionate about art, sculpting, true crime, and psychology. It's like a colorful canvas of interests, you know? 🎨🕵️‍🎨🕵️‍♀️\n\nI'm on the lookout for a long-term platonic friend and shares similar interests or can introduce me to exciting new things. Just a heads up.\n\nPeople have told me that I have a unique and creatively independent mindset. I tend to dive deep into observing things, and as an INFP, I'm introspective and not very judgmental. Growth is a big deal to me, and I admire those who strive to progress and evolve.\n\nOh, and by the way, I also love learning new languages and would really appreciate improving my English skills. It's like adding a vibrant rainbow to my life. 🌈 If you want to hang out, Instagram is my go-to platform.\n\nLooking forward to connecting with you all and having some amazing conversations!", "20 year old male here, studying architecture, with interests in \n\n>art, sculpting, true crime, and psychology\n\nwhich is almost everything you've named except for sculpting. I'm like the male version of you. Which is inteesting.", "Dm me", "Sure, I'm down. However my goals and field of work are very different than yours. So if you're looking for similar field for more relatable experience I'm sure someone else would be here", "Hi, check your dm!", "Interested \nBadly need an accountability partner\nCan't dm because of my new account", "Hey, I am also 20, also female, and I also struggle with productivity and want to fix it to make my life better right now. And I appreciate your hobbies and interests! I'll dm you", "Hi, \nI'm a 20 years old male, I'm basically struggling with similar things - used to be productive before, now not as much. I'm also striving to be independent and I'm studying digital art( I want to work in the games industry as a concept artist). I also like learning languages, I'm studying  japanese atm. I'm INTJ, used to get infp before that, so idk \nI'm always trying to grow although I do fail a lot sometimes. I have lots of notebooks filled with notes about self improvement. \n\n\nU can hit me up if you want..", "hi", "dm me im in", "I’ve been looking for a productivity discord haha and even thought about starting my own. If anyone wants to join a community lemme know", "I’d be down to join a discord, it’s helpful having a virtual “body double” to work along side. :)", "hellooo ive been looking too", "Try focusMate.", "I’m down to join a discord group or something, but I’ve been working in interior & architecture for 6 years now - freelance & work from anywhere vibes. \n\nI’m more on the strategy & consulting side of the industry so also happy to give advice and share knowledge.", "At what age does the feeling vanish, I’m 19 and I wanna be a writer, psychologist, scientist, I wanna work with technology, want to own a bookshop cafe. I really want to achieve a lot, learn a couple of languages, travel around the world, all in a lifetime. \nBut as humans, we’re limited and I fear that if I don’t pick what I want to do, I might not become anything at all. I just wanna know if I’ll get over this urge probably when I’m older. ", "It never does. I picked one based on my purpose, the book \"Ikigai\" helped me learn how to define that for myself. Then a side hustle to ensure I have enough money coming in too. Everything else is labelled and will be completed as a 'side quest'.\n\nOn the bright side, you'll never get bored.\n\nKeep aiming sky high mate", "Thank you…I’ll pick up that book. Yes I never get bored, cause there’s always something to do. I sure do need a side hustle", "Who is the author? I found more books under this title.", "But deep boredom is the peak of mental relaxation. The lifestyle you glorify creates mountains of anxiety and depression.", "kudos for the book rec, adding it to my list now", "Thanks .. I just googled this book.. exactly what I need ❤️", "I genuinely wonder for the people who label their material as a side quest, ever get anywhere.", "Ikigai is a great one.", "This is so super accurate! I felt that drive to do everything ever until I found my purpose and now I have things I do on the side, but I generally feel extremely content with my main purpose/s.", "Pickup ‘The Burnout Society’ while you’re at it.", "Hector Garcia", "I just do it to tick off a box, the side quests aren't really long term goals that get me anywhere. I don't spend nearly as much time on them as I would on the main important stuff.", "BCH is the voice of a generation he must be protected", "I have so many different hobbies due to ADHD lol idk what to do", "I’m not even diagnosed yet, I get paralysed sometimes cause I have so many things to do but dunno where to start from. I just sit there till I figure it out.", "I was the same until I started taking generic adderall. For instance, today I wanted to create a discord server so I watched a 30 minute tutorial and did it. Took me about an hour because of the pausing to implement what I learned but I did it. Prior to adderall I’d over analyze everything. Now if I really want to do something I just do it. If it’s complex then I’ll write out baby steps so I don’t confuse myself. Analysis paralysis is a bitch and you’ll waste away overthinking things. Just do it and learn on the way. Godspeed.", "so well said", "Do things that have least resistance. Find things that are somewhat intuitive but require practice. I’ve found juggling to be really fun and easy and new. Find increasing complexity as you get older. No need to rush. Keep unlocking levels", "I don’t recommend it but crippling depression will destroy that urge to achieve", "I don’t even think I can be depressed for long, I’m not my best self but there’s always hope lingering around me.", "It’s great that you have so many aspirations. I did/still do. I thought I would finally find something that seemed like a calling and not settle but settle on one thing.\n\nI never prioritized. I just wanted to do it all, all at once and didn’t really get anything done.\n\nSo I think wanting to do a lot is great, but go about it in a more planned way than I did.", "Wait till you get older. Life gets way more complicated", "This is terrible advice I don’t understand the upvotes behind this. I hope he didn’t advocate you to be depressed to get those urges out.\n\nOP please don’t let this stop you if you wanted to try out everything you have in mind.\nRisking is better than regretting someone said.\nSo think about it.\nAnd let people help you make decisions but never let people make decisions for you.\n\nYou should have the final say. \nGood luck and go out there and do what you want.\n\nThere’s nothing wrong with being obsessed as long as you don’t neglect things like mental health ,family and friends.\nSome people want a lot and some people want less and that’s all up to you. It’s your life and you are the person who sets the rhythm 🥁.", "I guess", "People are upvoting because they feel this, not because it’s advice", "Read the first 4 words of that comment", "don’t listen to that guy. sadness is also fleeting, and he’s weird for trying to bring you down.", "lol best of luck. Enjoy happiness while it lasts, it’s fleeting", "It's not advice. The comment literally says \"I don't recommend this.\"", "Yes I was going to say the same thing. Dont let him dim your spark, i know lots of people who prefer life now at their older age", "Yeah I realized that by reading those 4 words I mentioned.", "it is called openness trait on the big 5 model.  \nit is hard to be like that, but quite fruitful\n\nyou are going to live an interesting life.\n\nbut you have to discipline yourself very well\n\nand to learn to pick things (and pick the ones you are ok with losing)", "I'm in my 50s and still want to do it all! I've traveled a bunch, written books, and have kids who are teenagers now. I haven't had all the hobbies, but I've had a few. I am working my way into some kind of new career in the next few years. \n\nAt times, I've been really busy and focused, but the feeling of wanting to do it all comes back!", "Nice to hear it from an adult perspective", "I'm sure most people want to achieve a lot of things in life, but most end up not even acting towards achieving them. \n\nI'd suggest focusing on one or max two things at a time and work on improving yourself in those. Once you've become proficient at those, you could work on a third thing too. For example, work towards becoming a scientist and set aside some time for you to get started with your bookshop cafe. Once your cafe starts gaining traction and you feel secure about it, you could hire someone to manage it, while you still own and look after it. Then you can start working on something else such as writing along with becoming a scientist. \n\nCreating a roadmap for your future will definitely help you, but I doubt you would be satisfied trying to do everything at once. Also if possible, try reading 'the 12 week year'. It's a fascinating book which might help you in taking action, completing your tasks and using your time as efficiently as possible.\n\nAnyways, I hope this helped and good luck on your future endeavors!", "Thank you…currently focusing on one thing rn but I just get the feeling of missing out on things I didn’t try . Yeah I’ve been wanting to create a roadmap, I’ll check out the book also", "Maybe you could try each of them out briefly to see if you're actually interested in them. I can relate to what your saying, because I too was interested in multiple things and one of them was psychology. Later I learned that I was only interested in how the human brain works and the results of studies/experiments, however I had no interest in pursuing it or practicing psychology.", "Remember, the biggest source of unhappiness is when you have high ambitions and unable to achieve. Having said that, worry about mastering one field and hope that will be the field of future and you are there.", "🤞🏽", "same lol same, wanna learn music, learn art, learn languages, learn chess, learn 3d, so many things to do in this small fu\\*\\*ing life !!", "Just start from somewhere", "I do/did work on those things :)", "No, it doesn't. I'm 40, and I still have the urge to jump from thing to thing. \n\nOne thing I will tell you, though, is to start exploring now. Figure out what you like and what you don't like. Ask yourself, why did you move on to another 'subject,' or why did you stay interested in that one?  Try and actually see things through and don't move on too early or quit too fast. In the other end of the spectrum, don't force it if its not there, move on. \n\nBeing curious and creative is what brings me joy in life. It sounds like it might do the same for you. Lean into it.", "Thank you! Yes I’m always curious, it keeps me moving", "You're welcome. Goodluck!!!", "I'm over 40 and done all that except bookshop cafe (but, that'd be a cool late-age job for me). Your post helped me realise simultaneously, my urge for \"more\" just does not diminish, but also that I'm actually doing pretty ok at this time-stamp. Along the way you'll necessarily get good at explaining why your curriculum vitae reads like a Don Quixote dream sequence.\n\n&#x200B;\n\n>fear that if I don’t pick what I want to do\n\nkeep that FOMO in check and don't fool yourself into thinking a decision today dictates your entire life sequence forever after, amen. At the same time, as another commenter here said, it's not advisable to be *too* flighty, but rather actually stick with certain worthy pursuits long enough to have actually achieved some level of competence and/or status.", "“I saw my life branching out before me like the green fig tree in the story. From the tip of every branch, like a fat purple fig, a wonderful future beckoned and winked. One fig was a husband and a happy home and children, and another fig was a famous poet and another fig was a brilliant professor, and another fig was Ee Gee, the amazing editor, and another fig was Europe and Africa and South America, and another fig was Constantin and Socrates and Attila and a pack of other lovers with queer names and offbeat professions, and another fig was an Olympic lady crew champion, and beyond and above these figs were many more figs I couldn't quite make out. I saw myself sitting in the crotch of this fig tree, starving to death, just because I couldn't make up my mind which of the figs I would choose. I wanted each and every one of them, but choosing one meant losing all the rest, and, as I sat there, unable to decide, the figs began to wrinkle and go black, and, one by one, they plopped to the ground at my feet.”\n\n\nSylvia Plath, The Bell Jar\n\nTimeless problem. Try stuff. See what sticks.", "This! I’ll definitely try stuff", "yess was looking for the fig analogy", "oh you are one of us, multipotentialites. Same here, I wanna do so many things, learn so many things that I end paralysed and not acting towards any of them. It probably wont go away, idk but you dont need it to go away in the first place! the renaissance man is a cool idea and I am never gonna give it up", "It's not an age so much as... Crippling depression?\n\nGo do those things. Become a psychologist who has also studied some science, write a book about it, and then retire to own a bookshop cafe. Learn a language. Travel. Desire to achieve things isn't bad.", "Thisss…bit by bit I’ll get there", "What if you get depression though?", "I don't know, just keep doing things even though it's harder? That's what I do. You tell me if you find the solution, okay?", "Studies show we do change as we age, (even though when polled, we believe will be the same) so your priorities will likely change as the decades move forward. \n\nBut as I approach 50, my life to-do list is always longer than what I can reasonably accomplish, lol. But that’s OK, as long as you accomplish some things, it is better to aim too high, than too low.", "You have plenty of time to do a lot of different things. I know someone who became a well known artist in her 70's, long after she thought she was too old. \nThat said, certain choices put us on a particular path. It's difficult to do grad school later in life, although it can certainly be done. ", "As much as a spinning mindset sucks. It's best to just get used to it and use it to your advantage. It's better to have passion and desire than none of it and end up a bum", "Never lose this feeling! You will have to prioritize and make a plan to achieve everything but this enthusiasm is a wonderful thing and will serve you well.", "I’m 32 and still have the same urge. I wanted to be young again so I can have more time to do all and all.", "still in my 20s and the best thing I learned in my personal experience is to focus on one thing at a time, idk if it's a me thing but I found it gave the best results and whenever I tried doing everything at once even with a schedule I ended up with burnouts and slow improvements, but ofc this is just my experience and it's up to you to find what suits you the best.", "I’m 36 and have felt this way all my life. So far I have had a fulfilling tv journalism career, then at 28 switched to commercial real estate. Now at 36–after being a broker in real estate and finally making some decent money—I’m getting my masters degree in Neuroscience. Likely will be aiming for a PhD in my 40s. Also currently pregnant (which is actually harder than any of the careers!). Literally none of my careers have related to each other, but each one builds on life skills you develop along the way. In my opinion, you focus on one or two things at a time and put your full and undivided effort towards achieving those specific goals. When you achieve, you enjoy it for a while, then try something new!\n\nFavorite quote below—though Plath never did get to do all the “things” since she… you know… stuck her head in an oven. Nonetheless, it’s a relatable thought:\n\n“I can never read all the books I want; I can never be all the people I want and live all the lives I want. I can never train myself in all the skills I want. And why do I want? I want to live and feel all the shades, tones and variations of mental and physical experience possible in my life. And I am horribly limited.”\n\n― Sylvia Plath", "So refreshing, congratulations momma❤️\nYour family are so lucky to have you.", "You need to read Choose Possibility by Sukhinder Cassidy, the author is one of us.\nMy biggest takeaway from the book is “seek opportunity in parallel”, literally start with one thing and have the second as a side hustle. Once the second is mastered, drop the first and do the third and so on. In the end, you experience so much that can eventually narrow down and become your niche.\nJust start and keep going and if you read the book, read it slow and take it in", "Trying to pick at least two things to do as a career but I feel like I’ll miss out on the things I never got to become.", "im 20, currently doing mechanical engineering and im scared this is not meant for me. i wanted to be in medicine back then. now i just want to be a florist or a baker. it never stops. last month i wanted to be a landlord(?)", "60s...never really stopped that feeling..it actually got worse. my saving grace has been to stay in fields where that urge is somewhat contained like nursing has a thousand different ways to apply...but i will say that at your age part of it is that you dont really know what working these jobs is actually like. some always know what they want to do others (like me) learn by what they dont like...astronomer? nope..stars like cold weather not me...oceanographer?nope...i am too chicken to trust a bottle of air..etc. i did not become these things but i did take college courses...so try lots of different things and enjoy the journey!!!", "You can do anything, but you can't do everything.", "Nope. 33 and still have crazy, wild dreams that I fulfill. Never stop!", "There’s a healthy acceptance that you can’t do everything, but that you can pick and choose what you do and can change as you go. The problems come when you start to feel anxious because you can’t do everything that pops into your head. That you feel like you’re failing. \n\nBe ambitious but don’t punish yourself if you hit a limit", "It never stops. In my case I've always been that and by the time I was 36 it was exhausting. I was in a race with my own urges. On the bright side, i was never bored or idle. It kept me busy.", "It does when your breath your last breath. Creating, building, and achieving form the true essence of life. Nothing else is as transformative and glorious.", "It kinda doesn't unless some aspect of your life beats it out of you, haha. I think even in the event that you glommed onto one of those and made it Your Whole Deal, you'd still have some of the others floating around as hobbies.\n\nI write boring business-type software for a living. I still want to publish a video game, write a novel, get okay at even one actual musical instrument...\n\nYou will eventually run up against the reality that you only have time to put the actual work into one or two things that aren't your actual job.", "No. I don't think so. It may just be smaller things, but idk. Relaxing on my self ststained homestead after returning from doing something good for others just sounds so quiet and nice. Idk what I will want when I get there. Maybe rehab horses or a Vinyard. I know that I have put in WORK to get where I am now. Now I'm looking forward to other things. \n\nGoals for me have so many categories. Peace, selflessness, race, travel, business. I don't think I will ever say ok... I'm done doing all of the things. Haha.", "36 here and it's just gotten worse so far", "Thats kind of a tricky question. At 50 I still have a lot I want to do, but plenty of that stuff is stuff I just think is neat and realize I'd rather use my time for other things. \n\nDon't try to do it all now, recognize the things that need eduction or energy and do those early. Recognize what you need as a prerequisite for each as well. You can't be a psychologist without an education. Depending on what you mean by \"Scientist\" but that probably also needs schooling. Try to prioritize a science that overlaps with psychology so you can double up on classes taken.\n\nWorld travel needs either money or free time. You'l be spending a good amount of time being a scientist and/or psychologist so either travel first, or plan to do that later in life.\n\nOwning a bookstore cafe is not a money maker, so it might be better as a retirement project once you've made money doing something else. That also gives you freedom to travel and let others run the cafe when you're traveling.\n\n\\--- \n\nI've never felt strong enough about starting my cafe that i've pursued it. I had too many interests in school to become an engineer or psychologist, so ended up not doing any of them (but hey, no debt now.) I haven't traveled globally and it got a lot harder once I was married and had kids.\n\n\\---\n\nThe best thing you can learn now is to accept your decisions. Maybe you won't do all that, but you'll still be fine. Make the best of the decisions you DO make. Also you might consider getting an ADHD diagnosis and get medication if you have it... from personal experience, these sounds like ADHD symptoms.", "No, we live in achievement society. It breeds narcissism. Always have to be producing or else you’re a loser.", "Yes, 42.", "I mean if it's there now, why not harness it?\n\nA quote I've been mulling over recently is \"you can do anything, but you can't do everything.\"\n\nI think it's a really good one. \n\nOne way to look at it that might be helpful is to consider what resources are only going to be available to you once, or in what order.", "It never does go away but it changes shape in different eras of your life. Im going to borrow from the model of an artist I know to illustrate my point:\n\nAt 19: this is the time to explore and spread your wings like no other. The ambition often won't lead to achievements without guidance i.e. a mentor to put walls up around those dreams and get you to the finish line. You cut your goal achieving chops here.\n\nMidlife: the ambition is seasoned with acute knowledge of what it will take plus what resources you have. Thus the dreams undergo greater scrutiny/auditioning(?). Finish lines reached much more. You level up your goal achieving chops here. Legend status in reach as you pass 10,000 hours of mastery\n\nLate life: here you are taking everybody to school in your domain since you possess the necessary finesse with your area of expertise. But it's much harder to reinvent yourself. Still possible though. But the temptation to stay in your lane and shine is too grest for many. Your chops feed you your new dreams here as they define how you will work.", "Wait until you're forty-five, fifty. Then you really become aware of your own mortality. And that significantly changes the perspective of life. Until then, enjoy the endless possibilities.", "It can definitely go away. For sure get back burner’d. Smoke a lot of Indaca! 💫", "I really identify with this post. I don’t think it goes away either. I have always wanted to do everything all at once - it makes life interesting but hard to choose", "im 23 and I still feel the same.", "never give up on your dreams. hopefully you'll live a long full life and be able to pursue whatever you want", "I'm 19 too and I feel the same way. I want to do so many things and achieve so much as well. It's comforting that I'm not the only one my age that feels the same way. However, I feel like we shouldn't limit ourselves, in the long run at least. I feel as though when you have so many things you want to do, you don't do any of it. I know at least I want to be a novelist. But I want to be a fashion icon as well. I feel like focusing on the things that you're really passionate about and then branch off to the other things. That's what works for me, at least. I created a rough list of everything that I want to do in this human life and ranked to what I'm really passionate about.", "And it never will go away.", "I can only speak for myself, but sometimes you chase an ambition to the bitter end and realize it wasn't fulfilling in ways that you'd hoped. Or the deeper you get into some pursuit, the more unpleasant realities of it make the achievement less and less worth it. Or as time goes by, you change as a person and what seemed really important at one stage in life became less important with time.\n\nOr the world changes in ways that upsets the oxcart and you have to rethink everything.\n\nFrom age 15 I had it locked in my brain that I was going to take the Electrical Engineering path in life. I followed that path until I was 33 or so before I had to concede I just plain didn't want to do it anymore, and that the pursuit had caused me some pretty serious emotional damage.\n\nThis isn't prescriptive to you and I wouldn't presume to tell you what your future is. Some people do have the insatiable urge to achieve until their dying breath, and I wouldn't pretend like I know better. \n\nBut life's journey has all kinds of unexpected curves and paradigm shifts, and I would counsel that you shouldn't be surprised if your priorities change.", "All you mention is easily doable within a lifetime. Skip the bookshop cafe though, as it takes massive amounts of time and probably will not bring you much.\n\nTry to distill what exactly attracks you in each of the things you mention. Maybe some things have overlap? Can you combine things?", "No. Balancing what you've achieved and the perception of what you think you should have achieved evolves.", "I think it's good to have so many diverse goals. I was pretty focused on just one and when I achieved it, I didn't know what to do with myself. I wish I had more variety like you, so I could switch gears to something else.", "It’s stressful and confusing", "Yes and no, I am trying to make up for lost times and I'm doing 6-7 things nearly as once. I still want to learn I have been needing to go back to college to learn college algebra", "I wanna learn algebra from scratch too, I hope we all find our wayy", "In college I had to start at intermediate algebra, I had to take the class 4 times then I passed.\n\nTo be fair, first time I enrolled it was a summer 2 month long class way too fast paced for me dropped it. Then I enrolled in fall, failed, I enrolled in spring (2020 covid happened) had to go to online, for some reaosn my dumbass dropped the class. Then I took a self paced course, and used the max length and passed the class with a 93% I almost considered redoing the class to get 100%\n\n&#x200B;\n\nWhich BTW I always got C or D in high school so this was a big win imo.", "I'm 30 years old now and completely relate to how you feel, the best thing advice I can give is to try the ones ypur super passionate about. I've got 11 years on you and I'm just now figuring out what I actually want to do but I've done alot! I decided I wanted a business so I did that and failed because I got bored, I became a dental assistant and got bored (It is great to have the qualification though because I've been able to work in-between all my other schemes pretty easily) I decided I wanted to travel and so sold all of my belongings including my car and got a job on a superyacht (probably the best thing I did). I guess what I'm trying to say is time isn't running out just trust good things are going to happen and you'll get your light bulb moment one day.", "I can relate to getting bored of things and I fear that would make it more hard for me to stick to things", "I know you've had alot of book recommendations but I'm reading GRIT by Angela Duckworth now give it a try. I've actually forced myself to stick with my new venture, but I'm glad I spent so much time figuring out what I wanted in life. I don't think of anything I've done and got bored of as wasted time it's all life experience and it's amazing the way random events have benefited me. It's good to have in the back of your mind that you need to have somewhat of a plan but remember to enjoy yourself.", "Depends if you have positive or negative support around you. With positive support your ambition will never go away; otherwise i’d reccomend healing first and finding support", "I have little to no support. Healing? Is it from the fact that I cant do it all", "Healing from the fact that you have no support. Most people try to move on asap when they can and create a supportive environment; only to find out they’ve been going through a rollercoaster, which is not good. First create an equilibrium (neutral state) by healing (try postive affirmations, postive self talk etc). Essentially for at least a month to help you realise having no support is obviously a bad thing, after you can move on and seek ur own network or create one if you can’t find it. If any of the tips become too dreadful please seek professional help", "You’ll find out later in life that the talent or intelligence weigh very little to success. It’s the resilience and self talk that keeps a person in the game, we don’t care how you’re doing, but instead how you’re dealing with things is what seperates us. A healthy environment to learn and develop is essential, so create that for yourself", "Take it from someone 20 years older - do it all now (or try your best.)", "🤞🏽❤️", "It tapers down but no not really. The STRESS of it goes away when you find a career with tenure and start a family.\n\nGo to Jobcorbs, Utah. Explore your options.", "No worries, you can achieve all of that and more. You don’t even have to put your mind into it. \nI’m 40 right now, I thought I will do one or two things, maybe a bit of travelling, wife and kid. \nBut life has it’s own plan for you, and so:\nI travelled to almost every continent except Antarctica, I experienced things and adventures I would have never imagined 10 years ago no matter 20. I slept in a bush in Africa and had a standoff with an elephant, I walked around Cornwall in England and slept totally illegally under the stars in a ruins of some castle.( not because I wanted to but because I was so poor I couldn’t afford to sleep anywhere else)\nI have been to war zones, twice. I had stayed in some in luxury resorts and the most dinkiest hostels that only Eli Roth could imagine. \nI lived in London and Berlin, I lived in villages in Greece with less then 6 people. I had finished Bachelor and Masters (but not the one that actually matters a lot, Arts)\nI was a teacher, I worked as a painter(not art, basements), I worked in my profession as a creative director and I was unemployed and slept on night busses in London. \nRight now, 40, I still have no absolute idea what I want to do or be. And I think it’s a good thing, life is unpredictable and it will carry you on. You may want to do plans but life will happen in its own way. Relax, work hard when you can, enjoy the ride!", "it does if you collapse your ego ", "I lost the urge went it felt like nobody cared what I was doing or appreciated it. So instead of work goals I decided I wanted to enjoy my time outside of work more", "I felt that way at 19.\n\nAt 33, I'm much more focused on a smaller number of things that have become more personally meaningful to me. I'll tell you one thing to put you at ease, and one thing to serve as a warning.\n\n1. It's good to be interested in a wide variety of things, because this keeps you open to new experiences and new opportunities. It's fine to be interested in psychology, technology, science, literature, language, and ten other things, all at once, because these are the factors that are going to allow you to see possible paths forward in your life, and at your age, a \"possible path forward\" may just mean an *interesting experience*.\n2. **But**. The older you get (and I want to stress here that you have like 10 years before this becomes relevant), the more you're going to want to choose between something being a *professional interest,* a *personal interest,* or a *passing interest*. It's very hard to give up a successful career as, say, a therapist in order to pursue your dream of founding a startup. Not impossible, but difficult, particularly if you have family responsibilities by that point.\n\nI don't want to frame myself as exemplary here, but here's how it panned out for me.\n\nAt 19, in college, I entertained the idea that I could write fiction part-time while also composing music for video games and movies, and maybe starring in my own travel TV show or writing travelogues, in the vein of Paul Theroux. I also cared about language-learning, anthropology (which was one of my majors), and tech, particularly user experience design, which was a fairly nascent field at the time.\n\nWhen I graduated, I moved to Taiwan for two years to teach English and learn Mandarin. While there, I played music, wrote short stories, and began to build a portfolio of UX work. In a lot of ways, those were the two most productive years of my life. I was single, worked 20 hours a week in a job I enjoyed, and pursued these passions with the rest of my time.\n\nI got a job offer to work at a tech startup in Shanghai, China. I stayed in China for six years. During that time, I tried to write more, but my time and energy began to dwindle. I stopped treating music as anything but a self-soothing exercise. This was hard at first, but at some point I realized that I enjoyed just sitting down at a piano and playing around. It didn't have to lead anywhere.\n\nI got engaged, and then we moved back to the US to get married. We had a baby 16 months ago, and trying to be a good husband and dad has taken the bulk of my attention. \n\nAlthough I had been working in the tech industry for close to a decade, when I was laid off last year, I decided to really make a go of writing. That's where I'm at now. I still want to achieve new things (financial success in the literary world), but I've realized that I can't build a whole lifestyle out of everything I am interested in. Some of those interests fell away once I realized that they weren't going to define my career, and that's alright.\n\nThat doesn't mean that those interests and experiences don't matter. They inform the stories I write and the people I meet. They shape the way I view myself. My son has a cool dad, and I have friends all over the world. \n\nAnd, I still have time.", "Well I’ll tell you fent takes all that away and then some 😭 I wish I had your drive", "The urge goes away when:\n\n1. You just start chipping away at them and the ones that stick are the ones you keep going with, and the others just naturally start falling by the wayside.  Or you find new ones you never thought possible (for instance, I didn’t know I could do the job I have now without a law degree)\n\nand\n\n2. You start measuring your life by the journey rather than the destination and start measuring your self-worth by the life you’ve lived vs by your accomplishments.\n\nYou may start writing and realize you hate spending all of your time behind your computer and would rather be out in front of people and work on the bookshop dream, or that running a business is not your temperature and you’d rather become a school psychologist or scientist.  As you go through life, you’ll discover things about yourself and what you really want out of life, and you’ll naturally start carving that path.\n\nLife itself may guide you.. maybe (not hoping for this for you, but maybe) you lose funds and the bookstore may never occur or maybe you decide you don’t have the money for graduate school.  Or you fall in love and have a family, and decide staying home with the family and writing part time is a better alternative.\n\nHeck, when I was your age, I thought I wanted to go into politics and then worked in public service and interned for the city and state and decided it wasn’t for me lol\n\nIt’s healthy to have lots of dreams at your age… but stay open to where they and life may take you.", "I'll be 37 next week and that feeling has been gone for a few years now. ", "I think a purpose or a goal can also help with focusing your life path. Etc my purpose or goal early was always that I wanted to help people. I started with behavioural therapy, then to family social work and then now I am in family violence counselling. Every stop I had the goal of helping people which I achieved in small ways here and there. And I left the roles to the one I'm at now because I felt like my goal would be even better achieved at my current role. So I think you could apply that too", "I’m 20 years older than you, and no, no it doesn’t", "I am retired, starting new companies and learning a new language.", "Yup, as you get older you’ll learn to accept and move on", "After u hit 30, u start to realize there is no point. Nobodies gonna remember u in a thousand years anyway.", "I would like to think it tones down some in retirement.  Yes, you want to stay busy and active in your later years but it won't be as intense probably like it was in your 20s and 30s.", "I’d like to respond to this tomorrow. So I will then.", "Why should it go away at this point ? It’s a beauty of life", "Being a psychiatrist (an MD) would help you with 4 of those things, and you could pivot into other fields if you like afterwards. Keep a realistic timeline for yourself so you can accomplish all the things. Learn languages as a hobby and use it to teach as a side hustle. Travel the world with friends who can split expenses or finish school to get money then travel, whichever works out. \n\nI think you can definitely do it all if you have some realistic timelines and grace for yourself when life happens!", "Arnold's motto was always \"Stay Hungry\" for this reason. Yeah you can be defeated by success just as easily as failure. IMO it happens when you start making good money and eating more. As you get older, your metabolism slows down and that usually co-incides with having enough money to eat well. So people LITERALLY get weighed down by life. As you get older, you have to LITERALLY stay hungry. \n\nTravel is really powerful. You realize immediately that everyone lives in a psychic bubble with very specific rules and beliefs, and even going to the next town or neighborhood you're suddenly in a different bubble, with a whole different vibe, a whole different way of thinking. LA is a perfect example. You can be chilling with deadheads and hippies in Venice beach, and literally a 1/4 mile away is Santa Monica which is like super metrosexual, sex in the city kind of vibes. Totally different aesthetic and mindset and kind of person. And people in LA absolutely hate to leave their neighborhood for any reason. It's more than just the traffic, it's because they are feeding off that psychic bubble. But you get to a point where you can't exist without it, that's when your potential is capped. If you can travel, you can keep resetting yourself. If you wanna get into finance you fly out to London or Hong Kong or Dubai, get a suit made, take a few meetings, read a few books in amazing coffee shops and you can get into the mindset really quickly. Travel is a mega superpower. I'm pretty biased as it's my absolute passion, but given your age I would put that at the front and pick your spots based on your other ranked goals. If I'm you I would get a RTW plane ticket and do a world tour of [the best cafe bookstores in the world](https://www.flightcentre.ca/window-seat/coolest-cafes-world-book-lovers)", "I’m 49. I’ve achieved my career goals. I’ve achieved my family goals. I’ve travelled extensively and have worked deeply on my physical and mental health. I’m very content with my life. But every day is another opportunity to maintain or improve. \n\nThe best advice I ever got was “You can have it all, but not all at once.” Don’t get overwhelmed by having too many competing goals. The way to get shit done is to focus, prioritize and execute. Recalibrate periodically. You’ll be amazed at how much you can get done as the years go by!", "As a former renaissance kid and recovering compulsive planner, I say go for it. In a world filled with a lot of can't types, be that guy.\n\nAlso note: It helps to have a core discipline that grounds you and serves as your foundation for other activities. Once I identified my \"Kung Fu,\" so to speak, a lot of things become clearer to me.", "I'm 34 and I recently realized the career I studied for isn't right for me. I'm going through a kind of second coming of age where I am exploring my interests once again. I think the difference between being 19 and being my age is that your goals tend to be a bit more realistic.\n\nFor example, when I was your age I wanted to be a scientist, then a lawyer, maybe a doctor, or an actress. It was all these prestigious careers that took a ton of effort and required a lot of money and training and connections. I realize my limitations now. Now my interests are easier to obtain and based on my unique interests and qualifications and not so much getting a job that makes me look good to others.  I have entertained becoming a dog groomer full time (I have tons of experience with dogs, a data scientist (something I also have some experience with), going into IT, and even being a truck driver (I love road trips and time spent alone on the road). These are all jobs I could have training for and be ready to start within a few months hypothetically speaking.", " that hunger for achievement is what keeps life spicy", "As Simple Plan so succinctly put it: \"welcome to my life\"", "Note that every answer is based on the level of consciousness of the author and these opinions themselves could be their paradigm. It could be a huge difference if you want something for your Self as soon as you are embedded beyond an ego state or beyond linear time. Naming a specific way would be a recommendation that could be a distraction again. The assumption that it is the desire of your true nature could be used for you and against you by yourself.", "> I just wanna know if I’ll get over this urge probably when I’m older.\n\nIt depdends.\n\nIf you learn to manage your time, you'll focus only on the most impactful things and ignore everything else. There is less urge to do everything, because that tends to waste of time.\n\nIf you want to do it all, that's also an option but it dilutes results.", "Im still trying to achieve incredible things in my 28 year, and I only picked up the pace again. Im even more determined now.", "Mine went away in utero", "It doesn't go away with age, but it might go away with perspective, mindset, etc.\n\nThere are people in the \"slow living\" community who live like this. Also, monks do too.", "it never does you just get better at accepting the fact you never will amount to anything and then the depression kicks in", "Hopefully it doesn't.  \nStaying curious and having the possibility to always learn new things it's what makes life exicting.  \nYou should embrace it and grow it.", "Once you step foot into an over bureaucratic environment then you'll know how worthless it all really is.", "It will slow down. the person who never said never does, I disagree with.\n\nFirst, is a blessing that you have so many things that you are interested in and for me at least as I got older, some narrowed, and there are still new things that I will try, but the more I do the more I have things that I say to myself I will never do that again, and I think this is a blessing too because you start to learn what you do and do not like the older you get.", "You can do it all! \n\nMy brother has been a lecturer, he has a PhD, published dozens of papers, he was a stock trader and made millions of dollars, he’s a published author, he was going to become a medical doctor but instead he now travels the world and he also had his own PhD students, he’s also learning French, and he’s only just turned 30. So yeh, you can do a lot. They say about 7 years is enough to master something before moving on to the next thing.", "Then achieve a lot and quit posting on reddit? Tf.", "Jokes on you…what do you think Reddit is for ?", "Being unproductive...", "That’s what YOU use it for", "Based on what I'm seeing,  you're broke", "And based on what I’m seeing you’re mentally unstable", "[removed]", "I’ll check it out!", "My recommendation is to get the book No Bad Parts.  It can help to heal that part of you.", "sometimes, it does go away. eventually, as life moves on, you realize you have a limited time on this earth, and you decide to do ONE thing, instead of daydreaming of doing multiple things.", "Yes, when you cross thirty and made reasonable progress in life.", "For me it vanished when I realized must of the things I dreamed would cause me to starve in this world, or at least struggle heavily for the rest of my life. I tried for a while but it wasnt sustainable. Dreams are great, but you cant eat dreams of use them to pay rent. So I got a job that payed money and I didnt like while I study for another job that gives a lot more money and I dont like either.\n\nIts sad and it sucks but thats what most adults end up doing. We all think we are gonna be different when we are young but we likely wont be. Unless off course we are the lucky ones that get support while we figure out our dreams AND also get lucky enough to be the best of the best in our dream field in order to live off it. There is a lot that has to go our way in order for that to happen tho, so its not impossible but its highly unlikely.\n\nPS: Things like your race, gender, country of origin, looks, etc; also affect the likeliness of success.\n\n  \nEdit: WOW You can tell Im depressed lol Anyway young one, this wasnt meant to discourage you, I still hope you follow your dreams and keep that drive, cause its definitely worth it. Cherish that pep in your step!", "You're very young and full of hope,\" and more importantly \"energy\" and bursting with ideas. It's good to see that. The urge to conquer the world may or may not die down. Really depends on what kind of circumstances life throws at you.\nKeep aiming high! But adulting is hard and life sucks the energy out of us eventually.\n\nI don't want to demoralize you, but you can't do everything in life (realistically speaking). One day you might have to pick and choose a certain direction and pursue it for the long hall.\n\nBest wishes for you!", "Thank youu.", "You know, that's normal, but also a result of nowadays Internet. Be careful with that mindset, you can end up overwhelmed with the choices you have and end up burning out. ", "Yeahh, I wanna know what’s influencing it; if it’s natural or not", "It's good to have wants to achieve but level set as well, otherwise anxiety and wreck the fun of learning. Focus on one, maybe two things at a time. Dive into the love of those things until you are ready to move on. I made the mistake of trying to do it all at once and nothing ever really got the attention it needed. \n\nAnd you are young. Try things out. Our society a lot of times tells you that you have to pick something and stick with it. Don't do that.", "Yes, I’m getting the idea of sticking to one thing, immerse myself in it then move to the next thing", "I bet you’re a Gemini! Or have strong Gemini  or air sign placements. \n\nIm the same way and achieved a lot. Go after those dreams!! Follow the flow and they will unfold.", "i just want to have sex", "How to stay in contact with as many friends/contacts as possible with maximum depth?\r  \n\r  \nWhat would you do? Can you recommend a few habits, routines, events?\r  \n\r  \nBackground: i know many great people but the older i get the harder it gets to stay in contact. Also the depth of our conversations weakens.", "I don't think you can force it unfortunately, I'm in the same boat with friends I've had for the last 15 years where they just haven't responded to my messages so I'd rather not put the effort in if they don't.", "Of course, if there is no mutual interest, it makes no sense.\n\nI was hoping that there would be recommendations for routines or apps that would help keep track of the amount and encourage regular contact.", "I use the Pomodoro technique for studying and its worked out quite well. Sometimes, like when preparing for an exam, I study for longer periods, but I still do take breaks of usually 15 minutes. \n\nI usually spend the time during breaks scrolling through Instagram or watching YouTube shorts, and sometimes I feel like all the extra, useless information my brain is absorbing from these sources is hindering my ability to retain information from my study sessions. So are there any alternative things I could do during breaks that does not necessarily involve moving around as it is not possible sometimes due to the location at which I'm studying?", "Put your brain at rest. Gaze, relax your eyes. Drink water. Do some stretching, a short walk or light exercise. A powernap. No phone and social media!", "I'm having a hard time imagining what sort of environment you have that prevents you from moving around? Or well I get that you might be in a library or something but presumably you are allowed to leave this space?\n\nAnyway you are completely right that going to Instagram or YouTube is not really that helpful when it comes to taking breaks. \n\nTo get the most out of your break (in terms of being able to focus and retain information etc), I think you want to do things that are basically neutral or nothing. I do stretching sometimes but see how that can be weird to do in public. Meditating is a good one and can be done anywhere. But the main part of my breaks and I think probably the best one is to go for a walk. \n\nI generally like to have my sessions be 75m work and then 15m break, so then I have time for a 10 minute walk getting some sun and fresh air, with enough time to spare not having to rush getting into it or out of it. If your setup is such that its annoying to pack up/down could maybe stretch it to 120 minute focus and then a break up to 20m, but wouldn't stretch it much longer than that. Or you can just take a casual stroll around wherever you are set up. \n\nThe main goal is to do something non-stimulating so that your mind has some time to rest and decompress, not be pulled in all sorts of other directions by very stimulating things like instagram or youtube.", "I only have 2-7 hours worth of work but am stuck there for 7 hours. I have to respond within a 5 minute time frame so I have been watching movies on Netflix. I only have 43 left to watch I am interested in. I am wondering once I finish if you would recommend trying TV shows or something else. I tried online surveys but they don't pay well. I have weights already to lift. Also unsure what shows to watch.", "For me, wasting time learning always feels more productive than wasting time consuming entertainment. Try a podcast or documentary.", "Seriously, I wish I had that kind of time. As others have said here, learn something new. Get a certificate in something.\n\nPlenty of online learning to be had. Stop with the mind mush and do something productive.", "Get a degree online if you don't have one. Upskill in whatever field you're in. Read industry-specific news. Look up new recipes. Pay your bills. Do all your \"chores\". Play chess.", "Mindfulness practices, awareness practices, embodiment practices, and/or get a new job", "I'm a lifelong student. I'd be diving into my absolutely endless (multiple lifetimes) of bookmarks of things to learn (programming things, 3D printing things, category theory things, and the list goes on and on).", "Online chess", "I mean, I would either start writing or something, or embrace the pointlessness and find the pilot episode of Days of our lives and just binge until my brain rotted,", "I'm curious what job position allows you to do this? Also are you at an office? Do you have people watching you?", "I do a job like that in the Army. I sit down in a room for 8-12 hours (schedule fluctuates), stare at monitors, receive phone calls, and type reports", "I’d listen to audiobooks and podcasts. I like all genres, but you could just sample some, and see what you like…If I had my own office, with few visitors, I would also crochet or knit, and consider drawing and coloring in an art book.", "You can learn Spanish with www.dreamingspanish.com all it requires is watching videos and nothing special besides your attention. It is purely done via listening/ watching. Check r/dreamingspanish", "I'm 23M and I'm absolutely pathetic\nI'm falling behind in life. I quit my job because I couldn't handle the routine of getting up at 7am, traveling 1.5hrs to work and then sitting at work and working for 9hrs. Coming home at 7pm to only have 3hrs left until I had to sleep to do it all over again the next day for 5 days a week. On the weekend I would dread Monday so much that I would end up crying. \nHow will I ever amount to anything? How will I ever work any job or become financially independent? How will I ever take care of my parents who are slowly growing older? \nI imagine all my friends happily living their life with their partner being all successful and accomplished while I fail. I don't even know how to drive a car, I'm that useless. \nThe days of my life keep getting over everyday and I am not progressing at all. I'm still the same person I was 3yrs ago. Life is just gonna fly by, opportunities will be missed. I'll always be a failure who was incapable of being good at anything. How will I ever get a girl to date me? There's absolutely nothing attractive about me. I'm gonna be a lonely, incapable, good-for-nothing middle aged man full of regrets. I can't do it, I've given up. \n", "Half of these comments are not great advice or are very vague. If you have the funds, I recommend just signing up for online therapy and trying a few different therapists until you find someone you’re comfortable with. If you can’t afford this, I’d recommend just looking up “ACT principles” on Google/Youtube and reading/watching a little bit every day/week. \n\nJust take small steps and understand you are still in a really great position for your age. Nobody would want to work a job where they work 45 hours a week and have to commute another 15 hours a week, that’s completely understandable. If you’re going to compare yourself to others who are “doing better” than you, just remember there are also countless others who are “doing worse” and have thousands in debt and/or addictions. It’s all relative. I hope you are able to gain some momentum in a positive direction, but if you can’t just DM me and we can always just talk. Much love, you got this <3", "Thank you so much", "Not even just not great advice, but legitimately terrible advice to give to someone in this situation. Hey, have you tried comparing your suffering to others? How about not being sad? How about this shitty self-help book that also contains the much of the same terrible advice?", "How about loving yourself and caring for yourself?", "Be thankful that you are only 23 years old and already came to the conclusion. Most people never realize it at all, so you're already one step ahead.\n\nWhat you're saying is probably all true. Nothing about you is attractive to girls, lonely, missing opportunities and you'll remain the same person for the next 3 years as well. Honestly, if I had to travel 1.5 hours to work I'd also quit, so I don't think that's a pathetic choice at all. \n\nMental health and physical health goes hand in hand, so start by picking up a healthy lifestyle. A healthy body is attractive to everyone, and being healthy in general is also attractive because it shows discipline.\n\nIt's okay to be angry, but don't use it on yourself. The world is unfair, so if you instead put that anger into bettering yourself, you'll be a completely new person in no time. Rock bottom feels like crap at first, but in a month from now you'll look back and cry tears of joy instead.", "Crucial advice.  No one seems to know the correlation of the mental and physical until they buy-in, and once they do, it’s a great tonic for them mentally. I wish you luck OP.", "I feel the same, I’m on year six of trying to graduate a three year uni course for a degree that I’ll never use, I feel useless I live with my mother and while I help a lot I don’t help financially, I’m so overwhelmed and see everyone my age doing masters or working or both and I feel pathetic", "I'm 23f, and while I'm in totally different circumstances, I can completely relate to what you're feeling. I know it's cliche, but 23 IS still very young, you can start something different or new and be on a totally different place in a couple years. I have (not officially diagnosed but 99% sure) inattentive adhd and it's really hard for me to be motivated and do things, keep a routine, etc, and if I had a job situation like that I would be absolutely just miserable and unable to function. It's good you got out of that situation, now hopefully you can find a different job that is better for you. I have not gone to college or anything and feel I've missed a lot of opportunities by reason of circumstance, but after a lot of looking around I started a course to become a professional bookkeeper and am on my way to finish that and hopefully start my own business. I've been pretty past about it unfortunately, but it's been less than a year and it was a fairly small investment to get me doing something, I might not do it forever but it's decent (can be very decent) income and a springboard to other things. Also, I just got my driver's license after I turned 23! It's never too late. It will feel good to find a new direction, even if you're starting \"from scratch, \" before you know it, it will be 6 months, a year, 2 years down the road and you'll be much farther along than you are now. As far as girls, a decent person will recognize the difference between being a bum and not trying to get anywhere, and between having been handed a tougher hand of cards and working through difficulties. Ultimately this build character in a way that everything just falling into place for you your whole life doesn't. You aren't useless at all, finding your way can be super hard, especially in these times, give yourself a few years though and I really bet you'll be in a better place and a better person for it. One thing you can always do that is invaluable for yourself and makes you more attractive to others, both career-wise in in relationships, is work to better yourself personally. You can't always control your circumstances, but you can control your general attitude, how you treat others, how you handle yourself, how you deal with anger, interpersonal skills, etc. You can always be advancing on one front or another. Maybe start working towards getting your license, start taking steps even if they seem small, it will feel great and they will start to really add up. Also, don't compare your last 3 years to the next 3 years, they'll be very different, no doubt. Keep your head up, I hope some better opportunities come your and you find yourself on a better path in the near future!", "Thank you for writing so much but I feel absolutely hopeless", "You sound really depressed from your other comments, please keep getting help for that, it really can get better, I've personally experienced that. Sometimes on really bad days I'd just cut myself some slack for the day, drink some matcha (it's one of the few things that helps me focus and lifts my mood) and watch motivational videos on YouTube or something, sounds weird but it helps. You really have to not be so hard on yourself. Don't think about your whole life, just take today, maybe tomorrow, do something, make your bed, wash the dishes, start a basic routine, whatever. Mental health needs to be your priority now, like sure keep looking for a job if you like, but life is going to seem horrible no matter what your circumstances are if you don't stay committed to taking care of yourself, therapy etc. Please stick with it and give yourself some grace", "I don't feel like doing anything. I'm unable to even watch YouTube videos. I'm so lazy and pathetic", "Well it sounds fkn weird but I highly recommend matcha, it raises your GABA and serotonin (I think dopamine too, don't really remember) which affects your nervous system and gives you energy and motivation. It's not a \"magic fix\" for your problems, but a temporary boost might do you some good. It's a lifesaver for me, I'll just get stuck doing literally nothing and feel like I can't move, it's 10x worse if I'm depressed. I don't take any meds, but that helps a ton. Also have you looked into getting checked for adhd? That might help you be aware and change things up to accommodate, it makes a difference. But fr have someone get you some matcha from Walmart or something, be like 1/2 or 1 tsp. Sorry it sounds so weird, but good luck, I know how miserable it can feel", "Invest in yourself, you'll be alright.", "I'm pathetic and lazy and depressed. I wish I was capable of investing in myself", "Have you read atomic habits? It’s a great book, but most importantly it instills the value of making the smallest possible steps towards change. It’s really hard to do stuff when you’re depressed, so committing to the smallest possible thing can be all you can manage. This might be what you need to turn your life around. It won’t be overnight, but progress is motivating.", "Lazy and depression go hand in hand. Lazy is caused by depression! In order to break its hold on you , you need to seek a behavioral therapist, and you need to look at what makes you happy. What makes you feel like you are doing something for good. Just making money isnt it. You know who the most successful people are? sociopaths with some degree of narc. \n\n Because to them its all about being on top and lording it over people and pushing only success. They are great at what they do most become corporate owners, powerful politicians, and many are highly skilled and paid surgeons. Because they have no care about the spiritual side of life or emotional happiness. Their drive is to be rich and powerful and perfect . People who are not them have some level of empathy and compassion, and feel awful when having to sacrifice their happiness to make a buck.", "Have you gotten any help for your depression? Your mindset isn't doing you any favours", "1st thing you do is stop the negative self talk, immediately. No one is gonna give you pity and stuff for that, it won't get you anywhere. Make the decision now that you will never talk about yourself negatively again, with the exception of constructive criticism to better yourself.", "Read this book called Eat that frog. You may find it useful. Also, always keep trying, don't give up. There is simply no other way!", "From a recovering self-help addict, this doesn't sound like something that a self-help book will help with at all. In fact it might make things worse", "I take pills for the depression and anxiety. I go to therapy. Although I feel like giving up both", "I guess that’s not the book you need whe you are depressed, because depressed people are already eating every frog big and small 😅\nI admire that book, but this type of situation requires a more gentle approach…\nYou cannot start being productive without first healing and taking care of your mental health.", "No offense but That book is ass ong.", "How, exactly, would it make things worse?", "You need to make your mental health your priority. Speak to your therapist about all of this and especially the fact that you want to quit therapy. I cannot stress enough that this is something you can get through and once you're on the other side everything else will fall into place, and I'm speaking from experience", "Please see a cognitive behavior therapist, they dont push pills, they help you modify your thinking, and they are not known for pushing anti depressants. Regular therapists tend to medicate, CBT's actually help you solve the problem without pills.\n\n[https://www.betterhelp.com/advice/therapy/what-is-a-behavioral-therapist-and-what-do-they-do/](https://www.betterhelp.com/advice/therapy/what-is-a-behavioral-therapist-and-what-do-they-do/)", "I recommended this book because it addresses OP's problems like procrastination, lethargy and time-management. The book is quite uplifting. In my experience, extreme laziness breeds depression. So maybe addressing the former may address the later!? This was my thought-process. But I agree to your points too. Healing is necessary. You definitely know it better.", "Atomic Habits is written by someone for whom creating habits and being super organized comes easily for him. (He talks about being the kind of person at uni who was studying and going to bed early whilst his housemates played video games until the early hours) So the advice in his book works well for people whose brains work the same way. \n\nHowever, if you're someone at the other end of the spectrum, there's a decent chance that you might be able to implement some of the suggestions short term but not stick to them. Now to someone like the OP, this could lead to thoughts like \"Why can't I implement this stuff. It worked for other people. I was right, I really do suck\" thus furthering the vicious cycle. \n\nAlso, James Clear is literally unqualified to talk about any of this stuff. He's not a behavioral scientist (his degree is in biomechanics), his book is full of pseudoscience and his \"research\" consists of Twitter posts and Reddit threads", "I don't think there's an \"other side\". I'm gonna keep failing in life", "If you want to keep throwing yourself a pity party then that's your choice. If you think your life is going to suck then it will. Only you can change your life and if you choose not to even try then I hope one day you can make peace with that decision.", "I hope so too", "I think this is called the \"mid-life crisis\" in 20s, I guess try to watch some vids on how to get out in that situation cause honestly I don't know what to say but I hope you will be free in that situation", "Quarter life crisis is what you mean. Midlife is 40-50", "Currently I'm there. But I'm more of a it is what it is kinda guy so not much of a problem..", "Yes", "I was you at your age! And now at 38 I’m quite ok! 😊\nThe story of my life is quite long, but the piece of advice I have for you is to check life out of the city, somewhere calm and quiet, where you can work and live near you workplace. Find something enjoyable for you to do as a job and do something else, have fun, enjoy new places, nature, going out with friends, good books, something that brings joy and happiness to your life. Be grateful and the future will smile 😊", "That 1.5hrs of travel is killer. Used to do that myself. Now I work hybrid and my job is barely 10 minutes away. What industry are you working in?", "Also, consider therapy. It can be extremely helpful, and don’t be afraid to talk to someone close you trust. I’m sure they would be very supportive too.", "Hybrid work is legit the best thing to have happened too bad the ass first managers want it gone.", "I switched jobs because I was commuting 45 minutes each way to work at my old job, promised hybrid so I could stay closer to family. I ended up in all days of the week, late hours, early mornings. I bailed. I now work for a boss that is hybrid first, and very flexible with our needs. I love it!", "1.5 Hours? Don't blame this only on you. You sound as if you are exhausted. Maybe don't focus on what other people do. What is something you really would like to do. If you can work 9 hours + 3 Hours total to get to work and back: You do have the energy. It is invested at the wrong place (maybe).  \nYou are not alone. You are not failing. Realization is the first step. I believe in you!", "One thing though. If you say you are lazy. Well ok but you can change that. If you say you are pathetic then you are just because of saying this. This is not only unattractive for friends and or girls. It is also harmful to you. Stop that.", "Only up from here champ. You need to get out of this rut and stop calling yourself a failure forever. Surround yourself with some good energy, feed yourself good media and knowledge about growth. I’ve been there. And no one will pick you up unless you do.\n\nNo one is incapable of success. Maybe waking up early and doing that routine on repeat is not your style. But since you’ve quit and you can only think of failure, this thought will lead you nowhere. Instead, take some time off, and go all in on understanding yourself and building yourself from the ground up. What do you want to do? What would be your preferred work style? What kind of work rewards you?\n\nThis is not a sprint, it’s a marathon. Take it easy.", "To be honest that sounds awful from a work/life balance perspective. I wouldn't expect miracles at the start of a career but to feel miserable before starting every week and during it is a bit too much. Aren't there any other options closer to you? Or haven't you considered moving closer to your job?", "First of all, get help - therapy like the others have suggested. While we all can try our best online to help you, it's not going to replace what properly trained professionals can do for you.\n\nIf you can't, then the best medicines are friends/family, routines, and mindfulness.\n\n* Now that you've quit your job, you can find time to connect with people who are close to you. If you don't have those people, that's okay. You'll find some along the way to getting better.\n* Routines - Use routines and hobbies to prove you're not useless/incapable of growing. Find something easy to do where you can track your progress. It can be as simple as growing a plant. Helping people at a pet or homeless shelter is also great. **Just keep your body moving and your mind occupied everyday.**\n* Mindfulness - Practice being mindful of your attitude towards yourself. Rubbing salt into your own wounds isn't going to help you get better. Follow every negative thought with a constructive thought. Reading books and finding philosophies to follow could help provide structure (doesn't have to be religion.)\n\nLastly, **take things at your own pace.** It's unfair to measure yourself against someone else, they may have privileges in money, opportunities, mentors, mental or physical health that you don't. Measure who you were today with who you were yesterday, and be accepting on the days you're not able to measure up.", "You 23 find a job that you that fits you and hours you like but remember your an adult and bills don't wait  for anybody", "MOVE TO A DIFFERENT COUNTRY WHERE THERE IS LESS WORK LOAD", "You’re still super young", "First off, look for a job. I dunno what country you are in but look for someplace else. Preferably somewhere with better union and working conditions. You definitely need a change of scenery.\n\nPick up an easy but monetisatble hobby. Start small 15 min a day. And read about building in public. \nI'd suggest marketing but that's my hobby. Your's can be different.\n\nStart networking with the intention of helping and always mask the Desperation l, show you wanna help them instead. It won't be of help immediately but having a well oiled network is a goldmine for your 30s", "I feel like im falling behind to, but are we really falling?", "Your adult life has literally only just started. You've got 40 years of developing life skills and experiences now. Keep your chin up and keep going. No other choice really.", "Hi, i really suggest that you consult a doctor. I have had this sort of feeling - unmotivated, burnt out and anxious all the time. And for years I tried to deny that i had an issue or thought of it as some slump. But turns out I needed medical help. I think you do too. I know right now you have no motivation or drive to make big changes in life and probably stuck in a cycle of guilt. But i hope you can muster up the courage to seek medical help. All the best.", "Man, the world for us young is already doomed, dont fret over it.", "One thing I found that keeps me going is practicing gratefulness. Write down some things that you currently have, and I guarantee you, that someone is even worse off.\n\nBe grateful for everything that you have, because that, is what you need... Nothing more... Nothing less.", "The only advice I can give is to find a job in something you love, it really does make the work worth it. It also makes the days go by easier. I went for the money when i was young , and hated my job so much it was causing me depression and anxiety. I finally said F it went to work in a job doing something I love and care about, the money was a lot less but so was the stress. I just had to learn to budget im still not rich but but i have what i need and a happier existence.\n\nNever judge yourself by others, and never try to keep up with them. You are an individual your ideas and priorities in life are different. Trying to be what you think society expects of you has been the downfall of mental health for a lot of people. Also believe it or not just going for the money can leave you in more financial problems than actually being poor. Do what you love, and make what you can out of life. But if you arent happy in what you do all the money in the world wont matter. You will still feel like a wage slave, your mood and metal well being will suffer, then you will buy stuff to feel better with all the money you make. But in the end its pointless because all that stuff is trying to fill a void of happiness that isnt there.\n\nI will put it this way. I have a relative that works a blue collar job in a mining pit 12 hours a day 4 days a week, he even takes the overtime. He makes good money for this area, but all the money in the world couldnt  get me to do what he does. But he loves his job, he gets to drive loaders and excavators its his thing. So he is happy in his work, where I would hate it. The point is love what you do and be happy.", "Don’t beat yourself, that schedule was unrealistic.", "use my task manager.", "Hi OP!\n\nI work 21 hours a week. With the amount of money I make I can save 5-15% of my income every month or so if I don't buy video games, energy drinks, gadgets or whatever else I happen to buy even though i really don't need it. Because I only work those 21 hours a week I have the time and energy to invest in myself. I'm doing long distance running twice a week, strenght training 4-6 times a week, read a lot,  looking at bullshit on youtube when I'm not working towards my goals, record and edit videos, study, play music and spend time with my family.\n\nIf I would work 40 hours a week, I'd maybe have time and energy to do 1 or 2 of those that I mentioned. I'd feel choked and would cope by drinking alcohol, do drugs and be an asshole. Speaking from experience by the way.\n\nYou can't compare yourself to others in order to learn one of the most important lessons of life:\n\nKnow thyself.", "I was like you. Same situation. Travelling Noida to Gurgaon (in India) for 2 hours before and after work. So basically what is happening with you is that now life is moving in the direction where YOU have to actively make choices for yourself. And that is SCARYY. If you were in habit of being led by circumstances, now is the time when life is saying : hey, buddy get up and drive or you'll crash!\n\nYou can't travel. So switch jobs. A break is good. A break from job is a blessing honestly. Imagine 60 years of life and in that you took a little time off, how does it even matter? \n\nGetting a girl to date. Focus on your communication, how you talk and express and ask things. Work on yourself. Join a gym. This will help you in making friends. \n\nDon't romanticize your life negatively. See yourself as main character and live the arc.", "I used to feel exactly like you I was washing dishes and cleaning toilets and general low end restaurant work and one day a new employee came in to the restaurant I worked at and invited me to go to his church after only a few times going I met a family that was so kind the father of the family was doing carpet laying and needed a helper he offered me a job and we did carpet tile vinyl flooring and different things we branched out into solar energy panels and that field and from that experience I learned how to do many things including framing painting roofing siding working on the truck we used and everything in between later on he moved back to California and I had to find work  I met a woman who had a six month old son without a father in the picture I fell in love with her she was on welfare and we decided to get a place together and we found an apartment we could get with her check I went out to look for work on the next day after we moved in together and found an apprenticeship at a plumbing company I excelled at the company I felt like I was doing something important and in less than 3 years became a journeyman plumber they didn’t pay very well so I sought a better opportunity because now I’m a licensed plumber and I called a friend who went to the union and he gave me a number to a shop owner that hired me over the phone  for 15.70 hr that was in 1989 and today I’m still working for my union making over 70$ hr I recommend you go to church meet some people that do trade work and learn a trade or if you can get into an apprenticeship in your local union and learn the plumbing trade it’s been great for me I raised a family and there all grown up now I’m getting older and closer to retirement age but I plan to run a private business and continue in the trade it pays well and I’m very experienced  so that’s my story I never gave up but at some point I put myself in the hands of the lord and you can see the results of having a little faith it goes a long way think positive and take steps to changing your situation your not in prison you have every opportunity that we all have without even knowing it just every day put one foot in front of the other and you will accomplish everything you need to eventually just believe in yourself and know that god has a plan for you good luck and god bless", "Your story relates to mine. When I was about 23 I thought I was nothing. I was growing without a father and life was in poorness, I also didn't have enough opportunities, no good college, only hard work at some shamy places instead. I complained everything in my life, parents, circumstances, myself. Genuinely speaking, I didn't know what my life was going to be. But I acknowledged that my life is only in my hands and no one could change it but me. When you speak about working dusk till dawn I can feel the same, because I was in that position. But all that you need is step by step change something, first of all quit your current employer. Find something closer to your house and then maybe you will have some time for your personal interests, maybe going to a gym or music club, where you can find new friends who might help you. Don't be upset. Life is plummet and upsurge sometimes, I suppose that at my 29.", "I refuse to tire myself any more more than i already am. I have health issues so due to them i work x 3 a week only. And few hours at a time. I may be poor. But i dont wake up crying to work.  I also can be better partner if i treat myself first. Also i have mostly dated poor men as well and it never bothered me. \n\nBut im 25, so i also feel like im failing. This society makes us think we must grind money or career, then maybe get married and kids (not for me, not for everyone!) . The way someone else does it may not be our way. I want to find my career some other way.  I try to not be miserable because someone else managed to do as society expects. What if im not like them. I rather not.\n\nEDIT: Just saw what sub this is. Sorry if its not relevant. This just popped in my feed.", "Jesus, reading another “I’m 20-something and figured out life” kind of topic really gets first on my nerves, second after it feels super boring so I’ll just leave this comment for my own sanity. For you, friend, 20 whatever is a beautiful age to get anywhere you want.", "BRO YOUR 20 FUCKIN 3????? Do you actually have any idea how much time you have left?? Complaining and pitying yourself will do nothing but set you back more and more until it really is too late.", "Set a goal. Maybe it's to learn how to drive. \nGet a part time job, less demanding. You'll figure it out. Get some easy wins and it will snowball for you. Full time hours at 23 isn't really necessary if you don't have crazy bills.", "You have plenty of time. Find something you want to do.", "you're OK va wants to diagnose me with PTSDwhat the he'll do they know. I'm ready for another deployment I'm already retired so whatever they want asholes. What do they know all they see is behaviors that a a little different than normal. But what is normal going to the mall hanging out, instead I ended up in Bosnia transiting the suez going into gulf of aeden just to bully panga pirate boats. With mk38s and CiWI CMON SO I mendeda FEWBeathinng souls that's what war is. I'm ready to deploy again. HOORAH THAT MY WAR CRY AND FACE. ASSHOLESFight the war fuck the Norn no more complacenence.", "Most of these comments aren't the vibe.\n\nI'm not a therapist, but my friends and I have been trying to live the \"content life\". At our age, we're constantly surrounded by social media people who seem to have the perfect life. My life is basically nothing compared to them. I'm in my late 20s, live at home, kind of a mindless job with a long commute. \n\nBut I try to think about the positives. A good cup of coffee, a good show, a good movie, a delicious meal. Start small. Its okay to be super excited about the small things and work yourself to a better position with time. It can even be looooots of time. Thats okay!! I promise it'll be okay. Life is about taking the steps that are right for you, not anyone else. If that means taking it slow and easy, then so be it, life is about going at your pace.\n\nAlong with that, its okay to be sad too. Life isn't what we always want, the grass is always seemingly greener on the other side, but I promise you got this! Lots of wishes and hugs for you.", "Hey, I was in the exact same boat. I quit too and now I'm working remotely", "I hate nothing more than the Monday-Friday 9-5 weeks, and then rushing the Saturday with the masses to do all the chores, get a haircut, dentist, socialize, only to be drained and mong out the whole Sunday. It was so robotic and draining, every day is predictable. It was until I found a job where I can work irregular hours, I work sometimes during the day, evenings, and nights, that alternating pattern gave me so much relief and flexibility. I am an evening person, so this allowed me to have enough days where I can sleep in, and others where I have to wake up early. Working in the weekend was not as dreadful as I thought, because then I get my free days in the week, when everyone is at work, and just spend my time focusing on myself instead.\nI always found 5 days to be a lot, so I work 4. I stay over time when I feel energized, when I don’t, I don’t force myself to stay overtime. I still hate the office times, and while many consider it a privilege— I thought it was the hell!— That’s just my experience but the message is: it is not you! It’s how the system works, if it doesn’t fit you, seek to adjust the condition. Find what you prioritize the most, and what pattern works out best for you. For example, a job with flexible hours, a 4-day week, a shorter commute, nicer colleagues etc, and most importantly do not “force” yourself to tolerate these conditions because you think that you have to. There is no one “right” way to do things. It is important to seek mental help when you think it is necessary, or ask for advice about burnout from an occupational physician. All the best.", "Try to get a remote job that you can do at home", "Hey, buddy. First of all, stop saying you’re worthless. You’re not worthless, you’re an incredible human capable of anything you can imagine. Please don’t talk to yourself that way. Your accomplishments are not you, and you are not your friends. You are not behind. Behind doesn’t exist. There is different, and your life is different from your friends, but that doesn’t mean their lives are better. Talk to yourself like you would anyone who isn’t you. I know you’re an amazing person, and it pains me to think that you are out here thinking negatively of yourself. I don’t care that you don’t know how to drive, and I don’t care if you’re unemployed, homeless, out of shape, unhealthy, sleep deprived, or anything else, or all of the above at the exact same time. Even if all of those things were true at once, you would be just as deserving of love as the people you admire. Once you realize this, I promise your life will get better, because it’s true. The reasons you think you’re behind are because of social standards which do not exist outside of people’s minds. Anyone who tells you different is insecure and does lot love themselves, and is trying to drag you down. You are a beautiful human being. Love yourself, before you have a better job, body, or habits, because you deserve it. You deserve to love yourself as you are reading this, and no later. Please keep your head high. You’re an incredible human, I’m absolutely sure of it because I have never met a human who wasn’t incredible. I haven’t met you, but you have value by virtue of being alive, friend. I truly hope you realize that now. Best of luck on your journey, and be a friend to yourself and remind yourself that you are already amazing and worthy of love from others and, more importantly, yourself. Please take care, and best of luck to you, my friend.", "Get a higher paying job with less hours. Any sales position with commission will make you driven. Try to learn a trade or go to school on the side. Get a hobby that doesn’t give you money but will fulfill you and ultimately set a short term / mid term / long term goal for yourself. I know it seems like everything is going to shit right now but remember tomorrow is a new day and a good night of rest will make you feel like life is amazing. Stay driven and dedicated good luck to you !", "Leave the job and find a different one. It is not worth it to hold on to it", "I was in a retail management job before the first lockdown, it was hell. It sounds very similar to your situation, I’d get a train and a taxi just to get to work, be out of the house for 9 hours then get home at 7ish with no time left at all. My manager also resented me because he wasn’t the one who hired me.\n\nPlease please change the job if you can or get work closer to home. That job made me so depressed and I really have been where you’ve been. I went for anything I could to change the situation and I managed to get a different job before the lockdown.", "First, you’re not failing. You seem incredibly self-aware, which is quite admirable, especially at your age. Hang in there, find something to work towards, and pursue it with everything you have!", "Hey man you are still really young and there are plenty of different of jobs that you will actually enjoy and not dread. Keep on going. Don’t let urself be down it can all change very quickly to be alot better", "Can you find a job closer to home? I will say my favorite schedule was one where I worked 4 10s instead of 5 8s. My work was also 10-15 minutes from my house so I didn't have to account for a whole lot of travel. You also sound depressed. Have you tried getting some good sunlight? Maybe try going for a walk or even just sit in the sun for a bit. Call up friends that you can hang out with. You aren't a failure. What you see other people posting on social media, you have to remember.... everyone tries to make their lives seem better than what they actually are.\n\nLet me tell you a story abt my life. I was 30yo and reconnected with an old friend who just started a new job making 16 an hour. We ended up in a relationship and fell pregnant. During my pregnancy, he ended up losing his job and had several short term jobs. This was all at the start of the pandemic. He ended up getting a really good job and earned his way up to 25 an hour. He recently started a new job in the same field making almost 35 an hour. So in 3 years he went from losing his job to making pretty good money. He has no college education and only dabbles in the idea of doing trade school to increase his knowledge in his field.\n\nMoral of the story is... you are still so young. You have time to mess up and start again. You just need to keep pushing. You have time to meet someone", "My man, you need a hug, and it has to first be from yourself. This past days I have had some bad health related realizations that made me very depressed and I was feeling and thinking the same way you describe. I'm still am. I thing at the end of the day is to be doing whatever you are doing towards a goal and it has to be an obtainable goal. Maybe save up mone for some very specific reason, or get enough experience to jump to some other field or whatnot. But put yourself goals, and if possible break them down into smaller tasks. And take care of you social relationships, they are gold.", "You’re being your own worse enemy, you’re not “failing,” you’re “learning” what life is all about and the challenges it places in your path. Believe in yourself enough to get a mentor or coach to guide you if the friends and family around you don’t have the skills or don’t want to give you the time. You can do this, your success is just around the corner. Good luck with everything! 👍 —Rocco", "I relate really hard to not being able to tolerate long commutes.   I mean, it's easier with public transit, in that I can sit and read or whatever, (but it's harder with public transit because I've gotta be a certain place at a certain time, or be another hour late, and if I've gotta make connections... yeah, it's mostly not happening.)\n\nI'm like 15 minutes away from work (via car) right now... and that's about my limit.  I tried moving to 25 minutes out (by car) and it was just too much; I was too exhausted by trying to deal with the commute.  \n  \n For me?  just getting out of the bed/the house is literally the hardest part of the day; like, there's this shift from 'sleep mode' that is really hard to actuate.  when I don't go into work, sometimes it doesn't happen at all.  and the longer the commute, and the more planning involved in the commute, the harder that is.", "The #1 reason for not being able to get out of bed is going to bed too late. If you need to get out at 7am, you should be in bed at 11pm. Try to stick to that routine as if your life depends on it, even while not employed, and 7 days out of 7, and even if you think you can get by on less sleep. You probably can, and you might wake up earlier, which is a good thing, now you are awake and rested, go do some fun or productive stuff and discover the power of waking up without an alarm clock. It will change your life. Promise.", "I'm glad you realised at such a young age. You have time. So instead of wallowing in self pity, it's better to redirect your thoughts into doing something productive.\nIs there anything you love to do?\nIs there anything that you are good at doing? It could be coding or something as small as cooking, driving, cleaning, organizing, leading, fundraising anything. Even if you are good at making crafts and DIY stuff, you can get through mahn.\nOnce you know what you're good at, you can monetize it by improving upon it and teaching others in how to do it!\nWish you the best of luck!!🙌", "Honestly 1.5 hours of driving is too far! I commuted an hour to school each way if driving, it was 2 or 2.5 each way by train but I made it. So anyway probably a good call you quit that job, now you can find something closer and not waste such a percentage of you life driving. (Just 10 minutes a day is a work week at the end of the year!)\n\nI'm 33 now, and so can definitely say you can change sooo much in 10 years! You're just starting out.", "Try this, rewrite your post except change all the negatives to positives, and include some punctuation where you naturally take a breath, rather than rambling all your thoughts in one burst. It will actually change your neuropathways a little. Then you can take your positive statement, and write it down on paper, which uses 100s of little micro movements and changes your brain wiring more. \n\nYou gotta understand you have to physically jolt yourself off into a different track. Even military people have a drill sergeant who is physically beating them and abusing them to get their training in. You have to do the same to yourself. Look at it this way, if you're at rock bottom you're basically invincible. Nothing can hurt you anymore. So you can just start crushing it. Get a small win (write your positive statement even if it's \"lying\") and start drilling your positive statements. \n\nEveryone goes through a \"dip\" and if you look around, that's almost everyone right now, which means you're about to go to the next level. The question is just how epic of a comeback do you wanna have? \n\nPlease don't respond to these comments like arguing why you're fucked though. Genuinely don't do it, no one gives a fuck. Just offering a strategy for how you can take your situation and flip it.", "Brother I’ll say this , life sucks, but you have too pick your suck. Your not failing your learning, start taking action , look up what you need too get your license in your state, self improve yourself by , reading , mediation and staying of social media because it’s super unrealistic they’re trying to sell your lifestyle remember. You got this brother seriously, I’m in the same shoes as you I thought I was worthless and wasn’t worth anything but it’s not that I’m worthless it’s what I was putting in my head and what I was doing in my day too day, your gonna be uncomfortable when you do something but remember why your doing. I love you brother we got this, dm if you wanna talk more", "Bro… *you’re 23!* You’re still a pup and you have a lot more time than you think. You need to reassess your situation(s). Maybe rethink you job, take the time you have and learn to drive, and stop comparing yourself to others because they’re *not you*. My life truly didn’t start until I was 38 getting married and having kids. That gave me more purpose than I’d ever had. \n\nFind your purpose at the moment… then pursue.", "You aren’t pathetic or lazy. It’s smart to not commute 3 hours a day. Work will always be work, but you don’t have to put yourself through something where you’re this depressed. Give yourself space and time to figure it out.", "There are two kind of labor: slavery that you cant enjoy and slavery that you can.\n\nAside from money, your job should give you something you want to achieve. Like, flight to a pilot, heroism to a firefighter, patriotism to a soldier, excitement to a scientist… To become the best in a field that matters to you, sometimes jobs are nothing but a starting point which should evolve into investments and entrepreneurship after the skills and knowledge comes.\n\nSounds like you have choosed a path without any motive. Maybe you should start from finding what matters to you in this life then you shall live solely for it, with discipline and an open heart which will embrace all the possibilities that you may like or not.\n\n\nAlso your job sounds shitty. Tbh its an improvement for you to quit, good start, keep going.", "You’ve already done the hardest step… reaching out. Now take another small step. Then another one. Do something you used to love to do, that you haven’t done in a long time. Take a walk. Read a book or a comic. Visit a friend or family member. Make art. Go to the park. Go visit an animal shelter and take a dog outside for play time. Go to a movie. Finish that little project you started last summer. Visit an old folks home and have a conversation with someone you would never have met if you hadn’t gone there. Volunteer! It’s amazing how much giving your time for something good will come back with gratitude, tenfold. It’s amazing how accomplishing just one small thing will give you the boost you need to do another - small thing. \n\nDepression sucks. It’ll hold you back and whisper in your ear. Don’t give it control. If you don’t have access to therapy, you’ll have to motivate yourself instead.\n\nYou’re young. Your life matters. You can learn to drive next year. You can meet the love of your life in five years. Doesn’t matter when… Doesn’t have to be today, it just matters that you start moving forward. Make the decision to wake up tomorrow and do something different. Don’t stay stuck in your rut with the little voice telling you you’re “this - that - and the other thing”. \n\nYou’ve got this! If you want it - and want it you do. This post proves it. Now prove it to yourself. ❤️‍🩹", "You're exactly like me when I was 25 years old with undiagnosed ADHD.\n\nI was diagnosed 2 years ago, now my car is fully paid, I own 2 properties, and I was promoted early of this year.\n\nPlease get help, you can start with online therapy first. Don't be shy when it comes to your mental health.", "I was in your shoes. Im the same age as you. I had a checklist of important things I needed to do and i just did that. It helped me organize and not overwhelm me with the daunting task of living. Just focus on one thing at a time. Get that drivers license too. I got mine last year recently only. All my friends got it when they were in highschool. 17 or 18. If anything, start rushing now before its too late. ANY experience is better than no experience.", "Whats the point thinking like this? You just have to get up and go, push yourself.", "Get rid of the 1.5 hour commute and find an activity to do after work. \n\nAt 23, you are working to gain experience, but you are still learning. Quit thinking too long term, and focus on padding the resume and getting experience. Better jobs, opportunities, situations will come. \n\nTalk to people at work, build relationships. Having that sense of belonging helps, but it won’t solve it. \n\nTalk to a mental health therapist. \n\nThe last thing is FIRE - have a plan to retire early. Stick to it. You want to get to the point where you realize, hey I don’t need this job any more. It’s at that point where job satisfaction typically is at its zenith. \n\nThere isn’t one thing that is going to magically change this, but various changes can make a difference.", "You have so much life left to live my friend! Invest in yourself. Exercise helped me when I was younger considerably... hit the gym and get fit. It will boost your confidence. Look for a new job in a different field.  What are you good at? \nTry to really be comfortable in your own skin. It took me 30 years to become truly comfortable with who I am as a person and since then life changed for me. You'll always have tough times but it's in our nature to dust ourselves off and try again or search for change. \n\nGood luck!", "Read \"can't hurt me\" by david goggins", "What bout a bullet?", "“When life is hard you need to be harder”\n\nHere is my advice:\n- get a new job. Traveling 3 hours a day is a lot. \n- if you feel unattractive because you are overweight, try to lose weight. Water fasting and/or keto should make you feel better and give you more energy. There are a lot of hormones associated with low quality food and excess pounds that can screw up your mood. \n- don’t smoke weed or drink alcohol. Won’t help your mood or motivation. \n- exercise will bring up your mood, but it should be something you enjoy. \n- practice being happy. Think of happiness as a skill, like riding a bike. You need to practice it to master it. It will feel weird and pathetic at first but eventually it should hold. \n- try religion. Prayer and belief in higher powers tends to increase happiness.\n- your parents aren’t your responsibility. You are their responsibility. Parents should do everything for their children, not the other way around. \n- stop whining\n- get some sleep", "The religion part is bullshit. Most of your \"advices\" are bs. When someone has no energy to do something, telling them to do things won't do shit. You only do more harm than good. And \"stop whining\"? \"Stop being sick\"? I hope you only pray to your gawd for cure whenever you're sick.", "[removed]", "Andrew Tate from temu be like", "**Rule 1 - Be Positive**\n\nBe polite and courteous to each other. Do not be mean, insulting or disrespectful to any other user on this subreddit.\n\nDo not harass or annoy others in any way. It may land you in legal trouble, and the mods cannot help you if it falls to that.\n\nDo not catfish. Catfishing is the luring of somebody into an online friendship through a fake online persona. This includes any lying or deceit.\n\nWe wish to keep this subreddit a civil environment for all.", "Yeah you are still 23 man! Look at my story, i am 24M, i graduated as a petroleum engineer 2 years ago, still didn’t work in my field. I got a job abroad from my country to work in a plastics field. 1 year and a half and i quit! Now i am aiming for 2 things, completing my masters degree and working on my business idea (but i need business partners to help). \n\nSo its really normal, follow what you like", "Buy a membership at a Brazilian jiu jitsu gym. About 10 years from now, you might have a shot at a black belt in jiu jitsu.", "[removed]", "**Rule 1 - Be Positive**\n\nBe polite and courteous to each other. Do not be mean, insulting or disrespectful to any other user on this subreddit.\n\nDo not harass or annoy others in any way. It may land you in legal trouble, and the mods cannot help you if it falls to that.\n\nDo not catfish. Catfishing is the luring of somebody into an online friendship through a fake online persona. This includes any lying or deceit.\n\nWe wish to keep this subreddit a civil environment for all.", "Just curious if you have any efficient routines, habits, or tips for increasing your productivity at work using Outlook.\r  \n", "Hey fellas, I'm a 21M who works during the afternoon and go to university during the night. I know my circumstances are pretty alright, since I have some friends that work the entire day and go to uni after, but lately I'm feeling kinda unmotivated. Basically, I want to do so many things during the morning, I want to study, do homework, work out, play videogames, but sometimes I get so lost in these options that I end up doing nothing.\n\nHonestly, after a long day of doing tasks, studying, dealing with people that get on my nerves and so on I don't want to do nothing next day But we go on haha. \n\nDoes anyone live/lived this lifestyle? What can I do in order to mainten a proper work/study/fun routine?", "When do you sleep? :p People generally are not built to be 'on' 24/7, it's not because you have friends that have crazy busy schedules that your situation is ok. Make some time for recreational activities and accept you can't do everything you want in life. Set some priorities", "Preparing for an exam or doing any lenghty activity that will benefit me in the long run is difficult\n\nIs it just me, or does anyone else feel a knot in their stomach when thinking about starting to prepare for exam/ bigger assignment or any other lengthy activity \n( A goal you can't reach in a day)? It's like a sense of dread that makes me want to avoid what I need to do.  It's really weird, since I know it will benefit me. ", "So I have a big problem staying productive throughout the day. I usually get up early and get most of my stuff done before school but I’m really struggling with waking up that early right now. I have a list of things I usually wanna get done in a day but by the end of the school day I just blow it off. Do yall have any tips on staying productive or even any tips on waking up early?", "", "Excellent post.", "I'm a phone addict seeking an iOS app to help me quit social media. \n\nIt should lock me out until a timer expires, and ideally, block individual apps too. \n\nWhile Apple's Screen Time is an option, it's easily bypassed. \n\nI need an app that I cannot bypass whatsoever (turning off phone etc..) do not recommend it otherwise \n\nThank you! ", "Share your morning routine/ habits/ techniques to when you wake up! Trying to get some good morning routine in and would love to hear from you on what worked for you!", "Following. I wake up at the last minute possible and rush to get ready and leave for work. Trying to change that 😫😫", "Me", "Wake up at 5:30. Strong cup of coffee.\n\nBrush + Snack.\n\nGym at 6. \n\nBack by 7:30. Protein shake + breakfast. \n\nCollege at 8 am. That's basically every morning.", "Fucking chad", "You don't shave or shower?", "haha I'm actually trying to change that since I can't get enough sleep. Planning on going to gym at 4pm after college, so I can wake up at 7:30", "shower after gym and shave on sundays", "Wake up at 5:30\n\nStretch and drink a little water while still in bed\n\nGo to the bathroom/brush teeth/wash face\n\nDo makeup and hair and get dressed\n\nWake up daughter and get her ready\n\nEat breakfast together\n\nGet lunches made\n\nOut the house by 7:00 to take her to preschool while drinking my coffee on the commute\n\nWork at 7:30\n\nSince I work pretty early, I prioritize my workout after work at the gym. Not the most productive but I get a lot done after work", "Wake up at 1 pm go back to sleep, wake up again at 9 pm and then sleep till 1 pm again", "I can say you are not happy with the things going on in your life", "Who are you ?\nI can say you are not happy with your life", "Oo, I have a different take!  For me to feel productive throughout the day, I need to have a slow morning. I wake up, make coffee and read in bed for at least half an hour (i’m a huge bookworm). I love this start :)", "I love this and 100% agree. My mornings aren’t always like this, but I really do enjoy relaxing in the morning and then doing everything else a little later (unless it’s a work day).", "I wake up at 6am every weekday morning. I tend to sleep in over the weekends, I know I should be waking up at the same time everyday ideally, but sleeping in over the weekend is a good compromise I think.\n\nI’ll hit a workout. If it’s a Monday, Wednesday, or a Friday then I’m in the gym. I’ll get to the gym around 7am and be done by 8am. If it’s a Tuesday or a Thursday, it’ll be a run. Again, running at 7 and back by 8.\n\nBetween 8 and 8:45 I’m getting ready. I’ll down a protein shake, shower, get changed etc etc etc.\n\n8:45 I’m at my desk, ready to work.", "5am wake up, have a cry, put my big boy pants on, sit at the table looking into space brainstorming get rich quick schemes, realise im running late, brush teeth, get in the car, drive to work", "My morning routine is unbeatable!\n\nWAKE UP 5:30...\n\nImmediately brush my stinking teeth... No one should have to endure my morning breath, it is of great shame and should be dealt with as soon as possible.\n\nDrink Lime juice with ginger and salt... Disgusting... Reminds me that life is pain... You have to do something hard upon waking to remind yourself of this truth... Doing this makes me grateful for all of the time that I'm not drinking lime ginger salt water... This gives me an edge in any pursuit on this Earth...\n\nDrink 800ml water.... Hydrate to the max... How can you be your best if you are not hydrated? Answer: You can't... I get myself more hydrated than a fish...  \n\n\nDeep work for 90 minutes on the PC... The early morning is when my mind is most alert and powerful, I play 4d chess with reality, making insane money making plays and moves, while everyone else is still in bed (pathetic)...  \n\n\nAfter this I have breakfast, it's oatmeal with fruit and protein powder. It's extremely bland... I don't need flavour, I need results... I also take my vitamins and some omega 3s, because I am worth it...  \n\n\nI then make myself a decaf coffee and drink it outside for 10 minutes as I absorb the morning suns rays into my bloodstream.... At this point I'm the most awake and alert being on Earth, no caffeine required...  \n\n\n90 minutes more deep work... That's 3 hours of work to start off the day... Reality as we know it shatters under the weight of my many keypresses...  \n\n\nGYM \n\nRUN\n\nYOGA\n\nSHOWER  \n\n\nI'm a machine, and this is my morning routine...", "I’m taking it as sarcasm and I audibly laughed \n\nIf it is not … you have quite a routine…\n\nThe world cannot stop you …", "Add a little flavor sometimes lol. Cinnamon, nutmeg, vanilla extract, maple syrup, splash of salt!", "But he gets enough salt with his lime juice! BLOOD PRESSURE!!!", "Getting up at 4AM, beginning by drinking a glass of water.\n\nGetting some snacks and tea ready (I'm not a coffee drinker), and also packing a lunch in case it wasn't prepared last night.\n\nAfter I wash up (face, teeth, etc.), I'm somewhat prepared to leave.\n\nI take my time, I am leaving the house at 4:50, so I have time for everything.\n\nMeanwhile I am listening to some music, I can't start the day without it.", "Wake up. Shower. Coffee. Kiss wife. Sit down at desk to work. (Remote worker)", "Wake up 6am, shower, workout 30 mins (core and glutes) with coffee, walk dog for about 45 mins and then come home get dressed to go to work for 9am. I usually eat breakfast at work as I'm not hungry until 9ish. Throughout all this I am drinking lots of water and good tunes!", "Wake up.\n\nCoffee.\n\nShit.\n\n15mins daily full body mobility routine.\n\nWork.\n\nThat's my morning 7 days a week \n\n(work is replaced with studies of programming using codecademy on the weekend)", "Wake up at 6am, medicate and caffeinate. Contemplate why I am awake so early until 8. Realise I have to get myself and kid out the door. Race like the wind, usually late. Eat dry cheerios on the way to work. Promise myself to be more organised tomorrow, then laugh to myself as I know that’s total BS.", "So I am a working from home (most days) mom of 3 older children, I think that may be valuable, as my routine has looked wildly different based on what season of life I am in. I usually wake up a bit before 5 am.\n\n~10 minutes, Wake up, rest for a moment. Grab my tablet, look at email, and my mobile game. \n\n~15 minutes, Up, stretch to the sky, love my dog & let him outside, feed dog when he gets back in, do 10 minutes of morning stretching with YouTube, ending with a few minutes of mindfulness.\n\n~10 minutes, Start making morning latte, unload dishwasher. \n\n~30 minutes, Enjoy latte, Reddit, mobile game. \n\n~10 minutes, make kid lunches, make sure kids all up & launching for the day. \n\n~55 minutes, Start a morning checklist, which goes like this — start a load of laundry; swish and swipe all 3 toilets, change out toilet paper and empty trash; vacuum the chinchilla’s cage & love on our chin; look at my Outlook calendar & planner, brain dump; gather dinner ingredients & finalize plan to get dinner on the table; tidy up beds; oral care, shower, get dressed, do hair, light make-up\n\n~ 15 minutes walk the dog \n\nStart work for the day!", "Sleeps by 8pm.\n\nWakes up by 4am.\n\nBlack coffee by 4.30am.\n\nWorkout by 5am.\n\nWake infant daughter up by 5.30am.\n\nCook breakfast by 5.45am.\n\nFeed daughter breakfast by 6am.\n\nEat breakfast by 6.15am.\n\nShower by 6.30am.\n\nLeave for work by 7am.\n\nIn office by 7.40am.\n\n...repeat for 5 working days.", "Wake up at 5. Shower. Go to work", "Get up at around 7, hot water bottle, tea, wordle, Read non-fiction, read fiction, sometimes meditate, get ready, quick work email check (I am 6-9 hours ahead of everyone I work with, so it’s just to see if anything urgent happened over night), get ready, gym. \n\nOn the way or before unload dishwasher, throw in laundry. \n\nShower at gym. Go to bakery get some bread for dinner. \n\nCome back home. Put laundry in dryer.\n\nI mostly don’t at before lunch.", "I don't really care.\n\nThe most important is the \"end-of-the-day-routine\" - because for me is more important how I sleep that how I drink my coffee.", "Walk up at 4am\nPray and meditate.\nDrink a glass of water\nWalk to gym @ 430am\nGym @ 5am to 615 or 630 am\nHouse by 7 am\nShower and prep for work\nGo to work @ 8am", "I have two kids, and there are different things for different days. So I have a checklist for each day so when I wake up, I know exactly what needs to be done, down to the minute stuff like drink coffee and brush my teeth, that way, I know I've done everything I need to for my kids to get off to school and me to work on time.", "Wake up at 5.30am, chug a bottle of water, medicate then meditate. \n\nGet dressed/presentable, eat a bowl of granola then head to gym for 6.15am. \n\nLift heavy things or try to move fast until 7.15/7.30am. Short sauna session where I read a book then shower. \n\nHome by 8/8.15am. Have a protein shake whilst firing up the computer to start my workday (I WFH).", "Wake up, meds, chug a glass of water, take vitamins, start coffee, cold shower or ice bath, skincare, brush, floss, check email and work related apps over coffee, do one thing off my weekly chores that need doing, unload the dishwasher, minimum 10 minutes yoga, min. 5 minutes wim hof breath work, minimum 5 minutes meditation, minimum 10 minutes journaling/prioritizing goals for the day, minimum 30 minutes reading, tidy the house, make the bed, get ready for the day (hair, makeup etc), weigh myself, and I only check my phone when then I’m done/out the door. Takes me about 1 hour 45 each morning. That way when i have the extra time, I can extend whatever thing I usually put minimums on to my liking. (They’re minimums because I could waste the day doing them haha).", "Coffee. Pills. Coffee. Back to bed because fuck it.  Under the blanket is fine. I am 43. This feels wrong but who cares. I exit the imaginary tent. Avoid smoking but a diet coke may be nice\nAlbeit it is 500/1 of my rent i decided to drink one and call it a morning. Exit to my studio where i toil relentlessly on things people will not care and probably the client will only give 1/3 of what i asked, in a super late fashion. Sorry i got carried away.", "Waste of your life. Think about change.", "Im fortythree yr old 3rd world dweller. Live in a rut, die in a rut. It is a little too late for me", "That is a limiting belief. I'm way older than you and starting a completely new life: new business, new country.\n\nRead some books to start your thinking and motivation. I can heartily recommend: The 7 Habits of Highly Effective People - Stephen Covey\n\nAnd here's a thread with a myriad of books that may be of interest for you:\n\n[https://www.reddit.com/r/productivity/comments/18f765q/what\\_books\\_and\\_courses\\_would\\_you\\_recommend\\_to/](https://www.reddit.com/r/productivity/comments/18f765q/what_books_and_courses_would_you_recommend_to/)", "I'm extremely dumb, i like having the reminders but microsoft todo is kinda janky with repeat alarms showing as past while as not working anymore.\n\nEverything seems to be for working in a group people or something convoluted.\n\nI just want a simple daily 'if my computer clock hits x then say y' list, what is the best for this that isn't mobile only?\n\nIf i could code i'd make a darn batch script with simple timers that has a popup if checking once every minute matches any listed time, i'm talking dead simple.", "A calendar?", "This group is a place help each other share our experiences of applying mental models to solve problems in life - no matter how small or big. ", "Applying models - **mvp** , **premature-optimization** - to try and finish typing up my resume in a reasonable time. I have a tendency to over-optimize and take too long to finish tasks. I end up internet researching for too long - without focusing on delivering the the end product.\n\npls share your experiences and thoughts.\n\nthe **fallacy** of wanting to be a **perfectionist** - ends up making us highly inefficient\n\n**occum's razor** sometimes the simplest solution is the best  \nand for me its to simple open a doc and write down my resume - with zero research", "I have an intermediate-advanced English level, but I prefer to stick with easier books, without many fancy words. \n\nCan you recommend Novels for non-English speakers?", "If you're only just starting to get into the habit of reading books in English - I'd suggest starting with simpler books/comics. a couple of recommendations:\n\ntwo simple and quick reads books with powerful subtext\n- The Little Prince (translated)\n- The Boy and the Fox, the mole, and the Horse (graphic)\n\nClassic literature without \"flowery\" language:\n- The Old Man and the Sea\n- Animal Farm", "~~I'd suggest you work out what your favourite genre is, then go to Amazon Kindle e-store, search for your genre, find something you like the sound of, then read the reviews to get an idea of the reading level (or start off in the Young Adult classification).~~\n\n~~You may as well read something you're into, it will make the experience so much more enjoyable and hopefully means you end up reading significantly more than you would have otherwise.~~\n\nEdit: Ignore everything above.  Just do a search on Amazon for \"Fiction for ESL\" ... there's 2000 plus titles listed.  All written and/or curated for English as Second Language students.  \n\nFor example:\n\n> *Introducing \"[English Novels for ESL Students](https://www.amazon.com.au/English-Novels-for-ESL-Students/dp/B0C1XWLB83),\" an innovative series that brings classic English literature to life for language learners. Carefully curated for students looking to expand their vocabulary through authentic texts, this collection provides an immersive reading experience with gripping stories and engaging themes.*\n\n>*Each book is thoughtfully adapted to suit the language level and learning needs of ESL students, ensuring that readers can easily follow the plot while broadening their vocabulary and improving comprehension.*", "Midnight Library  \nTomorrow, and Tomorrow, and Tomorrow", "The Artemis Fowl series by Eoin Colfer", "I am not an organized person, but I love being productive. Recently went from 1 to 3 kids & I need to work on becoming more organized so things go smoothly day to day. Looking for a to do list app compatible with iOS. These are my wants and needs: \n\nNeeds: \n\n-Ability to schedule things on a calendar at a specific time/date\n\n-Ability to set reminders (multiple for one task preferred)\n\n-Ability to set time frame for how long a task will take to complete\n\n-Some kind of color or symbol grouping function \n\n-ability to check off completed tasks\n\nWants: \n\n-Free or freemium \n\n-Ability to create multiple lists or calendars  ", "I just useatlas.ai it has all of those minus time frame and it’s more of a computer app but I think their working on a imessage app too"]