[{"post_title": "[OT] Micro Monday: Amusement Park!", "post_url": "https://www.reddit.com/r/shortstories/comments/1btks5m/ot_micro_monday_amusement_park/", "post_main_text": "#Welcome to Micro Monday\n\nHello writers and welcome to Micro Monday! It’s time to sharpen those micro-fic skills. What is micro-fic, you ask? Micro-fiction is generally defined as a complete story (hook, plot, conflict, and some type of resolution) written in 300 words or less. For this exercise, it needs to be at least 100 words (no poetry).      \n\nHowever, less words doesn’t mean less of a story. The key to micro-fic is to make careful word and phrase choices so that you can paint a vivid picture for your reader. Less words means each word does more! You’re free to interpret the weekly constraints how you like as long as you follow the post and subreddit rules. **Please read the entire post before submitting.**  \n\n&nbsp;\n\n***\n         \n#Weekly Challenge \n\n**Prompt: Set your story at an [amusement park](https://storage.googleapis.com/pai-images/92aea52b3df54041b067ca361f3acf38.jpeg).**       \n**Bonus Constraint (10 pts):** Include the sentence - *\"There were worse ways to make a living.\"* **(You must include if/how you used it at the end of your story.**\n   \nThis week’s challenge is to set your story in an amusement park. You’re welcome to use the setting creatively (it’s encouraged!) as long as it is the main setting of your story. Be sure to **follow all post and sub rules**. The bonus constraint is encouraged but not required (you’re welcome to change the tense). You do not have to use the linked image.     \n\n ***   \n# Last Week: [Entanglement](https://www.reddit.com/r/shortstories/comments/1bhzopa/ot_micro_monday_tea_time/?sort=old)     \n- **Winner:** [“Tugged”](https://www.reddit.com/r/shortstories/comments/1bnsl7e/comment/kx0yeuo/?utm_source=share&utm_medium=web2x&context=3) by u/rudexvirus                                      \n    \n  \nYou can check out previous Micro Mondays [here](https://www.reddit.com/r/shortstories/wiki/micro/).    \n\n&nbsp;\n***\n\n#How To Participate\n\n- **Submit a story between 100-300 words in the comments below (no poetry) inspired by the prompt.** You have until **Sunday at 11:59pm EST**. Use [wordcounter.net](https://wordcounter.net/) to check your wordcount.\n\n- **Leave feedback on at least one other story by 3pm EST next Monday.** Only **actionable feedback** will be awarded points. See the ranking scale below for a breakdown on points.\n\n- **Nominate your favorite stories at the end of the week [using this form](https://docs.google.com/forms/d/e/1FAIpQLScXLibiH2uqd8sBTWaVLeQVjGRsnjE5kPdCS6AZfqCRVhzf2Q/viewform?usp=sf_link).** You have until **3pm EST** next Monday. *(Note: The form doesn’t open until Monday morning.)*\n\n###Additional Rules\n\n- **No pre-written content allowed.** Submitted stories should be written for this post. Micro serials are acceptable, but please keep in mind that each installment should be able to stand on its own and be understood without leaning on previous installments.\n\n- **Please follow all subreddit rules and be respectful and civil in all feedback and discussion.** We welcome writers of all skill levels and experience here; we’re all here to improve and sharpen our skills. You can find a list of [all sub rules here](https://www.reddit.com/r/shortstories/wiki/index/rules).  \n \n- **And most of all, be creative and have fun!** If you have any questions, feel free to ask them on the *stickied comment* on this thread or through modmail. \n\n&nbsp;\n***\n\n#Campfire \n- On **Mondays at 1pm EST,** I host a Campfire on our [Discord](https://discord.gg/writingprompts) server. We read the stories aloud and provide live feedback for those who are present. Come join us to read your own story and/or listen to the others! Everyone is welcome and we’d like to have you, we absolutely love new friends!\n\n&nbsp;\n***\n#How Rankings are Tallied\n\n**Note: There has been a change to the crit caps and points!**       \n \n**TASK** | **POINTS** | **ADDITIONAL NOTES**\n|:--:|:--:|:--:|:--:|:--:|:--:|\n| **Use of the Main Prompt/Constraint** | up to **50** pts | Requirements always provided with the weekly challenge\n| **Use of Bonus Constraint** | **10 - 15** pts |  (unless otherwise noted)\n| ***Actionable* Feedback** (one crit required) | up to **10** pts each (30 pt. max)  |  You’re always welcome to provide more crit, but points are capped at 30  \n| **Nominations your story receives** | **20** pts each | No cap\n| **Voting for others** | **10** pts | Don’t forget to vote before 2pm EST every week!    \n  \n*Note: Interacting with a story is not the same as feedback.*\n&nbsp;\n\n***                              \n***\n\n###Subreddit News   \n\n- Join [**our Discord**](https://discord.gg/writingprompts) to chat with authors, prompters, and readers! We hold several weekly Campfires, monthly Worldbuilding interviews, and other fun events!        \n\n- Explore your self-established world  every week on [**Serial Sunday**](https://redd.it/1btg3aj)!   \n\n- You can also post serials to r/Shortstories, outside of Serial Sunday. Check out [**this post**](https://www.reddit.com/r/shortstories/comments/m20mxf/ot_rshortstories_now_has_serials/) to learn more!  \n\n- Looking for more in-depth critique for a story? Check out our new sub [**r/WPCritique**](https://www.reddit.com/r/WPCritique/)!   \n***", "post_comments": [{"comment_author": "OldBayJ", "comment_text": "#Welcome to Micro Monday!\n\n- Top-level comments are for stories only.    \n\n- Feel free to make suggestions for future posts or ask questions on this stickied comment! I'd love to hear your ideas."}, {"comment_author": "ZachTheLitchKing", "comment_text": "Hay Bay!\n\nCould you have found a creepier amusement park picture that wasn't intentionally a horror image? xD  The coloration and clouds lend this image a very spooky quality that demands I look closer to find the intrinsic horror elements, but the closer I look the more normal it all looks.  Just...a bit messy and run down.  It feels more like a parking lot carnival than an amusement park with the energy it's putting off.\n\nGreat image! Can't wait to see what creepy stories we get this week :D"}, {"comment_author": "OldBayJ", "comment_text": "is that a challenge?? 🧐"}, {"comment_author": "ZachTheLitchKing", "comment_text": "[I wouldn't \\*dream\\* of challenging you](https://i.makeagif.com/media/2-02-2014/Cpc9og.gif)"}, {"comment_author": "OldBayJ", "comment_text": "🤣"}, {"comment_author": "JKHmattox", "comment_text": "[RO] One Night Only\n\nCaravans. It sounded like something from \"Lawrence of Arabia\" but there they were, parked however they liked, in the grass along the water’s perfect edge. I’ve spoken her language all my life but still haven’t a clue why things were said the way she would. \n\nMaybe it’s they drive on the wrong side of the road. No. It’s those damned roundabouts. Yes, that’s it; who builds a traffic circle in the middle of a freeway? Wait, wasn’t it a motorway, the A14; something like that.\n\nI guess it didn’t matter why, because whenever she spoke, there was nothing I could do but listen.\n\nWe met by chance, at a place named Fort St. George. Or was it The Waterman? It’s hard to remember details from those short hours spent amidst the bend upon the River Cam.\n\n“No… Edin-burgh,” she annunciated slowly in response to my butchered first attempt at the name of her childhood home.\n\n“Edin-burg,” I smiled back with a wink.\n\nWith a crooked grin she rolled her eyes, and led me toward the midway on the savior's green.\n\n“For as much as you guys love to talk, you should at least do it properly,” she responded with a chuckle.\n\nIt was 21:37 Greenwich Mean when our feet left the ground on an affixed vertical orbit into the sky. The remnant of the sun was an orange mess above the spires of stone and for a moment, I thought maybe, but only for a time.\n\nThe morning which followed was Monday, July the third, and work would wait for yet another day. The caravans were gone, as if they never were. Grass swayed gently in the cool breeze and I knew, I would never hear her voice again. I guess the question is, was she ever even there?\n\n "}, {"comment_author": "rudexvirus", "comment_text": "In the first paragraph we go from the parked caravans to “she” ans how she speaks with no introduction or proper shift for topics? \n\nI think a transition/ introduction to the characters would have been super helpful here, and /or maybe a seperate paragraph for that thought.\n\nThose sorts of squished paragraphs are my only real complaint here tho.  I especially liked the ambiguous/ questioning ending."}, {"comment_author": "LA_Vines", "comment_text": "I'm having a hard time determining where an amusement park is in this story, but I could very well be missing something.\n\nI think the setting here is far too specific for someone that isn't from this area. When you include such specific locations, it may help to include some general info as to the setting like: \"It's a rainy English day\" or something.\n\n  \nCould just be me, as an American. Maybe where you're talking about is a very well-known area?"}, {"comment_author": "JKHmattox", "comment_text": "If it helps, I was writing from the point of view of an American who found himself working in the UK last summer. The narrator wouldn't know what a \"caravan\" was in this context, until his companion for the evening told him. I may tweek the first paragraph some to make this more clear. Thanks for the feedback I appreciate it."}, {"comment_author": "JKHmattox", "comment_text": "I think those are all fair points. I was definitely going for ambiguity but you did pick up on the fact the story was set in England.\n\nThe story takes place at a weekend carnival, which seemed pretty common when I was over there. Yes, there are specific details which a person who lives in this area or went to college there would pick up on. I'm not sure how well know the area is nationally, but I had at least heard of city before I went.\n\nThank you for the feedback, I appreciate it."}, {"comment_author": "LA_Vines", "comment_text": "# Mickey\n\nThere are over six-thousand satellites orbiting Earth, each full of sensors and complex circuitry that are far outside the abilities of most people’s understanding. Harold was one of these people, only needing to understand enough to perform his day job, which also happened to be his night job. Harold was on call twenty-four-seven.\n\nThis balding, middle-aged man’s life was entirely confined to a bunker that was located in some secret location that not even Harold knew. His only clue being the word embroidered on his uniform: “Disney”. Harold’s job consisted solely of a large computer monitor and a single, large red button that was installed into the steel desk that occupied a large portion of the room. \n\nOccasionally—seemingly randomly—a loud buzzer would sound and satellite images showing factories, buildings, and sometimes even military bases would appear on the monitor. Thirty seconds would pass before that image was replaced with a red screen on which there was bold, black text:\n\n**“LAUNCH?”**\n\nAfter which, Harold was meant to promptly press that large button and watch his target be quickly replaced with a large mushroom cloud. He did this task very well. So well that he hardly even needed to be prompted to press that button anymore, giving it a quick *thwack* nearly the instant an image appeared on the screen. Harold grew quite bored of this after a few weeks, but there were worse ways to make a living. One day, however, the displayed target made him take pause; a huge, sprawling complex of rollercoasters and amusement rides took up the view of the monitor. Harold had just enough time to make out the image of a large, cartoon mouse statue before the prompt took over his screen:\n\n**“LAUNCH?”**\n\nHarold pressed the button and was atomized before he even heard the explosion.\n\n\n\n\\[300 Words\\]\n\nBonus Constraint:\n\n“Harold grew quite bored of this after a few weeks, but **there were worse ways of making a living**.”"}, {"comment_author": "rudexvirus", "comment_text": "\n>  only needing to understand enough to perform his day job, which also happened to be his night job. Harold was on call twenty-four-seven.\n\nI was very briefly going to make a comment about the day job being cuttable, but then I finished the sentence lol. I love this bit \n\n> This balding, middle-aged\n\nThis usually reads as present tense; consider a way to rephrase?\n\nThis story gave me big Lost vibes with the computer room, and I enjoyed that about it. the narrator voice was strong and fun. Well done <3"}, {"comment_author": "rudexvirus", "comment_text": "\n#Upon Their Final Breath\n\n*** \n\nAt the edge of town lives an amusement park.  It is a place with carnival games, larger-than-life rides, and a footpath full of trash. Maybe it was bigger at one point in its life, and at another, it was a simple carnival. \n\nInside the park lives a cloud of fog that lays low to the ground. A hungry cloud that moved but doesn't hunt. It doesn't shimmy across the land to seek its prey, but it is happy when sustenance comes along.\n\nIn the houses live five hundred people who never question the fact that the rides have always been shut down. People who were never told to fear that prowling cloud. They walk inside,  explore, and see what all the fuss might have been about. \n\nThey never think about the ones that didn't make it out, for the people don’t keep history very well.\n\nThree friends dress in black and steal flashlights from their parents. Desperate for adventure, they walk into the cloud on a night that it's awake—exploring a haunted place like a rite of passage to true adulthood. \n\n The park sits quietly and watches—the Ferris wheel lying out of place but tall and aware. A monitor that seeks to archive the fog's history and those it consumes.\n\nThe seats squeak from high up in the air, but the friends ignore the warnings. They talk and laugh and carry on,  systematically waking up the park. Step by step, they move deeper into the secret hunter's land. \n\nNever knowing what the fog is supposed to do, they ignore it as it grows. They breathe in still, without protection, as it crawls up their necks and covers their faces. \n\nMaybe they notice then, but it's too late to scream as the fog thickens and explores their lungs.\n\n(297 words)"}, {"comment_author": "LA_Vines", "comment_text": ">...they walk into the cloud on a night that it's awake...\n\nI feel that this doesn't add much to the story since we already know the cloud is alive in a sense. 300 words is a tight constraint and I think these words could have been used better elsewhere."}, {"comment_author": "rudexvirus", "comment_text": "Ohhh that's a good point  <3\n\nI'll see if I can edit it before deadline to make better use of the words there"}, {"comment_author": "MaxStickies", "comment_text": "# Mascot Misery\n\nThe phrase “there are worse ways to make a living” was all that got Marcus through most days. His world was a cacophony of screaming kids and the clattering machinery of the rides. Were he a rare visitor to Funzone Prime, he could likely bear it; but not as it was his whole existence.\n\nThat suit worsened things though. The Alien was a bulky figure, so to represent him, it meant donning an outfit a stifling twenty centimetres thick. It was July when Marcus found himself once more in the entrance plaza, handing out leaflets to excited children and their exhausted parents. He wobbled around, danced, hugged a kid now and then. Same old routine.\n\nAnd it was *warm*. Marcus got sweat in all the worst places, his suit preventing him from scratching his myriad itches. The whole situation reminded him of his request to management for fans to be installed, yet no air flowed over his body. They gave him a bottle of water, which he drank deeply from, but it was soon to run out. Yeah, Marcus was having a really bad day.\n\nThe worst of it, to his mind, was the tingling on his leg. It started at noon, and he figured it to be that the suit was too tight. Except that the tingling was travelling *up* his leg. He felt six individual points against his skin. And then it occurred to him. He tore off The Alien’s head, shook off the torso, but by then it was too late, he’d been stung. No scream or yelp escaped his lips, for his anger overwhelmed the pain. All Marcus did was trudge from the park, still wearing those costume legs, the bee or wasp or whatever it was still inside them.\n\nHe never returned to Funzone Prime.\n\n---------------------------------------------------------------------------------------------------------------------------------\n\nWC: 300\n\nConstraint: Included in the first sentence.\n\nCrit and feedback are welcome."}, {"comment_author": "ZachTheLitchKing", "comment_text": "Howdy Max!\n\nOh dear, the miserable mascot in an amusement park?  I already feel bad for whomever is about to suffer the hands of angry parents and irate children.\n\nCalled it:\n\n> His world was a cacophony of screaming kids\n\nMarcus is a *mood*.  I can just barely bear theme parks when I'm dragged to them.  Ugh this whole thing is giving me anxiety of a sort xD  You're capturing the tortuous, downtrodden energy masterfully Max.\n\nMaxterfully!\n\nAs someone who's worn mascot costumes I commend Marcus for doing so in July.  I sure hope it was at least semi-modern, with an ice vest, camel pack, or even a hidden electric fan.\n\nOh never mind, the installation of fans was apparently denied or ignored.\n\nWow, if I found a bug of any sort inside anything I was wearing, I'd be arrested for indecent exposure within seconds xD  Kudos to Marcus for keeping it together long enough to leave to go somewhere private.\n\nGreat story max, you really captured not only the essence of working in such a place, but the true feeling of the layers and layers of horrible things until a straw breaks the proverbial camel's back.  In this case, the sting.\n\nGood words!"}, {"comment_author": "MaxStickies", "comment_text": "Thanks Zach, glad you like it :)"}, {"comment_author": "oliverjsn8", "comment_text": "*A Natural*\n\nCharles Blondin VI took a tentative step onto the tightrope hanging high over the empty stands. He felt the slight give of the rope beneath his thin leather shoes. The smell of roasting nuts rose through the air filling his lungs with each breath he took. Shouts of excitement filtered through the big top tent from the rides outside.\n\nHelpless to stop himself, he looked down. There was no net and more than 100 feet to go.\n\nOnly 20 or so feet from the start, Charles felt the center of gravity move to his left, so he shifted right. \n\n‘Left foot, right foot, left foot, pause-,’ he muttered to himself. \n\nThis time his center of gravity moved slightly right, so he shifted left. Suddenly his center shifted left and he corrected right. Too far!\n\nTime seemed to slow as he saw the clowns rush over, buckets and mops in hand. The ground rushed to meet him.\n\n**Splat**\n\nThe ringleader shook his head. “Charles's autobiography said he was a natural, that he was born for the tightrope. I’m starting to think he was a liar,” the ringleader murmured while making a few notes on his clipboard.\n\nA few minutes later, the mess was cleaned up. \n\n“Bring in the next clone!” shouted the ringleader.\n\nCharles Blondin VII took a tentative step out onto the tightrope."}, {"comment_author": "Pakonab", "comment_text": "What a delightfully disturbing story! I love that cloning is being used to get a tight rope performer of all things. \n\nIn the paragraph \n\n“Time seamed to slow as he saw the clowns rush over, buckets and mops in hand. The ground rushed up to meet him.”\n\nIt feels a little clunky and disjointed. I think it would read smoother with one idea than the other. Like maybe\n\nTimed slowed as the ground rushed up to him. The last thing he saw was the clowns rushing in with buckets and mops.\n\nAll together really enjoyed the story.\n\nGreat words!!"}, {"comment_author": "Peter_Palmer_", "comment_text": "# The security guard\n\nThe kids placed a ladder against the fence and threw a blanket over the spikes on top. One after the other, they jumped over and immediately marched away like a group of well-organized criminals on a mission. First destination: the biggest roller coaster.\n\nThe carts rested at the bottom. The biggest kid approached the operator’s booth.\n\nIt was locked. He shook the door but it didn’t budge. Angrily, he kicked the door and then gave up. They didn’t plan beyond getting into the park. Some began pushing the carts itself. As if they’d manage to get it moving, while hooked on a long steel chain.\n\nAfter their fruitless attempts, they became bolder. Two walked on the tracks, the other two climbed on top of Super Stian’s statue, which doubled as a bin.\n\nSeeing them with the park’s statue gave Jeffrey an idea. A look at live feed of the storage room, confirmed his thoughts. He made his way over. All the way in the back stood an old costume of Super Stian, a left-over from a time that mascots were pure horror rather than wholesome.\n\nHe quickly changed, called the police to let them know about a break-in, but stressed that they didn’t need to hurry, as everything was safe. The security cameras were streamed to his phone and he used it to locate the kids.\n\nUnder cover of the night, he sneaked up on them. With a roar he jumped from the bushes.\n\nThe boys screamed, then ran all the way back to their ladder …\n\n… only to realize that they didn’t think about how to get back out. Meanwhile Jeffrey chased them and grinned as the boys pissed their pants. There were worse ways to make a living than being a security guard.\n\nWC: 299 (with title)\n\nI used the sentence of the bonus prompt as the last sentence of my story."}, {"comment_author": "MaxStickies", "comment_text": "Hi Tiphiene, like the story! I can feel the frustration of the security guard of seeing the kids clambering over and possibly damaging the equipment, and endangering themselves too. I like the figurative descriptions of movement in this story, like \"immediately marched away like a group of well-organized criminals on a mission.\", it really helps to visualise things.\n\nFor crit, I think there are a few too many short sentences: parts like \"It was locked. He shook the door but it didn’t budge. Angrily, he kicked the door and then gave up. They didn’t plan beyond getting into the park.\" make the action feel a bit blocky and not very fluid, so perhaps you could try combining some of them into larger sentences? Also, I don't really get an idea of what Super Stian looks like, so some brief descriptors would I think enhance the idea of it being a scary costume.\n\nAnyway, that's all I can see. Good words!"}, {"comment_author": "Dependent-Engine6882", "comment_text": "# **It Could Be Worse**\n\n## <Slice of life>\n\n—\n\nWatching people come and go, Kim absent-mindedly nibbled on the sugar- and cinnamon-coated beignet she got from Ramona’s stand.\n\nAfter several months of endless rain and freezing cold, the sun had finally come out from behind the thick, dark gray clouds. It brought along singing birds, flowers of all shapes and colors, and lots of joyful customers. Every spring, the amusement park where Kim had been working for the past four years came back to life. When the sun was out, it was as if the park had never closed its doors for months. It seemed like the games had never stopped working.\n\n“Four years,” she whispered, contemplating the crystals of sugar on her fingertips.\n\nKim was the kind of person whose smile could light up the whole place and spread happiness. However, even someone with a smile as bright and contagious as hers had their bad days. Days during which she couldn’t help but wonder how she, who had lots of dreams, ended up in this sad, old ticket office. Ones when she found herself wondering when her life got out of hand. Which misstep had cost her her ambitions.\n\n“Excuse me, miss.” A woman, probably in her mid-thirties, knocked against the scratched glass to get Kim’s attention.\n\nKim blinked several times before she wiped her hands against her worn-out Polo work shirt. “Yes, sorry.”\n\n“Could I have two tickets for kids, please?” The woman asked, smiling softly.\n\n“Of course!” Kim responded with her signature smile plastered on her face.\n\nAs she was printing the tickets, she overheard one of the kids say that her hair color was very cool. That comment alone chased away the dark thoughts clouding her sky.\n\n\"Guess **there are worse ways to make a living**.\" She beamed, dropping the money in the cash register.\n\n—\nWord count: 300 words\n\nNote: I included the sentence as a monologue at the end (It’s written in bold characters).\n\nThank you for reading my story, crits and feedback are always appreciated.\n\nr/AnEngineThatCanWrite"}, {"comment_author": "Pakonab", "comment_text": "Bad Luck\n\nThere were worse ways to make a living and Girn knew it. He had been fired from almost every position available to someone his age on the deep space cruiser Valhalla Eternal. Currently he runs the halo chambers in the amusement district and its aroma of funnel cake. \n\nGrin had a problem with bad luck. His last jobs had ended in an explosion and a soup bath. In the back of his mind Girn was starting to get a nagging feeling things had been too smooth. He remembered his boss's description of the simple job.\n\n“just let people in, load up the experience they want, and hit the shutdown button if they panic.”\n\nCurrently a group of kids explored a classic earth carnival and had been enjoying carnival games and carried balloons they won. As he watched them get on the Mary Go Round the sky started turning dark and the animals of the ride appeared more sinister than happy.\n\n“Oh no. Not again!” Girn said\n\nWith a pit forming in his stomach he watched as the ride started going faster and faster. The children began screaming in panic. Girn remembered the kill switch hit the button but standard to his existence it did nothing. He saw shadowy faceless figures now speeding up the ride on his display. He leapt up to yank open the door but it wouldn't budge. \n\nNaturally at this time his boss arrived. \n\n“What in Thor’s name is going on here?”\n\nHe stomped over in a rage and hit the shut off button.\n\n“Really Girn, pushing a button is too hard? Get out of my sight you’re fired!”\n\nIt would have been nice to keep that job more than a week Girn thought as he slunk away. Maybe I should try being a navigation intern?\n\n\nWC: 299\n\nBonus: used in opening line.\n\nAll C&C welcome!\nThanks for reading!"}, {"comment_author": "ZachTheLitchKing", "comment_text": "<Realistic Fiction>\n\n***Slowball***\n\nChelsea had bills to pay, and no one was hiring.  So she took odd jobs.  A carnival two towns over was setting up for two weeks outside of the firehouse offered twenty bucks an hour to sit at a booth and scam people out of money.  Different area code, no chance of being recognized.\n\nThere were worst ways to make a living.\n\n\"Step right up and take a shot,\" she said with zero enthusiasm as people walked by.  Occasionally a couple would stop, or a small family.  She knew the spiel; throw the ball in the bucket.  She had the advantage of being closer so her 'demo' always worked.  She also had a ball in the bucket already, so when she tossed hers it would hit that and not bounce so much.\n\nWhen it was time for the kid or the guy or whomever to try, she pulled both balls out.  No one asked why there were two in there, always assuming a past winner.  Then the sucker tossed, the ball hit the bottom of the plastic bucket, and bounced right out.\n\nTry again?  A dollar a try.  Five for three.  \n\nCute blonde woman walked up next.  Big arms and a baseball cap.  Softball player?  She tossed the ball underhand with a strong spin.  It rolled around and landed.\n\n*No way.*\n\n\"Congrats,\" Chelsea said, \"What prize do you want?\"\n\n\"Still got two throws,\" she said, tossing a second ball.  It stayed in as well.  She picked up the third, pulled out a marker, and wrote something on it.\n\n\"Here,\" she tossed it to Chelsea.  Catching it, the temp-carnie saw a phone number.  She grinned and considered calling it as the blonde walked away, until she noticed it was only seven digits.\n\n*Shit...what's the area code?*\n\n\\----------------  \nWC: 298/300  \nAll crit/feedback welcome!  \nr/TomesOfTheLitchKing\n\nNotes: Bonus Constraint - Chelsea thinks it as she considers the carnie work."}, {"comment_author": "LA_Vines", "comment_text": "> A carnival two towns over was setting up for two weeks outside of the firehouse was offering twenty bucks an hour to sit at a booth and scam people out of money.\n\nThis sentence could use some restructuring.\n\nCould try:\n\n>A carnival ***that was*** two towns over...\n\nBut then it could feel like we're using \"was\" to string together a run-on sentence. \"...for two weeks...\" could be removed to help with this."}, {"comment_author": "rudexvirus", "comment_text": "##super nitpicky things: \n\n> was offering\n\nI think you could probbbbbably get away with offered here?\n\n> adult with some kids.\n\nFamily?\n\n> when she tossed hers it would hit that and not bounce so much.\nI think you can cut “tossed hers it would hit…” because you basically show us all of that already w/ the other ball and also by telling us *why.* “it wouldn't bounce”\n\n***\n# overall \n\nOkay that was actually I have, even intending to do more lol. As always take them with a grain of salt. I adores the ending of this. From the number on the ball to the reminder that she's in another city. A++"}, {"comment_author": "ZachTheLitchKing", "comment_text": "Heya Rude!\n\nThank you for the feedback :D I switched up the \"offering\" and \"family\" like suggested but felt keeping the bounce explanation was still nicer.  \n\nI'm glad you like the ending <3  I sort of wrote this backwards from that and had to shuffle things around a couple of times to make it feel like a coherent story.\n\nTHanks for reading!"}]}, {"post_title": "[SerSun] Serial Sunday: Queen!", "post_url": "https://www.reddit.com/r/shortstories/comments/1byfc6v/sersun_serial_sunday_queen/", "post_main_text": "#Welcome to Serial Sunday!\n\nTo those brand new to the feature and those returning from last week, welcome! Do you have a self-established universe you’ve been writing or planning to write in? Do you have an idea for a world that’s been itching to get out? This is the perfect place to explore that. Each week, I post a theme to inspire you, along with a related image and song. You have 500 - 1000 words to write your installment. You can jump in at any time; writing for previous weeks’ is not necessary in order to join. After you’ve posted, come back and provide feedback for at least 1 other writer on the thread. Please be sure to read the entire post for a full list of rules.\n***\n#This Week’s Theme is Queen!       \n\n[**Image**](https://www.deviantart.com/cvanilda/art/A-bow-for-Scarlet-872508655)  | [**Song**](https://www.youtube.com/watch?v=XqBKrJnA8ZY)            \n    \n**Bonus Word List** (each included word is worth 5 pts) - **Please list which words you included at the end of your story.**                  \n- querulous                                \n- quaint                                                                                                   \n- quintessence                                                                                                                      \n- quickened         \n                                          \n         \nOriginally just meaning a woman monarch (often due to their marriage with a king), “queen” has grown over the years to accumulate many different shades of meaning. Regardless of whether it refers to honest-to-goodness royalty, prom queens, drag queens, or anything in between, queens are usually associated with femininity, beauty, and the power that comes with both. How does your “queen” react to this? Are they self-assured, confident in their femininity and strength? Do they flinch away, desperately clinging to a preconceived mask as they secretly crumble under the weight of their own or others’ expectations? What does your queen and how people react to them say about the concept of feminine power in your world? What sort of role model is your “queen”? Are the traits they embody considered “good”? Or do they become “evil” when viewed from the conventions of the world?      \n\n\nOr perhaps your characters might simply take a break and play chess, cards, or suddenly start rocking out to “Bohemian Rhapsody”. Now go have fun with it! *Blurb provided by u/wandering_cirrus.*       \n\nThese are just a few things to get you started. Remember, the theme should be present within the story in some way, but its interpretation is completely up to you. For the bonus words (not required), you may change the *tense*, but the base word should remain the same. **Please remember to follow all sub and post rules.**     \n\n[**Don’t forget to sign up for Saturday Campfire here!**](https://docs.google.com/forms/d/e/1FAIpQLSfQPPx4WCaDmjiCzboXfBJLixTV3picjXU1NsJmH05_OfEbgw/viewform?usp=sf_link) We start at 1pm EST and provide live feedback!\n \n***\n###Theme Schedule:\n                                                                                                                                                                                                                            \n- April 7 - Queen (this week)         \n- April 14 - Recovery    \n- April 21 - Struggle    \n\n      \n***        \n&nbsp; \n[**Previous Themes**](https://www.reddit.com/r/shortstories/wiki/sersun/)  |  [**Serial Index**](https://www.reddit.com/r/shortstories/wiki/serial_sunday_serials/)      \n&nbsp;\n***\n\n#Rankings for [Perception](https://www.reddit.com/r/shortstories/comments/1btg3aj/sersun_serial_sunday_perception/)       \n   \n- [**First**](https://www.reddit.com/r/shortstories/comments/1btg3aj/comment/kxnkgi4/?utm_source=share&utm_medium=web2x&context=3) - u/MeganBessel             \n- [**Second**](https://www.reddit.com/r/shortstories/comments/1btg3aj/comment/ky3fbhu/?utm_source=share&utm_medium=web2x&context=3) - u/OldBayJ         \n- [**Third**](https://www.reddit.com/r/shortstories/comments/1btg3aj/comment/kxoz94k/?utm_source=share&utm_medium=web2x&context=3) - u/ZachTheLitchKing            \n- [**Fourth**](https://www.reddit.com/r/shortstories/comments/1btg3aj/comment/kxt32uq/?utm_source=share&utm_medium=web2x&context=3) - u/AGuyLikeThat                \n- [**Fifth**](https://www.reddit.com/r/shortstories/comments/1btg3aj/comment/ky3o035/?utm_source=share&utm_medium=web2x&context=3) - u/Zetakh                          \n         \n\n\n***        \n#Rules & How to Participate\nPlease read and follow all the rules listed below. This feature has requirements for participation!     \n\n- **Submit a story inspired by the weekly theme, written by you and set in your *self-established* universe that is 500 - 1000 words. No fanfics and no content created or altered by AI.** (Use wordcounter.net to check your wordcount.) Stories should be posted as a top-level comment below. If you’re continuing an in-progress serial (not on Serial Sunday), please include links to your previous installments. \n\n- **Your chapter must be submitted by Saturday at 9:00am EST.** Late entries will be disqualified. All submissions should be given (at least) a *basic editing pass* before being posted!\n\n- **Begin your post with the name of your serial between triangle brackets** (e.g. <My Awesome Serial>). When our bot is back up and running, this will allow it to recognize your serial and add each chapter to the SerSun catalog. Do not include anything in the brackets you don’t want in your title. (Please note: You must use this same title every week.)\n\n- **Do not pre-write your serial.** You’re welcome to do outlining and planning for your serial, but chapters should not be pre-written. All submissions should be written for this post, specifically.\n\n- **Only one active serial per author at a time.** This does not apply to serials written outside of Serial Sunday. \n\n- **All Serial Sunday authors must leave feedback on at least one story on the thread each week.** The feedback should be **actionable** and also include something the author has done well. When you include something the author should improve on, provide an example! You have until **Saturday at 11:59pm EST** to post your feedback. (Submitting late is not an exception to this rule.)     \n\n- **Missing your feedback requirement two or more consecutive weeks will disqualify you from rankings and Campfire readings the following week.** If it becomes a habit, you may be asked to move your serial to the sub instead.\n\n- **Serials must abide by subreddit content rules.** You can view a [full list of rules here](https://www.reddit.com/r/shortstories/wiki/index/rules). If you’re ever unsure if your story would cross the line, please modmail and ask!\n\n&nbsp;\n***\n\n#Weekly Campfires & Voting:\n\n- **On Saturdays at 1pm EST, I host a Serial Sunday Campfire in our [Discord’s Voice Lounge](https://discord.gg/writingprompts).** Join us to read your story aloud, hear others, and exchange feedback. We have a great time! You can even come to just listen, if that’s more your speed. Grab the “Serial Sunday” role on the Discord to get notified before it starts. You can [sign up here](https://docs.google.com/forms/d/e/1FAIpQLSfQPPx4WCaDmjiCzboXfBJLixTV3picjXU1NsJmH05_OfEbgw/viewform?usp=sf_link)\n\n- **Nominations for your favorite stories can be submitted [with this form](https://docs.google.com/forms/d/e/1FAIpQLSerFCI5u_sDWUnlkuOO8h4vQVqdWLDfeK_gBEDWps7THlhgUw/viewform?usp=sf_link).** The form is open on Saturdays from 12:30pm to 11:59pm EST.  You do not have to participate to make nominations!\n\n- **Authors who complete their Serial Sunday serials with at least 12 installments, can host a SerialWorm in our Discord’s Voice Lounge, where you read aloud your finished and edited serials.** Celebrate your accomplishment! Authors are eligible for this only if they have followed the weekly feedback requirement (and all other post rules). Visit us on the Discord for more information.\n&nbsp;\n***\n\n#Ranking System\n\nWe have a new point system! Here is the point breakdown:\n\n**TASK** | **POINTS** | **ADDITIONAL NOTES**\n|:--:|:--:|:--:|:--:|:--:|:--:|\n| **Use of weekly theme** | **75** pts | Theme should be present, but the  interpretation is up to you!\n| **Including the bonus words** | **5** pts each (20 pts total) | This is a bonus challenge, and not required!\n| **Actionable Feedback** | up to **15** pts each (4 crit max)* |   This includes thread and campfire critiques. (You can always provide more crit, but the points are capped at 60.)\n| **Nominations your story receives** | **10 - 60 pts** | 1st place - **60**, 2nd place - **50**, 3rd place - **40**, 4th place - **30**, 5th place - **20** / Regular Nominations - **10**\n| **Voting for others** | **15** pts |    You can now vote for up to 10 stories each week!\n\n*You are still required to leave at least 1 actionable feedback comment on the thread every week that you submit. This should be more than one or two vague sentences, and should include at least one thing the author has done well and one thing that could be improved. **Please remember that interacting with a story is not the same as providing feedback.** *Low-effort crits will not receive credit*.   \n  \n**Looking for more on what actionable feedback is?** Check out [this guide on critiquing](https://www.reddit.com/r/WPCritique/wiki/how_to_critique).      \n\n&nbsp;\n***                                        \n***\n###Subreddit News\n\n- Join [**our Discord**](https://discord.gg/writingprompts) to chat with other authors and readers! We hold several **weekly Campfires**, monthly **World-Building interviews** and several other fun events! \n- Try your hand at micro-fic on [**Micro Monday**](https://redd.it/1btks5m)!    \n \n- You can now post serials to r/Shortstories, outside of Serial Sunday. Check out [**this post**](https://www.reddit.com/r/shortstories/comments/m20mxf/ot_rshortstories_now_has_serials/) to learn more!\n- Looking for critiques and feedback for your story? Check out [**r/WPCritique**](https://www.reddit.com/r/WPCritique/)!\n&nbsp;\n\n***\n***", "post_comments": [{"comment_author": "OldBayJ", "comment_text": "#Welcome to Serial Sunday!\n\n- All top-level comments must be serials.\n\n- Reply here to discuss the theme, suggest future themes, or talk about serial writing.\n\n- Please read the post rules carefully and follow the subreddit rules in any feedback."}, {"comment_author": "ZachTheLitchKing", "comment_text": "Hay Bay!\n\nKeeping it brief so I can recover for more WORD OFF\n\nAmazing image; love the regality of the central figure and the layered interpretations available for the various spectral figures around her.  Other queens?  Princesses she slew to get her crown?  Her gown *is* blood red and the world *is* black and white beyond her.  Who's to say?\n\nThe song is really a nice tune and melody.  The beat drop early on just after \"How to treat me like a Queen\" is chef-kiss to my musical tastes.  \n\nCan't wait to write for this in a couple of days!"}, {"comment_author": "Nate-Clone", "comment_text": "# I Am What You Eat\n\n[Chapter Index](https://www.reddit.com/user/Nate-Clone/comments/1bcb2t0/i_am_what_you_eat/)\n\n**Chapter 7 - Get-Oasis**\n\n\"...and when I finally lassoed the callous crooks, they begged for mercy, like all of El Waffelo's victims should!\"\n\n\"Great. Great story, dude.\" Develyn clapped with a face of disinterest.\n\nBasil had all but tuned out the waffle as he stared at the \"Cracktus Desert\" whizzing by them on Waffelo's motorcycle, releasing streams of whipped cream from the two exhaust pipes.\n\nBasil sighed. \"Do you even know where you're going?\"\n\n\"Of course! The omlorks always fly towards the Oasis!\"\n\nThe four riders noticed a few omlorks carrying eggs high in the air, going in the same direction as them—towards an archway separating the strange not-sand from green grass.\n\nThe bike turned as it skidded to a stop near the entrance. Waffelo pulled Basil out of the sidecar, with Develyn and Sophocles following.\n\nThe Oasis certainly had a fitting name. Palm trees grew around buildings with flat brown walls flecked with holes and shiny white crystals. A similarly colored fort with tall spires cast a shadow over the area.\n\nMore strange eggfolk walked the streets, but they looked very different from Develyn and Waffelo. One's shell was thinner and burnt on the edge, while another covered their whole face. One didn't even have a shell, just a big scrambled yolk for a head. They were walking past a pond of water.\n\n\"...water?\" It took Basil a second to process that. Water—that thing he had already run out of last night.\n\nHe tugged on Waffelo's chain, reaching the pond and chugging the water within. Several eggfolk looked at him like…well, he was a creature from another world, but he didn't care. If he wasn't cuffed, he would've probably stripped naked right there to take a bath himself.\n\n\"Wait, you drink that stuff?\" Develyn tilted her head.\n\n\"What kind of foolish fantasy are you living, boy?\" Waffelo tugged on the chain. \"Syrup is the only delectable drinkable that we Pekfest ingest! Whatever that clear stuff is, it tastes revolting!\"\n\nHe probably should have expected that from folk like this, but it wasn't particularly pleasant to imagine.\n\nThey continued their trek down the street or street-equivalent, apparently approaching something called \"The Incubator,\" according to a sign.\n\n\"So, you live here?\" Basil asked Develyn, his thirst finally quenched.\n\n\"Eeeyup.\" She put her hands on her head. \"Shitty, isn't it?\"\n\n\"What?\"\n\n\"Look at it, dude. Everyone's just relaxing. Everything's just given to us without any work. There's, like, two people here who actually do shit, and one of them's Waffelo.\"\n\n\"...and we should thank her, for our gift from Bon, the beautiful Amaya, has finally awoken!\" A deep, feminine voice came into earshot, followed by cheering from dozens of eggfolk near her.\n\n\"Aaaand there's the other one,\" Develyn said, looking up at her.\n\nShe spoke on an elevated platform holding dozens of Amaya's eggs. Her shell was a golden yellow, indistinguishable from the yolk. She wore a brown dress with burnt, black trim, almost reminding Basil of buttered toast.\n\n\"Thank you for keeping her in your prayers in the past days. I've no doubt she'll bring us hundreds more children. Thank you.\"\n\nThe regal woman bowed, leaving the stage to light applause. Her eyes widened when she saw a particular deviled face.\n\n\"Oh, Develyn!\" The woman leaned in, hugging her, though Develyn didn't look pleased. \"Where on Scrump have you been?!\"\n\n\"Doing your job.\" Develyn crossed her arms.\n\n\"What? What do you-\"\n\n\"I believe I can explain, Your Majesty.\" Waffelo stepped forward, pushing Basil in front of her. \"This, Yolkal, is the kidnapper of your precious princess!\"\n\n\"What?!\" Basil and the eggs seemed to shout at the same time.\n\n\"Th-That is not true, Miss.\" Basil tried to speak up. \"I didn't do anything to her.\"\n\n\"Yeah. I ran away.\" Develyn jumped in.\n\nYolkal sighed, rubbing her eyes upon hearing her daughter's words. \"I told you, the Syrup Swamp is no place for you. You could have gotten yourself killed.\"\n\nDevelyn snorted. \"Please. The Zubber were out there, and I came out fine-\"\n\n\"The Zubber?! In the Syrup Swamp?!\" Yolkal yelped. After a stunned silence, Yolkal swiped the staff from her back.\n\n\"Hey! That's mine!\"\n\n\"Not anymore.\" Yolkal seemingly knew what she was going to say. \"And you won't use it until you learn to listen to me.\" She opened her hand. \"Give me the belt.\"\n\nDevelyn sighed, unhooking the belt holding the spice containers from her waist and placing it in her hands.\n\n\"I don't even know why he gave these to you. All they've done is put ideas in your head.\"\n\nBasil raised an eyebrow. *\"He\"?*\n\n\"Thank you for bringing Develyn to me,\" she said in a calmer tone to Waffelo. \"Leave the boy with me.\"\n\n\"Rats!\" Waffelo sighed, unlocking the cuffs. \"I was sure he was at least a little nefarious! I mean, look at that mug of his!\"\n\nYolkal eyed Basil's face. The innocent face that his scout troop joked could never express anger, even if faced with the most infuriating thing in the world.\n\n\"You're free to go, Sheriff. Sorry for interrupting your mission in Penge.\"\n\nWaffelo tipped his hat. \"Always a pleasure.\"\n\nAnd with that, he was off. They could hear his cycle start up again in the distance.\n\n\"What's your name, then?\" Yolkal asked.\n\n\"Uh, it's Basil, ma'am.\" He gave his best attempt at a bow. She was royalty, after all.\n\nThe egg tilted her head. \"Wouldn't it be 'Bah-sel'?\"\n\nBasil groaned. \"It's 'Bay-sil'-'\"\n\n\"I believe I know how to pronounce the word, sir.\" She squawked back. \"Come. I'd like to hear more about you.\"\n\nHe walked with the two of them, Sophocles in hand, approaching the nearby fort - her castle, no doubt.\n\n\"Pardon me for asking, Bah-sel, but…\" Yokal tilted her head, analyzing his body. \"Where are you from?\"\n\n\"He said he's not from here.\" Develyn butted in. \"Said he's from another world.\"\n\nYolkal's eyes widened as she looked dumbfounded at the gate to the fortress.\n\n\"That's certainly...strange.\" She eventually said as the gate opened.\n\nWC: 997/1000\n\nNotes:\n\n* Bonus words used: N/A\n* Theme - Queen: Her Royal Yolkiness, the leader of the Oasis, Miss Yolkal Eguine, the Golden Egg."}, {"comment_author": "ZachTheLitchKing", "comment_text": "Heya Nate!\n\nAbbreviated crit during WORD OFF\n\nThe first line leading in with a \"...\" told me Waffelo  was talking for a long time already and you didn't disappoint with Develyn's reaction xD\n\nIf you wanted to take back some words to put in another funny joke you had in mind, you could probably remove Basil questioning if Waffelo knows where he's going and the omlork explanation.\n\nNice touch distinguishing water and syrup.  If Syrup is what the Pekfasts drink I wonder what the other kingdoms imbibe.\n\nThe most scathing remark on any culture I've ever seen:\n\n>There's, like, two people here who actually do shit, and one of them's Waffelo.\n\nQueen lady in charge talking to people about the recently solved problem, but did nothing about it...*sus.*\n\n*Yolkal*, nice!  Making me think of \"yokel\"\n\nI love all of Waffelo's dialogue:\n\n>I was sure he was at least a little nefarious! I mean, look at that mug of his!\n\nNot sure I'm sold on the \"bah-sel\"/\"bay-sil\" moment, since the name's being spoken and she's not seeing the word written down.  It's more likely she'd imagine it's spelled completely different.  This is another cuttable block to fit in another joke.\n\nI'm getting less sus of Yolkal the more Basil interacts with her; she's very shocked, surprised, and dumbfounded by things to be a master manipulator.  But just because she's surprised by him doesn't mean she didn't orchestrate the eggscrutiating situation from earlier.\n\nGood words!"}, {"comment_author": "Nate-Clone", "comment_text": "How you being, Zach the King?\n\nThanks so much, and yeah, I'll definitely remove some stuff to make room for that sweet Waffelo wordplay, heh."}, {"comment_author": "JKHmattox", "comment_text": "[SF] <No Man’s Land>\n\n \n\n \n\n“Honor's Truth and the Queen of Battle”\n\n \n\n \n\nAs the newest member of Combat Team Charlie 6-4, I became the misfortunate custodian of Olga.\n\nThis angel of vengeance was an overweight, anachronistic beast, who slowly belched 12.7 millimeter slugs from her beveled muzzle. She was fed by a detachable rotary magazine which could fit only twenty-eight rounds a piece. Technically, they were thirty round magazines, but if you loaded more then twenty-eight cartridges into them, the weapon was sure to jam. That withstanding, what she lacked in munitions quantity expenditure, she made up for with her destructive personality.\n\nMost everyone hated carrying Olga. Aside from her heft, the foot-mobile artillery piece tried its best to separate you from your shoulder any time you brought it to bare. I won’t lie, I grew kind of fond of the thing, as she and I came to an understanding very early on.\n\nCharlie 6-4 was a motley lot who'd stretch the uniformed regulations of the Federal Marine Force, or FMF, to their very limits. In the oppressive summer on Nowhere, we often patrolled without a cammie blouse under our shield-generation armored vests. Better known as a flack, its nomenclature was derived from a time amidst Earth’s three world wars. This left just a brown skivvy, or t-shirt, between our skin and the protective shield generator rig.\n\nOur helmets too, were decorated with a flare for the original. We shrouded this headgear with a rumpled tan-pixelated cover which obscured the helmet’s semi-gloss surface from all the world to see. Girls would personalize this cotton vail with their call-signs or ironic quotes like “Gave Peace a Chance” inked into the starched fabric.\n\nStitched to the back of my helmet-cover was a black rectangular patch with the word “JACKIE” embroidered onto it with scarlet colored threading. It might seem messed up the girls sowed it on there without my knowledge, but it was just their way of saying, “you’re one of us now!” \n\nTwo months into my tour, Head-Shed, that’s the command element, gave all garrison combat teams the directive to search for weapons cashes in the remote settlements on the Great Forgotten Lake. These villages were built on the edge of a dried-up inland sea, which was nothing more then a salt-flat two hundred kilometers across.\n\nCharlie 6-4 was further tasked with escorting a journalist as they documented Federal counter insurgency operations on Nowhere. Gunny wasn’t thrilled with the idea of some nosy reporter tagging along with her Marines, so she personally joined our team for the mission. On patrol, she wore her weathered forest-green Raider-Commando beret tucked over the side of short, fading dirt-blonde hair. Affixed to it was an empty globe which represented Earth, with a wreath of figs on either flank of the half sphere. It was a privilege she earned at great personal expense, and even our officers were wise enough to let that one be.\n\nRaider-Commando teams were elite in the FMF. Their custom fitted battle rigs made it possible to fight high-intensity conflicts anywhere, to include the vacuum of space. Charlie 6-4; we were light infantry, equipped for less intense operations in atmospheric, terrestrial environments. Aside from the flack vest and helmet, our battle-rattle consisted of a thin biometrically integrated exoskeleton, or EXO, which assisted with heavy loads and fatigue. \n\nGeneral Robotics hadn’t considered male physiology when they designed the LISA-C, or Light Infantry System, Augmented Consciousness. Aside from the discomfort caused by my physical incompatibility with the thing, its AI started giving me the cold shoulder so to speak, when I purposefully ignored her advice in some less then desirable situations. Spend a few hours arguing with an artificial consciousness designed to integrate with the female mind, and I’d bet you’d become the first grunt in combat without an operable AI since the Battle of Formosa.\n\nI liked the newshawk from the start. They wasn’t much older then sergeant Michaux when they became an interstellar war correspondent for The Alta-Californian. At the independent news agency, they was galactically renowned for their hard nosed, realist journalism, with several prestigious awards before turning thirty. I guess it helped they wasn’t able to return home either, given an ambiguous citizenship matter with the Federal Administration.\n\nBy the time we met on Nowhere, she went by the name Abby Edward; a clever inversion of her family and given name. Abby was Gunny Campbell’s age by then, and her preserved athleticism meant she had no problem keeping up with the team when she embedded on a patrol.\n\nWe took to calling her “Royal Purple”, or just RP for short, due to the deep highlights woven through her otherwise raven hair. Her olive-drab flight suit and tan leather boots contrasted against the Prussian blue “PRESS” flack they made her ware. Atop her tangled crown was a floppy-brimmed cover with the bolded words “TRUTH BEFORE DISHONOR” scribed in dark ink. It was fair to say we all respected her for that.\n\n“Jackie,” Kroger whispered from behind me, “ask her!”\n\n“Not now Kroger!” I hushed back.\n\n“Ask me what, Owens?” Gunny Campbell interjected from eight meters ahead of me.\n\n“Com’on Jackie, don’t be a pussy,” Lexi added on as she continued to walk forward in parallel, ten meters to my left.\n\n“OK Jackie; what is it you want to know?” Gunny asked with a broad smile after finally learning my call-sign.\n\n“Um, well me, and some of the girls, were wondering… why is it you carry a knife on your chest-rig; given the distances involved  with interstellar warfare and all?”\n\n“Hayup… you never know Owens, there might be cake,” she cryptically mused. \n\nOur laughter crackled from the staggered column stretched amidst the outskirts of the arid villa. This disturbed a perched loiter of several men who guarded an adobe structure which served as their municipal hub. Nobodies were humans descendent from Earth, but with a history briefly departed from our own. Unlike most of known humanity, nearly half their population were born male. Their arbitrary isolation had saved them in that way.\n\n \n\n \n\nW/C 996\n\nNote: In modern western militaries, particularly the US army, the infantry is known simply as “Queen of Battle”. \n\n [No Man's Land Chapter 1: Letter of Intent ](https://www.reddit.com/r/shortstories/s/UV8D69Bp5k)\n\n[No Man's Land Chapter 2: Stolen Valor ](https://www.reddit.com/r/shortstories/s/wDcGEoVFn9)"}, {"comment_author": "ZachTheLitchKing", "comment_text": "Howdy Mattox!\n\nAbbreviated feedback during WORD OFF \n\nI like the intro paragraph going into detail about the old-fashioned gun followed closely by some sci-fi elements like the shield-generation vests.  A nice touch dropping \"Earth's *three* World Wars\" in the past-tense like that, implying future-history.\n\nBrief introduction to AI is interesting, I hope we get more of that interaction later.  \n\nTypo here: \"They\" is still a plural pronoun even if used to refer to a singular person, just like \"you\"\n\n>They wasn’t much older  \n>  \n>it helped they wasn’t able\n\nGreat descriptive line here; simple yet elegantly visual:\n\n>We took to calling her “Royal Purple”, or just RP for short, due to the deep highlights woven through her otherwise raven hair.\n\nGreat line:\n\n>“Hayup… you never know Owens, there might be cake,”\n\nGood chapter Mattox.  Some fun character interactions and several great layers of worldbuilding with potential hooks for further delving.  I personally hope to see more about this AI in future installments to see how they benefit or bedraggle Jackie.\n\nGood words!"}, {"comment_author": "JKHmattox", "comment_text": "A quick note on the plural pronoun thing. As a child of the 1980s, it still takes some getting use to but there are some situations where they/them are singular pronouns. A call back to this is how Abby Edward's name is an inversion of her original given name. This assumes she was born Edward Abby. I was doing my best to convey this transitional aspect about the character without just plainly stating it. Hopefully it makes more sense now.\n\nYes the AI thing is going to be present through much of the combat scenes in this story, but not exactly how you would think.\n\nFuture history is very important to this story but I am taking an omitted/fragmented approach to this exposition. Few people talk about what happened five hundred years ago, but that doesn't mean it doesn't have a profound effect on our lives today. I mean if you ask most Americans, world history began in 1776 😉\n\nI''m glad you are enjoying the story thus far and thanks for the feedback I appreciate it."}, {"comment_author": "MeganBessel", "comment_text": "# <In the Shadow of the World Tree>\n\n[Chapter Index](https://www.reddit.com/r/BesselWrites/comments/tdn37h/in_the_shadow_of_the_world_tree/)  \n[Appendix](https://www.reddit.com/r/BesselWrites/wiki/TasamAlvedyos)\n\n**Chapter 108: The Known Bird**\n\n---\n\nThe other three looked at Maltis. She just pointed again. “Let’s go down there. We’re here, aren’t we? Might as well take a look around.”\n\n“I’m willing to do that,” Elfo said. “If Lena wants to.”\n\nLena frowned, turning back to look at the empty air of the room. “Why me?”\n\n“You’re the leader of your party.” There was a pause, then the voice continued. “Back on `Earth`, many years ago, the stars were used by people to guide them and to lead them as they explored new lands, and eventually into the void—providing comfort with stories and tradition as they did so. I see you as a similar star to your group, and to the people of your land. A fire in the darkness.”\n\nVeska nodded along. “Told you,” she said softly.\n\n“That is why I think you are the leader.” Another pause. “Would you like to go down to the `polar` side?”\n\nLena looked back out over the gleaming landscape. “Yes,” she said. “Let’s do it.”\n\n“Though I *do* recommend changing into the long-sleeved clothes this `shuttle` has available.” As Elfo spoke, the cabinet Veska had been looking through earlier opened of its own accord. “For your safety.”\n\nThough they were puzzled at this request, after some small discussion they did so. Though once done, they laughed at how ridiculous they all looked.\n\nOutside, the swan-colored landscape grew closer as the flying-room soared above it, for a moment swinging over one of the bigger parts of the sea, like a bird swooping on its prey.\n\n“As well, each of you please put on one of these…ear-talking things.” A small cabinet opened, revealing four objects—each a tiny rounded cone attached to a loop. “They will allow me to communicate with you while you are off the `ship`.”\n\nWith further explanation, but they figured out that the cone went into an ear, and the loop held it in. “Like this?” Lena asked.\n\n“Perfect.” This time, Elfo’s voice was there in her ear, rather than echoing in the ship. “Landing in three…two…one…”\n\nA soft thump as the flying-room hit the ground, and then a scrape as the door opened, and a breeze blew inside.\n\nLena shivered.\n\nBut still walked out into the landscape, her shoes crunching on the salt-like substance beneath. And her whole body felt like…\n\nThere was a time, when she was young, she got really sick—even the doctor had been worried she was going to die. And she had kept shivering and shivering, and no matter how many blankets she’d had or how close she’d gotten to the fire, she just could *not* stop shivering.\n\nThis reminded her of that.\n\n“This is…`kod`?” Bakla’s teeth chattered.\n\nLena knelt down to pick up the powdery stuff beneath their feet. It made her hands sting, like ointment had just been rubbed on them. The powder was kind of like salt, but…not. And as she ran it between her fingers, it turned to water.\n\n“The ambient temperature is currently two `degrees Celsius` below zero. I believe you would find that `cold`, yes. What do you think of the `snow`, Lena?”\n\nDespite her discomfort, she knelt back down to scoop more up. “*Weird*.” It was the only way she could describe it.\n\nVeska made a ball with some of the stuff and tossed it at Maltis with a laugh; soon all four of them were giggling like children as they pelted each other.\n\nThen an animal sound. “*Gakigakigaki!*”\n\nThey looked up to see a flock of birds walking towards them. Night-and-swan-colored birds, very similar to the one that Lena and Veska had—\n\n“_Gategli_!” Veska exclaimed. “The one we encountered must’ve gotten to our side somehow!”\n\n“To *your* side?” Elfo sounded puzzled. “That shouldn’t have happened, unless…” A pause, and then a resigned voice. “The `breakdown` is happening faster than expected. My `logs` are indicating over a dozen `anomalies` in the `maintenance shafts` over the past year. This is not good, Lena.”\n\nThe birds were almost upon them now, seemingly unconcerned with their presence.\n\nMaltis ran forward and grabbed a small one. “Elfo, what *is* this?”\n\n“*That* is an `emperor penguin`, one of several kinds of `penguin` that were completely killed in the `Magnacide`.”\n\n“_Penigwini_,” Bakla recited. “I like *gateg* better.”\n\n“*Gak*!” one of the *gategli* honked as they continued marching past.\n\nVeska frowned. “They are different from the one we saw, though. Ours had a cloud-colored arc between its eyes.”\n\n“That was probably a `gentoo penguin`,” Elfo explained. “There are different kinds of `penguin`, as there are different kinds of hawks, skinks, or parrots.”\n\nThe bird in Maltis’ hands wriggled its way out and continue to walk, unconcerned.\n\n“Though…” Veska said thoughtfully. “It’s after dark on our side. And we haven’t eaten in a while. I’m starting to get hungry.” She looked back at the flying-room. “Elfo, can we eat a *gateg* or two?”\n\nAfter several seconds, the voice responded, “If you have the tools to do so, I see no problem with it. Or as our twenty-first `century` ancestors put it: `chow down`!”\n\n---\n\nWC: 841 (849 in Scrivener), and I continue the 850 convention\n\nA reminder that things in `monospace font text` are \"twenty-first century English, General American”.\n\nThe four first go up to Zhik Lenali in [Chapter 104](https://www.reddit.com/r/shortstories/comments/1bbimpw/sersun_serial_sunday_monster/ku9tzre/). Veska refers to Lena as a light in the darkness in [Chapter 71](https://www.reddit.com/r/shortstories/comments/157h3fi/sersun_serial_sunday_future/jt5uxum/). Their unfamiliarity with cold, ice, and snow is discussed in [Chapter 107](https://www.reddit.com/r/shortstories/comments/1btg3aj/sersun_serial_sunday_perception/kxnkgi4/). Lena and Veska previously encounter (and name) a penguin in [Chapter 39](https://www.reddit.com/r/shortstories/comments/zcgxa3/sersun_serial_sunday_unknown/iz7e5s3/). The Magnacide—their term for the [Holocene extinction crisis](https://en.wikipedia.org/wiki/Holocene_extinction)—is previously mentioned in [Chapter 106](https://www.reddit.com/r/shortstories/comments/1bmql7r/sersun_serial_sunday_obsession/kwdnodv/).\n\nThank you for reading!\n\n/r/BesselWrites"}, {"comment_author": "ZachTheLitchKing", "comment_text": "Heya Megan!\n\nAbbreviated feedback during WORD OFF\n\n*THE KNOWN BIRD!* Been waiting a long time to know what this bird is called :P\n\nCurious if Elfo's \"decision\"/requirement for Lena to make the decisions is because of their explanation (which implies a great deal actual intelligence and emotional awareness) or because of some deep ingrained protocol for \"Lena\" to make the choices.\n\nI'm glad the group isn't currently falling into the trope of distrusting everything new and strange; they've seen and experienced enough weirdness that being asked to put a strange device in their ear is more of a \"might as well\" at this point rather than one or more of the party hotly denying any further change to their norms.\n\nI love the immediate interactions with cold and snow.  You've done an amazing job describing it all without using words that wouldn't exist to a people who never encountered it.\n\nVeska's natural instinct to make a snowball.  10/10\n\nGategli!!!!! :D  Excitement.  Love the validation finally after so many months.  At least a dozen! Highly amused that Maltis just picks up a baby penguin (or, a \"small\" one at least); makes me think of that level in Super Mario 64.\n\nBreakdown is ominous.  Sounds imminent too but these sorts of things can take place over a longer period of time.  I hope it's not too late to save the world(s)!\n\nGreat ending to the chapter; time for some gateg-wings!\n\nGood words!"}, {"comment_author": "Carrieka23", "comment_text": "<The Beginning of The Demon Life>\n\nChapter 82\n\n[Chapter Index](https://www.reddit.com/r/HaruSohma/comments/17iraud/serial_sunday_the_beginning_of_the_demon_life/)\n\n\\-----------------------------------------------------------------------------------------------------------------------------------------\n\nFye's body glows, twisting unnaturally. A second head, chest, and pair of arms emerge beside Fye. It crawls forward on its pale hands, its legs pulling themselves out of Fye’s body, black goop trailing behind it. It has the same figure as Fye, and even the same two blades. It’s easy to mistake the two as twins. \r  \n\r  \n*A clone?*\r  \n\r  \nWithin a blink, the clone throws one of the blades at Linda. She quickly blocks it with her own, blasting a beam of golden light toward the imposter. The newcomer moves to the side before charging towards the queen. \r  \n\r  \nAlex steps forward, about to help, when he feels something slice his side.\r  \n\r  \n*Fuck!* He cusses at his own absentmindedness. \r  \n\r  \nHe quickly turns, seeing the real king in front of him, blade at his neck, when his body suddenly freezes. Taking the opportunity, Alex moves away, holding onto his bleeding side. \r  \n\r  \n“No, fight me!” Evan shouts, taking a step towards Fye. Evan's eyes change color, just like the time the hypnotist made those guards freeze. Only this time, he isn’t using words. \r  \n\r  \nThe king's eyes turn to Alex. Just seeing that emotionless gaze sends shivers down the demon’s spine. Fye’s arms slowly begin moving, trying to break free from the spell. \r  \n\r  \nThe clanging sound of swords draws Alex's attention towards the Queen. \r  \n\r  \n*Should I leave Evan here with Fye? But he might get himself killed. And what about Linda? Can she handle this clone?* \r  \n\r  \nFye’s fingers twitch. Alex's chances are running slim. He turns back to Fye, running towards him. Hoping that luck is on his side, he swings his sword towards Fye’s neck. \r  \n\r  \n*THUMP! CLINK!* \r  \n\r  \nLike the speed of lightning, Evan drops to the ground. Fye’s dual blades are now touching Alex’s. The little chance Alex had been granted is now washed away, and Fye has the advantage. The king knees him in the chin before kicking him in the chest, knocking the wind out of him. \r  \n\r  \nAlex stumbles back, his ears ringing, his breath coming in short pants. He glances around, seeing a weak Evan trying to get up and Linda and the clone still battling it out. Alex coughs violently, blood dripping onto the ground. \r  \n\r  \n*I can’t…not now…*\r  \n\r  \nHeavy footsteps approach. He turns, seeing Fye walking towards him with a mocking grin. He turns his blade tip so Alex can see it. At this moment, he’s the target. Alex glances at Evan, who is slowly getting up, but the hypnotist’s legs are shaking. He also looks paler than usual. It is clear that even he is at his limit. \r  \n\r  \nAlex's legs finally give in. He kneels down, sweat, blood, and tears all sucked into the clouds. \r  \n\r  \n*It is like the first fight, nothing has improved.*\r  \n\r  \nIt won’t be long until Alex can’t avoid death anymore. \r  \n\r  \n*No, I don’t want to die…*\r  \n\r  \nAs if to grant his wish, a sword flies in Fye's direction, hitting him in the shoulder. A howl escapes the king's lips as he takes a couple steps back.\r  \n\r  \nHe notices Linda, who’s breathing heavily, lower her arms. She runs towards Alex, helping him up. She then grabs him by the wrist before running to Evan. \r  \n\r  \n“Both of you, get it together!” she shouts. \r  \n\r  \n“But Linda, he’s too strong. He even managed to break away from my hypnotism twice now.”\r  \n\r  \nAlex takes this time to catch his breath and fight through the pain. He grits his teeth, hoping that this fight will end. \r  \n\r  \nLinda turns to him. “Alex. I know you have that power still. I want you to use it.” \r  \n\r  \nAlex's eyes widen. Just thinking about using it again makes his stomach twist. The last time he used it on someone, he got them killed. \r  \n\r  \n“You have to trust me.” The queen holds his hand. She stares at him deeply, her eyes softening like a mother’s. “If we want to knock some sense into Fye, we need to do this. This is our only chance to help him.” \r  \n\r  \n“Is this really the way? Using fear? Does it really help people open up?” Alex’s fist tightens, remembering Edom's frightened expression. “Or does it make them shut down their feelings more?” \r  \n\r  \n“Look, it’s either him or us. If you want Fye to redeem himself, make him realize that he isn’t a god. Make him fear you.” \r  \n\r  \nAlex can tell by Linda's eyes. She is not going to take ‘no’ for an answer. He turns to Evan, who gives him a nod. \r  \n\r  \n“You have me also to back you up. You’re not alone.” \r  \n\r  \nAlex turns back to Linda, taking a deep breath before closing his eyes. He lets his emotions bubble up together. Hatred, disgust, fear. \r  \n\r  \n*“I knew you needed me.”*\r  \n\r  \nA smirk appears on his face. He turns to Fye, taking a step forward. \r  \n\\-----------------------------------------------------------------------------------------------------------------------------------------  \nWPC: 796"}, {"comment_author": "Maximum-Estimate8853", "comment_text": "# <HOME OPENER>\n\n**Chapter 27**\n\n**SATURDAY**\n\n“This is it, Jimmy, the Ninth Island Showdown. Everyone knows the teams. We of course have visiting champions, the University of Nevada Las Vegas Runnin’ Rebels defending their title against the home team, the University of Hawaii Rainbow Warriors,” said the KHON2 sports anchor from his booth as HD cameras scanned excited fans in the stands, eager for the players to make their entrance.\n\n“That’s right, Frank,” said Jimmy. “Two teams with an unmatched rivalry throughout the NCAA. For UNLV, we’ve got a future NFLer in Marbury Stokes who went thirteen and oh last season. By the same token, you’ve got Jesse Pratt for the Warriors who has just as bright prospects, going for twelve and one last season. It’ll be a thrilling matchup, to say the least.”\n\n“The winner takes the revered Island Showdown Trophy,” said Jimmy.\n\nCameras caught a high-def, 40K closeup of a sparkling golden pineapple mounted on a wooden base displaying a Las Vegas-themed plaque, twirling in a protective glass case.\n\n“You know, the Brits and the Australians have a similar rivalry with cricket called the Ashes,” said Frank.\n\n“But who watches cricket?” laughed Jimmy.\n\n“And who wants an urn of smelly ashes?” agreed Frank.\n\n“The only thing that could come between these two teams is a freak of nature. No, I’m not talking about six-foot-seven, three-hundred pound UNLV linebacker Kiki Stewart. I’m talking about lava, Frank,” said Jimmy.\n\n“The lava flow is getting awfully close,” said Frank. “Let’s send it to Virginia Collins who’s following the flow. Virginia?”\n\nThe camera cut to a big-haired blonde woman standing in the middle of a deserted roadway. In the background, quaint municipal support vehicles with orange strobing lights blocked off the entrance and exit to the areas. Official-looking people in uniforms milled about as if they had been there for hours already.\n\n“Thanks Frank,” Virginia said. “Football fans probably aren’t paying too much attention to this, but a few hundred feet from Aloha Stadium is snaking a slow but steady stream of red-hot lava. There is no reason to be worried, according to the Governor who had this to say before she went into the stadium herself only moments ago,” said Virginia.\n\nThe broadcast cut to a shot of Governor Holcomb and Kimo entering Gate 2. A microphone and camera were thrust into their faces, but Evelyn continued walking. “We’re here to join the game, that’s all,” she said.\n\nCutting back to Virginia: “Not many words from the Governor there, Frank. And we’ve just been told that the Governor has fired Oahu’s Director of Emergency Management, so we are trusting the Governor has everything handled. Back to you boys at Aloha.”\n\n“Thanks Virginia,” Jimmy said. “Can’t they just reroute the stream of lava so that it goes into the ocean, Frank?”\n\n“Who cares, Jimmy? All I’m wondering is if Coach Hall and Jesse Pratt can pick the right routes to defeat the Rebels today.”\n\nWith that, an announcer said, “Introducing your University of Hawaii Rainbow Warriors!”\n\nThe crowd went wild and a smoke machine belched out white clouds and confetti in front of an entrance tunnel. The announcer listed off the players in order of least important to most important. The last player out of the tunnel was the back-up quarterback. The smoke machine stopped, and the rival team arrived onto the field. A small din erupted amongst fans and commentators alike.\n\n“I don’t know if you’re seeing this, Jimmy,” said Frank, “But I think they missed Jesse Pratt.”\n\n“You know, Frank,” Jimmy said. “I think you’re right. Where the heck *is* Pratt?”"}, {"comment_author": "ZachTheLitchKing", "comment_text": "Howdy Max!\n\nAbbreviated feedback during WORD OFF\n\nAbsolutely adore the announcer-talk starting this chapter off.  Really sets up the feeling that everything's about to go down.\n\nMinor suggestion; consider italicizing the team names to help differentiate them from the university names.  Not sure if there's a standard or not, just a thought from my own reading.\n\nThis got a good chuckle out of me:\n\n>“But who watches cricket?” laughed Jimmy.\r  \n>  \n>“And who wants an urn of smelly ashes?” agreed Frank.\n\nI like how many times Virginia says \"the Governor\"; really going to hammer home all of the mistake's Evelyn's made this week when it all goes to hell.\n\nAnd finally Jesse's absence is noted by someone.  I was expecting a chapter going over the coach and team freaking out tbh. \n\nThe lava flow feels like a ticking clock over everything else going on.  I can't wait to see exactly how many different blazes of glory are going to go off soon.\n\nGood words!"}, {"comment_author": "Maximum-Estimate8853", "comment_text": "Thanks!\n\nJust after I posted I was thinking that I could zoom in on the coach and have him freaking out... there definitely is a lot of off-screen drama. I guess I don't see a role for the coach in the whole scheme of the plot, it would just be flavour.\n\nHe is not as degenerate as all the other characters, so I guess not worth following.\n\n  \nEdit: Also, I could probably google it, but I am totally in the dark about Word Off...I am guessing some sort of writing competition like NaNoWriMo but on Reddit?"}]}, {"post_title": "[RO] For He Could Never Know MY Love", "post_url": "https://www.reddit.com/r/shortstories/comments/1byx428/ro_for_he_could_never_know_my_love/", "post_main_text": "I have done my best to put feelings into words. Comments and criticisms are most welcome. Please let me know how I can improve next time. I sincerely hope all of you enjoy reading this :)\n\n\\---------------\n\n“I love you”. A cliché start? Maybe. But isn’t it sad though to think these words have been spoken an uncountable number of times through infinite heart-ache? It makes the pain feel both miniscule but also vaster than the ocean. A web connecting the universe, threads of sadness, pain all tinged with what is supposed to be a beautiful word, love. Surely a better word could have been designed for such a complicated feeling. There was a quote by Margaret Atwood, “The Eskimos had fifty-two names for snow because it was important to them: there ought to be as many for love.” When I tell him, those three words how could he know the depth behind it?\n\nHow is it supposed to convey that I yearn for him every minute of the day? That I wake up with his name upon my lips? As I cuddle into my pillow, I picture spending the moment with him so strongly that when I open my eyes, I am devastatingly surprised to realize that I am not looking at him. The irony is rich in the emptiness that weighs me down. It is cocky to even imagine I could reach my normal level of function so I sit on my bed catching tears before they fall. I tried to think of the last time I felt this way and came to the conclusion that the pain has been different each time. Love hurts different. Maybe one could even swap that word with pain. I 'pain' you. Adoration, care, yearning. All deceivingly sweet words for the pain. But then again that could be how the vocabulary attempts to differentiate all the ways of how the heart hurts. The mistake made was ours where we forgot that it is not a sweet cocoon but a thousand daggered fingers toying with the softest organ within ourselves. God made the ribs strong to protect us but we are helpless against the slow fiery consumption that is born within our very core. Sometimes I feel like I am okay. I almost laugh at myself for being foolish, overdramatic. Then the sinking feeling sets in again. I feel as if water were settling in my lungs and I realize that I had only been distracted for a blissful moment. I spend my waking hours regretting every minor occurrence that led us to this point. I overthink each insignificant word and touch. I imagine he may have felt swept up in a tornado of my expression of love when he prefers a gentle breeze. I cannot help but build resentment towards myself for being overwhelming. I dream of parallel universe in which I did not smother him with intimacy. I fear that I over-watered the plant that is our acquaintance. Incessant wonderings of “What ifs?” persist through my mind till I grab on to my temples in an effort to silence my own brain. Then comes the soft devious voice slipping between the cracks whispering that he never felt for me as I do for him. It says that it not the choices I made but him in his own character that could have never committed to a fondness so authentic. It is meant to be comforting yet I perceive it as a cruel reminder that I needed to be less. If we could meet each other again for the first time, I would not. It is not because I repent encountering him, instead the reason is that I cannot love him ‘less’. The fact that there may be no other person who would be fond of him to the depth that I am, offers me no comfort if he reciprocates their feelings, since they knew to love him a way that I never could. He was my home, my ‘happy place’. It is his arms I wish to be in when the world feels a little to punishing to stand against alone. He was the comfort I needed when I dared put down my walls. I was me in my true self when we were closed off from prying eyes. He gave me a place I could rest at. The tendrils of hope cling onto his sweet nothings. Despite my desire to drown myself in his deceiving words I find myself unable to stop rushing to the surface for air. The razor-edged truth grazes upon me that he neither understands nor has the capacity to equal my feelings. The death-blow is however from the devotion I hold despite him.\n\nTherefore, when I say those three words, “I love you” how could I expect him to know that this is the meaning it holds? It seems only arrogant to expect him to recognize a feeling that cannot be contained within a single word. The word ‘love’ in its essence is a mockery to the human heart. There lies a saving grace for me however upon the fact that I have given him the best of me. There is both solace and despair in the conclusion that I shall always be ‘more’.\n\nWord Count: 840", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "**Welcome to the Short Stories!** This is an automated message.   \n\nThe rules can be found on the sidebar [here]( https://www.reddit.com/r/ShortStories/about/sidebar).\n\n**Writers** - Stories which have been checked for simple mistakes and are properly formatted, tend to get a lot more people reading them. Common issues include - \n\n* Formatting can get lost when pasting from elsewhere.  \n* Adding spaces at the start of a paragraph gets formatted by Reddit into a hard-to-read style, due to markdown. Guide to Reddit markdown [here](https://www.reddit.com/wiki/markdown)    \n     \n**Readers** - ShortStories is a place for writers to get constructive feedback. Abuse of any kind is not tolerated.    \n     \n***  \n\nIf you see a rule breaking post or comment, then please hit the report button.           \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/shortstories) if you have any questions or concerns.*"}]}, {"post_title": "[FN] Binding Lessons", "post_url": "https://www.reddit.com/r/shortstories/comments/1byonv2/fn_binding_lessons/", "post_main_text": "Two students walked along the shadows of Old Queen’s Way, the great statue loomed over much of the 10 mile courtyard, overlooking the mess hall, gymnasium, and the dormitory. One walked with an awkward gait leading his colleague to raise an eyebrow. \n\n“Herkal, you alright? You look like you shit yourself”, he said.\n\nThe other man looked at him with a weak, embarrassed smile, “Huh? Oh yeah, these new pants were made poorly. Too tight in the waist”.\n\nNew pants huh?, he thought. Herkal had them for nigh on half a year which made an already obvious lie that much more obvious. They had known each other for twice that time, having been forced to work together after Herkal tried to make him stop his antics in the classroom, leading to a fight. They had grown close since then.\n\nHerkal tried to distract him, “Lakon look, there’s the library. We may have the main book for class but we’ll find more comprehensive texts there. When we’re done with the serious stuff I’ll show you my favorite, ‘Kings and Queens of Fursagla’ it’s by Prime Master Quidranius, one of my favorite authors. He also wrote…”\n\nLakon listened to all the books written by the man which later turned into a rant about King Oglokor and the last battle which ended Fursaglan rule and caused the arranged marriage between Lady Sidhaia and Lord Amur-sin of Aroloth before settling on the talk about current political events and how they were shaped by these long ago battles and weddings. He didn’t remember most of it but found an unexpected pleasure in listening to Herkal passionately speak when he was normally quiet and reserved. By the time they arrived at the front steps to the library, Herkal looked confused.\n\n“Why are we here again?”, he asked. Their conversations seemed to always make him forgetful. \n\nHis friend chuckled, “You promised to help me study. Amarita will give us a test in two days and I find her class as interesting as a wet leaf in a desert. Well actually that’s not true, a wet leaf in a desert sounds like a fun mystery to solve. How did it get there? What blasphemous wind carried it so far out and defied the natural order?”. \n\nHerkal frowned but ignored him, they had arrived at the library. Lakon went ahead and opened the double doors in an exaggerated manner, spreading his arms out wide and with his head hanging back. He had a penchant for the melodramatic. \n\n“Oh yes! The library, the only place where you can find teachers that don’t tell you when to shit and eat and sleep”, said Lakon.\n\n“Well there better be no shitting, eating, nor sleeping in my library, boys. I worked really hard to keep it nice and tidy”, said an old woman that emerged from behind a twelve story bookshelf. \n\n“Boys? I’m old enough to be your scandalous much younger lover”, said Lakon. \n\n“What?”, responded the woman as she wrinkled her nose. \n\nHerkal stepped forward ignoring Lakon’s antics, “Mother, I made a promise to my friend here that I would help him study. He has problems in class and needs attention and care that cannot be provided by a teacher dealing with fifty students at once. I promise we won’t make a mess of things and if we do then I will make sure we clean up after ourselves”.\n\nThe woman nodded reluctantly, clearly she did not trust his friend and Herkal couldn’t blame her, he had a habit of making a poor first impression. Herkal forgot all about the strange comment as he looked up at the ceiling. He made a noise of approval.\n\n“Nice ceiling, I think this place will be good for studying”, he said.\n\n“What does the ceiling have to do with studying?”, asked Herkal.\n\nLakon snorted as if it was obvious, “Well it looks structurally sound. If the roof were to fall on our heads then there wouldn’t be much use in studying. Can’t learn if your dead”. \n\n“Go on before I change my fucking mind”, said Herkal’s mother.\n\n“Thank you Caestra!”, said Lakon cheerfully.\n\nOnce they were away and deeper in the labyrinth of books, Lakon widened his eyes at his friend, “She’s your mother? How come you never told me?”.\n\nHerkal shrugged, “It never came up”.\n\n“That’s very significant. How did that never come up? We talk everyday”, said Lakon.\n\n“And if you studied with me you would’ve known”, Herkal said. \n\nThey went up some stairs where emerged a forest of stacks upon stacks of books and scrolls and clay tablets. Herkal took a ladder and placed it against one of the shelves to climb up a dark corner where cobwebs and dust rained down with even the slightest touch. Lakon wandered about glancing at the books until his friend giggled in elation. Herkal climbed down the ladder and ran to Lakon while pointing at the book in his hand with a face of pure joy.\n\n“Look! Look! Look! This is the one”, he said. \n\nThe young man ran towards Lakon who had strayed away as he inspected other shelves and fell on his face. Lakon ran to help him up but found a second book slip from him. He took it and flipped through the pages. The contents intrigued him.\n\n“What is this? Why do you have a book about magic?”, he said.\n\nHerkal dusted himself and cleared his throat, “Your birthday is tomorrow and I wanted to get you something”, he muttered.\n\nLakon didn’t know what to say. He hadn’t expected Herkal to remember his birthday but smiled warmly at him, “Thank you. I actually wanted to show you a spell\nI learned a couple of days ago. It’s nothing dangerous just blowing the wind. I’ve been practicing it so I can now control how strong the wind is”, he didn’t think his friend would understand the true significance of it but it was a hard earned skill he’ll be damned if he didn’t show someone.\n\n“Don’t, I don’t want my mother to complain about us sneaking into the library”, he picked his book up and got three more from the bottom shelves.\n\n“Loosen up, It’ll only be a simple spell nothing too big. I’ve done this before”, he said as he spread his legs out and planted his feet firmly into the floor. \n\n“Was your success based on luck or did you truly master the spell?”. \n\nLakon felt a little hurt but continued just so he could prove him wrong. He cupped his hands and whispered the spell into them, a small green light flickered in his hands. He felt the light spark, tickling his palms. After a while it grew from the size of a pebble to fill his hands with a more intense light. \n\n“I thought you were just going to blow some wind! Why is there light in your hands?”, fretted Herkal. \n\nLakon felt very confident he had it under control… at first. The light grew in proportion, enveloping his hands and sucking in the air rather than blowing it out. It was getting harder and harder to breathe and he could barely hear his friend’s protests against the use of magic. The spell had been like removing the pillars holding a roof so that he would have to hold it in the pillar’s place, and it was very heavy. Sweat trickled down his brow. He felt his chest constricting. Using all the strength left in his mind, he began to contract the ball of light that grew to the size of a human’s head. As it grew shorter everything got back to normal.\n\n Yet books and scrolls were thrown about as if discarded into heaps of trash. Many hundreds of sheets of paper torn from the glue that bound them to the spines of their books. Dust flew about, Lakon only noticed it when he tasted it in his mouth and it irritated his nose. Herkal immediately began to gather about the pages and fitted them back to their respective books. Lakon didn’t help, instead he looked at one of the shelves, ‘Something must’ve caused such a disturbance. Whatever it was it came from there’.\n\nHis thoughts were interrupted by Herkal’s sneeze, “Why the fuck did you make it so big? Why couldn’t you just flip a few pages and be done with it? All you had to do was show a little trick”, the bookworm gathered the books, occasionally reading passages in some and gathering a separate pile of the ones he would read later and the ones that he would place back in their shelves.\n\n“I didn’t intend to make it so big. Something else did that. Well, I mean, the spell was all me but it was bigger than anything I can do with my skill”, he went to the nearly empty shelf and started feeling the cobbled wall behind it, “Look over here, these are symbols of sorts. Perhaps hieroglyphs from Old Aroloth. If you look hard enough you can see these lines where air blows out. I felt it while making the spell”.\n\nIntrigued, Herkal gently placed the books and sheafs of papers in his hands on the floor and went to the hieroglyphs next to Lakon. He put his hands to feel them out too, “These carvings are as old as the school but the alphabet it uses is older than the Empire of Aroloth”.\n\nWith all the anger of his friend’s shenanigans gone from his eyes, he started trying to pull at the lines once he realized they led somewhere. Herkal abandoned his efforts and searched through the books, taking some and putting them back at the shelf.\n\n“Wait, let’s discover what’s behind here”, said Lakon until he realized what he was doing. \n\nA second or two later, he helped him put the books back in a certain order. But instead of putting the spines of the books facing outward, he put them inwards facing the wall. \n\n“Any other time I would’ve cursed the person who did this to the tenth generation”, said Herkal.\n\nOnce they put all the books in a certain order, something clicked inside the wall. Both students stepped away and watched as the wall withdrew into itself and slid away to the side. Inside was a room filled with scratches of glyphs in every corner, some shrunk in different places to make room for more. In the very center sat an old woman.\n\n“By the Gods! Are you alright?”, asked Lakon while Herkal simply gaped.\n\nThe old woman looked to be about her seventies with sunken eyes and skin hugging bone. The duo could see her skull. It was evident to the both of them that her confinement stretched back many years. \n\n“Are you alright?”, repeated Lakon. \n\nShe smiled. The old woman licked her chapped lips and rapped her knuckles in the rough stone. A purple sphere appeared and fazed out of existence a few seconds later. Then a dozen appeared all over the room and they too disappeared. \n\nShe stared at the two of them with bloodshot eyes, “Wh-who are you? You don’t look familiar”.\n\nLakon and Herkal looked at each other in confusion. Herkal spoke next, “My name is Herkal, ma’am. How long have you been here?”.\n\n“Why are you here in the first place? Who would do something like this?”, said Lakon.\n\nHerkal motioned for him to stop, “First let’s get her some medical attention. She looks malnourished and starved. We need to get her some food and…”.\n\nBefore he could finish, the old woman raised a hand to the air and screamed a spell. Lakon was pulled away by unseen forces and crushed by the wall of glyphs and whatever magic the woman had called upon. Blood ran down his nose and eyes, he groaned in pain from the spell. \n\n“Wait stop! We’re not here to hurt you!”, was all he had time to say before she uttered more words of power and he felt his stomach contract. He crumbled to the floor and crawled to the woman, intending to stop her, to do whatever it took to stop the intense spear of pain lancing through his body. \n\nMore words of power were spewed out… by another woman. Caestra opened her mouth, within, her own purple sphere fizzled into being, it shot out a beam of sticky blue goo with enough force to knock the skeletal woman out of balance. Freeing both Lakon and Herkal. \n\nLakon dropped to the floor, yet even in his weakened state he got on all fours and went over to Herkal. He shook his friend but could not rouse him from the floor. When he wouldn’t wake, Lakon stood on his wobbly legs and dragged him away from the two women before they began to fight.\n\n“Caestra?”, whispered the malnourished woman.\n\nA pang of guilt seized her soul, but she couldn’t afford to let that stop her. Caestra couldn’t let her prisoner leave or else she would harbor even greater regrets than leaving a woman to spend the rest of her life imprisoned in a stone room. The fool boy returned after dragging her son away to safety.\n\n“Get out, this doesn’t concern you”, she told him.\n\nWordlessly, he looked at her and then back at the other woman, ‘He means to fight. Damn fool’, she thought. \n\nThe prisoner got up effortlessly, speaking muttering words of power to herself. Every time she completed a spell her skin flowed purple for a second. To Caestra’s surprise, Lakon did it too, she was amazed the boy could muster such skill at such a young age. Yet it was not enough. \n\nShe sucked in her breath and began another spell. Her arms shot forward, tendrils of green smoke slithering through the whole room before reaching her prisoner. The skeletal woman replicated her tendrils with her own fingers, both women pushing against each other to cover the whole room with the snake like smoke produced by their spells. \n\nLakon touched Caestra’s shoulder, adding his own power to hers. The librarian took advantage of this, weaving another spell. Once cast, the purple sphere reappeared in her throat and, untethering the tendrils in one hand, reached down her throat and pulled out a shimmering yellow knife. She took one step forward. Then another. And another. Lakon had used too much of his strength to follow. His hand fell limp from her shoulder as she moved towards her prisoner. \n\nThe tendrils dissolved with every step. The skeletal woman’s tendrils, however, grew stronger and enveloped more of the room. She made them coil around Caestra’s body, tightening like a snake around her neck. She knew Caestra had no defense against her. Casting spells required a great deal of concentration. Holding on to the knife required nearly all of her attention else it would dissolve like the tendrils. \n\nThe tendrils constricted the airflow, she felt the throat get crushed, her vision blurred, a part of her made her gasp for air. Yet still she threw all her willpower to the one spell. When she reached the old woman, she plunged the knife in her abdomen. \n\nThe old woman shrieked in pain. Her rags darkened, stained with her blood. The loss of concentration and the loss of blood led the tendrils to dissolve. She collapsed, drained of all strength. \n\n“You left me here for years”, she breathed. Blood bubbled in her mouth. \n\n“You could have done a lot of damage. Many people would’ve died. This was the only way to stop you”, replied Caestra.\n\n“You and I both know there was a better way”, she said. Then she took her last breath. \n\nThe librarian looked over her shoulder and saw Lakon trying to get up and failing. She went over to him and grabbed his hand, pulling him up. The student looked bewildered and horrified at the body of the old woman he had only just a few minutes before wanted to help.\n\n“Please, don’t tell my son”, said the woman. ", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "**Welcome to the Short Stories!** This is an automated message.   \n\nThe rules can be found on the sidebar [here]( https://www.reddit.com/r/ShortStories/about/sidebar).\n\n**Writers** - Stories which have been checked for simple mistakes and are properly formatted, tend to get a lot more people reading them. Common issues include - \n\n* Formatting can get lost when pasting from elsewhere.  \n* Adding spaces at the start of a paragraph gets formatted by Reddit into a hard-to-read style, due to markdown. Guide to Reddit markdown [here](https://www.reddit.com/wiki/markdown)    \n     \n**Readers** - ShortStories is a place for writers to get constructive feedback. Abuse of any kind is not tolerated.    \n     \n***  \n\nIf you see a rule breaking post or comment, then please hit the report button.           \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/shortstories) if you have any questions or concerns.*"}]}, {"post_title": "[SF] <The Weight of Words> Chapter 72 - First Name Basis", "post_url": "https://www.reddit.com/r/shortstories/comments/1by4ojj/sf_the_weight_of_words_chapter_72_first_name_basis/", "post_main_text": "[Link to serial master post for other chapters](https://www.reddit.com/r/RainbowWrites/s/JxGKlyy8jF)\n\nMadeline got her chance to ask after Sarah when the guard arrived to take them all to the dining hall. With her aching body and drowsy mind, she longed to just switch off for the night, but she’d told Joanna that she’d do this. Besides, no matter how tired she was, it couldn’t completely kill her curiosity.\n\nShe just wished that she could get Billie’s comments about the guard’s interest in her out of her head. It made her feel so much more awkward going over to talk to him — and she wasn’t great at talking to people at the best of times. Her mouth felt sticky before she’d even reached him, and she could feel the heat radiating from her face.\n\nAs he gathered the group by the door, she sidled up to him. “Errr… Excuse me.”\n\nHe glanced around at her and smiled. “Can I help you with something?”\n\n“Maybe?” Clenching her fists and closing her eyes, she forced the words out. “Look, I’m really sorry if this isn’t something I should be asking it’s just… One of the people in our dorm was taken away today…”\n\nHis smile fell slightly. “I did hear about that.”\n\n“It just shocked us all a little. And I was wondering if there was anything you could tell us. Will she — Sarah, that is — will she be coming back?”\n\n“Ah. Well.” His weight shifted slightly from one foot to the other, as his eyes avoided hers. “I can’t say for certain, I’m afraid.”\n\n“So there’s a chance then?”\n\nHe blinked slowly and sighed. “Yes. There’s a chance.”\n\nA small spark of hope fluttered to life inside Madeline’s chest. “And I don’t suppose you could tell me where she is now, could you?”\n\nHe met her gaze again, no trace of a smile left on his face. “Nowhere you want to be. Trust me.”\n\nThe flutter of hope faltered. Still, it wasn’t all bad news. That was something, at least. Madeline mustered the best smile she could manage. “Thanks. I really appreciate it.”\n\n“No problem. Never hesitate to come to me with questions or concerns. That’s why I’m here.” He glanced away, surveying the now fully assembled group. “And with that, I should probably take you all to dinner, shouldn’t I… What was your name again?”\n\nShe blinked a couple of times, somewhat taken aback. “Madeline.”\n\n“Madeline.” He nodded to himself. “It suits you. I’m Marcus — just in case you ever need to ask for me.” With a parting smile, he turned his attention back to the rest of the group. “Now, who’s hungry? Come on everyone. Follow me!”\n\nAs she trailed after him, Madeline wondered why she’d been so surprised by the exchange of names. It wasn’t an unusual thing to ask of someone. Was she that out of practice with social niceties? Or was it just that she’d never expected a person who would work with or for Poiloogs to actually care about her as a human being?\n\n“So?” Billie slipped into step beside her, making her start. “What did you find out?”\n\n“Not much. But still more than I expected.” She glanced over her shoulder, scanning the crowd for Sarah’s siblings. “I’ll tell you properly at dinner with Joanna and Ben if we can get a seat near them.”\n\n***\n\nWhen they were finally all sat together with steaming bowls of soup served with fluffy, buttery bread, Madeline regretted her promise to talk over dinner. Her stomach grumbled and ached. But she knew that if it was her friend or sibling — or her Billie — she’d want to know everything as soon as possible.\n\nJoanna and Ben were watching her expectantly from across the table.\n\nShe nibbled at her bread while she chose her words, careful not to get their hopes up too much. After chewing slowly and swallowing, she said, “I didn’t find out much. But Marcus — the guard, that is — did imply that there was a chance Sarah might come back.”\n\nJoanna’s eyes widened. “Really?”\n\n“Yep. But he wouldn’t be at all specific about the likelihood.”\n\n“And did he tell you where they took her?” Ben asked.\n\n“Again, there was nothing specific. All he’d say was…” Madeline paused. Should she filter the information to make it easier on them? Surely that wasn’t her decision to make. And Marcus hadn’t told her anything that they likely didn’t already know. “All he’d say was that I wouldn’t want to be there.” She grimaced. “Sorry.”\n\nJoanna shook her head, reaching across the table to clasp Madeline’s hands. “Don’t be sorry! Thanks to you we know that all hope isn’t entirely lost. Thank you! Really!”\n\n“Yeah,” Ben grinned. “Thanks.”\n\nThe pair retreated into themselves after that, with Joanna leant on her brother’s shoulder. They pushed their food around but showed little more interest in it than that. It made Madeline feel guilty for the ferocity with which she descended on her meal, but she couldn’t deny her rumbling stomach any longer.\n\nNo one seemed to feel in the mood to talk after that, not even once the majority of bowls at the table had been wiped clean. It was only when they were back in the dormitory that Billie nudged Madeline gently. “So,” they waggled their eyebrows, “Marcus, eh? First name basis already?”\n\nMadeline groaned, flopping down onto her bunk and lying back while keeping her feet on the floor. “Don’t! You know I’m awkward enough already!”\n\n“I’m just saying…” They flopped down next to her. “He didn’t tell me his name when I asked him about the walkmans.”\n\nMadeline turned her head to glare at them. But when their noses brushed she couldn’t maintain it.\n\nThey grinned, shuffling even closer. “I just want to make sure that you know how wonderful you are.”\n\n“You mean that you want me to be awkward and self-conscious?”\n\n“Well… You are cute when you blush.”\n\nMadeline rolled her eyes but snuggled closer into them. Their warmth was soothing on her sore muscles. Their presence, as always, made her feel safe and secure.\n\nHer eyelids began to droop, and she felt herself drifting off.\n\nThe last thing she heard before she was lost to the land of sleep was Billie whispering, “I suppose I’ll take the first shift again, shall I?” as they pulled out their walkie to try to contact their allies on the outside.\n\n---\n\n***Author's Note:*** *Next chapter due on 14th April*", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "**Welcome to the Short Stories!** This is an automated message.   \n\nThe rules can be found on the sidebar [here]( https://www.reddit.com/r/ShortStories/about/sidebar).\n\n**Writers** - Stories which have been checked for simple mistakes and are properly formatted, tend to get a lot more people reading them. Common issues include - \n\n* Formatting can get lost when pasting from elsewhere.  \n* Adding spaces at the start of a paragraph gets formatted by Reddit into a hard-to-read style, due to markdown. Guide to Reddit markdown [here](https://www.reddit.com/wiki/markdown)    \n     \n**Readers** - ShortStories is a place for writers to get constructive feedback. Abuse of any kind is not tolerated.    \n     \n***  \n\nIf you see a rule breaking post or comment, then please hit the report button.           \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/shortstories) if you have any questions or concerns.*"}]}, {"post_title": "[SP] Boddi Shame", "post_url": "https://www.reddit.com/r/shortstories/comments/1byccc3/sp_boddi_shame/", "post_main_text": "`[A follow-up story to` [Ruth-Less](https://www.reddit.com/r/ToonTales/comments/1b9r4sg/ruthless/?utm_source=share&utm_medium=web2x&context=3) `(03/07)]`\n\n`//////////`\n\n“*…for the record, it was* ***Boddi’s*** *idea!*”\r  \n\r  \nThe ghastly head of Ruth Florent sinks back into the bubbly remains of her prank, manically laughing at her poor victim, Krass. The headless phantom, Boddi, aggressively gives Ruth the middle finger before stomping through a wall into a supply closet.\r  \n\r  \nBoddi rummages through cleaning supplies while making a mocking hand puppet. Putting her supplies into a mop bucket, she phases back through the wall, but the bucket is stuck behind. A few seconds later, Boddi phases back into the supply closet, opens the door and walks out.\n\n\r\r\n\n>***\\*Knock\\* \\*Knock\\* \\*Knock\\****\r  \n\r\n\nKrass opens the front door to let Boddi in.\r  \n\r  \n“Is that…stop stealing stuff from the janitor’s closet!” yells Krass. “I don’t need the super doing room checks again!” Boddie turns to face Krass, holds up the bucket, and then makes an “***X***” with her arms. “Just use *my* cleaning supplies!” Boddie points at the still-growing mass of bubbles coming from Krass’ laundry room. “That reminds me, you’re cleaning that up too.”\r  \n\r  \nBoddi waves her arms frantically. “I don’t care. This place better be spotless when I get back, or I’m bringing the priest.” As Krass leaves the apartment, Boddi slumps forward.\r  \n\r  \n“What a *dick*,” says Ruth, floating down from the ceiling. “Anyway, see ya later.” Boddi races in front of the floating head and tries to communicate. “Yeeeeah, sorry, I don’t speak charades. Happy spring cleaning!” Ruth quickly phases through the door. Boddi weakly flips the bird behind Ruth before dragging herself back into the bathroom.\r  \n\r  \n\\-\r  \n\r  \nInside the bathroom, “*Looking good, jackass*” is written on the mirror in a mysterious green slime. Boddi metaphorically sighs as she starts filling the bucket with water. After a few minutes of scrubbing, the mirror is finally clean. After packing all the cleaning supplies back up, Boddi looks at the mirror and sees Ruth acting as Boddi’s head. Ruth screams as Boddi stumbles backward, tripping on the rug and falling onto the floor.\r  \n\r  \nBoddi feels above her neck stump but doesn’t find anything. Boddi slowly stands back up, seeing Ruth’s head again.\r  \n\r  \n“Real hilarious, Ru…” says Ruth as Boddi makes more hand gestures. Ruth’s eyes widen, and Boddi stops. “How did you…?” Ruth gasps. Boddi slowly reaches out toward the mirror, cautiously placing her hand on Ruth’s reflection. “I…am…Boddi…” Boddi smiles as tears well up in her eyes. “I have a voice. Oh my goodness, I have a *voice* again!” Boddi stares deeper into her own reflection when her eyes suddenly turn white.\r  \n\r  \n“Looking good, *jackass*,” says Boddi’s reflection.\r  \n\r  \nCracks spread across the mirror. Boddi’s reflection spreads amongst the shattered glass before a giant version of Ruth’s head with shattered glass-like skin and razor-sharp teeth leaps from the mirror. Before Boddi could step back, the giant Ruth’s head bites just above Boddi’s neck stump.\r  \n\r  \nBoddi freezes in place, as if her head had really been bitten off. The giant Ruth's head laughs as it slowly fuses back into the mirror, the cracks sealing up. Boddi braces against the bathroom wall, sweating, chest heaving, and hands shaking.\r  \n\r  \nThe last few cracks form the words, “***Keep the mirror clean. Some people actually have something worth looking at***” before completely repairing itself. Boddi slides to the ground, holding herself in the fetal position.\n\n\r\r\n\n`.`\r  \n\r  \n`.`\r  \n\r  \n`.`\r  \n\r  \n`.`\r  \n\r  \n`.`\r  \n\r  \n`What's that? A sequel story that ISN'T the wonderfully wacky adventures of ToonMan? What's going on here?!`\r  \n\r  \n`Jokes aside, thanks for reading, and I hope you enjoyed the story!`\r  \n\r  \n`And before you say anything, yes, I know in the original story, her name was \"Bobbi.\" I just think \"Boddi\" sounds better in my head.`\r  \n\r  \n`If you have any COMMENTS, CRITIQUES, or CRITICISMS, please don't be afraid to let me hear 'em (as long as they're CONSTRUCTIVE (or COMICAL)). Also, head over to` r/ToonTales `if you wanna read more stories like this one.`\r  \n\r  \n`Stay safe, drink plenty of water, and be kind to yourself and others.`\r  \n\r  \n`ToonMan, AWAY!`\n\n`\\\\\\\\\\\\\\\\\\\\`\n\n`PROMPT: The mirror is haunted and likes to troll people`\n\n`PROMPT BY:` u/StressedAfraid_\n\n`STARTED WRITING: 04/06/2024`", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "**Welcome to the Short Stories!** This is an automated message.   \n\nThe rules can be found on the sidebar [here]( https://www.reddit.com/r/ShortStories/about/sidebar).\n\n**Writers** - Stories which have been checked for simple mistakes and are properly formatted, tend to get a lot more people reading them. Common issues include - \n\n* Formatting can get lost when pasting from elsewhere.  \n* Adding spaces at the start of a paragraph gets formatted by Reddit into a hard-to-read style, due to markdown. Guide to Reddit markdown [here](https://www.reddit.com/wiki/markdown)    \n     \n**Readers** - ShortStories is a place for writers to get constructive feedback. Abuse of any kind is not tolerated.    \n     \n***  \n\nIf you see a rule breaking post or comment, then please hit the report button.           \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/shortstories) if you have any questions or concerns.*"}]}, {"post_title": "[SF] Bliss", "post_url": "https://www.reddit.com/r/shortstories/comments/1by6os3/sf_bliss/", "post_main_text": "I found this old short story I wrote about space pirates about 7 years ago on an old hard drive and thought I would post it here for reddit to enjoy :)\n\n&#x200B;\n\nThe key to any successful drug habit is to limit your use to just below the point of addiction. Although, he thought, that’s easier said than done when your drug of choice is Bliss.\n\n  \n Personally, he would never touch the stuff, his intoxications were limited to small, infrequent quantities and performance enhancement, but a lot of people wanted that escape, and the market was always booming.\n\n  \n Sarif adjusted his boarding rifles strap one last time. When a markets booming, there’s sure to be some real explosions close behind.  \n\n\n&#x200B;\n\n  \n Bliss had exploded onto the scene maybe 5 years (sidereel) before, the risks were huge, users bodies quickly collapsed under the prolonged, extensive use, almost immediately several cartels had fought brutal, bloody wars across the ‘domes of Mars and Terra, entire districts became no-go zones, smaller colonies seemed to collapse under the pressure, hell, there were stories that the Neptune harvesting city Ferro had fallen into the atmosphere and crumpled like a foil ration pack under the pressure, all because the maintenance crews were smashed on Bliss.\n\n  \n The smuggling trade, always lucrative, had taken on a new lease of life. Every captain, hell every crewer, used to supplement their pay by hauling a few extra items from stop to stop, it was mostly harmless stuff; a few personal letters and items ferried cheaper than standard shipping, maybe some hard to get luxury foods from the major colonies which could fetch a small fortune on the stations. But Bliss? Allah forgive them, no crewer could resist the sheer capital those vials represented. A few fluid ounces, hidden in a footlocker, could net them more than the captains months salary.\n\n  \n   \nThat’s when the piracy started. Captains got greedy, booking fake flight plans, skimming the outer stations, dropping crates of Bliss at every stop. The money was good. Hell, the money was TOO good. Independents soon realised what was happening. An experienced Traffic Conn could spot these fake plans in a heartbeat, and realised it was often cheaper to pass on the info to ‘private interests’ than to report it to their boss.  \n Knowledge is power, they say, and knowing what ships were going to be too far removed from shipping lanes to call for help? That was a power beyond measure in the Bliss game.\n\n  \nThat’s how Sarif had come to end up in the void past Jupiter, stuck half a rotation away from the nearest colony, with an asteroid mine too small to have a name a full days blast away. Knowledge is indeed power. They knew just when to strike so that nobody could stop them.  \n The soft seal on the hull was locked in, the targets engines were down, they couldn’t run, let alone fight. Looking out the clear plastic sleeve, he could see several scores across the ships hull, every now and again he thought he could see a burst of air escape and instantly freeze, as the hull fractured and cracked.\n\n  \n Inside his helmet, the comms chirped, “Breaching in 3… 2… 1...”  \nThey were professionals, this was far from their first strike. The team had originally worked corporate security on Mars before the Red Revolution had put them out of a job. The EM Corp had recognised their unique talents, and both parties had done well, but eventually they pushed too many people too far, and the civil war erupted. There was only so much Sarifs team could do, they won every battle, but the war was lost at the first shot.  \nDespite their efforts, despite the blood spilled on Martian soil, despite the loss of his love, they failed.  \n EM Corp was the only company willing to hire people from the Middle Eastern Diaspora before the war, after? Well. Let’s just say they’d had to skip a few meals to keep their ship running. In a way Sarif owed his continued existence to Bliss, users often gave up everything they owned just for another moment of the utopia it took them to, but for Sarif, the real prize was the money they got for selling it on.\n\n  \n Sarif clumsily entered the target vessel. He had done this a thousand times, but the fleeting memory of his lost love had shocked him. It had been years since his death, but that fleeting image of his face hit him harder than a tank round. \n\n  \n Muhammed and Sarif had grown up side by side, inseparable since the moment they met as teenagers working in the Martian Agri-domes. They had enlisted together, served their time in the Colonials, then moved to EM Corp together. Sarif hadn’t realised how much he depended on Muhammed until he wasn't there.\n\n  \n One second, they had been side by side, seemingly holding the main airlock of the EM Corp headquarters at Hallas, then in a blinding flash of plasma, Muhammed and half the guardhouse he was hiding behind, was gone.\n\n  \n Sarif shook his head, a futile gesture to clear his mind. Clinging to the side of the corridor in zero grav he looked like a beetle in his black Sealed Tactical Armour (Recon), one hand and two feet firmly planted against struts built into the ships walls. His free hand clutching his standard pattern boarding rifle close, he had been in the game too long to make the mistake of immediately storming up the corridor before you knew what you were facing.\n\n  \n It only took a couple of seconds before he saw the first of his would-be ambushers; a pale face behind an emergency mask peered round the corner, clutching a simple smoothbore shot-rifle, his eyes quickly found Sarif, and widened in fear as he saw the boarding rifle aimed directly at his face. Sarif grinned and pulled the trigger.\n\n  \n The boarding rifle was an ingenious piece of equipment, built by Remstadt, one of the oldest weapons manufacturers on earth. When shooting inside a vessel you had to be careful not to damage the hull, as fighting in a true vacuum is every troopers nightmare, many crews would reduce the powder load in their bullets, reducing the risk of them damaging the walls, but also reducing range and their chances of killing an armoured opponent, indeed, troopers used to be given reduced load rounds as standard when boarding ships.\n\n  \n The Remstadt Boarding Rifle, initially sold to militaries and PMCs, used specially designed bullets made from a form of toughened glass and filled with a sealant, they could pierce most armour and even an inner wall, but when the bullet fractured, the sealant would instantly bond to the surrounding material and create an airtight seal, so even a bullet unlucky enough to pierce the hull would seal the crack before any atmosphere was lost.\n\n  \n The effect it had on a human skull, however, was what truly endeared it to Sarif. The round shattered the perspex screen of his breaking gear and entered the boys right eye, almost instantly the expanding sealant cracked his skull and mushroomed out, freezing fragments of skull and brain matter in a billowing cloud of gore.\n\n  \n His squad started to enter the ship as Sarif placed a few more rounds into the support beams along the corridor, he didn’t know where the defenders were, but he knew where he would be, and was determined to keep them pinned down.\n\n  \n“Storage is down this way, boss”, his second jerked a hand over his shoulder  \n“I’m not an idiot, Badiah, I know storage is that way. we’re going this way.”  \nThe look on her face was almost comical, her face scrunched around her battered pugilists nose as she tried to discern Sarifs intent from his casual tone.  \n“The bridge? We already know where the Bliss is, we don’t need to ask the captain”  \n“Trust me on this”, he insisted, blasting another defender in the shoulder as they spun out to shoot.  \nBadiah shrugged, she sent half the team to secure the cargo for transfer, and called the rest up to advance with them.  \n The defenders fought with fear and determination, for all they knew they were up against enforcers from the Cartels, death in a firefight was preferable to what those monsters would do. But for all their desperation, they couldn’t stop Sarifs team, junctions were littered with the dead, mushrooms of blood and sealant sprouted from their bodies, some swinging lazily, anchored by their magnetic boots, others floating freely across the enclosed space, Kadeem was pushing one along in front of him as a shield.\n\n  \n The closer they got to the bridge, the more desperate the defenders became, the clatter of automatic rifles replaced the low bellow of standard shot-rifles, in their desperation they were using every weapon they had onboard to repel their attackers. Full powered rounds chewed into the cover afforded by the emergency airlock frame leading up to the bridge, ricochets and bullet fragments filled the air with an incessant, insectile buzz.\n\n  \n“We’re gonna have to risk a low charge” Badiah sighed, detaching a small grenade from her belt  \n“do what you gotta do, my friend, but I need the captain alive”\n\n  \nSarif knew Badiah would never question him twice in one mission, but every time she looked at him he could see the question burning behind her eyes: what are you doing, Sarif? Why are we really here?  \n He wished he could trust her. He wished he could trust anyone. Since Hallas, he had never been able to get close to another person. In the end, they would always leave him, one way or another.  \nBadiah signalled the team, twist-activated the grenade, and threw it straight at the wall. The grenades zig-zag path off the walls sent it right to the defenders door without her even having to see them, a hollow crunch/thump followed by a pressure wave down the corridor signalled their demise.\n\n  \n Kadeem went in first, launching himself to the far wall, gun trained ahead, he wasn’t immediately blasted from his foothold, that was a good sign, emboldened, the rest of the team began to bound towards the bridge. Only a few steps from the bridge, the team was dangerously exposed, it was a fragile moment in any boarding action; seizing the bridge was often a vital part of any action, and every bridge was designed, if not primarily, to act as a holdout against invaders, same as the engine rooms. Just before they could take up positions at the airgate, the defenders did something Sarif would never have anticipated: they opened the door.\n\n  \n Dumbfounded, the team was vulnerable for a precious few seconds, floating in the corridor, bunched together. The woman on the other side of the gate took full advantage. The automatic shot-rifle in her hands bucked several times, mag-gripped to the floor she absorbed the recoil and raked the gun in a circle around the enclosed tunnel.\n\n  \n Badiah took a blast in her forearm, the remains of her left hand and wrist wagged frantically at the end of her arm, a few precious tendrils of flesh keeping it attached, her scream was a heady mix of pain, anger and confusion, as the force sent her careening towards the wall, truth be told that probably saved her life, as another blast went past where her head had been a second prior, lucky for Badiah. But not for Amir, who took the full brunt to his chest. Had the woman been using reduced load rounds, his armour may have stood a chance at stopping it, but the buckshot from the shot-rifle found every crack and gap in his STA(R) armour, and pulped his flesh. He was dead before he could make a sound.\n\n  \n Kadeem was the first to react, raising his gun he fired a trio of shots at the crewmember, the first impacted on the side of her gun, the exploding sealant permanently gluing the breach half open, but the second and third rounds hit her centre-mass, the magnetic power of the boots was no match for the raw fury of the Remstadt rounds, her body flew backwards even as the sealant flash-hardened, leaving two mounds of bloody matter erupting from her chest, her organs locked in place, her heart unable to beat with the sealant locked around it, lungs no longer able to draw breath as the glue expanded and crushed them against her ribs. It was a brutal way to die. Fortunately for her, it didn’t take long.\n\n  \nQuickly following the womans body, Kareem was first onto the bridge, sweeping towards the bridges left, he fired again at a young rating hiding behind a console. Had he not been so eager to push the advantage, Kareem may have survived the mission, but in his eagerness he failed to check the gateway properly, and didn’t see the man hiding “below” him, the force of the shot-rifle threw him towards the bridges floor with comedic ease, Sarif couldn’t tell if the young man was dead or not, but if there was even a chance, he had to take it.\n\n  \nSarif entered the bridge like a bullet, pushing off a support strut in the corridor, he darted through the gateway at a spin, lining up shots he managed to take down Kareems attacker and one other ambusher, before spinning his legs out and engaging his mag-boots and landing in a crouch.\n\n  \n The captain merely watched all this unfold, he had no weapon, and, judging by his size, he wouldn’t have needed one. The first thing Sarif noticed about the man, however, was not his size, but the mans officious manner and the barely restrained outrage in his eyes.  \n“Who are you to enter my bridge uninvited?” he bellowed, his entire frame shaking slightly at the violence of his question  \n“Who are you to enter MY SHIP uninvited?”  \nSarif barked out a laugh before he could stop himself, how does a man stand before a firefight, see men die, and immediately demand answers of his captors? He knew he had found his man at last.  \n“Captain Laffan, I assume?”  \n Laffan nodded, “James C. Laffan, Captain of the Prestidigitation, and who the hell are you?”  \n Sarif ignored the question, and began circling the captain.  \nKareem gurgled and rose from the floor, and Badiah struggled through the gateway onto the bridge, her suits internal systems already delivering painkillers into her bloodstream and tightening the material above the wound like a tourniquet.  \n“James Cassius Laffan, Captain of the Prestidigitation, born August 2107, Mars, MC-22 Herschel crater biodome.”  \nEveryone on the bridge, bar Sarif, was wearing the exact same expression of purest confusion. Sarifs face was entirely unreadable.  \n“Th-That’s… yes that’s me, who are you?” his voice had taken on a panicked edge now  \n“Fought during the Red Revolution. War Hero. Led the battle of Hallas Dome. Some say you personally drove the first of the plasma-equipped rovers into battle.”\n\n  \nAs the words sank in, Laffan seemed to inflate with pride, but a very different reaction overtook Badiah.\n\n  \n“Oh by Allah’s grace, no...”  \nShe finally understood.  \nThe captain half-turned to look at her, a single eyebrow raised quizzically  \nThe next words froze him in place  \n“You killed my love there.”  \nFinally, he understood too.  \n Laffan tried to speak, tried to reason or explain, tried to buy himself a couple more valuable seconds of life, but the words wouldn’t leave his throat. Probably because of the curved blade in Sarifs hand that stabbed up under his jaw, hooking him like a fish.  \nAlthough it could equally have been the look in Sarifs eyes, a raw fury, a transfixing gaze that never left the captains own as Sarif butchered the Hero of Hallas Dome on his very own bridge.  \nKareem and Badiah could simply watch as he tore the captain to pieces using his two blades.  \nA chirp came through their headsets “We have secured the Bliss, oh folks wait until you see this haul, we’re gonna be rich!”  \nSomehow, Badiah thought, I don’t think the boss will care. This was never about the money.", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "**Welcome to the Short Stories!** This is an automated message.   \n\nThe rules can be found on the sidebar [here]( https://www.reddit.com/r/ShortStories/about/sidebar).\n\n**Writers** - Stories which have been checked for simple mistakes and are properly formatted, tend to get a lot more people reading them. Common issues include - \n\n* Formatting can get lost when pasting from elsewhere.  \n* Adding spaces at the start of a paragraph gets formatted by Reddit into a hard-to-read style, due to markdown. Guide to Reddit markdown [here](https://www.reddit.com/wiki/markdown)    \n     \n**Readers** - ShortStories is a place for writers to get constructive feedback. Abuse of any kind is not tolerated.    \n     \n***  \n\nIf you see a rule breaking post or comment, then please hit the report button.           \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/shortstories) if you have any questions or concerns.*"}]}, {"post_title": "[FN] <Penumbra> Chapter 6 - Of Secrets & Smuggling", "post_url": "https://www.reddit.com/r/shortstories/comments/1bxs32c/fn_penumbra_chapter_6_of_secrets_smuggling/", "post_main_text": "Lacus didn't think the facade would work for long if they made it to the docks.  Best case scenario, one of the medics found out Florus *wasn't* hurt and he was arrested for faking an injury.  Or...whatever Sammosans did to cowardly soldiers.  He doubted these invaders would treat it kindly.  \n\n\"Hey, limp a bit less,\" he muttered.  The incoming swell of soldiers had thinned out, so Florus reducing how injured he was acting wasn't likely to be noticed.  By the time they were close enough to the port for the smell of the sea to be stronger than the smell of smoke from the spreading fires throughout the city, the prince was walking normally again.\n\nSecundus tried to take the lead, but his tense shoulders and stern look kept drawing attention.  Florus had to speak up to Sammosans who approached and confronted him a few times.\n\n\"Hey, just keep your head down and let's follow Florus,\" Lacus muttered under his breath.\n\n\"Too dangerous. We need to stay between him and danger.\"\n\n\"I *know*, you dull wit.  But if we attract attention we'll be putting him in more danger.\"\n\n\"What if somebody recognizes him?\"\n\n\"Then we grab him and say he's our prisoner.\"\n\n\"And the robes?\"\n\n\"We smuggled him out of the palace disguised as one of our own so no one would chase us.\"\n\nThe lack of argument from there told Lacus he accepted the plan, even if he didn't like it.  Lacus didn't like it either; he wanted to grab Florus and drag him into one of the buildings they were passing, shove him in a barrel, and roll him out of the city.  Or *anything* other than let him walk in the front and take all of the attention.\n\n*Note to self; learn to speak Sammosan.*  If it wasn't for Florus's education they would be dead already, so he had to relax and follow along.\n\nThey were within sight of the ships when someone came up and actually stopped them from walking any further.  A tall man with biceps as big as Lacus's head blocked their path and asked Florus something.  Lacus couldn't follow the conversation at all, but the man seemed to be asking the prince some questions.  They both looked at Lacus and Secundus for a moment before the prince answered another question.\n\nThe person stopping them smiled and nodded.  \"Welcome future to home, brothers,\" The big man spoke in halting, heavily accented Haranese.  He made a gesture with his fist that Lacus actually understood from years of doing something similar as a Royal guard; it was some sort of salute.\n\nBoth he and Secundus mimicked it simultaneously.  That seemed to please the big man and he left them be.  It didn't make the Royal Guards feel any more comfortable though; there were *hundreds* of people here at the docks.  Sammosans, Gymirans, and people in the white robes that seemed to be from all over the land.\n\nIncluding from Harenae.\n\n\"Brothers!\" One such Haranese white cloaked figure approached, waving a torch around like a madman.  They nodded their heads in return and the man gave them a confused look, glancing at their own torches, two of which had gone out.\n\n\"By the Flame,\" he said, stepping over and holding his out.  It didn't take Lacus long to figure out what he was doing and held his extinguished torch up to reignite it.  Florus did the same.  \"It does not do to let the Flames of Hope go out.\"\n\n\"Right,\" Lacus muttered, \"our bad.  Been a rough day.\"\n\n\"It certainly looks it!  Are you three the only ones left?\"  His eyes traveled to the blood stains on their clothes; the ones left from the people they'd killed and taken the robes from.\n\n\"We're the only ones who made it this far, it seems.\" Secundus cut in gruffly.  Good answer.  Didn't confirm or deny anything.\n\n\"Glad you lot showed up when you did,\" Lacus added in.  \"Any chance we can get changed into something a bit fresher?\"\n\n\"Hmph,\" the Harenae traitor grunted, nodding his head over towards a colorful cart by one of the ships.  \"If you can afford it, The Merchant is selling fresh cloth.\"  He spat at the ground.  \"It seems even the Flames of Freedom and Hope cannot burn away the taint of greed from *everyone*.\"\n\n\"Right, well, we'll give them a chat.\"  Lacus patted the traitor's shoulder and walked around him, motioning for Florus and Secundus to follow.  Another Shen merchant, by the look of the cart, was set up at the edge of the docks.  Unlike the one Lacus had met a few weeks earlier, there was no crowd of peasants clamoring about.\n\nLacus smacked his fist on the side of the cart, right on the closed wooden shutters.\n\n\"Hey!  Merchant!\" he barked, hoping this one spoke Haranese like the last one did.  \"We need some-\"\n\nThe shutters opened and the same Shen trader from some weeks earlier appeared.  Their headdress was different - more blues, less reds, and different feathers that were shorter and seemed to glitter green in the torch light - but their face was the same and their eyes widened in recognition.\n\n\"Fariba?\" Secundus asked.\n\n\"My friends!\" They said, walking out the side of their cart and around to embrace them.  First Secundus, then Lacus, then when they went to hug Florus Lacus grabbed their arm and pulled them away.\n\n\"Hold on,\" he said, \"I thought you said you were leaving.\"\n\n\"And leave Fariba did!\" they protested, gently tugging at Lacus's fingers to free their arm.  \"And now Fariba is back.  It is most unfortunate that you did not heed Fariba's-\"\n\n\"Did you sell us out?\" Secundus asked, grabbing Fariba by the throat.\n\n\"Hey!\" Someone called.  A group of white cloaks were walking by.  One was laughing.  \"Their prices are shit but they're useful.  Don't break'em!\"\n\nSecundus let go of the Shen merchant, who straightened their robe and adjusted their headdress.\n\n\"Fariba sells only the finest goods and information,\" they said, \"but Fariba never sells out.  That is *very* bad for business.\"\n\nLacus doubted Fariba *never* did anything, but did buy that the merchant would make the best choice for business.  Seemed like the Shennese thing to do.\n\n\"And you expect us to trust you?\" Secundus asked through a clenched jaw.\n\n\"Fariba expects nothing but for their friend to see what is in front of their bushy noses.\"  The merchant reached up and ran their fingertips through Secundus's mustache.  \"If Fariba wanted to sell you out, when surrounded by people who would do you harm, why wouldn't Fariba do so right now?\"\n\n\"Because we'd beat you bloody with our torches then burn your cart?\" Lacus offered.\n\n\"Fariba knows you would not; how would you keep your prince safe if so?\"  The merchant lowered their voice and nodded at Florus, who was staying close behind Lacus during this exchange.\n\n\"Fine, you aren't a traitor then,\" Secundus conceded.\n\n\"Fariba is not from Harenae so could not be a traitor anyway.\" They shrugged.\n\n\"Can you prove your *friendship* and get us out of here?\" Secundus continued.\n\n\"But of course!\"  Fariba said, much, much louder.  \"Fariba will happily get you out...of those soiled robes.  Come! Come!  Set your flames in the sconce here and Fariba will dress you in the finest fabrics you can afford.\"\n\nLacus glanced over his shoulder.  Absolutely no one was giving them even the slightest attention.  It seemed that he wasn't the only one quickly tired of Fariba's boisterous nature.\n\n\"Come, come friend!\" the merchant said.  Lacus looked over and saw that Secundus and Florus were already entering the large, colorful cart.  He followed them inside, not realizing how cramped it was until he was pressed up against the prince and the wall to let Fariba pass.  They closed the shutters and continued speaking quietly.\n\n\"Begin by disrobing,\" they said, \"and Fariba will give you fresh robes in case we are snooped upon.  Unlikely, buuuut,\" they shrugged, \"anything is possible these days it seems.\"\n\n\"How are you getting us out of the city?\" Florus asked.\n\n\"You will remain in Fariba's cart,\" Fariba answered, \"hidden beneath some of Fariba's wares.  They have yet to search this cart given we are all friends.\"\n\n\"And if they do?\"\n\nFariba shrugged.  \"Then you are stowaways.  Fariba can only do so much to save your skins.\"\n\nLacus didn't like that answer, but he wasn't in a position to argue.  This was the only reasonable way out that he could see.  When Secundus and Florus began to disrobe, he followed along.  \n\nTheir lives were in Fariba's hands now.\n\n\\----------------  \n[\\[<= *Of Flames & Flight*\\]](https://new.reddit.com/r/shortstories/comments/1bwywks/fn_penumbra_chapter_5_of_flames_flight/) [\\[Chapter Index\\]](https://www.reddit.com/r/TomesOfTheLitchKing/comments/1bt9vl7/index_penumbra/) [\\[*Of Hiding & Help* =>\\]]  \nAll crit/feedback welcome!  \nr/TomesOfTheLitchKing\n\nNotes:  \n- End of Act 1", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "**Welcome to the Short Stories!** This is an automated message.   \n\nThe rules can be found on the sidebar [here]( https://www.reddit.com/r/ShortStories/about/sidebar).\n\n**Writers** - Stories which have been checked for simple mistakes and are properly formatted, tend to get a lot more people reading them. Common issues include - \n\n* Formatting can get lost when pasting from elsewhere.  \n* Adding spaces at the start of a paragraph gets formatted by Reddit into a hard-to-read style, due to markdown. Guide to Reddit markdown [here](https://www.reddit.com/wiki/markdown)    \n     \n**Readers** - ShortStories is a place for writers to get constructive feedback. Abuse of any kind is not tolerated.    \n     \n***  \n\nIf you see a rule breaking post or comment, then please hit the report button.           \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/shortstories) if you have any questions or concerns.*"}]}, {"post_title": "[HR] The Monster from the Waves", "post_url": "https://www.reddit.com/r/shortstories/comments/1bxqc4y/hr_the_monster_from_the_waves/", "post_main_text": "To explain what I saw today is near-impossible. My nerves still reverberate fear through my body like a struck tuning fork. I struggle at times with questioning my sanity, wondering if what I had seen was a dream or hallucination, but sadly, the absence of my dear friend speaks only that my experience was true.\n\n\rIt happened this morning whilst fishing off the shoreline of our favorite beach. The day was overcast, but the thought of rain had never crossed our minds. Really it was the perfect time to go fishing. \n\n\rWe managed to catch enough fish to fill a bucket within an hour of our time there. It seemed somewhat odd to have had that good of luck, but we both just chocked it off to the good weather. \n\n\rRoughly an hour later we nearly filled our second bucket when I felt a sudden change in the air, almost like it was electrically charged. I asked my friend if he felt it as well, and he said he did. \n\n\rAfter a few moments of silence, my friend yelled for me to direct my attention towards the shore, and I noticed how quickly it was encroaching. We scrambled to gather our things and nearly lost all of our fish in the panic to reach higher ground. My friend and I could not surmise what was causing such a rapid rise in the shoreline. It had swelled dozens of feet within mere minutes!\n\n\rWe should have left after seeing the tide rise so quickly, but for some reason, we stayed. The charged air. The rising tide. It was so captivating. \n\n\rThings suddenly took a drastic turn when, far off in the waters, we could see a strange light. It was a bright blue glow that drew closer and closer to the shore. My mind kept screaming at me, pleading with me to run. I knew that whatever was in that water was not worth piquing my curiosity. But my legs would not budge. They were held firm to the ground with the unbreakable glue that is fear. \n\n\rThe light drew closer. I was able to make out what looked like an incredibly large, glowing blue snake, then the glow stopped… and everything went silent. The gulls went quiet, the wind became dead, and the water that lapped on the shoreline ceased its constant, tranquil, whooshing. \n\n\rMy heart began to race as I watched the surface tension of the sea bulge upward, then stone mountains pierced the water and began rising towards the sky. They continued upward, followed abruptly by thick scales and tremendous heft. I nearly had a heart attack as I stared at this massive monstrosity that was emerging from the waves. It seemed to be hundreds of feet tall and looked like some sort of reptile. The monster’s hands were big enough to crush a house to dust. Its eyes, massive and terrifying, gave off a stare that pierced the air like an arrow. Behind it was a massive, muscular tail that certainly had the strength to rupture the earth and create shockwaves strong enough to topple multiple city blocks. Whatever this creature was, I knew it had the power to destroy all of Tokyo if it wished. \n\n\rI began to back away, slowly at first, but then I turned and quickly ran. I looked back to see my friend still standing at his same location. I was about to run after him, but then I noticed the monster inhaling deeply, expanding its massive chest with air. It opened its enormous mouth that was filled with razor sharp teeth and let out the most deafening roar I’d ever heard. I quickly covered my ears, but that was not enough to prevent irreversible damage to my hearing. The shockwave from the monster’s roar felt as though it nearly stopped my heart. I could barely breathe as the force of the noise continually battered my body, and I watched my friend collapse to the ground. \n\n\rAfter the roar finally stopped, the creature began to move towards land, placing its gargantuan feet on the shoreline. It trudged along, swaying its massive body back and forth as it moved; each step sending out a shockwave that knocked me off my balance. I watched the hulking beast lumber towards Tokyo, leaving behind craters for footprints. \n\n\rI ran over to my friend. He had no pulse. The shockwave from the creature’s roar had killed him.\n\n\rI have not yet heard any news as to whether or not the creature made it to Tokyo. I have no doubt in my mind that it was successful, however. No amount of military firepower could bring that thing down. I’m sure of it…\n\n\rI struggle now with the realization that I share my world with this monster from the waves.\r", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "**Welcome to the Short Stories!** This is an automated message.   \n\nThe rules can be found on the sidebar [here]( https://www.reddit.com/r/ShortStories/about/sidebar).\n\n**Writers** - Stories which have been checked for simple mistakes and are properly formatted, tend to get a lot more people reading them. Common issues include - \n\n* Formatting can get lost when pasting from elsewhere.  \n* Adding spaces at the start of a paragraph gets formatted by Reddit into a hard-to-read style, due to markdown. Guide to Reddit markdown [here](https://www.reddit.com/wiki/markdown)    \n     \n**Readers** - ShortStories is a place for writers to get constructive feedback. Abuse of any kind is not tolerated.    \n     \n***  \n\nIf you see a rule breaking post or comment, then please hit the report button.           \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/shortstories) if you have any questions or concerns.*"}, {"comment_author": "Usr7_0__-", "comment_text": "I love monster tales like this one. Very much enjoyed it. In my mind, it is a creature that suddenly makes all of the fictional Godzilla tales no longer so farfetched to the narrator. Imagine being that person and realizing that monsters are real..."}]}, {"post_title": "[SF] The Number", "post_url": "https://www.reddit.com/r/shortstories/comments/1bxtj4i/sf_the_number/", "post_main_text": "This story is one I wrote that I have on another social media site; wanted to share it here as well and see what others might think. Thank you. I have a short note after the end just to explain my intentions. It is about 1000 words I think. Hope you like it...\n\n\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\n\nThe Marine ship was in low orbit around ExoP-19-D, a satellite that was about the size of Earth. It would descend down near the surface in short order. Captain Vallix gave some last minute instructions to the Transportotroopers.\n\n\"They're going to be tough. But the BioWeapons will take care of them.\" One of the soldiers thought about the BioWeapon; they all had them, and they were pretty effective. It shot cartridges that contained what looked like a little animal fetus inside a chamber of liquid medium. The liquid was actually a device to keep the organism in permanent stasis; permanent until it entered the body of the enemy. At that point, it rapidly reproduced itself, producing thousands of copies in mere seconds, absorbing the energy out of the host. The copies would pop out of the host's body almost immediately, plunging into any nearby enemy host. It was essentially a perpetual grenade. Eventually the process would slow down and stop, but the chain reaction sustained itself for a frightening while.\n\n\"We're going to be in a Pepper Zone. Make sure your ThoughtBlockers™ and Selective Opto-Inhibitor Accessories™ are on.\"\n\nEveryone tensed up. The phrase Pepper Zone meant nothing and was completely a random designation. It was meant to make you not think about...it. That's what all the soldiers literally thought. We can't think about, it. That's hard to do, they all agreed to themselves.\n\n\n\nThe ship skimmed above the surface at tree-level. As the rectangular box quickly flew by, Marines appeared on the surface. It doesn't happen often, but one died in the transport; the mRNA probably broke down during the quantum exchange. That's usually the cause of failure.\n\nThere was no time to vacuum the jellied remains. A cenotaph would have to do back home.\n\nThoughtBlockers™ were activated at Vallix's command.\n\nAll of them had a hard time as the sound waves within their helmets blasted their ears. They were disoriented. They could hardly think.\n\nUnfortunately, one of the soldiers, Veevo, an achingly beautiful private in her second tour on ExoP-19-D, had become, right at that moment, immune to the device. She experienced only 50% blockage, maybe as high as 65% on an intermittent basis. It probably wouldn't be enough. The Opto-Inhibitors would help unless she stepped on one of the new Number Mines the enemies were using in the Zone.\n\nWhich she did.\n\nThe weird spider-things descended on her fairly swiftly; no one around her could think to help. Even though a very small amount of thought was allowed through – less than 1%, if the soldier could take it – any thought of assisting Veevo would have been immediately discarded. There simply was no helping her. The Marines moved forward, cautiously looking out for any signs or Number Bombs, or LDAs (Laser Digit Attacks).\n\nVeevo loved her country. She had planned on marrying a prince someday; settling down with a family. All that was gone now. It's what happens sometimes when you attempt the new version of going over the top; how many of the soldiers in the Great War survived No Man's Land, anyway?\n\nPoliticians back home would waste no time in calling Veevo a hero.\n\n\n\nVallix walked along the terrain. Somewhere, in the back of his mind, even as the onslaught of the loud blocking sounds kept synaptic thought to only the essential minimum, he thought about the descent. What he was telling his soldiers.\n\n\"You know what they did to a Marine back in Texas? He came into his barracks and happened to mention that he knew the value. The number. When it was reported what he had done, told his fellow brothers, the MPs came and dragged him to the brig. Ooh rah! He was court-martialed and in two days, executed.\"\n\nThe soldiers looked back at their commanding officer with faces of stone.\n\n\"This is important. Once you know the number, you're dead.\"\n\nThis was somewhere in the back of his mind. It was in the same place as the number. It eventually came to the surface.\n\nWhen it did, the spider-things, which were all around the zone, activated.\n\nVallix collapsed as the lower part of his legs dissolved from the venom.\n\n\n\nThe number really wasn't a big secret, but if it was possible to censor that information, then the government made an attempt. It wasn't possible on any macro level, but there were recruits here and there that didn't know it. The triggering number.\n\nThe signs though tried to communicate them.\n\nOne soldier, a veteran named Graggf, came in front of a sign at the very moment when her Opto-Inhibitor failed. The number then invaded her mind. The docile spider-things awakened.\n\nShe panicked. Took off her helmet.\n\nThey entered her suit from there.\n\nShe screamed. Ran. Fell down.\n\nDisappeared.\n\n\n\nThere was talk of surgical intervention that would render soldiers incapable of remembering numbers. That was still a possibility. But they couldn't make it work. Not on a practical level. If someone had a handicap, then it probably would be difficult to become a Marine. Same thing goes for neurological disorders that would make numbers hard to store. Might be great for the Zone, but only for that.\n\nColonizing this planet was paramount. The soldiers always remembered that when the ThoughtBlockers™ were turned off. When they were turned on, they just wanted to get from A to B as fast as possible.\n\nFighting the spider-things was impossible. They were too quick; numerous. Like wasps. There were nests everywhere in a Zone. Bombing from above wasn't possible because the enemy could stop the weapons with some unknown strategy.\n\n\n\n\"It doesn't matter what the language is,\" Professor X. Xoy-Potts said in his famous lecture about the subject. \"Once the value is in the synaptic soup, whether the value is synthesized via English, Russian, French, Finnish, whatever...once constructed, the effect is chilling. At least if a human is doing the evaluation, as far as we know. We think they're mutations, and we have no idea how they evolved to select this idiosyncrasy. They prey on other food sources on ExoP-19-D in the normal way. Darwin would be perplexed into silence.\"\n\nA series of Number Mines detonated; the numerals formed within the smoke. They were blocked. Still, one of them was out.\n\nTwo of the enemy appeared to the left of the group. They tried to sign the number with their hands, which had extra digits than humans (the enemy was somehow immune). One marine was out.\n\nThe BioWeapon took care of the enemy.\n\nSpeakers were everywhere, of course. One was particularly loud, and the marine with the ThoughtBlocker™ that had dipped for two seconds was out.\n\nOne of the marines was captured. She would be put in one of the tanks at the enemy base. She would not be able to not think of the number.\n\n\n\nThose remaining reached the rendezvous point. The Zone was now behind them.\n\nNevertheless, not one of them would return home.\n\n\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\n\nThank you for reading, it is appreciated! So I love high-concept ideas and challenged myself: try to come up with something like A Quiet Place (can't make a sound) and Bird Box (can't look). I thought to myself: what if you can't think of a certain number? As simple as that. I have no idea if this concept has already been done or not. Think it might make a neat short film. Of course, I decided at the time to write it like an Asimov's-magazine type tale, with all the sci-fi trappings, but if I ever adapted it as a short screenplay, I probably would simply set it in the not-too-distant future in suburbia, and have it be more character-driven and streamlined. \n\nJust a hobbyist short-story writer who enjoys sharing tales from time to time...\n\n  \n", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "**Welcome to the Short Stories!** This is an automated message.   \n\nThe rules can be found on the sidebar [here]( https://www.reddit.com/r/ShortStories/about/sidebar).\n\n**Writers** - Stories which have been checked for simple mistakes and are properly formatted, tend to get a lot more people reading them. Common issues include - \n\n* Formatting can get lost when pasting from elsewhere.  \n* Adding spaces at the start of a paragraph gets formatted by Reddit into a hard-to-read style, due to markdown. Guide to Reddit markdown [here](https://www.reddit.com/wiki/markdown)    \n     \n**Readers** - ShortStories is a place for writers to get constructive feedback. Abuse of any kind is not tolerated.    \n     \n***  \n\nIf you see a rule breaking post or comment, then please hit the report button.           \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/shortstories) if you have any questions or concerns.*"}]}, {"post_title": "[SP] Caroline's Cove", "post_url": "https://www.reddit.com/r/shortstories/comments/1bx4mmj/sp_carolines_cove/", "post_main_text": "    Happy birthday.” She said, and handed me the card.\n“Really?” I laughed. Oh my God. She was so cute. What a great friend to remember, but a psychic appointment? Really?\n“I just know you’ve been having a rough time and I thought it might help.” She said.\nI hugged her.\n“You’re a good friend. Thank you. That’s really sweet.” I replied. I meant it. It was thoughtful. It was my birthday and, she was right, I’d been thru hell.\n\n“Something is missing.” The psychic said, lighting a candle and motioning me to sit down.\n“Besides my bank account?” Just kidding, not really. I was broke but not super broke. My newly started business had flopped. I’d invented a blow dryer holder I thought would revolutionize how women got ready. I was wrong. It didn’t catch on. I’d spent so much money and time developing and bringing it to market. I’d lost track of myself. A bottle of wine every night couldn’t blind the truth of my failures. I was dying inside because of it.\n“All this trouble you’ve made for yourself.” She told me, “Doesn’t distract you from what’s really missing. It’s only been an attempt to create something else. But that’s not going to happen. Give up. Cash out. Go find what you’re missing. You know what you need”.\n\nI drove home. She was right. \n\nWhen I was fifteen I ran away from home. I went to a party and met the love of my life. No seriously, it was love at first sight. His name was Daniel. He was a year younger - which is a lot at that age. We hooked up and went back to his grandmother’s house. She was an alcoholic. We lived at her house together all summer. My parents barely noticed I’d left. Then one day the cops showed up. I cut off a lock of his hair to take with me. I told him I’d love him forever. My patents shipped me off to boarding school. Three weeks later I found out I was pregnant. I called him and left a message with his grandmother to call me. He never did. I had a miscarriage. Later, I graduated and went off to college and after that I started my business. Every relationship I had – failed. Some where during these times I’d heard he’d gotten married and had a daughter of his own. I wondered if he ever thought about me.\n\nI came home to my apartment. My dog was sick. I took him to the vet and found out he had advanced cancer. I took care of him as long as I could. I loved him so much. It killed me later when he died in my arms. I took a lock of his hair for keepsake. He was my best friend. I wasn’t ready to let him go.\n\nThe psychic had given me a small book having something to do with resurrecting the dead, to read when I felt so inclined. She thought it would help “find what’s missing”. I decided to “Give up and cash out.”  After all, there was nothing here for me now. Glancing thru Face Book I saw that a friend of a friend was a friend of Daniel’s and that Daniel had passed away. No details how or why.\n\nI had forty thousand dollars left in the whole wide world. I bought a fixer upper mobile home on a small piece of land across the street from a forest in the rural community of Caroline’s Cove. It was a small and rustic lake community. I opened a little boutique where I could sell cute clothes and items and hopefully make friends. The locals were nice but not overly friendly. I guess they were figuring how long I would last.\n\nOne night after work I got drunk and broke out the book. I took my dog’s lock of hair and placed it in a glass bowl. I lit a candle and said a prayer, then burned the hair. I looked to the woods across the street. The trees swayed in the wind. That same wind blew out the candle and I got so scared I picked up my wineglass and ran back inside. I took a bath and went to bed, wondering how cool it would be if that shit really worked.\n\nThe next morning, I woke up with a screaming headache. I made coffee. I heard a scratching and whine at the front door. I opened it and nearly fainted. My canine best friend sat on the porch. Oh my God, I nearly died of happiness but still couldn’t believe my eyes.\n\nI put newspaper all over the floor and left him there when I left for work.\n“Be home soon. You stay here.” I told him. “Wait for me”.\n\nI went to the shop and was glowing, more-friendly than I’d ever been. The customers must have noticed because I got invited to a party later that week. I said I would go.\n\nI came home and sure as shit – there he was. I made him chicken for dinner and we went for a walk. He was happy and healthy as he’d ever been. I called the psychic.\n“That book really works.” I said.\n“It does.” She replied, ‘But only for those who really want to return.”\nForeboding I must say but I was too overwhelmed with joy to give it much thought.\nThat night I celebrated. I sat on the front porch with a bottle of wine, then two. I took Daniel’s hair from a box of memories and lit a candle. I placed the lock of Daniel’s hair in a glass bowl and burned it.\nMy dog lay at my feet watching the woods. The wind blew. The candle blew out.\nNothing happened.\nI waited and waited. I grew tired. At last I wandered off to bed. I was okay with it. I had my dog, a new place to live and was finally a peace with my life. I was fine. All was good. Good night.\n\nThe next morning another vicious headache awakened me. Oh God, I hate hangovers maybe one day I’ll quit drinking. I turned over to hide from the light and there he was, lying beside me in bed, naked. Oh-My-God.\nI jumped up and watched him sleeping. He was really there. I touched him a few times and he didn’t wake up. Wow. I made coffee. I came back into the bedroom. He was still asleep. Pup needed a walk so we went and when we came home there he was, standing in the kitchen, dazed.\n“Hi.” He said.\n“Hi!” I responded, unsure what to do next.\n“My head hurts. I’m tired.” He said.\n“I’ll make you some breakfast.”\nI did. He ate slowly and then went back to bed.\nI watched him sleeping. I left him with the dog.\n“I have to go to work now. Take care of him.”\nMy pup whined. I knew he understood and I left for work knowing this was surely the oddest day of my entire life.\n\nI returned home eight hours later. He was standing in the kitchen, doing the dishes I’d left in the sink.\n“You don’t have to do those.” I said.\n“No, it’s alright.” He replied, and then looked at me strangely. “Are we married?” He raised his left hand, displaying his ring.\n“Yes. -- Spiritually.” I responded.\n“Where’s your ring?” He asked.\n“I lost it.” I stammered, not knowing what else to say and bummed I had started this off with a lie.\n“Oh.” He replied. \nI followed his gaze to my chest. I’m lucky enough to wear whatever I want to work and today I had been wearing a sundress with tiny string straps. If you stood close enough you could see the tops of my boobs and that was what he was looking at. He reached a tentative finger forward and placed it on my chest, moving downward. I froze, literally frozen, and held my breath.\n“Maybe we should take this inside.”\nThose were the words he used when he wanted to have sex. I almost exploded as he said them.\n“Yes.” I replied, “Let’s take it inside.” \nWe “took it inside” all night long. I prayed for a baby not knowing what that might bring. In the morning, we laid side by side, together. Nothing had changed all these years. I was still so in love. So much in love in fact, I’d do anything to live this way forever, and so our life together began.\n\nI made coffee. I walked the dog. We had breakfast together and I left for work. When I returned home he was fixing the roof – he’d basically fixed everything around the house. Oh my God, who knew I would be so blessed.\n“I was thinking about getting a job.” He said.\nReally?” I responded, “Why?”\n“So, you don’t have to work so much. Maybe I could buy you a new ring.”\nI didn’t want to argue. I didn’t want him out in the world but at the same time, I wanted him to feel good about his being here. I said okay.\nThat coming Friday was the party I’d been invited to. We were excited to go.", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "**Welcome to the Short Stories!** This is an automated message.   \n\nThe rules can be found on the sidebar [here]( https://www.reddit.com/r/ShortStories/about/sidebar).\n\n**Writers** - Stories which have been checked for simple mistakes and are properly formatted, tend to get a lot more people reading them. Common issues include - \n\n* Formatting can get lost when pasting from elsewhere.  \n* Adding spaces at the start of a paragraph gets formatted by Reddit into a hard-to-read style, due to markdown. Guide to Reddit markdown [here](https://www.reddit.com/wiki/markdown)    \n     \n**Readers** - ShortStories is a place for writers to get constructive feedback. Abuse of any kind is not tolerated.    \n     \n***  \n\nIf you see a rule breaking post or comment, then please hit the report button.           \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/shortstories) if you have any questions or concerns.*"}]}, {"post_title": "[FN] <Penumbra> Chapter 5 - Of Flames & Flight", "post_url": "https://www.reddit.com/r/shortstories/comments/1bwywks/fn_penumbra_chapter_5_of_flames_flight/", "post_main_text": "Lacus lamented not taking the servants' passageways sooner.  They weren't as spacious or well-lit as the main halls, but they were easy to navigate and mostly straight lines.  Getting out of the palace was a breeze; they'd done it by accident.  Turning a corner and getting a view of the sky out of an open door surprised all three of them but they didn't stop to gawk.\n\n\"Alright, where are we?\" Lacus asked once they were in the open air again.  The bells were a bit quieter now; some still rang in the distance but the palace alarms had gone silent.\n\n\"We're by the East Gate,\" Florus answered, surprising Lacus.  He pointed up.  \"I recognize this street from my garden.  Lacus looked up and, sure enough, he could see the ropes that the invaders had used to scale the wall.\n\n\"Come, more may be on the way,\" Secundus barked.  Lacus couldn't have agreed more.  He led the way, holding Prince Florus's arm as Secundus brought up the rear.  They avoided the East Gate to the palace and headed into the narrower streets between buildings.\n\nThe Royal stables were not connected to the Palace - far too inappropriate a smell for that - but they were close.  Lacus used to think it was stupid to keep them further away because of the smell; the palace was large enough that there was no way it could have been offensive.  Now, though, it was perhaps the most brilliant tactical choice he could imagine.\n\nUnfortunately, as they emerged from the surrounding buildings and to the pen where the horses were kept, they were greeted with five people robed in white holding torches to the building.  While the structure was stone and brick, there were bales of hay and boxes of food that caught.  The horses were gone, at least; stolen or taken by others to escape.\n\nThe white robes saw them and shouted something in Sammosan.  Lacus held up his spear and Secundus stepped up behind him with his sword and shield ready.\n\n\"Stay back,\" Lacus grunted over his shoulder.  The white-robed Sammosans ran at them.  The one at the lead swung his torch but did not get near enough to do anything with it as Lacus stepped forward and speared him through the stomach.  He twisted the weapon and pulled the dying man closer, kicking him off and into the next one charging forward.  Their bodies tangled and he fell.\n\nSecundus stepped into another one's reach, batting the torch away with his shield and swiftly driving his short blade into the foreigner's ribcage.  The bearded guard always seemed to know exactly where to pierce an enemy without hitting their ribs.  He slashed at the next two while Lacus finished off the grounded invader.  \n\nOnce all five were dead Lacus looked back to make sure Florus was still okay.  He looked rightfully shaken but was otherwise unharmed.\n\n\"What now?\" Lacus asked Secundus.\n\n\"We need to keep moving.\"\n\n\"No shit.  *Where* to?\"\n\n\"We'll make for the North Road,\" Secundus said, sheathing his sword and kneeling down next to one of the dead men.  \"Some of the Sammosans who ambushed the Magistrate were wearing robes like these.  We can use them to conceal ourselves.\"\n\n\"Oh yeah, sure, just walk around in bloodstained white robes.\"  Lacus had his doubts but joined Secundus in stripping the bodies.  He was quite surprised to find that one of them was a woman, but it worked out that her robes were closer in size to Florus than the other men's.\n\nThe prince was reticent to dress in a dead person's clothing but did not argue.  Lacus helped him with the robes as the style was different than the royal outfits he usually wore and wasn't prepared for the folds of fabric or where to tie them off.\n\n\"Okay, torches.  One of us should act wounded.\" Secundus looked at Florus.  Lacus agreed with the idea and ducked under one of the prince's arms.\n\n\"Lean on me,\" he said, \"and hold your hand over that blood stain.\"\n\n\"This is gross,\" the prince complained but complied.\n\n\"Keep your head down,\" Lacus continued, scooping up some dirt from the ground and rubbing it on Florus's face.\n\n\"You'll have to leave your spear.\" Secundus pointed at Lacus's weapon.  He hated dropping it but knew his friend was right.  Only having a torch as a weapon made him feel naked, even more so than not having his shield or armor on.\n\n\"Right, follow me, we'll get out of the city and hide in the countryside.\"  Secundus led them away from the now blazing stables.\n\nThey didn't make it far before they ran into another group.  A dozen men and women - denizens of the city - were running down the street and came to a stop at the sight of them.  The fear on their faces was clear.  \n\nNormally, Lacus wouldn't have given some laborers like them a second look, but right now he was keeping the prince safe.  He set his jaw and tilted his head, letting his prominent brow line cast a shadow from the torch over his eyes.  The afternoon sun didn't help the effect too much, but it was enough.  Whatever other white robes these people had encountered had done the hard work for them, and the citizens turned and ran back the way they'd come from.\n\nSecundus led them across a main street and into another alley.  They weren't heading directly north yet, but somewhat westerly.  Lacus knew going along the wall would expose them to fighting, and getting on the main road would make them easy targets so he followed the more capable guard and focused on keeping Florus close.\n\nThey turned a corner and were behind a group of soldiers in black, leather armor.  Four of them were kneeling down on the ground and pointing at lines they'd made in the dirt.  Four more were looking over their shoulders and three were keeping a lookout.\n\nOne spotted the trio and reached for their sword, but stopped.  He barked out some words in Sammosan, which Lacus couldn't understand.  He looked at Secundus, whose jaw was set firmly.\n\nFlorus spoke up, saying something in the same language while keeping his head lowered.  Lacus looked down at him, surprised at how pained he sounded.  Had he pulled the prince too hard?  Or was he *actually* good at acting?\n\nOne of the soldiers kneeling on the ground looked over at the conversation and stood up.  They removed their helmet - another woman - and Lacus realized that she was Harenaen, not Sammosan.\n\n\"Brothers!\" she said, walking over and clapping Secundus on the arm.  \"You have done well, follow this road,\" she pointed back, the opposite direction Lacus and them wanted to go.  \"There is a foothold by the docks with medicine men and wizards to help your friend.\"\n\nShe stepped closer to Florus.  Lacus tensed but noted she wasn't drawing a weapon.  The woman leaned in and pressed her forehead to the prince's curly hair.\n\n\"May the Flame protect you, brother.\"  She went back to the huddle of soldiers.\n\n\"*Go*,\" Florus whispered, taking a step the way the woman had indicated.  Going further *into* the city seemed like a terrible idea, but there were nearly a dozen soldiers there.  Soldiers, with swords and shields and spears.  Going the opposite way would be suspicious, and suspicion was *not* what they wanted to draw.\n\nThey walked down the road.  Secundus whispered that they would go around the bend and, once out of sight, double-back down the alleys.  But they encountered more soldiers, and more white robed Sammosans.  While they were not accosted, everyone they passed did look at them and give approving nods.\n\nThere was no chance for them to step off of the main road to a side path.  More soldiers were coming up along the street, flowing from the harbor.  They didn't move in orderly columns like proper soldiers, but jogged in small groups and broke off down the side alleys seemingly at random.\n\n*Shit,* Lacus thought.  They had no choice but to keep up the game of charades.\n\n\\----------------  \n[\\[<= *Of Empires & Escape*\\]](https://new.reddit.com/r/shortstories/comments/1bw4kgr/fn_penumbra_chapter_4_of_empires_escape/) [\\[Chapter Index\\]](https://www.reddit.com/r/TomesOfTheLitchKing/comments/1bt9vl7/index_penumbra/) [\\[*Of Secrets & Smuggling* =>\\]](https://new.reddit.com/r/shortstories/comments/1bxs32c/fn_penumbra_chapter_6_of_secrets_smuggling/)  \nAll crit/feedback welcome!  \nr/TomesOfTheLitchKing", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "**Welcome to the Short Stories!** This is an automated message.   \n\nThe rules can be found on the sidebar [here]( https://www.reddit.com/r/ShortStories/about/sidebar).\n\n**Writers** - Stories which have been checked for simple mistakes and are properly formatted, tend to get a lot more people reading them. Common issues include - \n\n* Formatting can get lost when pasting from elsewhere.  \n* Adding spaces at the start of a paragraph gets formatted by Reddit into a hard-to-read style, due to markdown. Guide to Reddit markdown [here](https://www.reddit.com/wiki/markdown)    \n     \n**Readers** - ShortStories is a place for writers to get constructive feedback. Abuse of any kind is not tolerated.    \n     \n***  \n\nIf you see a rule breaking post or comment, then please hit the report button.           \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/shortstories) if you have any questions or concerns.*"}]}, {"post_title": "[FN] <Penumbra> Chapter 4 - Of Empires & Escape", "post_url": "https://www.reddit.com/r/shortstories/comments/1bw4kgr/fn_penumbra_chapter_4_of_empires_escape/", "post_main_text": "For three weeks the Royal Guard conscripted the poor sods of the city.  At first, it was like pulling teeth, and Lacus was half-assing it because of the trouble.  No one wanted to fight, not even for two copper pieces a day.  Almost a soldier's salary with less than half of the duties.\n\nThen news of the fighting in the mountains started to trickle into the city.  The Imperial Army retreated from strongholds.  Monsters.  Lacus didn't believe most of it.  But, to the surprise of no one, the common folk did and he watched them start to line up to be given spears and shields.\n\nDrills were the worst part of it all.  He was a guard, not an instructor.  Dealing with *people*?  People were the worst.  Lacus had no patience, tact, guile, or desire to learn any of the three.  He wanted to sit on a bench, eat grapes, and watch the sunrise before taking a walk through pretty gardens or following the prince around on his palatial-centric errands.\n\n\"Ugh, no you dumbasses.\"  He rubbed his temple and prodded one of them in the back with the blunt end of his spear.  Their stances were terrible.  Legs all out of position.  \"You won't stop any oncoming charge like that.  Look.\"  He walked around in front of one of the peasants; an older fellow with hair starting to grey at the temples.  The man was a fisherman, judging by the smell, and had strong shoulders because of it.  Lacus jabbed him in the chest and he stumbled back.\n\n\"Someone comes running at you, you wanna be able to stay put when they run into your spear,\" he told them.  \"Otherwise, you-\"\n\n*Dong!  Dong!  Dong!*\n\nThe city's alarm bells began to ring.  Only the ones to the south by the docks at first, but the alarm spread.  Lacus looked up towards one of the watch towers in the palace.  The guard stationed up there leaned out of a window and waved a blue flag.\n\n*Shit.*\n\n\"Alright, Gutter rats, head to the front gate,\" he yelled without actually paying them any attention.  Picking up his shield he left them to do honestly whatever they wanted.  Lacus didn't care, he had his orders.\n\nHe ran into the palace, it's vaulting corridors filled with flowers and colorful banners that gleamed in the daylight.  Normally they were filled with the sounds of palace visitors, servants of the King, and dignitaries and court officials of some form or another going about their business.  But now it only sounded like bells.  Deep, booming bells of war.\n\n\"Lacus!\"  Secundus emerged from a side hall and joined him in jogging up the stairs to the upper floors.\n\n\"Florus still in his garden?\" Lacus asked.\n\n\"Should be.\"  They had discussed these plans at length and practiced them a few times.  Lacus was never one for actually *doing* things, but now he was regretting it.  He didn't know what was going on or where the threat was coming from.  Which escape routes to take.\n\nComing down the other way were four Imperial Guards and the Magistrate.  They shoved Lacus and Secundus aside as they guided their charge away.\n\n\"Hey, follow them,\" Lacus told Secundus, \"They'll know which way's the best way out.  I'll bring Florus behind you.\"\n\nSecundus nodded and ran back down the stairs after the Imperials.  Lacus ran the rest of the way to the gardens where Florus spent most of his day.\n\n\"Lacus!\" The prince called when Lacus made it out of the tall doors.  He was on his knees in a circle of flowers, the city bells drowning out whatever else he said.  Lacus didn't bow, didn't smile at him, or speak at all.  He ran out and grabbed the man by his arm, hoisting him to his feet.\n\n\"We need to go!\" he yelled between the sounds of the bell.  The prince pointed past Lacus, out over the edge of the palace.  To the south, pillars of smoke were rising from the bay.  He couldn't see that far very well, but he suspected that the ships in the water weren't just fishing boats.\n\n*Clank*\n\nThe sharp sound stuck out despite the louder alarm bells of the city.  Metal on stone.  Again.  And a third time.  Lacus saw a hook fly up in the air and catch on one of the ramparts around the garden.\n\n*Shit!*\n\nHe pushed the prince down into the flowers and ran over to the wall.  A head of yellow hair emerged as someone climbed up, but that was all Lacus saw before his spear obliterated the invader's face.  Removing his weapon from the corpse let it fall back down the way it had come.  He drew his knife and cut through the rope before moving towards the next one.\n\nToo slow; a tall man with thin limbs pulled himself up onto the parapet and pulled an axe off of his hip.  Unlike his compatriot, this one was smart enough to wear a helmet.  His face was hidden behind a bushy blonde beard and he threw his axe with a roar.\n\nLacus blocked the incoming weapon with his spear, the blade burying itself in the shaft of his weapon.  He ran forward and slammed into the man with his shield and knocked him back over the wall.  Another invader, following close on the other, grabbed him by the ankle and pulled.\n\n\"Wah!\" Lacus yelled, falling on his back and sliding over the edge.  His spear was long enough to catch against the ridge on either side, leaving him hanging there.  He used his shield to daze the man on the rope by knocking his head into the stone wall.  From his new vantage point, though, Lacus could see dozens of others scaling the rope behind him.\n\n\"Lacus!\"  Florus yelled.  Lacus looked up and saw the pretty brown curls dangling around the prince's eyes a he held out a hand.  Lacus dropped his shield and took the offered grip, pulling himself back up.\n\n\"We need to get you the hell out of here,\" he breathed heavily, standing up and grabbing the prince's arm.  For the first time in a long time, the royal heir didn't argue.\n\nThey ran back into the palace and down the stairs.  *Where are the other guards?*  Lacus could only imagine how the people climbing the walls had gotten all the way to the palace so quickly.  Did someone abandon their post?  Were they betrayed?  \n\nHe thought he heard something and stopped.  Florus stopped with him.  Footsteps approaching from below.  The stairway curved ahead and hid whoever was coming.  Lacus stood in front of Florus and readied his spear.\n\nSecundus appeared; his sword was in hand and blood was splattered across his face and down his breastplate.\n\n\"Intruders!\" he yelled.\n\n\"I know!\"  Lacus urged Florus forward again.  \"Some were scaling the walls.\"\n\n\"Sammosans?\"\n\nLacus shook his head.  \"I think it was the Gimmysomethings your friend warned us about.  Yellow hair and all that.\"\n\n\"Sammosans ambushed the Magistrate.  Took down three of the Imperial Guards in the process.  Me and the last one only barely managed to escape.\"\n\n\"Where'd he go?\" Lacus looked past Secundus, hoping for more backup.  The other man shook his head.\n\n\"Ran off.\"  He spat on the floor.  \"Cowardly Chol.\"\n\n\"We've gotta get Florus out of here.  Is the entrance still clear?\"\n\n\"It was when I came back.  The Magistrate and his guards were on their way to the docks but that was where the Sammosans came from.\"\n\n\"I think it's where they're attacking from.\"\n\n\"We saw smoke from the gardens,\" Florus chimed in, his grip tight on Lacus's arm. \"It looked like it was coming from the docks.\"\n\n\"The stables,\" Secundus said.  Lacus nodded.  It made the most sense.  Get some horses, and head north out of the city.  Keep the prince out of harm.  Figure it out from there.\n\n\"Right, this way.\"  Lacus nudged Florus through a side corridor.  The prince was panting heavily as they ran, unused to such exertion.  Lacus wasn't exactly in great shape either, but he at least had some practice with his guard patrols and recent weeks of training the conscripts.  But he was motivated to keep the prince safe and out of harm's way.  It was why Lacus was a Royal Guard in the first place; to stay close and keep Florus safe.\n\nThey could smell the smoke before they saw it, stopping in a dining hall.  Something was on fire nearby, and they were too far from the kitchens for it to be dinner.  \n\n\"Smells like pork?\" Florus said uncertainly.  Pork was rarely served in the palace due to the king's distaste for it.  The smoke was coming from a room at the far end of the hall.  A great gout of it began to billow, as though whatever was on fire was given extra fuel.  There was a loud cry of someone in anguish and then another scent arose; burning hair.\n\n\"That's not pork,\" Lacus said as it dawned on him.  Secundus looked disgusted but the prince was merely confused.  The sound of running boots and Sammosan chanting came from the smokey door and Lacus didn't want to wait for whoever was coming.\n\n\"This way,\" he said as he pulled Florus with him into one of the servants' halls and away from whoever - or whatever - was burning *people*.\n\n\\----------------  \n[\\[<= *Of Monsters & Mercenaries*\\]](https://new.reddit.com/r/shortstories/comments/1bvbnxf/fn_penumbra_chapter_3_of_monsters_mercenaries/)[\\[Chapter Index\\]](https://www.reddit.com/r/TomesOfTheLitchKing/comments/1bt9vl7/index_penumbra/) [\\[*Of Flames & Flight* =>\\]](https://new.reddit.com/r/shortstories/comments/1bwywks/fn_penumbra_chapter_5_of_flames_flight/)  \nAll crit/feedback welcome!  \nr/TomesOfTheLitchKing", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "**Welcome to the Short Stories!** This is an automated message.   \n\nThe rules can be found on the sidebar [here]( https://www.reddit.com/r/ShortStories/about/sidebar).\n\n**Writers** - Stories which have been checked for simple mistakes and are properly formatted, tend to get a lot more people reading them. Common issues include - \n\n* Formatting can get lost when pasting from elsewhere.  \n* Adding spaces at the start of a paragraph gets formatted by Reddit into a hard-to-read style, due to markdown. Guide to Reddit markdown [here](https://www.reddit.com/wiki/markdown)    \n     \n**Readers** - ShortStories is a place for writers to get constructive feedback. Abuse of any kind is not tolerated.    \n     \n***  \n\nIf you see a rule breaking post or comment, then please hit the report button.           \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/shortstories) if you have any questions or concerns.*"}]}, {"post_title": "[HR] Fate worse than death", "post_url": "https://www.reddit.com/r/shortstories/comments/1bw64pg/hr_fate_worse_than_death/", "post_main_text": "I didn’t spare a second thought for my surroundings that day. There wasn’t any reason for me to appreciate things, like the cold breeze that evening, or the misty rain. I just kept to my routine, leaving work and heading to my car. A typical day. A normal day. I can’t remember what I was thinking at the time, if I was even really thinking about anything. Maybe I was running through my day in my head, making sure I didn’t forget to finish something urgent that would blow up in my face the next morning, if I left at that time. Maybe I was thinking about bills, or kids’ birthdays, or anything else that would preoccupy a man’s thoughts. It made no difference. I was happy to be in my car and heading home. Some unknown miles later, on the drive home, I groaned when I heard the brakes squeal, and the wheels rumble, when I stopped at each stoplight. In my head it was just another expense or bill to add to the list. I tried to push it to the back of my mind and turn up the music. Hoping I can at least have a few minutes without worrying about these things. It’s very easy to let the music play and drift into “autopilot,” letting the daily commute go by in a flash. There isn’t traffic to think about on the drive home after rush hour. As I approached one of the busier intersections on the drive home, I remember feeling a burst of adrenaline when I hear the brakes snap and I can’t slow down my car.\r  \n\r  \nI didn’t feel a thing, or process anything as my car was rammed into on the left side, or when it spiraled into the guard rail only to get skewered through the front left and right doors. It’s a cliché, but it all happened so fast, in an instant. The only problem was, in the split second I was obliterated, in the split second where the lights should have gone out, I was suddenly seeing through a camera lens. The trees, sky, roads, and cars spiraling around from the accident, all kept moving. Except my view remained where I died. I had no control, no way to turn my eyes or adjust to focus on what I heard or felt, all that was left was the view I was forced to see. There was nothing I could think of to explain what I was going through. I couldn’t move this camera that I was stuck seeing through the aftermath of my demise. A few seconds passed after this when suddenly everything froze, I had nothing else to process, no thoughts or images or decisions. That was it. Dead. Time to move on, but it started to make sense in my head at the time, even if it felt like some sick video game. I stared into the still frame I was left with, a cruel image of nothing more than cars, roads, and smoke coming out of the totaled vehicles. Then the image started dimming to black, and I felt myself panic as I drifted into the void.\r  \nIt was at this exact moment, at the turning point, that a man’s voice spoke in my head, or maybe spoke next to me, it would be impossible for me to know which. What was clear though was the situation he explained to me.\r  \n“You… are gone. However, it doesn’t have to be over.” He said, without any emotion.\r  \nPlease, I’ll do anything! I said, in my head. I was so scared, so afraid to face the abyss after death. There were no hiding things from each other in this state of limbo. I felt him, eager and energetic, from my response, and he felt my fear and fed off it. He needed this. I didn’t care to think about it at the time, I didn’t care what that could imply, all I could grasp was the desire to live, to not be stuck in darkness.\r  \n\r  \n“For 10 years you can be there and live on through your family. You can stay conscious and see them. Do you accept?” It was almost like he was smiling with anticipation.\r  \n\r  \nYes! Yes please, I accept! If only I knew then, what I know now.\r  \n\r  \nAnother flash, in an instant, as quickly as the one that turned the lights off, now the lights were on. I noticed instantly I made a horrible mistake. The sight in front of me was almost a birds eye view of my home. I saw my wife in the living room. I could feel how sad she was, I knew this must be the exact moment she found out I died, but I could not see anything specifically. I was living in a world of shadows. Everything was out of focus. I couldn’t hear the voices of my wife or kids it was like I was underwater. I was left with partial sight, partial blindness. Tricked into a decade where I am half observing, half experiencing, the world they were living in. I was as much a passenger as I was a prisoner. I’m stuck, not able to interact or communicate in any way, for 10 years. Each day that passed, I was more desperate to leave this torture behind. I hated that man for tricking me into this nightmare. I hated myself for thinking this was somehow better than letting things end. For 10 years, I am stuck inside of a mirror.\r  \n\r  \nThey will never know, never know that I’m here.\r  \n\r  \nand afterwards, they will never know that I was here.\r  \n\r  \nand afterwards, I will never know what happens, now that I’m gone.", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "**Welcome to the Short Stories!** This is an automated message.   \n\nThe rules can be found on the sidebar [here]( https://www.reddit.com/r/ShortStories/about/sidebar).\n\n**Writers** - Stories which have been checked for simple mistakes and are properly formatted, tend to get a lot more people reading them. Common issues include - \n\n* Formatting can get lost when pasting from elsewhere.  \n* Adding spaces at the start of a paragraph gets formatted by Reddit into a hard-to-read style, due to markdown. Guide to Reddit markdown [here](https://www.reddit.com/wiki/markdown)    \n     \n**Readers** - ShortStories is a place for writers to get constructive feedback. Abuse of any kind is not tolerated.    \n     \n***  \n\nIf you see a rule breaking post or comment, then please hit the report button.           \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/shortstories) if you have any questions or concerns.*"}]}, {"post_title": "[MF] / [FN] I came tumbling through the above mess of your house with many loud crashes.", "post_url": "https://www.reddit.com/r/shortstories/comments/1bvzjdu/mf_fn_i_came_tumbling_through_the_above_mess_of/", "post_main_text": "I came tumbling through the above mess of your house with many loud crashes.\n\nI banged right through the roof, and then all the old detritus of your past you had stored in your attic, through the floor of the attic (which was the ceiling to your living room), and then with a loud smack I landed in a writhing crumpled up heap on your living room floor.\n\nMy entrance was accompanied by many loud and shocked gasps and hiccups, for you had planned a dinner party and invited all the haughty lords and ladies across the land.\n\nYour stuffy acquaintances were stuffed into your small living room, stuffing themselves on turkey and stuffing before I rained broken wood and all your old baggage and other stuff upon their heads and plates.\n\nLuckily, I was the only injury caused by my entrance.\n\nI knew you had outgrown me then, but I had not yet outgrown myself, so I was stuck with me and all the needy, crazy thoughts cavorting around my head.\n\nI couldn’t help but to act on one or some of them, and so act I did, so I hoped you were happy with how I ruined your day, like we were both used to. Like the good-bad-old times, whilst I drifted off into unconsciousness from my harsh fall.\n\nAll lost boys know how to fly, but none of us fly well. It’s warned that one day we’ll forget, which in of itself serves as a self-fulfilling prophecy… we’re bound to fall, usually around the time we start forgetting that we’re lost and instead start realizing we’ll never be found, or worse yet that no one is looking for us.\n\nYou can’t be lost if you have no where you’re meant to be. That means you belong anywhere, which means that no one is missing you. \n\nWhen you outgrew me, that was when I knew for sure that you’d stop missing me.\n\nSo I came flying over to your house on the last little puffs of pixie dust that I had sticking to the inside of my pockets. I had a grand machination to do something so charmingly foolish that would get you to miss me, maybe even miss us, something that would stick me to your ribs like a good meal.\n\nBut just like all the dry and roasted bird and bread bits intermingled in the crowd crowding around my unconscious body, I went down unsavory and uncomfortably crunchy. \n\nI dreamt what was explained by the paramedics when I woke up mid-way to the hospital, more or less. I was shuffled out quick and quiet, my appearance fizzling out like soda pop left out in a glass for too long, no matter how hard I splashed against your icy cold company and their transparent conversations. Maybe I fell too flat.\n\nIt would take me longer than most to understand that no matter how I fell, it wouldn’t win you back, or even impress you enough to really remember how cool you might have thought I was when I first took you for a flight.\n\nIt wouldn’t be until I really began to outgrow myself that I would understand that I should have apologized, not just for the fall, but for all the good-bad-old times leading up to the rationalization for the fall. They were more like okay-bad-reallybad-sad-times. But by then I didn’t know you like I knew you, and I had grown up enough to know that you were flying higher without pixie dust than I could ever reach with it. \n\nBy then I grew up enough to know that even with all the pixie dust, I was holding you down, holding you back, like a plane that managed to snag a helium balloon. \n\n\nAt least you got free of me before I could drag you all the way back down to the airport. ", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "**Welcome to the Short Stories!** This is an automated message.   \n\nThe rules can be found on the sidebar [here]( https://www.reddit.com/r/ShortStories/about/sidebar).\n\n**Writers** - Stories which have been checked for simple mistakes and are properly formatted, tend to get a lot more people reading them. Common issues include - \n\n* Formatting can get lost when pasting from elsewhere.  \n* Adding spaces at the start of a paragraph gets formatted by Reddit into a hard-to-read style, due to markdown. Guide to Reddit markdown [here](https://www.reddit.com/wiki/markdown)    \n     \n**Readers** - ShortStories is a place for writers to get constructive feedback. Abuse of any kind is not tolerated.    \n     \n***  \n\nIf you see a rule breaking post or comment, then please hit the report button.           \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/shortstories) if you have any questions or concerns.*"}, {"comment_author": "Baseddoug12", "comment_text": "Trying to get back into writing, this is some prose poetry that I scratched up recently and wanted to get some feedback on. Hoping to be somewhat consistent with journaling and turning it into something legitimate to show others so that I can continue to grow as a writer"}]}, {"post_title": "[HR SF] Vine World", "post_url": "https://www.reddit.com/r/shortstories/comments/1bvny6m/hr_sf_vine_world/", "post_main_text": "The Vines came almost all at once, on a warm otherwise unremarkable summer night twelve years ago. Teddy didn’t remember their coming. He was only fourteen now, which meant he was two when they came. Actually, it wasn’t exactly accurate to say he didn’t remember their coming.\n\nThere were the dreams.\r\n\nIn the dreams he’d be asleep, peaceful in his bed, when suddenly, with the rending sound of a thousand angry zippers the snakes would punch through the walls, yellow eyes flashing, their mouths open wide and hissing, long saber-like fangs spitting luminous green venom. They would spill into the room like waterfalls and begin to coil around him in his bed. Tighter and tighter until breathing became an impossibility and the hissing crowded out even his own panicked thoughts and the world beyond his eyes began to grow dark.\r\n\nHe didn’t always wake up screaming from these dreams, but he did so often enough that his parents worried about it. He could hear them talking about it in low whispers sometimes when they didn’t think he could hear them. Sound carried well in this house. But that tended to happen in structures where the walls didn’t always line up, floors sometimes leaned crazily in every direction, doors had long ago been pulled permanently free of their frames, and windows were smashed and lying on the ground in twinkling shards of glass.\r\n\nThe vines had done all that.\r\n\nTeddy lay in his bed in the eternal twilight of Vine World, which was what everyone called ground level these days. He knew that if he looked at the wind-up clock on his nightstand he would see that it was eight o’clock in the morning, give or take fifteen minutes. His brain knew what time it was, even if there wasn’t enough sunlight down here to confirm what his brain already seemed to know.\r\n\n“It’s your Shark-Alien rhythms” his Dad had once explained. Whatever that was. Teddy made a mental note to look up “Shark-Alien” on his next trip to the library, though what sharks and aliens might have to do with waking up with the sunlight, he couldn’t possibly fathom. \r\n\nThe “ceiling” of his bedroom was a vine. Twenty feet in diameter Teddy guessed, big for sure, but not even close to the biggest vine Teddy had ever seen. The vine’s underside bowed freakishly down into his room. On the right side of the ceiling it coiled away and upward towards the sky. On the left it traveled back through the wall it had smashed twelve years ago and down into the ground. Teddy’s Dad had nailed some boards in around the places where the vine touched the walls in an attempt to weather-proof the room, but the vines were alive. They moved constantly, breathed almost, even if it was only barely perceptible, and the seals rarely held for very long. This morning, humidity poured through the gaps between the vine and the walls and a thin sheen of sweat broke out on Teddy’s forehead and in his arm pits.\r\n\nMostly the weather stayed on the right side of the “wall”, but not always. It got particularly bad in August, which was Hurricane season here in South Louisiana. But those only hit once or twice a year, and only that often in the really bad years. When they did he would simply move in with his parents, or his brother Bob, for a couple days until the angry wind blew itself out somewhere over Arkansas or Mississippi.\r\n\nTeddy stared thoughtfully up at the vine. He wasn’t sure exactly what you were supposed to call the skin of the vines… bark he supposed. The bark was scaly, like a snake or a fish, each scale the size of a frisbee and shaped like the business end of a spade. The scales were generally brown, but there was a soft iridescence to them and a subtle shifting pattern of colors constantly rippled across the bark? Scales? Skin? \r\n\n“Whatever”, Teddy mumbled as he pulled himself up to a sitting position.\r\n\nIt was the thorns you really had to look out for. Teddy was lucky though, there were only two thorns on the vine that had been his bedroom ceiling since just before his second birthday, a day he remembered only in his dreams. \r\n\nThe thorns were not conical like those on the ragged patches of blackberry bush that still somehow managed to thrive in the backyard places where occasional columns of sunlight fought their way down through the alien canopy. No, these thorns were more like the arrowheads his Dad had taught him to hunt with, though much larger. They were shaped like pyramids, with a point sharp enough to stab through wood and four symmetrical ridges so hard and razor sharp they could put a score on a piece of glass. \r\n\nThere was poison in them too. They’d found that out the hard way, hadn’t they? But the less said about that, the better, Teddy thought.\r\n\nHe could hear the house coming alive below him, now. A wood fire crackled in the cast iron stove his Dad had salvaged from… somewhere, and Teddy could smell the faint odor of the smoke working its way up to his nose through the many gaps in the crazy vine-altered structure of their house. Firewood was not a problem in Vine World. The trees that hadn’t been violently uprooted by the sudden appearance of the vines had long since been choked off by the canopy on top and the strangling alien roots below. As a result, there were thousands of dead trees laying in and amongst the vines, quietly seasoning themselves for the cooking fires of Teddy’s future.\r\n\nTeddy’s short brown Cajun hair sat bolt upright on top of his head. In a simpler time, a time before the vines, his first order of business in the morning might have been a shower. But fresh water was much harder to come by now that you couldn’t get an unlimited supply simply by spinning a tap. His Dad had built rainwater catchment in all the places where the vines funneled water reliably down to ground level. But while rainfall remained as unpredictable as ever, the human need for fresh water did not. And so what fresh water they did have was reserved mainly for drinking and cooking.\r  \nHe walked through his bedroom “door” which was more like a concept of a door than an actual one. The door frame leaned crazily to one side like something out of the Esher paintings that hung on the walls of the Library in town. He walked out into the hall and scrabbled down the floor which fell away from his room at a loopy downward angle before hitting a bottom of sorts, and then curving back up towards the stairs that would take him down to the bottom floor.\r\n\nTeddy looked up and saw that Bob was just pulling himself up the last three feet of the incline and onto the landing at the top of the stairs. Always “Bob”, never “Bobby”. His parents had tried “Bobby” for a while but from the very moment Bob had learned to speak he’d begun to correct them. “Is Bobby a good boy?” they’d ask, and little Bob’s face would scrunch down into an expression of deep thought and consternation and he would bellow “—OB!”\r\n\nAnd so Bob he had become, and Bob he would forever be.\r\n\nHe was six now and he turned to see his older brother negotiating the crazy rolling hills of their upstairs hallway and smiled. “HI TEDDY!” Bob almost always shouted everything. It was kind of his thing. But he loved his brother, and Teddy loved him right back.\r\n\n“Hey Bob”, Teddy said as he lost his grip on the hard wood floor and slid back a couple feet. It occurred to him that it probably wasn’t very safe for a six-year-old boy to climb around on a crazy structure like this, but then again almost everything in Vine World was dangerous. You had to pick your battles.\r  \n“RACE YA!”, Bob shouted and took off down the stairs, which had somehow remained improbably intact. In addition to the shouting thing, Bob was always “racin’ ya!” everywhere.\r\n\nLaughing and hip checking each other in a good-natured way, Teddy and Bob bounded down the stairs, their footsteps pounding a syncopated rhythm on the old wood of the staircase. As they neared the bottom they could hear Mom in the kitchen shouting “Hey, hey, HEY! Come on guys, slow it down!” She was worried about thorns, of course, they were everywhere. But after twelve years, six for Bob, the brothers knew exactly where they all were. As they ran, they ducked, bobbed, and weaved like running backs in a sport they would never watch or play, one that had died a quick and violent death on that awful day twelve years ago, like so many other things.\r\n\nThe boys skidded to a stop on the old linoleum floor of the kitchen, still giggling and elbowing each other in the ribs. A vine the width of an elephant’s trunk stood in the very center of the kitchen. It had erupted up through the floor like a demonic volcano and now occupied the room like a support strut holding up the ceiling. It was covered with razor sharp thorns, and Mom and Dad had done the best they could to wrap the lowest and most dangerous of them in old towels, ragged bits of clothing, and a few salvaged traffic cones so that there would not be a repeat of the “accident” that had killed Carthage.\r\n\nCarthage had been the family dog. He was sweet and friendly and a mutt. “like God threw a beagle, a terrier, and a chihuahua in a barrel and rolled it down a hill”, Dad had often said. Carthage had been a great dog, but a hyper one. It was in his genes. And aren’t we all, ultimately, doomed by our own genetics?\r\n\nIt was his hyperactivity that had killed him.\r\n\nCarthage was a jumper. All you had to do was look in his direction and even before his name had a chance to fall off your tongue he was up on his hind legs and jumping straight up in the air. Sproing, sproing, sometimes he’d clear three feet straight up, his little head wiggling back-and-forth at the apex of his leap like he was trying to squeeze an extra few inches out of it.\r\n\nThey’d been in the yard when it happened. If they’d been in the house there was a decent chance, Teddy thought, that Carthage might have remembered about the thorns and not jumped so enthusiastically. But they hadn’t been in the house, and Carthage had put everything he had into that final leap.\r\n\nThe thorn caught him just behind his right shoulder and Carthage yelped in surprise and pain, immediately thrusting his tail between his legs and cowering at Teddy’s feet, whimpering with fear and unanswerable questions.\r\n\nDad had come running at the sound of Carthage’s distress and at first the injury hadn’t seemed that bad… well not that bad for a severe puncture wound anyway. The thorn had slid into the dog’s flesh like a hot blade through soft butter. But it was not deep, and barring infection it certainly did not seem life-threatening. But something about the drop of green liquid that hung from the tip of the thorn like thick luminous dew had made Teddy’s skin crawl. And within an hour it was clear that Carthage was a very sick doggie.\r\n\nHe’d lasted the night, curled in Teddy’s lap, whimpering and looking up at his boy with big watery eyes that were full of confusion, pain and fear. And little Teddy had cried right along with him, not able to do anything for his dog except to be there for him. To let him know that if nothing else, he was loved. To bear witness.\r\n\nCarthage’s end had come before the real end, and that, at least, had been a mercy.\r\n\nThere had been a few final labored breaths and Carthage’s nose, which had been resting on Teddy’s leg, rapidly moving up and down with his ragged breathing, suddenly began to weigh down on Teddy with the weight of something no longer in control of its muscles. And then a final breath came out as a whimper, and Teddy knew Carthage was gone.\r\n\nBut that wasn’t the end. Oh no, it wasn’t the end at all.\r\n\nTeddy had been holding Carthage in a towel and that had probably saved his life. Carthage’s skin had begun to ripple and undulate like his body had filled up with giant hungry maggots. Despite his love for the dog that had been his only pet, Teddy pushed the corpse off his lap with revulsion just as the dog began to literally dissolve in front of his eyes. Here and there, Carthage’s skin burst open with steaming jets of glowing green goop. The skin melted away revealing the jagged curvature of the animal’s ribcage and then even the ribs began to run in gloopy white rivulets. Teddy had just enough time to think “those were his bones” and then, finally, nothing at all remained of the dog except for a putrid greyish-green puddle of bubbling slime slowly eating its corrosive way into the Earth. \r\n\nAnd Teddy’s tears, of course.\r\n\nIt was hard, even now, for Teddy to see a thorn and not flash back to that difficult day. To the awful danger of the thorns. \r\n\nThe towels his parents had tried to wrap them in didn’t really offer much in the way of protection, either. The thorns were simply too sharp. If you were to forget yourself and stumble into one, it wouldn’t take much pressure for the tip to stab straight through like the pike thrust of an angry Spartan Hoplite. And from there, a slowly gurgling puddle of alien slime would be your ultimate destination. \r\n\nYou stepped carefully in Vine World. Very carefully.\r\n\nBut the wrappings did serve as a reminder of what was there. The incongruous pastel colors of the towels and the neon orange of the cones caught your eye and alerted you to the danger in a way that simply trusting yourself to notice the same damned thorns in the same damned places day-after-day could not.\r\n\nTowels had not been their first idea, nor even their second. The towels were more of a last resort. Dad’s first idea, coming right on the heels of Carthage’s untimely and unlovely death, was to saw the damned things right off. \r\n\n“Come with me”, he’d said to Teddy, who was only eight at the time. And Teddy had gone. Dad had been a contractor before the vines came and his workshop, really just a shed filled with his tools, had survived the coming of the vines mostly intact. Pulled along towards the shed by his father’s rough hand, they walked into the shop together and Dad pulled a two-foot wood saw off the wall.\r\n\nThey’d walked back to the offending vine with its offending thorn still dripping poison in an obscene parody of Teddy’s tears and Dad had lain the saw on the thorn at its base. With a roar of anger, he’d pulled the teeth of the blade across the thorn. Teddy heard a sound like a rifle being fired on full automatic as each of the metal teeth snapped off clean at the edge of the blade. Dad threw the ruined saw on the ground and stomped angrily back to the shed, shaking his head and cursing under his breath… something about “those Christing thorns!” Teddy thought. He’d come back with a fifteen-pound sledge and was swinging it before he even stopped walking. The head of the sledge came down perfectly on the sharpened tip of the thorn and…\r\n\nPING!!!!\r\n\nThe sound of two heavy metal pipes being smacked together reverberated between the living canyon walls created by the vines, and the sledge bounced off the thorn like a kid jumping on a trampoline. The momentum of the bouncing sledge knocked Dad right on his ass. He pulled himself up off the soft ground and walked over to the thorn. He leaned toward it until his nose was almost touching its smooth surface, almost like he was trying to see it at the molecular level.\r\n\n“Didn’t even dent the goddamned thing…”, he’d said angrily. And that had been their last attempt to destroy a thorn. \r\n\nMom pointed at Bob, “you, sit at the table, I’ll have your breakfast ready in a minute.” Bob happily ran off towards the kitchen table, his hands swinging back and forth above his head. Teddy thought the kid looked like a crazed chimpanzee when he ran. \r\n\nBob pulled himself up onto the bench seat at the kitchen table and Mom pointed at Teddy, “And you, put your gear on, I need some veggies from the garden.” She tried to sound like a drill instructor, but there was a nervousness on her face that gave the game away. For his part, Teddy hid his excitement as best he could. He didn’t want his parents to know how much he loved going to the garden. You weren’t supposed to enjoy climbing the vines. \r\n\nYou were supposed to fear it.\r\n\nTeddy headed back to the “gettin’ ready room”, as in, “we’re gettin’ ready to go outside.” It was a room just off the back porch, the only room in the house where there were no thorns. The one totally safe room in the house. You could do The Macarena in here if the mood caught you right.\r\n\nOn the dozens of hooks Dad had installed on the walls hung gear that he’d scavenged from a demolished sporting goods store on the other side of town. Teddy shrugged into a suit of armor made of mis-matched gear from a half-dozen sports he would never get a chance to play. Football shoulder pads, a baseball catcher’s chest plate and leg guards, thick hockey gloves and a helmet. None of this would stop a serious thrust from a thorn of course, but it would protect against most everything this side of a glancing blow.\r\n\nLooking like a rejected extra from a Mad Max movie (they had DVDs in the Library too) he pushed the screen door open past shrieking rusted hinges. Mom heard the door opening, hell the whole world could hear this door when it opened, Teddy thought.\r\n\n“Watch out for the vents!” she yelled from a room away.\r\n\nTeddy’s shoulders slumped and he sighed with obvious frustration. “Watch out for the vents” was the unofficial motto of Vine World. People said it to each other the way they might have said “have a nice day” or “Merry Christmas!” before the vines came. But Vine World left no room for such trivialities. There was too much danger, too much fear, and too much at stake.\r\n\n“The goddamned vents…” Teddy said to himself. He tried not to curse in front of his parents, but sometimes, well… sometimes the right word was the right word. “Le mot juste!” he said, much louder than when he’d cursed. And in some weird way, he thought his parents might have been even more surprised to hear him say that than they would have been if they’d heard him say “goddamned.” But when your kid spent every waking hour in a library, that was the kind of thing your kid was apt to say.\r  \nTeddy stepped out into what had once been their back yard.\r\n\nIf you could forget about the danger for one moment, it was almost beautiful. \r\n\nAbove his head the vines twisted and coiled around one another in a vast Gordian Knot of alien bark and thorns. Iridescent color shimmered along their lengths and what ground cover had survived the sudden plunge into darkness all those years ago reflected the light as if the aurora borealis blazed overhead. Here in the eternal twilight of Vine World, lightning bugs didn’t know what time it was either, and their belly lights twinkled and shone in the darker corners of what was a living organic cathedral. \r\n\nFrom the safety of the back door the scene looked like a magical glade from a Tolkien novel. If a Hobbit, a Dwarf, and an Elvin Archer suddenly appeared walking behind a grey-haired old wizard lighting their way with a magic wooden staff, Teddy thought he wouldn’t bat an eye. “Might not even be the strangest thing out here today”, he thought to himself, and smiled.\r\n\nAcross the glade, an asterisk drawn in bright orange spray paint beckoned. Teddy scanned the yard, looking for vents mostly, but also for the… Things… that came out of them. There were none, and that was something, at least.\r\n\nHe glanced back at the wall of the “gettin’ ready room” and saw his own compound bow hanging next to an empty space where a larger bow should have been. “Dad must already be out hunting”, he thought. Teddy grimaced. “Anything but a Scorch, Dad” he muttered under his breath. He was getting pretty tired of eating Scorch. \r\n\nWelp, there was always the vegetable garden.\r\n\nHe made his way slowly across the… Teddy continued to think of it as The Glade, even though twelve years ago nobody would have ever thought to call it anything other than somebody’s plain ole backyard. He moved slowly because things could change in a catastrophic instant in Vine World, and things that changed here almost never changed in your favor.\r\n\nHis head spun as if on a swivel and he walked in a strange crouch, ready to run at a moment’s notice in whatever direction might lead to safety. Twenty steps, then thirty, then fifty…. He counted as he went knowing that it was exactly sixty-seven steps to the orange asterisk. Somewhere behind him, he knew his Mom was trying to keep one eye on him as she took care of Bob and got the house ready to face the day. He could feel her worry across the space between them but there was nothing she could do except hold her breath and hope for the best. Vine World was about surviving one day at a time and everyone had to do their part.\r\n\nThe vines had forced Teddy to grow up fast.\r\n\n“Four thousand, three hundred eighty days…” he said out loud. That was how many days they had survived by taking survival one day at a time. You never thought about tomorrow or next week in Vine World. That kind of optimism could get you killed. The distant terrified shrieks that sometimes carried to Teddy’s ears when the wind was blowing just right in the darkest most silent graveyard moments of the night were an awful reminder of that fundamental fact of their existence.\r\n\nTeddy reached the asterisk and put a sweaty palm on it (tag, you’re it!). Above him a dozen pieces of two-by-four marked the upward trajectory of a large vine in three-foot intervals. In another time, there might have been a treehouse at the top of those two-by-fours, a sign out front boldly proclaiming, “no girls allowed!!!!” But not here. Not in Vine World. \r\n\nThe ladder steps went up about thirty feet and then disappeared into the tangled canopy overhead. He began to climb.\r\n\nA minute later he had reached the underside of the canopy and paused to take a deep centering breath. It only got hairier from here. He pulled himself up into the disorienting alien tangle and below him the Glade disappeared from view, lost in waves of shimmering brown scales. \r\n\nSomewhere below, their visual connection broken, Teddy’s mom stifled a worried sob and tried to focus on Bob.\r\n\nA few seconds later and Teddy was standing on a broad flat expanse of vine. Here and there thorns gleamed malevolently in the gloom. Dad had helpfully circled each one in orange paint, not that Teddy needed a warning to steer clear. He looked up and saw the route winding its way up through the tangles, marked with more fluorescent orange paint. Courageous beams of sunlight stabbed down through the canopy here and there and it almost seemed to Teddy that the vines shied away from them, like they were more comfortable in the gloom. In the dark. Where the monsters roamed free and ate their fill.\r\n\nTeddy had no idea exactly how high the vines went. He’d asked his Dad once and he’d said “dunno Kid, more than a hundred feet, less than five?” It was six hundred thirty-seven steps to the top of the canopy, Teddy knew that much, but the twisting path his Dad had marked meandered all over and around the complex tangle of vines. Sometimes you even had to go down a ways before you could go back up again. Teddy guessed it was about two hundred and fifty feet from the top of the vines to the ground.\r\n\nTeddy was relatively safe up here. The things that came from the vents couldn’t get at him up here. “As far as you know” he reminded himself. Every now and then something new did come out of the vents, and it would be dangerous to assume that the vents would never vomit out a creature that could pursue him into the canopy. A shiver worked its way down his spine despite the heat of the day.\r  \nTen minutes later he had almost made it to the top and he quietly thanked his Dad for the orange trail markings. It had taken almost a year for his Dad to find, map, and mark this route, and even though he’d climbed it hundreds of times, Teddy knew that without the markings he would soon be hopelessly lost up here. And if you got lost in Vine World, the best you could hope for was that you’d die of starvation or thirst before the Things got you.\r\n\nIt was much brighter now. What had been tiny little beams of sunlight down on the ground had become great gushing waterfalls of gleaming warmth up here. Teddy followed one last looping path around a super vine, this one easily fifty feet across, and saw the final stretch of orange painted ladder steps at the end of a short, narrow tunnel.\r\n\nTeddy laid on his back and began to push himself along this horribly claustrophobic space where a dozen smaller vines coiled tightly around one another. It was so narrow that if there were even a single thorn in this space it would be impassible. As he crawled, he thought of his dream… and the snakes. Were the vines sentient? Might they one day wake up, realize that a boy was crawling through this passageway and suddenly clench themselves into a crushing final embrace? \r\n\nIn the shadows, Teddy shivered uncontrollably.\r\n\nA few more yards and Teddy pulled himself into the last chamber at the base of the final ladder. His face was bathed in pure white sunlight that forced him to close his eyes so tightly it hurt. Brilliant sun spots danced on the blood red insides of his eyelids and the complex networks of his capillaries stood out in stark relief.\r\n\nDoc Hebert, the town doctor by virtue of the fact that he was the only doctor to have survived the coming of the vines, had once told Teddy that he guessed Human eyesight would adapt completely to the gloom of Vine World eventually, and that within a thousand years or so, it might be impossible for Humans to venture out in direct sunlight at all.\r\n\nTeddy thought that sounded like a damned shame and he laid here a minute longer, letting the sun warm his face for a while in honor of his sun-blind descendants, whom he would never meet and who might never get this chance.\r\n\nBut there was a job to do. He opened his eyes to the sunlight again, pulled himself to his feet, and climbed the last few feet to the roof of Vine World.\r\n\nHe rose up out of the gap in the vines like a submarine Captain climbing out onto the conning tower of his ship and looked around. The view never ceased to overwhelm him. All around, in every direction of the compass, was the terrible evidence of what had happened that day.\r\n\nVines. Vines by the millions, by the tens of millions… blended and woven as if they’d burst forth from the loom of the fates. They covered, buried, choked off everything he had ever known. If he squinted, it almost looked like a vast shag carpet of brown and green stretching in rolling hills and valleys to the horizon. Up close, you couldn’t see an individual vine move, or breathe, or whatever it was that they did, but across the miles and miles, the subtle combined movement of all the vines together made this alien roof ripple with motion. \r\n\nA thick mountain of vines rose, alarmingly, to the north. Dad said he figured that must be Baton Rouge, since there were no actual mountains here in the flat Earth of Louisiana.\r\n\nThe idea that this “mountain” might have once been the second largest city in the state was, well, thought-provoking. It suggested that the vines grew as high as they needed to in order to overwhelm whatever might be in their way. Like the Kudzu that had once threatened to choke off all the vegetation in the American South before the Vines had provided the final say in the matter. \r\n\nDid the Eiffel Tower itself lie dead and rotting underneath a city-sized pile of vines like Tiger Stadium just a couple hundred miles to the north? What about The Freedom Tower in New York? The Burj Khalifa? The London Pickle? The Taj Mahal? the Pyramids of Giza? \r\n\nTeddy didn’t believe that. Couldn’t believe it.\r\n\nHe just couldn’t believe that everything that had ever been, everyone that ever was, all that had ever been known, could really be buried under the vines. He thought that the day he did start to believe that, would be the day he gave up and let the vines have him.\r\n\nUp here, the vines sprouted leaves. Massive, lime green and waxy, they were big enough that a married couple could use one as a blanket if they were brave enough to try. As far as anyone knew, the leaves were not dangerous by themselves. But the way Teddy looked at it, you couldn’t be too careful when it came to the vines. The leaves hung like massive organic solar panels, collecting the sun here on the roof and delivering its energy to the real bulk of the vines deep down in the darkness below Teddy’s feet. \r\n\nSpread out before him were a dozen raised garden beds made of salvaged four-by-fours, anchored into the woody scales of the vines and bristling with summer vegetables. \r\n\n“Vict’ry Gardens” his Dad called them.\r\n\n“Victory over what, Dad?” Teddy had asked him once.\r\n\n“Over starvin’ to death, Bub”, had been the reply, and they’d both laughed so hard their bellies hurt, even though there really wasn’t anything funny about it at all.\r\n\nIt had been hell getting all the wood and dirt up here, but Doc Hebert had told Teddy he thought the “Vic’try Garden” idea, which had been his Dad’s, had probably saved the town. Once Teddy’s Dad had proven the concept, other gardens had begun to spring up all over the “roof”, and Teddy could see other townsfolk tending to their own gardens in the distance. He waved to a distant figure he thought was probably Mrs. Hebert, it was hard to tell this far away,  and she waved back. He tried to judge the distance and guessed it at about two hundred yards. “Length a two football fields, Bub”, his Dad might have said, even though Teddy had never seen a football field and probably never would. There was one in town, about two miles east of here at the city high school. But like everything else it was buried under the choking mass of the vines. The goalposts, once shining and white on Friday nights, now forever twisted and rusting in the dark.\r\n\nTeddy wandered between the rows picking tomatoes, lettuce, and peppers and pushing them into the carry bag at his hip. He loved it up here. Despite the alien view, you could almost feel normal with the sun on your face and a warm gulf breeze tossing your hair around.\r\n\nWas the Gulf of Mexico still there? Or was it just a memory, buried under the vines like everything else? He didn’t know, and in any case, it didn’t matter. Any place you couldn’t walk to in the hours between dawn and dusk might as well be on the moon. \r\n\nWhich reminded him. He checked the watch on his wrist. He knew it was still early in the morning, but he checked anyway, out of habit. You always needed to be aware of the time in Vine World. You could run into a… Thing, at any time of course, but at night… that was when they hunted. \r\n\nHis carry bag was full now and so he looked once more into the sun, letting it toast his face one last time. He closed his eyes and mentally prepared himself for the long walk down to the ground and the short dangerous sprint across the glade and back into the house. The summer sun was still hot, but Teddy knew that in a few weeks they’d be up here planting the fall vegetables… pumpkins and squash mostly. Over the years, a brisk trade in heirloom seeds had sprung up alongside the damaged church that had been turned into something of a Town Hall by what remained of their little community.\r\n\nIt's always easier to go down than to go up and Teddy got back to the final stretch of ladder steps almost before he realized it. He looked down through the hole in the canopy, down on the warm lights of his house so close and yet so far away. And again, he had that sense that he was looking in on an Elvish Glade. The way the vines had incorporated the house into their infrastructure, the lighting bugs flitting here and there like fairies, the preternatural silence, it was as if this house existed on the outskirts of Rivendell, rather than Southern Louisiana.\r\n\nHe climbed slowly down the last stretch of steps. His suit of armor felt heavy and cloying now that he was so close to safety, and he just wanted it off. His right foot touched the mossy ground and a sound like Armageddon drove a bolt of ice into his spine and nearly stopped his heart. A terrible ripping sound, like the skin was being torn off the world.\r\n\nHe turned slowly… very… slowly and saw it. A jagged crack had appeared on the ground halfway between himself and the house. It started as a single point and slowly grew, right to left, until it was nearly four feet long. The ripping became an ear popping whoosh and the crack broke open like a lanced boil, spilling a sickly green light into the glade.\r\n\nA Vent.  A goddamned vent.\r\n\nFor one crazy moment he thought about running for it, leaping over the vent and through that poisonous light like a horse leaping over a hedge in an equestrian event. His legs actually tensed up, ready to begin pumping themselves across the space between himself and the vent. And then he froze, all thoughts of a heroic escape suddenly and irrevocably banished from his mind.\r\n\nBecause now there was something in the light. Movement. A shadow. Something was coming out of the vent. Teddy leaned back against the vine and waited to see if he would die immediately, or if the vines would decide to give him a fighting chance today.\r\n\nWhat came out of the vent was a nightmare mash-up of a scorpion, a lobster, and a spider roughly the size of a large pit bull. Its dinner plate-sized claws clicked together curiously as if searching the air for something to cleave in two. The six legs behind the claws were much longer than a scorpion’s legs, more like a spider’s legs, long, spindly, arching, and multi-segmented. Each leg ended in a needle-sharp point that dug into the soft earth as the Thing struggled to pull itself free of whatever Hell had spawned it.\r\n\nIt was a Scorch.\r\n\nPlenty lethal of course, but there were much worse Things lurking in the depths of the Vents, and he’d dealt with Scorches before. There was still a pretty good chance he’d die right here at the base of this vine, but with a Scorch there were always… possibilities.\r\n\nSixty-Seven Teddy steps away, his Mom stood in the open back door, both hands over her mouth which was open in a terrified “Oh.” There was nothing she could do to help her son now, and she knew it. Whatever was going to happen in the next thirty seconds would happen whether she intervened or not. \r\n\nBob stood behind her, peering out between her legs. “WATCH OUT BRUDDER!”, he shouted, and Teddy almost rolled his eyes. “Yeah no kidding, Bob”, he thought uselessly.\r\n\nThe Scorch’s claws were moving ceaselessly, and their SNAP SNAP caused Teddy to flinch each time they closed on one another. But it was the stinger that commanded his attention. It was like a dagger at the end of a long retractable tail and it too moved this way and that, looking for something fleshy to plunge its length into. But Teddy knew that the stinger itself, and the poison it contained, were not the worst part of what that tail could do. At the base of the stinger would be two small holes… \r\n\nPOP POP… the sound of twin firecrackers and Teddy thought “here it comes!” \r\n\nFrom those two holes jetted two completely different but complimentary chemicals. And as they mixed in the air they ignited a three-foot jet of blue flame, and any newcomer to Vine World would have known instantly how the Scorch got its name.\r\n\nTeddy remained rooted to the spot just in front of the orange asterisk his Dad had painted, frozen in place. The Scorch’s alien red eyes, seated on top of long stalks that could rotate in three hundred sixty degrees searched for him, but Scorches couldn’t see very well, and as long as he stood perfectly still, there was a good chance it wouldn’t see him.\r\n\nBut just then a breeze rustled the hair at the back of his head and Teddy knew that he had a bigger problem. The breeze was blowing his scent directly at the Scorch, and a Scorch could target you by your smell as easily as a hunter with a rifle and a scope.\r\n\nAnd sure enough, after only a few seconds, the time it would have taken the breeze to travel from Teddy to the Scorch, it suddenly spun on him. Teddy had been spotted.\r\n\nThe Scorch came at him.\r\n\nTime seemed to slow to a crawl, seconds drawing out into hours, as every weapon in the creature’s considerable arsenal pointed right at Teddy’s most vulnerable spots. Its arachnid legs were a blur. The stinger came up and coiled back like a compressed spring, ready to strike. The claws opened wide and Teddy knew that whatever part of his body they targeted would soon be lying on the ground, detached and spilling great gouts of blood.\r\n\nHe put his arms up in front of his face. Maybe the hockey gloves would hold against the blade-like claws… maybe the umpire’s chest plate would deflect the stinger. \r\n\nMaybe… \r\n\nMaybe.\r\n\nAcross the glade his Mom screamed and for a moment it was the only sound in Teddy’s ears, except for the rushing sound of his own terrified blood. And then another sound cut off his Mom’s scream.\r  \nTHWIP!!!\r\n\nFollowed by a shriek from the Scorch that was so brain-piercingly awful it was almost a weapon unto itself.\r\n\nTeddy opened one tentative eye and saw a long shaft sticking out of what passed for a head on a Scorch. Both stalked eyes were bending inward, eyes rolling madly in their alien sockets, desperately trying to see what was causing it so much pain. \r\n\nIt was an arrow.\r\n\nAnd now the high-pitched keening of the Scorch was joined by the THUMP THUMP THUMP of footsteps running towards the glade, and Teddy looked up and saw his Dad leaping over a low hanging vine, one hand reaching into the quiver on his back as he did. Without breaking stride, Dad nocked the arrow, drew back the string, and fired a second time.\r\n\nThis time the arrow thumped straight into the Thing’s cerebral cortex, or whatever it was that Scorches had rattling around in their skulls. The arrow had the desired effect. The Scorch dropped flat with a meaty thud. Dead before it hit the ground, its lights turned off as if by a switch.\r\n\nBreathing heavily, Dad looked at his son, lost under a pile of second-hand sports equipment.\r\n\n“You OK, Bub?”\r\n\nTeddy looked back at him. “I guess it’s Scorch for dinner after all.”\r  \n\r  \n", "post_comments": [{"comment_author": "United_Campaign_834", "comment_text": "Cool concept!"}, {"comment_author": "GMFWashington", "comment_text": "Thanks! At one point I thought it might make for a good novel, but I haven't figured out the story yet"}]}, {"post_title": "[NF] Ramblings On Death - Written by YonathanJ", "post_url": "https://www.reddit.com/r/shortstories/comments/1bvri6z/nf_ramblings_on_death_written_by_yonathanj/", "post_main_text": "I can't wait to die.  \n\n\r  \n\r  \nNot that I am suicidal, far from that. I've written to lenghts before about my perspective on life, how ''those that choose life are the bravest of all!''  \n\n\r  \n\r  \nBut a part of me can't help but be insanely curious. Intrigued even, of what and how death will be. It's absurd, thinking about it. I may be stating the obvious but death is the opposite of life, that we've been immersed in forever, so of course such a concept is alien and frightening to us.  \n\n\r  \n\r  \nThe rational side of myself embraces reality as a purely objective construct, like a canvas, where subjectivity can arise. What I mean by that is, I reject wholeheartedly any hypothesis such as the ''brain in a jar'' or all the solipsists of the world. The self is nothing more than a natural extension of the universe, of reality, not something separate or higher.  \n\n\r  \n\r  \nEverything is self-contained in the whole.  \n\n\r  \n\r  \nI say that, since the concept of an after life is counterintuitive. Why would our consciousness remain when its condition to exist (the body) is destroyed? For the soul to be permanent, persistent, transcient, implies extraordinary presumptions;  \n\n\r  \n\r  \nSpirituality, the divine, unobservable assumpations about the nature of the world, our place in it, FAITH.  \n\n\r  \n\r  \nHow arrogant of us human beings, to be so full of hubris to think of ourselves worthy of salvation, of eternity, as we trample on the corpses of the whole planet earth, butchering and carelessly destroying the ''lesser'' lives of every beings, plants and animals, rats and ants...  \n\n\r  \n\r  \nWhat about their souls, on their way to heaven perhaps, or in eternal punishment for transgressing the divine laws of ants? How absurd. A human is a human, an ant is an ant, and rats are everywhere.  \n\n\r  \n\r  \nWhat makes us special, if not for delusion and fear? Now, enough from ants, as fascinating as they are.   \n\n\r  \n\r  \nSeeing that our brains are basically electric boxes, our minds purely physical phenomenas, I don't see how justifyable the idea that anyone's soul perdure after death, be it in Hell or Heaven or purgatory or whatever.  \n\n\r  \n\r  \nI suppose the idea is simply comforting. The idea that even through death one remains the same. After all losing what makes you ''you'' is most frightening of all.  \n\n\r  \n\r  \nOf course people would believe in the most convenient and agreable afterlife possible, since it's all fantasy! Of a lofy eternal paradise of bliss with loved ones, only accessible to those that believe, to those that behave ''properly'' to abitrary rules...  \n\n\r  \n\r  \nSorry for getting so cynical. Let me phrase it in a more imaginative way :  \n\n\r  \n\r  \nIt's like telling a fool on a roaming boat that the coming waterfall, deadly and deafening, is nothing to be afraid of. That the incoming, inevitable fall of hundreds of meters to certain doom actually leads to a calm lake.  \n\n\r  \n\r  \nOf course the fool will believe in the calm lake, even as he falls down and faces death in all its fatality.  \n\n\r  \n\r  \nYet funnily enough, wether the fool believes in the calm lake or not, the outcome is the same...  \n\n\r  \n\r  \nI can't help but wonder if perhaps, upon death, the brain plays a trick on itself, and ''dreams'' of whatever it is it wishes for.  \n\n\r  \n\r  \nFor the devout christian, a sort of distilled, condensed illusion of an eternal blissful afterlife with loved ones in heaven, much akin to a long dream that actually lasts a fraction of a second in reality.  \n\n\r  \n\r  \nAnd the wicked, cursed man, falling to despair as he gets to experience his own personal hell, stemming from his buried regrets, experiencing eternal punishment in the very last instant of his life.  \n\n\r  \n\r  \nThe mind making true what it believes, in the very last seconds of life, before the gaping void that is death.  \n\n\r  \n\r  \nWhat I'm trying to say is, perhaps the soul, so stubborn and eccentric it is, makes the ''afterlife'' possible and real, but only for itself? In a totally subjective way, much like the existence of the subjective mind in the incomprehensible objective universe it is part of? As a way to cope with the dissolution of the self, of the embrace of the void, of DEATH.  \n\n\r  \n\r  \nI personaly believe my mind will collapse and become one - once again - with reality, to a faint, blissful state of omniscience. All sense of self and consciousness, lost, nay, shed, much akin to a cocoon. And flying outward to embrace everything the etheral butterfly of my abstract self, takes hold of the universe in a loving, watchful embrace.  \n\n\r  \n\r  \n Death at last  ", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "**Welcome to the Short Stories!** This is an automated message.   \n\nThe rules can be found on the sidebar [here]( https://www.reddit.com/r/ShortStories/about/sidebar).\n\n**Writers** - Stories which have been checked for simple mistakes and are properly formatted, tend to get a lot more people reading them. Common issues include - \n\n* Formatting can get lost when pasting from elsewhere.  \n* Adding spaces at the start of a paragraph gets formatted by Reddit into a hard-to-read style, due to markdown. Guide to Reddit markdown [here](https://www.reddit.com/wiki/markdown)    \n     \n**Readers** - ShortStories is a place for writers to get constructive feedback. Abuse of any kind is not tolerated.    \n     \n***  \n\nIf you see a rule breaking post or comment, then please hit the report button.           \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/shortstories) if you have any questions or concerns.*"}, {"comment_author": "Future-Surround5606", "comment_text": "Death is not the opposite of life. It is part of the life cycle.  I live in a special place surrounded by forests, flowers, birds, bunnies, and foxes and hawks.   And deer!   Every season, a new thing wakes up as another thing goes to sleep.   I've lost my mom, but I know she hangs around here.  I've lost friends and deep loves, but they too make their presence known.  I'll not argue death will be a comfort to me when it's time for me to go, but I know it's not the end of me.  Love, after all, is eternal, and my life has been full of such.   \nI hope your life is, or will be, filled with the same kind of love."}]}, {"post_title": "[FN] <Penumbra> Chapter 3 - Of Monsters & Mercenaries", "post_url": "https://www.reddit.com/r/shortstories/comments/1bvbnxf/fn_penumbra_chapter_3_of_monsters_mercenaries/", "post_main_text": "Lacus and Secundus followed Fariba through The Gutter to an older district in the city.  The cobblestones lacked their hexagonal tiling like in the newer areas and were the old square style.  *Generous to think of these cracked piles of dust as 'square',* Lacus thought.  It was not too far of a walk to an abandoned intersection of five roads at odd angles.  To call it a courtyard would have been overly gracious to the gap between shoddy, run-down buildings.\n\n\"And here we have come!\" Fariba announced, gesturing at a dilapidated well in the middle of the area.  Lacus didn't need to get close to know why the well wasn't drank from; he could smell the sewage from a distance.  One of the city's outlets either breached the well, or the locals had taken to using it as a dumping pit.\n\n\"Why?\" he asked, looking around the area.  Other than ramshackle structures and graffiti, there wasn't anything else around.\n\nSecundus was examining a wall covered in red and black graffiti.  At a glance, it looked like blood and oil, but when Lacus got closer he saw it was pigment and charcoal.\n\nThe bearded guard ran a gloved hand over the drawings.  They didn't smear; this was old work.  \"Are these...letters?\" he asked Fariba.\n\n\"Correct, my friend,\" the colorful Shen merchant answered, nodding their head and making the feathery headdress wave.  \"They are Sammosan script.  They tell of the Beasts of Bathos.\"\n\n\"The what?\"\n\n\"I've heard of them,\" Lacus said, running his hand across his head as he looked at the illegible letters.  \"One of them children's stories, ain't it?  Be careful or the monsters will come and get ya?\"\n\n\"A child's tale, yes.\"  Fariba nodded again.  \"Sammos parents would warn their children not to wander into the forest at night.  It was said monsters from the Forest of Bathos would come and take them.\"\n\n\"There is no significant forest within a league of here,\" Secundus protested.\n\nFariba turned their head, smile shifting in the shadows.  Instead of smug or insincerely friendly, they now looked almost sinister.  It made bumps rise on the back of Lacus's neck.\n\n\"There are more recent stories of the Beasts,\" Fariba said, \"In Sammosan, their word is 'Thiria'.  And it has become the title of the slaves who rose up.\"\n\nLacus considered what that could mean.  Part of him just wanted to call the whole thing a fool's errand and get back to the palace, but there was *something* here.  If people were painting the name of rebel slaves on the streets here, that would be a problem.\n\n\"Hey,\" he leaned closer to Secundus and spoke quietly in Haranese, \"you think this might be a sign people are thinkin' of making their own rebellion here?\"\n\n\"That's exactly what I'm thinking.\"\n\n\"Fariba of Shen can understand your whisperings.\"\n\nLacus shot the gaudy merchant a narrow-eyed look, receiving only a smug grin in return.\n\n\"So is this what five Spirit-faring gold got us?\" Lacus asked.  \"We would have found this on patrol.\"\n\n\"You would not have known to read it,\" Fariba said with a shrug, \"but if you are haggling for more value for your coin, Fariba can respect that.  You may not know what the people of Sammos think of your people, for instance.\"\n\n\"Why the hell should we care what a bunch of sheep fuckers think about us?\"\n\n\"Ha! That is a good one, Fariba will have to remember it.\"  They chuckled.  \"But those fornicators think of you as badly as they thought of their masters.  Who they have risen up and killed, just to be clear.\"\n\nLacus raised an eyebrow in shock and felt no small sense of insult at the idea.  \"What?  We've been taking in their escaped slaves for generations.\"\n\n\"Seems few of them have returned to share the good news of the lavish treatment your people bestow upon them.\"  Fariba leaned against the foul-smelling well and began to pick at their fingernails.  \"Their belief is that those who manage to make it here are left to rot in the streets and their pleas for help to free their people are ignored.\"\n\n\"They thought we'd go to war to free them?\" Secundus asked disparagingly, \"That is hardly-\"\n\n\"Hold now, please, Fariba is only sharing the words of others.  It is not Fariba's opinion, you must realize.\"  They walked over to the wall and looked up at the graffiti.\n\n\"Their leader is a priestess of some small cult.  She came to these lands long ago and was turned away.  Coin, faith, and pity were not enough.  So now they say that she returns for vengeance.  The fires of her hatred burn bright and she sends shadows to do her bidding.\"\n\n\"The Beasts of Bathos.\"  Lacus looked up at the graffiti.\n\n\"The Thiria, yes.\" Fariba nodded.  \"Fariba knows not if this is a sign that they are planning to come here, a sign of your own people living in such...\" he looked around, sniffed, and clicked his tongue, \"...fine comforts planning to follow in the footsteps of Sammos, or just some children wasting fine pigments.\"\n\nThey backed away from the wall.  \"But Fariba *does* know that Sammos had a large fleet of ships for war and for trade.  Ships run by the very slaves that now control the country.  The King of Sammos, the Imperial Magistrate, and all their soldiers who did not make it out are presumed dead.\"\n\n\"I still don't buy that a bunch of slaves overpowered the Imperial Army,\"  Lacus said indignantly.  They were the best-trained soldiers from every nation.  Drilled for years and trained *specifically* to put down rebellions.\n\n\"Bah, slaves?  No.  They are many in number, but they had assistance.  Have you heard of the land of Gymir?\"\n\nLacus shrugged and looked at Secundus, who shook his head.  \n\nFariba continued, \"No?  It is a marvelous land full of marvelous people.  Savage poets who fight without regard for life or limb.  To them, the human body is a canvas; they paint their own with symbols of power, and carve sigils of death into their foes.\"\n\n\"So, what, the slaves were freed by...Gimmeerites?\"\n\n\"Gymirans.  And yes, but no.\"  Fariba reached up under their turban to scratch behind their ear as they bit their lip.  \"I do not know your word for it.  They were paid for their services though, which is a concept Fariba understands well.  Why one would risk their life for coin is a bit more mysterious but...\" he shrugged.\n\n\"Mercenaries?\" Secundus asked in disbelief.  \"A rabble of *mercenaries* defeated the Empire?\"\n\n\"Ha!\" Fariba laughed.  \"*You* are part of the Empire and stand undefeated.  So no, Fariba will make no such claims.  But the priestess *did* return from the frozen lands to the north on a ship of strange make with straw-haired men painted with sigils.  Her shadows and the men of Gymir, together, killed the king.  And where to next will those ships sail?\"\n\nHe gestured vaguely down an alley that led to nowhere, but Lacus knew the layout of the city well enough to know what he meant: the docks.\n\n\"Is that a threat against the Royal Family?\" Secundus asked.\n\n\"It is a warning, old friend.  You, who protect the royals, will face the Thiria should the rumors of a vengeful priestess be true.\"  Fariba tugged up the hem of their robe and stepped over a puddle.  \"Fariba does not enjoy gambling and will be taking their leave of the city by week's end.  If your life is more valuable than your oath, Fariba recommends you do the same.\"\n\nThey looked Lacus's direction and smiled playfully again.  \"Friend Lacus, you may remain here as long as you desire.  Fariba wishes you enjoy your time.\"\n\nThey vanished around the corner, leaving Lacus and Secundus alone.\n\n\"Either they just suggested I stay and die,\" Lacus said, \"or they told you to abandon your post...and die for your trouble.\"\n\n\"We'll make sure no one dies,\" Secundus said as he patted Lacus on the shoulder.  \"I think we have everything we need now.  We'll gather the guard, conscript a militia, and prevent any rebels from organizing.\"\n\nLacus sighed and followed his friend up the road and back towards the palace.  \"Great, more work.\"\n\n\\----------------  \n[\\[<= *Of Rumors & Rebels*\\]](https://new.reddit.com/r/shortstories/comments/1bude6v/fn_penumbra_chapter_2_of_rumors_rebels/) [\\[Chapter Index\\]](https://www.reddit.com/r/TomesOfTheLitchKing/comments/1bt9vl7/index_penumbra/) [\\[*Of Empires & Escape* =>\\]](https://new.reddit.com/r/shortstories/comments/1bw4kgr/fn_penumbra_chapter_4_of_empires_escape/)  \nAll crit/feedback welcome!  \nr/TomesOfTheLitchKing", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "**Welcome to the Short Stories!** This is an automated message.   \n\nThe rules can be found on the sidebar [here]( https://www.reddit.com/r/ShortStories/about/sidebar).\n\n**Writers** - Stories which have been checked for simple mistakes and are properly formatted, tend to get a lot more people reading them. Common issues include - \n\n* Formatting can get lost when pasting from elsewhere.  \n* Adding spaces at the start of a paragraph gets formatted by Reddit into a hard-to-read style, due to markdown. Guide to Reddit markdown [here](https://www.reddit.com/wiki/markdown)    \n     \n**Readers** - ShortStories is a place for writers to get constructive feedback. Abuse of any kind is not tolerated.    \n     \n***  \n\nIf you see a rule breaking post or comment, then please hit the report button.           \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/shortstories) if you have any questions or concerns.*"}]}, {"post_title": "[MF] Medic", "post_url": "https://www.reddit.com/r/shortstories/comments/1bvjrz4/mf_medic/", "post_main_text": "In the dream he was having, Arthur Simms found the woman grotesque. She was fat, shaped like a Great Blue, and her hair was frazzled, black and curly and unkempt. She wore sweatpants and crocs. When she was struck with the bullet she slumped over the cafeteria table and slid down like a slug along a downspout. She collapsed at the feet of a woman who had clearly never experienced anything like it, nor was cut out for it. “Well, she’s dead,” she blurted out as she looked at the blood on her sweatpants. The large woman gurgled and sputtered and shook.\n\n“Like hell she is,” said the dream-Arthur, and jumped up amidst the exchange of gunfire, and over the scream of recoils and explosions, screamed himself for everything he had, with all his soul, “medic.” His breath felt like leaden boots stomping on his chest, so he took another one, bigger, and shouted, “medic” again. Over and over, “medic,” “medic,” “medic.”\n\nSometimes the bubbles of worlds pop and dream-Arthur’s bubble had been glass—tonight it shattered—, when Real-Life Arthur flung his sheets off and started screaming, for all of creation and the unborn to hear, his cries of “medic,” “medic,” “medic.”\n\nHis wife sat up and said, “Arthur!” He shook. “Arthur, you’re having a dream!” Arthur sat there breathing heavily as the crying sound from the next room commenced. “The baby’s awake,” she said as she got up, still lightly rubbing his back. Arthur sat for a few more seconds trying to sort out what was broken glass and what was reality, unsure if there was a difference when he heard from the next room, “Daddy? Daddy!” and then more tears. He went into his oldest sons room and said, “It’s ok, buddy, go back to sleep.”\n\n“What was that noise?” the little boy asked through the sound of his own crying and his baby brother’s.\n\n“Daddy had a dream. It’s ok, you can go back to sleep.”\n\n“What did you say, Daddy?”\n\n“I said, ‘medic.’”\n\n“What did you say after that?”\n\n“Nothing, just ‘medic,’ ‘medic,’ ‘medic.’”\n\n“Why did you say that?” Then, pausing, “was there a witch?”\n\n“No, buddy, there’s no witches, let’s go back to sleep.” He heard his wife next door trying to comfort the infant, “it’s ok,” she said, “it’s ok. There you go, Mommy’s here.”\n\n“Why did you say ‘medic’, Daddy?”\n\n“I don’t know. I was dreaming that I needed a medic and I shouted it.”\n\n“You’re not supposed to shout inside. It’s unpleasant.”\n\n“Yes, Son, you are right. Thank you. I’m sorry I woke you. Let’s go back to sleep now.” And Arthur tucked him in and kissed him on the forehead and said, “I love you.”\n\nIt was a couple weeks later, after church on Sunday when the bubbles formed again. This time, Arthur was wide awake, grilling in the backyard, his brother and sisters sitting around the patio, and their kids all running around the back yard in their Sunday’s Best. There were a few daffodils left, but most of them were shriveling, turning brown, petals returning to the earth. The kids were laughing and shrieking and one could never be sure if they were enjoying themselves or if the gates of hell were opening up in the midst of their game of tag.\n\nHe was talking about the upcoming basketball game to his mother, when his son ran up to him and interrupted the conversation. “Daddy said ‘medic,’ Grandma! Daddy said ‘medic’!”\n\nArthur’s mother, blank-faced, said, “What?”\n\n“Daddy, said ‘medic’, Grandma! I was sleeping and Daddy had a dream and she said—he said—‘medic, medic, medic.’ I thought it was a witch, but Daddy said it wasn’t a witch.”\n\nShe looked at Arthur, and he told her, “I had dream the other night, and I woke him up. So now we are hearing about it.” Arthur’s wife came over and asked if he needed another drink, and he said “I can get it, thanks—Excuse me,” and he left his Mother and his Son to talk basketball.\n\nHe sat down in the kitchen and looked out the window at his son talking to his mother. It had been nearly twenty years, but he still dreamt about it. He had never forgotten about it, supposed he never could; it was like the scar on his face, he could never not see it, but he could go a long time without ever looking at it. He sat there in the chair and looked at the condensation running down the glass and onto the table. His eyes didn’t close, nor blink, they just stared at the glass and the streak of blood down the hallway as he and the two other men dragged the woman’s body, limp and cumbersome, to the medic’s station. A tear gathered in his eye and slid down his cheek and dropped onto the back of his hand. ‘Medic,’ he whispered, ‘medic,’ ‘medic.’\n\n&#x200B;\n\n\\*\\*\\*\n\nFollow u/quillandtrowel over at Medium & Twitter (link -> bio).", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "**Welcome to the Short Stories!** This is an automated message.   \n\nThe rules can be found on the sidebar [here]( https://www.reddit.com/r/ShortStories/about/sidebar).\n\n**Writers** - Stories which have been checked for simple mistakes and are properly formatted, tend to get a lot more people reading them. Common issues include - \n\n* Formatting can get lost when pasting from elsewhere.  \n* Adding spaces at the start of a paragraph gets formatted by Reddit into a hard-to-read style, due to markdown. Guide to Reddit markdown [here](https://www.reddit.com/wiki/markdown)    \n     \n**Readers** - ShortStories is a place for writers to get constructive feedback. Abuse of any kind is not tolerated.    \n     \n***  \n\nIf you see a rule breaking post or comment, then please hit the report button.           \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/shortstories) if you have any questions or concerns.*"}]}, {"post_title": "[MS] Mr. Silva's Library", "post_url": "https://www.reddit.com/r/shortstories/comments/1bv0ih9/ms_mr_silvas_library/", "post_main_text": "Threatened by dust fireflies that danced around tired and caramelised bulbs, aged Mr. Silva rummaged around. A face and presence, that for long lived years had shown an adult suave charm, were now forgotten in time, replaced instead by a face and presence of decay and old age. His reflection, an intermittent fear, not knowing the face that looked at him. Sluggishly but determined, he fought against the inability to practice what he would, in times past, do with great ease. Between infinite shelves of books, pages and memories, he did what he could to organise and alphabetise all those tomes, in order to make them make sense.\n\nSomeone was undoing his life’s work. He would arrange and keep the books in order, only to get this undone just around the corner. But he was never a person to back down from challenges or fights and had already thought of a plan to catch these cretins.\n\nIn one of the many corridors, he felt his heart and stomach sink. It was one of the library workers. He hated her. Lately no one would let him do nothing around here. And the little he tried to do was all wrong and badly done, according to them.\n\nHe tried to turn back and go unnoticed, but it was pointless. As pointless as trying to hide from your own hair. There was no escape from them. And this one worker was the worst. She was mean to him.\n\n“How many times do I have to tell you not to touch anything? If you need anything just ask for help and don’t touch anything. Understand?”\n\n“But it isn’t me.” - he said, trying to hide the large tears that were forming in his eyes. - “ There is someone around here trying to mess with the books.”\n\nShe looked at him with no hope in her eyes and went away somewhere else, shaking the shelves with each step she took.\n\n“I’m going to catch these people and show all of you.” - he thought to himself, pouting, while he got back to his quest to find those miscreants.\n\nBut then, a familiar smell caught his attention. He looked back and saw no one. But why would he look back? He was sitting on a big fluffy worn couch. The smell came from someone kneeling in front of him, in a praying pose, holding his hands.\n\n“Dad, can you hear me?” - said a face displaying a worried smile. \n\n“Hello little lady. Are you new here? Are they already replacing me already?” - he said with noticeable fear.\n\n“Oh, dad…Don’t you know who I am?”\n\nHe didn’t spend a second thinking about that question. The scoundrels had come back. He could see them and the end of the corridor, messing with his books.\n\n“I’m sorry little lady, I didn’t even ask you for your name, but I have some pranksters to catch. They are messing up all my books.”", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "**Welcome to the Short Stories!** This is an automated message.   \n\nThe rules can be found on the sidebar [here]( https://www.reddit.com/r/ShortStories/about/sidebar).\n\n**Writers** - Stories which have been checked for simple mistakes and are properly formatted, tend to get a lot more people reading them. Common issues include - \n\n* Formatting can get lost when pasting from elsewhere.  \n* Adding spaces at the start of a paragraph gets formatted by Reddit into a hard-to-read style, due to markdown. Guide to Reddit markdown [here](https://www.reddit.com/wiki/markdown)    \n     \n**Readers** - ShortStories is a place for writers to get constructive feedback. Abuse of any kind is not tolerated.    \n     \n***  \n\nIf you see a rule breaking post or comment, then please hit the report button.           \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/shortstories) if you have any questions or concerns.*"}, {"comment_author": "slater-aj", "comment_text": "I’m literally just a guy but I liked it. Is it basically that he has dementia and the worker is his daughter?"}, {"comment_author": "cunha89", "comment_text": "Yes 👍"}, {"comment_author": "bootymuncher8228", "comment_text": "DISCLAIMER!!!!! This is all personal opinion. I am not a professional, just an avid writer and reader!!\n\nYou do a lot of telling instead of showing which makes the story not feel as textured if yk what I mean. \n\nEX. \"He said with noticeable fear.\" \n\nDid his eyes widen, voice crack, hands quiver? Write why we would know he's scared. Especially with short stories you have to pack a lot into a little. Tbh lack of description makes it feel like you're just rushing to get to each plot point you want to hit. Also, some of your sentences are a little over complicated/don't flow well.\n\nEX. for restructuring. ***\"A face and presence, that for long lived years had shown an adult suave charm, were now forgotten in time, replaced instead by a face and presence of decay and old age.\"***\n\n1. His matured suave charm was forgotten in time, replaced by a face and presence of decay and old age.\n\nEx. To make O.G. sentence more readable (I **think** grammatically correct, don't count on it) (I still think the two italicized phrases don't work well in the sentence.)\n\nA face and presence that for *long lived years* had shown an *adult suave charm*, were now forgotten in time; replaced instead by a face and presence of decay and old age.\n\n***\"Threatened by dust fireflies that danced around tired and caramelised bulbs, aged Mr. Silva rummaged around.\"***\n\nThreatened by dust fireflies??? Im confused whether you're righting about actual fireflies dancing in the air as their tired bulbs flicker. ***/or/*** Dust particles flying in the air circling the dim lightbulb dangerously close to falling onto Mr.Silva.\n\nEither way, the threatened doesn't make sense.\n\nIn general, the plot was there but the way you paced it and the details you highlighted made it difficult to follow. I'm left with a lot of questions. Why is a man, who clearly has dementia at a library, whether he actually works there or not.  \n***\"But then, a familiar smell caught his attention. He looked back and saw no one. But why would he look back? He was sitting on a big fluffy worn couch. The smell came from someone kneeling in front of him, in a praying pose, holding his hands.\"***\n\nThe above portion is very specially confusing. I understand you're trying to portray dementia to an extent. I think you're trying to go either of two ways with that section. His dementia is warping is perception of his reality, like where he is and when it is, or, you just accidentally had some gaps in the physical aspect. Either way, that section didn't really flow well. I recommend if you were trying to do my first guess, to either make his confusion prominent as well, or if you want him more docile, to be calmly noting how time is distorted.\n\nBut then, a familiar smell engulfed his lungs. The joints in his neck creaked as Mr.Silva looked over his shoulder, but, saw nothing but an empty hallway. Though the hallway was vacant, Mr.Silva didn't turn back around. The smell was so distinct, so particular he could practically taste it. His memory served little help, for the decades of memories had begun to blur. His brow furrowed deeper as he tried to grab onto any discernible moment, but every memory bared nothing but obscure faces and distorted voices. He draped his hand across his forehead, squeezing both eyes shut, the farmiliar pounding in his head signaled a migraine. He massaged his temple, still gabbing at any memory he could. But the longer he tried the more his brain fought itself. His head grew heavier by the second, blah, blah, blah. But keep on writing!"}, {"comment_author": "cunha89", "comment_text": "Thanks for the tips 🤘"}]}]