["#Welcome to Serial Sunday!\n\nTo those brand new to the feature and those returning from last week, welcome! Do you have a self-established universe you’ve been writing or planning to write in? Do you have an idea for a world that’s been itching to get out? This is the perfect place to explore that. Each week, I post a theme to inspire you, along with a related image and song. You have 500 - 1000 words to write your installment. You can jump in at any time; writing for previous weeks’ is not necessary in order to join. After you’ve posted, come back and provide feedback for at least 1 other writer on the thread. Please be sure to read the entire post for a full list of rules.\n***\n#This Week’s Theme is Obsession!       \n\n[**Image**](https://www.reddit.com/r/Art/comments/yeapv9/obsession_me_digital_2022/)  | [**Song**](https://www.youtube.com/watch?v=zDLJUoSYNT4&pp=ygUXeW91J3JlIG1pbmUgcGhhbnRvZ3JhbSA%3D)            \n    \n**Bonus Word List** (each included word is worth 5 pts) - **Please list which words you included at the end of your story.**                  \n- obedience                              \n- ostentatious                                                                                                 \n- old-fashioned                                                                                                             \n- organic        \n                                          \nWhat goals will your character stop at nothing to achieve? What desires permeate their life, consume their thoughts, eat away at them until the character is no more than a vessel for that desire?\n\nThese are obsessions, desires gone dark and all-consuming, fragments fraught with emotion and emerged from the deepest depths of their psyche. Thus, obsessions can define a character in ways that other things can't. What obsession would consume a normally level-headed character? For a character obsessed with power, what made it so that power became their be-all, end-all? What levels are your characters willing to go to in pursuit of their obsession? What are they willing to sacrifice? If they achieve their ends, how do they react? Are they fulfilled? Empty? What do they fill their lives with in the gaping absence? Do they pick up knitting and start on the path to being a more adjusted person? Or is another obsession the only thing that can fill the empty void left behind? *Blurb provided by u/wandering_cirrus*          \n  \nThese are just a few things to get you started. Remember, the theme should be present within the story in some way, but its interpretation is completely up to you. For the bonus words (not required), you may change the *tense*, but the base word should remain the same. **Please remember to follow all sub and post rules.**     \n\n[**Don’t forget to sign up for Saturday Campfire here!**](https://docs.google.com/forms/d/e/1FAIpQLSfQPPx4WCaDmjiCzboXfBJLixTV3picjXU1NsJmH05_OfEbgw/viewform?usp=sf_link) We start at 1pm EST and provide live feedback!\n \n***\n###Theme Schedule:\n                                                                                                                                                                                                                 \n- March 24 - Obsession (this week)        \n- March 31 - Perception       \n- April 7 - Queen\n\n      \n***        \n&nbsp; \n[**Previous Themes**](https://www.reddit.com/r/shortstories/wiki/sersun/)  |  [**Serial Index**](https://www.reddit.com/r/shortstories/wiki/serial_sunday_serials/)      \n&nbsp;\n***\n\n#Rankings for [Notorious](https://www.reddit.com/r/shortstories/comments/1bh79tp/sersun_serial_sunday_notorious/?sort=old)       \n   \n- [**First**](https://www.reddit.com/r/shortstories/comments/1bh79tp/comment/kvc5t0u/?utm_source=share&utm_medium=web2x&context=3) - u/MeganBessel         \n- [**Second**](https://www.reddit.com/r/shortstories/comments/1bh79tp/comment/kw0d2v6/?utm_source=share&utm_medium=web2x&context=3) - u/Tomorrow_Is_Today1     \n- [**Third**](https://www.reddit.com/r/shortstories/comments/1bh79tp/comment/kvz0xbv/?utm_source=share&utm_medium=web2x&context=3) - u/Zetakh         \n- [**Fourth**](https://www.reddit.com/r/shortstories/comments/1bh79tp/comment/kvpjpgw/?utm_source=share&utm_medium=web2x&context=3) - u/AGuyLikeThat          \n- [**Fifth**](https://www.reddit.com/r/shortstories/comments/1bh79tp/comment/kvd2e7m/?utm_source=share&utm_medium=web2x&context=3) - u/ZachTheLitchKing                      \n         \n\n\n***        \n#Rules & How to Participate\nPlease read and follow all the rules listed below. This feature has requirements for participation!     \n\n- **Submit a story inspired by the weekly theme, set in your *self-established* universe (no fanfics) that is 500 - 1000 words. Use wordcounter.net to check your wordcount.** Stories should be posted as a top-level comment below. If you’re continuing an in-progress serial (not on Serial Sunday), please include links to your previous installments. **Please note: All submissions should be given a basic editing pass before being posted.**\n\n- **Your chapter must be submitted by Saturday at 9:00am EST.** Late entries will be disqualified. \n\n- **Begin your post with the name of your serial between triangle brackets** (e.g. <My Awesome Serial>). This will allow our serial bot to recognize your serial and add each chapter to the SerSun catalog. Do not include anything in the brackets you don’t want in your title. (Please note: You must use this same title every week.)\n\n- **Do not pre-write your serial.** You’re welcome to do outlining and planning for your serial, but chapters should not be pre-written. All submissions should be written for this post, specifically.\n\n- **Only one active serial per author at a time.** This does not apply to serials written outside of Serial Sunday. \n\n- **All Serial Sunday authors must leave feedback on at least one story on the thread each week.** The feedback should be **actionable** and also include something the author has done well. When you include something the author should improve on, provide an example! You have until **Saturday at 11:59pm EST** to post your feedback. (Submitting late is not an exception to this rule.)     \n\n- **Missing your feedback requirement two or more consecutive weeks will disqualify you from rankings and Campfire readings the following week.** If it becomes a habit, you may be asked to move your serial to the sub instead.\n\n- **Serials must abide by subreddit content rules.** You can view a [full list of rules here](https://www.reddit.com/r/shortstories/wiki/index/rules). If you’re ever unsure if your story would cross the line, please modmail and ask!\n\n&nbsp;\n***\n\n#Weekly Campfires & Voting:\n\n- **On Saturdays at 1pm EST, I host a Serial Sunday Campfire in our [Discord’s Voice Lounge](https://discord.gg/writingprompts).** Join us to read your story aloud, hear others, and exchange feedback. We have a great time! You can even come to just listen, if that’s more your speed. Grab the “Serial Sunday” role on the Discord to get notified before it starts. You can [sign up here](https://docs.google.com/forms/d/e/1FAIpQLSfQPPx4WCaDmjiCzboXfBJLixTV3picjXU1NsJmH05_OfEbgw/viewform?usp=sf_link)\n\n- **Nominations for your favorite stories can be submitted [with this form](https://docs.google.com/forms/d/e/1FAIpQLSerFCI5u_sDWUnlkuOO8h4vQVqdWLDfeK_gBEDWps7THlhgUw/viewform?usp=sf_link).** The form is open on Saturdays from 12:30pm to 11:59pm EST.  You do not have to participate to make nominations!\n\n- **Authors who complete their Serial Sunday serials with at least 12 installments, can host a SerialWorm in our Discord’s Voice Lounge, where you read aloud your finished and edited serials.** Celebrate your accomplishment! Authors are eligible for this only if they have followed the weekly feedback requirement (and all other post rules). Visit us on the Discord for more information.\n&nbsp;\n***\n\n#Ranking System\n\nWe have a new point system! Here is the point breakdown:\n\n**TASK** | **POINTS** | **ADDITIONAL NOTES**\n|:--:|:--:|:--:|:--:|:--:|:--:|\n| **Use of weekly theme** | **75** pts | Theme should be present, but the  interpretation is up to you!\n| **Including the bonus words** | **5** pts each (20 pts total) | This is a bonus challenge, and not required!\n| **Actionable Feedback** | up to **15** pts each (4 crit max)* |   This includes thread and campfire critiques. (You can always provide more crit, but the points are capped at 60.)\n| **Nominations your story receives** | **10 - 60 pts** | 1st place - **60**, 2nd place - **50**, 3rd place - **40**, 4th place - **30**, 5th place - **20** / Regular Nominations - **10**\n| **Voting for others** | **15** pts |    You can now vote for up to 10 stories each week!\n\n*You are still required to leave at least 1 actionable feedback comment on the thread every week that you submit. This should be more than one or two vague sentences, and should include at least one thing the author has done well and one thing that could be improved. **Please remember that interacting with a story is not the same as providing feedback.** *Low-effort crits will not receive credit*.   \n  \n**Looking for more on what actionable feedback is?** Check out [this guide on critiquing](https://www.reddit.com/r/WPCritique/wiki/how_to_critique).      \n\n&nbsp;\n***                                        \n***\n###Subreddit News\n\n- Join [**our Discord**](https://discord.gg/writingprompts) to chat with other authors and readers! We hold several **weekly Campfires**, monthly **World-Building interviews** and several other fun events! \n- Try your hand at micro-fic on [**Micro Monday**](https://redd.it/1bhzopa)!    \n \n- You can now post serials to r/Shortstories, outside of Serial Sunday. Check out [**this post**](https://www.reddit.com/r/shortstories/comments/m20mxf/ot_rshortstories_now_has_serials/) to learn more!\n- Looking for critiques and feedback for your story? Check out [**r/WPCritique**](https://www.reddit.com/r/WPCritique/)!\n&nbsp;\n\n***\n***", "#Welcome to Serial Sunday!\n\n- All top-level comments must be serials.\n\n- Reply here to discuss the theme, suggest future themes, or \n   talk about serial writing.\n\n- Please read the post rules carefully and follow the subreddit \n   rules in any feedback.", "For my fellow horror fans, [an alternate song for Obsession](https://www.youtube.com/watch?v=ikGfHjrtSVk) :)", "Hay Bay!\n\nWhat a powerful and *terrifying* image for this week :D  It looks like someone is being grabbed from behind, which is quite scary to be sure.  I can stretch to interpret it in other ways like the person is grabbing their own face to try and fight back their own urges and *obsession* but it's a big stretch at best xD  Definitely going with the darker interpretation because it conveys a much more powerful feeling.\n\nThe title of the song is very possessive, which fits the theme very well.  I can already imagine the vibe of the song based on the theme and title alone.  And listening to the song yeah, I was right.  Very much a toxic, possessive kind of relationship tone.  Just the sort of thing an obsessed person would do to the person they \"love\".\n\nWhelp I'm hoping the vibes this week aren't going to be quite so dark as the set dressing :P  But only time will tell!  Great picks :D", "Aight, I listened to the alternate song and *wow* this hits the \"Obsession\" vibe from a stalker POV sooooo well.  More than just a typical stalker also.  A serial killer type of stalker.  Given this is *serial* sunday I don't think we want any killers of this variety :P  (Hooray for bad puns)  Second verse it feels a lot more like someone doing dark rituals, which adds a new layer of creepiness.  I'm kinda digging it but I totally get why horror lovers would enjoy this song.\n\nLyrics aside (though they are very prominent) I like the sound of the song.  As in, the instrumentals and the tune.  It has an almost gentle quality to it, like something I could hear someone singing in a coffee shop with an acoustic guitar.  Actually, if this song was sung in a coffee shop I'd might be more interested in listening (not a fan of coffee shop guitarists, sadly)\n\nGood recommendation :D", "Did you listen to the additional song??", "No I didn't and I don't plan to because you preceded it by saying its for *horror* fans, which I am not xD (I'm a scaredy cat)", "the song itself isn't scary, just a little creepy in how the artist talks about loving the person. but totally understood", "Whelp I trust you not to steer me wrong so I'll give it a listen after work :D", "# <In the Shadow of the World Tree>\n\n[Chapter Index](https://www.reddit.com/r/BesselWrites/comments/tdn37h/in_the_shadow_of_the_world_tree/)  \n[Appendix](https://www.reddit.com/r/BesselWrites/wiki/TasamAlvedyos)\n\n**Chapter 106: The Forest and the Trees**\n\n---\n\nLena felt dizzy. _How could that possibly be?_ Stumbling over, she grabbed one of the chairs and practically fell into it.\n\n“Alvedos _is_ a tree!” Veska insisted. “I’ve _touched_ Her! I’ve _bound my soul_ to Her!”\n\n“I should clarify,” Elfo continued in an unconcerned tone. “While the `generator core` is not a tree, I suppose it _is_ surrounded by plant material as `camouflage` for the sake of the `native wildlife`.”\n\n“_Plant_ material?” Lena could barely breathe. “Alvedos is a _tree_, not a _plant_!”\n\n“Fascinating. Your `biological taxonomy` does not consider trees to be plants. That is—” It paused. Then in a softer voice, said, “I am observing that your heart `rates` are extremely `elevated` and your breathing is `shallow`. It seems you are all going through shock. Please sit down like Lena has, so you do not injure yourselves from fainting.”\n\n“Just what the cav are you?” Maltis shouted back. “_Where_ are you?”\n\n“Please sit down, and I will explain.”\n\nLena tried to keep her breathing steady. Tried to calm down. Tried to make _sense_ of all this.\n\nHer friends looked as dazed as she felt as they took the other chairs.\n\n“A long time ago,” Elfo said like it was speaking to children, “There was a man named `Maxibillion Spruce` who had a dream. He was very interested in what he considered the ‘high points’ of `ancient`—very old—`civilizations`. `Egypt`. `Olmec`. `Rome`. `Tang`. `America`. `Nigeria`. `Sanyue`. `Neo-Euro—`”\n\n“None of those mean anything to us,” Bakla said flatly.\n\n“My apologies.” The voice hesitated a moment, then said, “Of particular importance was his fascination with the `Pax Americana` during the dawn of the twenty-first `century` of the `Gregorian calendar`. Despite the paucity of documents that have survived from that time, he was highly instrumental in language reconstruction efforts of `General American English`, and its surrounding `cultural norms`. He also was very interested in the plants and animals—and I suppose trees—of that time, since so few survived the ensuing two `centuries`. With his money and political sway, he convinced the people of `Earth` to build a series of `ecological preserves` of the various `pre-Magnacide climates`, situated in the `Lagrange points` between `the earth` and the sun. _This_ `preserve` was built in `el four`, sixty `degrees` ahead of `Earth` on the same orbit.”\n\n“For supposedly speaking our language, that’s a lot of gibberish,” Maltis said.\n\n“There are a lot of words that were not in the original language design, and I am working from an incomplete…collection of observations.” Elfo sounded apologetic. “Let me try to rephrase. `Maxibillion` was a man from `Earth` who was very interested in historical plants, animals, and trees. He hired Lena to build _this_ disc in the void to hold the plants, animals, and trees so they wouldn’t die.”\n\n“A man from…” Bakla frowned. “Where?”\n\n“`Earth`.”\n\n“_Os_?” Lena asked.\n\n“It is the place humans are from. When the disc was built, humans were brought from `Earth` to take care of the plants, animals, and trees. You are their descendants.”\n\n“What does this have to do with Alvedos?” Veska wondered. “You said it wasn’t a tree.”\n\n“At the center of the disc is a `machine`, a human-made thing that creates a `gravitational field`, which keeps plants, animals, and trees falling to the disc. It also creates an invisible `EM-Plasmic` dome that protects the disc from the bad light the Sun emits, along with slowing down metal and rock that enters the air from the void.”\n\n“Fallen stars.” Lena was starting to make sense of it. “That invisible dome is where sparkle-stars come from!”\n\nElfo paused as though considering this. “Things entering the dome would create a brief flicker of light, yes.”\n\n“And Alvedos creates that!” She _does_ protect them!\n\n“In a manner of speaking, yes. But it is not a tree. It is a `machine`. And it is surrounded by something like a tree to keep it safe.”\n\n“And this _os_,” Bakla said. “Where is that, exactly?”\n\n“I have marked it on the window.” There was a circle drawn now—fox-colored, flickering like fire—around one of the visible stars.\n\nIt took Lena a moment to orient herself, seeing the stars this way instead of from the ground. But the circled star was in the Twin Otters, which meant… “The Dutiful Husband! But…it’s a _star_!”\n\n“It is a `planet`, which is…” Elfo paused for a moment, then continued, “It is like the disc, but a sphere. `Planets` orbit a star—in our case, the sun—just like `el four` and `el five` are doing.”\n\nBakla continued to ask more questions about the stars, but despite her interest Lena couldn’t think right now. Alvedos was _made_, not grown? The land was created to preserve animals, plants, and trees—and people weren’t fruits, but came from _another_ land?\n\nShe looked out the window, the flying-room hurtling ever closer to the edge. They were dropping, now, towards the sun and the horizon—matching Lena’s increasing despair as Elfo continued to explain that everything she had been taught—as a child and as a forester—was a lie.\n\n---\n\nWC: 835 (849 in Scrivener), and I continue the 850 convention\n\nA reminder that things in `monospace font text` are \"twenty-first century English, General American”.\n\nThe four first go up to Zhik Lenali in [Chapter 104](https://www.reddit.com/r/shortstories/comments/1bbimpw/sersun_serial_sunday_monster/ku9tzre/). Veska binds her soul to Alvedos in [Chapter 100](https://www.reddit.com/r/shortstories/comments/1aoinxd/sersun_serial_sunday_insolence/kq61efl/). The cube mentions General American English in [Chapter 72](https://www.reddit.com/r/shortstories/comments/15duvo9/sersun_serial_sunday_gamble/ju5gtzq/). The term _os_ previously occurs in [Chapter 69](https://www.reddit.com/r/shortstories/comments/14vbldi/sersun_serial_sunday_dreams/jrcvck2/). That what is under the World Tree is an EM-Plasmic generator is indicated in [Chapter 77](https://www.reddit.com/r/shortstories/comments/1694sbx/sersun_serial_sunday_light/jz1uaqr/) and [Chapter 103](https://www.reddit.com/r/shortstories/comments/1b5shdh/sersun_serial_sunday_lies/kt7r19f/). Sparkle-stars are discussed in [Chapter 8](https://www.reddit.com/r/shortstories/comments/ug4cf5/sersun_serial_sunday_night/i78u7pv/). The Dutiful Husband is discussed in [Chapter 15](https://www.reddit.com/r/shortstories/comments/vfunr5/sersun_serial_sunday_unity/id0p88u/) and [Chapter 35](https://www.reddit.com/r/shortstories/comments/ynxb14/sersun_serial_sunday_questions/ivcbrwy/). There is an argument that L4 is actually a sphere in [Chapter 38](https://www.reddit.com/r/shortstories/comments/z69eh3/sersun_serial_sunday_truth/iy6kflk/). \n\nThank you for reading!\n\n/r/BesselWrites", "Alrighty, Megan, now that I'm back... let's see what I missed...\n\n*\\*spits out coffee*\n\nWHAT! Alvedos is a lie?!\n\n> Lena felt dizzy.\n\nSo would I! Although I'm also looking forward to the \"God is dead!\" story arc we have coming up when they *(hopefully)* get back.\n\n> “I’ve bound my soul to Her!”\n\nOof, sorry, Veska.\n\n> “While the `generator core` is not a tree, I suppose it is surrounded by plant material”\n\nOooo like an epiphyte! Kinda.\n\n> “*Plant* material?” Lena could barely breathe. “Alvedos is a *tree*, not a *plant*!”\n\nI know they're all losing it right now, but I did get a good chuckle out of this opening scene. :)\n\n> `Maxibillion`\n\n*#angryUpvote*\n\n> Despite the paucity of documents that have survived from that time\n\nWhat did *your* world do to *my* internet?!\n\n> `pre-Magnacide climates`\n\nOoooo, \"murder of the great *[ones]*?\" Although I did a quick \"am I crazy\" Google search of *magnacide* and found out it's a brand of aquatic herbicide... No, surely, you mean \"murder of the great.\" Now, I want Magnacide stories!\n\n> `Lagrange points`\n\nAlright, I'm commenting on every other word here... but *+1* for physics! And for using stable Lagrange points!\n\n> “For supposedly speaking our language, that’s a lot of gibberish,” Maltis said.\n\n*\\*takes more worldbuilding notes*\n\n> Everything she had been taught—as a child and as a forester—was a lie.\n\nOof a tough chapter for them all, I'm sure, but especially brutal for Lena. But, on a selfish note, excited to see how they deal with this \"God is dead\" knowledge when they come back... Unless they go to the other side of the disc *(what's on the other side??? Soydevla Masat? Home of the people with no rizz?)*?\n\nI forgot to have any crit/suggestions in there... but I do want to add that I love the contrast in language/diction between Elfo and the gang. Wonderful job with the rhythm and flow between the two *(\"two\")* voices... the worldbuilding here really flew by. Although I am a WB fan, so maybe I'm biased. :)\n\nEither way, good words!", "Heya Megan!\n\nI've got my popcorn and a comfy chair, let's see what happens to our perplexed party this week!\n\nI love this reference to the cultural distinction between plant and tree:\n\n>“Alvedos is a *tree*, not a *plant*!”\n\nIt has the same \"energy\" as differentiating between humans and animals.  Which, I assume, their culture also delineates.  Very likely Elfo considers them all the \"native wildlife\"\n\nI had thought to call out \"elevated\" as a word that doesn't translate well, but given the buildings are prefabricated and they don't climb trees, I can actually believe the concept hasn't transferred properly.\n\n>elevated / shallow\n\n*Shallow*, on the other hand, I feel like would have been translatable.  While the streams/\"rivers\" through Alvedos are (I assume) fairly consistent in terms of depth  - and the concept of a \"shallow\" vs \"deep\" cut is less likely to have occurred in a utopian world like theirs - there is the \"ocean\" surrounding the landmass that is (again, I assume) deeper than the streams to help contain the wildlife to the landmass and prevent them simply \"walking\" out to the edge.\n\nI love this guy's name:\n\n>Maxibillion\n\nI'm having a lot of fun thinking through some of the blue words and trying to interpret how/why they wouldn't be translated.  \"century\" is a great example, since their system is base-twelve instead of base-ten so \"100\" would have little to no special meaning to warrant it's own fancy word.  And even something like \"preserves\", since there are a couple of meanings that could be associated with it (like the fruit spread, for example, which I feel the Alvedosans would have some form of), but that's more of an English foible than an actual \"literal\" translation so it also makes sense.\n\nWoah woah woah, Lore Alert:\n\n>in the Lagrange points between the earth and the sun. This preserve was built in el four,\n\nSo they're *orbiting* Earth!  -googles langrage points- oh wow, quite far away too...far enough that I suppose Earth would be roughly Mars-sized from our/their perspective so just a pale blue dot.  Has there been a reference to a blue star that I'm not recalling?  Actually, given the angle on this diagram I suppose its also possible that, for the most part, Earth would be hidden by the sunlight until the rotation flips it away.\n\nThe computer re-attempting to explain things is a nice touch, and it being wholly unable to explain things like \"gravitational field\" and \"EM-Plasmic\" is making me chuckle.  Much like trying to explain how wifi works to someone from the 1800's I assume, just eventually both parties need to stop trying and move on or progress will never be made.\n\nI love this part:\n\n>“And Alvedos creates that!” She does protect them!\r  \n\r  \n“In a manner of speaking, yes. But it is not a tree. It is a machine.\"\n\nIt's very much verging on the \"distinction without a difference\" vibe in a theistic vs atheistic discussion, where the same thing is being explained different ways and despite the important part being agreed on it's the difference that causes circular arguments.  \n\nThey're circling Earth...and its the *twin otters*!  Earth-and-Moon!? :D\n\n*El five!*  There's another disc out there!  If you were to spin this off into a sci-fi sequel where the Elfos and the Elfis meet I'd be SUPER interested in that interaction!  (Or heck, I might take this idea for Fanfic Week this year :D )\n\nBeautiful ending paragraph too.  I love the use of \"dropping\" to describe their movement around the disc and Lena's feelings.  *The All is Lost Moment*, her darkest hour.  But much like the rotation of the disc, things will come around and the sun will rise!\n\nRight?\n\nGood words!", "Hi Zach! Thanks for the feedback!\n\n> their culture also delineates\n\nYep, they basically have four categories: human, tree, animal, plant\n\n> Shallow, on the other hand, I feel like would have been translatable.\n\n\"Shallow\" as a metaphorical use for breath only dates to 1875, it appears. And while yes, they do have a word for \"shallow\", Elfo doesn't necessarily know it and/or doesn't think the metaphor applies to breathing.\n\n> orbiting Earth\n\nThey're orbiting the sun, but in a position always 60° ahead of Earth. That's more than high enough to be visible when the sun's below the horizon, but would always appear to be in the same place relative to the sun.\n\nI did actually work out the math on angular diameter of the earth, the moon, and the Earth-Moon system. It'd just be a bright star for them, though the earth and the moon would be visually distinct (oh hey go see what's said about the Dutiful Husband).\n\nI can talk to it more in a Discord chat because I've spent a _lot_ of time thinking through this :D\n\n> twin otters\n\nThat's just a constellation that from their perspective at this time of year the earth happens to be in. Poke me in Discord and I can send a screenshot of Celestia for this :P\n\n> another disc\n\nAs noted, there are five of them, actually, one at each Earth-Sun Lagrange point. Or at least, there _were_ at construction time.\n\nThough L5 wouldn't be visible from L4 mostly for visual magnitude reasons.\n\n> her darkest hour\n\n*looks at her plan*\n\nYes, Lena's darkest hour. Clearly. That's what this is. Nothing else coming up soon, nope, nada, not at all.", "<The Pretender>  \n\n\n[Chapter Index](https://www.reddit.com/user/Alex_gold123/comments/1bbm96p/the_pretender/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)\n\nChapter Four\n\nTolan stalked through the forest, all day, going in the direction of the capital of the Badia Kingdom - Badia city. He thought back to the stories he had heard of the castle that was in Badia city, where The Pretender himself resided. It was said to be impregnable and that it had never been conquered.\n\nHe relied mainly on the stories that was told to him about the castle and the city as he hadn't previously been very far away from the tiny village that he grew up in. The only person who even had gone far from the village, and thus the only person who could tell him the stories about far off places was Caban.\n\nHe wondered what the cranky old man would think of him leaving the village. Tolan thought that Caban wouldn't be upset at all if he left. The other people in the village might be upset but not Caban. He was always a strange man.\n\nHe remembered when he was very young always pleading with the old man to tell him stories about far off places. Caban would always grumble but eventually gave in. He told him about many tales in far off places in the world they were in. They were a lot of places that the old man had seen in his travels before settling in their little village. Tolan always dreamed of visiting these far-off places. He wanted to be well known and respected like the people in the old man's stories.\n\nHis parents always thought that it was just a delusion of his, that would go away soon. But the notion had persisted evolving soon until it created an obsession within him. He found the village constricting and yearned for a place with more people. But he hid these notions from his parents, his brother and the rest of the villagers. They wouldn't understand why anyone would want to leave the village. He didn't bother trying to explain himself to them. \n\nHe walked on, with a definite purpose, the sun giving out sweltering heat and trees all around him, a bow on his shoulder and a sword on his hip ready to face the world and what it would throw at him. His tall frame and black hair had lots of sweat but he took no notice, and didn't even think of slowing down.\n\nHe suddenly halted and put his hand on his hip. He thought he saw a movement amongst the undergrowth. His body tensed and his eyes narrowed, looking carefully for a sign of trouble.\n\n\"Looking for something?\" He heard someone say, he turned towards the voice and took a few steps back in fright. \n\nThere was a black snake on the ground just a few paces ahead of him. It was the color of midnight, its scales reflecting the sunlight as it stayed on the spot near him, it didn't come any nearer. Tolan realized with a start that it was the snake that had talked to him. \n\n\"What do you desire?\", it asked, curling up its body into a spiral heap. \n\n\"What are you?\", Tolan asked curious despite himself. \n\n\"I can grant any desire that you want to. What do you desire?\" The snake persisted in asking him that. \n\nTolan didn't think that he could get what he desired so easily. He felt pretty strongly that this was a trap of some kind. \"I'll just be going now. \" He didn't feel like fighting it. \n\nThe snake moved its head up and down which Tolan realized was its way of nodding. \"You don't trust me. That is understandable. Just note that when your desire for what you want becomes strong, I'll appear before you and ask you again. \" Tolan shivered as the snake slithered away, leaving him thankfully unharmed. \n\n\\--------------\n\nWC: 632 words", "Howdy Alex!\n\nYou can drop the comma in front of \"all day\", and \"City\" should be capitalized if its part of the name.\n\n>Tolan stalked through the forest, all day, going in the direction of the capital of the Badia Kingdom - Badia city.\n\nSince \"stories\" is plural, \"was\" should be \"were\":\n\n>He relied mainly on the stories that was told to him\n\nyou need a comma after \"places\" here:\n\n>The only person who even had gone far from the village, and thus the only person who could tell him the stories about far off places was Caban.\n\nYou start three paragraphs in a row with \"He <verbed>\"\n\n>He relied   \n>  \n>He wondered   \n>  \n>He remembered\n\nAnd several more thereafter.  Replace some of them with \"Tolan\"; don't be afraid to use his name about once per paragraph :)\n\nI like your description of Tolan's journey and thoughts through the forest.  They keep me really rooted in the character's perspective and the physical sensations of the journey.  But the ending is *really* what grips me; the snake (which I'm 99% sure is The Pretender) offering to basically grant whatever Tolan desires is a wonderfully biblical allegory for temptation, and the fact that the snake implies it'll be around is a great way to show that the temptation is always near.\n\nWonderful chapter Alex! \n\nGood words :D", "<Thosius>\n\n**Chasing**\n\nA pale sun rises over Torinia. It shines its light against the snow caps of the mountains, turning them to beacons from which one averts their eyes. All the worse for Berethian’s headache, as he sits amongst the gorse. The furs were just enough to warm him during the night, but his face stings from the chill. *Must be red as a cockerel’s comb.* Over the past few days, the journey has reached into the higher slopes, and with each ascent his chest heaves with the lack of air. He sees them in the distance, the domes of rock and ice laying in their path. Their presence causes his heart to pound.\n\nYet, they are not the main cause of his fear. Pellia’s warnings echo in his mind; he knows something must be done. But each time he looks at Baltathaius, it brings that image to his mind. The grin, the shaking, the staring; he was deranged. Though it was fleeting, Berethian saw the bloodlust in his leader’s eyes.\n\nHe glances to Pellia, who sits upon a rock, watching the land below. And then he turns his gaze to Baltathaius’s tent, an ostentatious blue pyramid he’d forced an inquisitor to carry.\n\n*I have no choice.*\n\nAs he clambers between the legs of his sleeping brethren, he becomes aware of someone walking parallel to him. He stiffens, arching his back like a scared cat. It takes all his resolve to see who it is.\n\nDelrethri notices him at the same time. “Morning.” He looks him up and down. “Why’re you so tense?”\n\n“Slept a bit rough, I think.” The lies come with surprising ease. “How was your night?”\n\n“I managed to find a soft patch. Are you going to see him too?”\n\n“Baltathaius?”\n\nDelrethri chuckles. “Well, yes, who else? Mind if we talk to him together? Might make our morning quicker.”\n\n“He’d not want to be bothered by both of us. He seems… agitated, don’t you think?”\n\n“No, he’s calmed down a lot since the fight. He won’t mind.”\n\n“Well… if you say so.”\n\n \n\nHe doesn’t even look up as they enter. Baltathaius’s attention is fixed on the war table before him, his palms planted firmly against the wood. Only a slight tilt of the head reveals his awareness of their presence. “Yes?” he asks.\n\n“We need to talk to you, sir,” Delrethri says.\n\nBloodshot eyes stare at them from a dark helmet. “Both of you?”\n\n“I’ll go first, for it is a matter of urgency. We’ve nearly run out of rations.”\n\n“Already?” he groans. “How?”\n\n“It seems there are mountain rodents inhabiting this area, and they got into our packs.”\n\n“Huh. Well, I’d say the solution is simple.”\n\n“It is, sir?”\n\n“Hunt and butcher the rodents. If there’s any salt left, we can preserve the meat.”\n\nDelrethri audibly gulps. “Yes, of course.”\n\nThe Head Inquisitor now turns to Berethian, who feels like a deer stared down by a wolf. “And you? What idiocy do you have to report?”\n\n“Well…” The words catch in his throat.\n\n“Go on, I don’t have all day.”\n\nHe knows Baltathaius’s stillness belies the fury beneath. *No choice.* “I believe that, with all due respect, sir… you need to ensure you are more… *level-headed*.”\n\nThere’s a loud bang as Baltathaius slams the table with his fist. Delrethri drops back from Berethian’s peripheral, while the Head Inquisitor points a wavering finger. “You believe so, do you, *Berethian?”* he barks. “You think I need to *calm down.* We’re in enemy territory, you stupid bastard! Calm Is the *last* thing--”\n\n“I… um…”\n\n“Look here; if you speak to me like that again, I’ll have you flogged! Teach you some fucking obedience!”\n\nDelrethri steps forward again, bringing himself to the fore. “He’s right, sir.”\n\nThe Head Inquisitors eyes bulge, his chin appearing beneath the helmet. Even his voice rises several octaves. “Excuse me?! He’s certainly not!”\n\n“No, sir, he is. During that fight, you got far too close to those creatures. And once or twice, your blades came almost within killing distance of an inquisitor. You are a danger to yourself and others. Think about what might happen, had things gone less in your favour.”\n\nThe silence is stifling. Berethian sweats despite the cool air, watching Baltathaius freeze in place like a figure in a fresco. A furious, old-fashioned villain, about to unleash a tirade against his men. But eventually, his muscles relax, and he looks to the ground.\n\n“You don’t understand; neither of you do.”\n\nDelrethri approaches the table, bending until he is level with their leader. “So explain. It may help if we know.”\n\n“I was *there* when Ikral first attacked in Thiras,” Baltathaius says, breathing heavily. “It was a bloodbath, and I was a young inquisitor in the aftermath of it all. So many people dead. Hadn’t seen anything like it.\n\n“We chased him all around the country, but when he made his home in that tower, we couldn’t reach him. He had so many followers in the surrounding forts, it was impossible. Until we recruited more, and involved the army in our attack. We took down each of his outposts, assassinating his generals, before we found our way to him.\n\n“That grin, that dreadful smile as he was decapitated. I’ll never forget it. So to have heard that his general of Fort Hathanian lived, and was continuing his work; my search for  Perithus consumed my very being.” He leans forward, scrunching up the map in his tightening grip. “I *must* kill him.”\n\nDelrethri bends lower, until he is mere inches away. “Of course, sir. But we won’t get to him if you can’t keep your anger in check. Please, do it, for your sake and for ours.”\n\nThe Head Inquisitor nods slowly. “Fine,” he says, trembling. “I’ll try.”\n\nBerethian glances between the two men. He sees before him two comrades, not a general and his soldier. They shake hands, and in spite of his gladness, Berethian cannot help but feel the anxiety building inside him.\n\n---------------------------------------------------------------------------------------------------------------------------------\n\nContext:\n\nThe tower and Fort Hathanian appear in the first chapter, [Nightmares](https://www.reddit.com/r/shortstories/comments/15jxgr7/comment/jvg8ui0/?utm_source=reddit&utm_medium=web2x&context=3). Ikral is also first mentioned in this chapter.\n\n---------------------------------------------------------------------------------------------------------------------------------\n\nWC: 1000\n\nBonus words: obedience, ostentatious, old-fashioned.\n\nCrit and feedback are welcome.\n\n[Chapter Index](https://www.reddit.com/r/StickiesStories/comments/16ilkx0/thosius_chapter_index/)", "Howdy Max!\n\nBack to the mountains we go!  Just after you tease me with treachery, betrayal, and subterfuge you shift the focus back to Berethian and, by extension, Baltathaius; the poster boy for such themes :P\n\nI love the term \"pale sun\", it makes me think of a distant, small sunrise, like in midwinter.  Just something cold and unhelpful.  No clouds to diffuse the light, no colorful landscape to enjoy it; just bleak and grey.  \n\nI love the conflict Berethian is feeling:\n\n>Pellia’s warnings echo in his mind; he knows something must be done.\n\nAnd I wonder how much of this is *truly* Baltathaius's madness or Berethian being manipulated.  It's clear Bally manipulates him one way - as he does just about everyone, though there's some potential sinister dark magic involved - but it's not clear if Pellia is worthy of trust or worthy of being absolved of potential manipulation as well.  This *is* all from Bere's point of view, after all.  If you're messing with our perspective *through* him you're being devilishly clever about it.  Supporting evidence for this fringe theory:\n\n>“He’d not want to be bothered by both of us. He seems… agitated, don’t you think?”\r  \n\r  \n“No, he’s calmed down a lot since the fight. He won’t mind.”\n\nI wonder what Bere would have done had Del not shown up as well.  Assassination?  Firm discussion?  Mutiny-but-keep-Balathaius-alive-like-a-fool?  I wonder if it would have worked.  So many possibilities!\n\nBleh, Bally wants them to eat rats.  I mean it's been done in the past and I know it's a good way to ensure survival but...bleh.   Hopefully that's enough reason for Del to support Bere in the upcoming coup :P\n\nOh hey, Big D does step up and support Bere in at least the idea that Bally needs to calm down.  That's a good sign.  Maybe Delrethri is just hiding his own misgivings because he believes Berethian is an ardent supporter?  I wonder how many inquisitors are just loyal out of fear of other inquisitors?  I wonder how many will turn when- and here I go insisting there's gonna be an uprising.\n\nYou sly dog, you have me monologuing :P\n\nI like how you have Baltathaius's increasing distress cause his sentences to shorten and become partially fragmented:\n\n>“It was a bloodbath, and I was a young inquisitor in the aftermath of it all. So many people dead. Hadn’t seen anything like it.\n\nI can read this line as emotionally supportive and/or subtly threatening depending on where Delrethri puts his emphasis; for \"your\" sake, or for \"ours\"\n\n>But we won’t get to him if you can’t keep your anger in check. Please, do it, for your sake and for ours.\n\nAgain, from Berethian's perspective, it seems that Baltathaius is going to have support when Bere tries to mutiny.  That makes Del a potential threat, *from Bere's perspective*.  I can't wait to see how this all shakes out :D\n\nGood words!", "Thank you very much Zach :)", "# <HOME OPENER>\n\n**Chapter 24**\n\n**FRIDAY**\n\nThe country music was loud, the beer was cold and the dance floor was packed. That’s all the Rainbow Warriors football team needed the night before the big game. Team building, they called it. The rafters of Bo’s Bar and Grill were unfinished, decorated with banners promoting Ninth Island Rivalry. The bar was lined with taps, and bottles of liquor sat on shelves going straight to the ceiling. Large flatscreens played highlights from ESPN.\n\nOnly true fans and hangers on knew where the Warriors would be: out in a grungy dive bar in the middle of nowhere. Girls hoping to hook up with some of the players gathered at a nearby table as linebackers did shots of Jagermeister for good luck. Male fans of the players huddled at another table, hoping they could hook up with any of the girls who couldn’t grab the attention of their favorite player.\n\nJesse Pratt sipped a light beer from the bottle and huddled at a table with his wide receivers, running backs and tight ends.\n\nHe tapped his foot to Last Night by Morgan Wallen. “How many scouts do you think will be watching tomorrow?” Jesse said.\n\n“Are you kidding? Everyone’s watching tomorrow,” said Lance, one of his receivers.\n\nJesse nodded. “I mean, all of us want to go pro, right?”\n\nRyder, his tight end, grabbed Jesse’s arm. “Bro, you need to lighten up. This is the first game of the season. Focus on winning tomorrow and everything will fall into place. That’s why we come out to party the night before. We gotta get you out of here.” Ryder tapped Jesse on the head. “So you can get into here!” He slapped him on the chest. Ryder lifted Jesse’s bottle to his lips for him with a single finger. “Drink!” he shouted.\n\nThe group began to chant: “Chug! Chug! Chug! Chug!”\n\nJesse smirked and tilted the bottle back, draining it. “All right!” He yelled. “Round of shots!”\n\n\\###\n\nThe boys eventually made their way into the throng of sweaty, undulating bodies on the dance floor. Girls were practically lining up to have a chance with Jesse who was successfully sloshed after three rounds of tequilas. “We gotta play tomorrow,” he told himself, “take it easy.”\n\nThen he saw her. The angel on the sidelines. A blonde, blue-eyed hottie in a cute halter. Amazing legs. She was just… staring. He decided it was time to take a breather anyway. Jesse pulled a random dancefloor girl off his shoulders and negotiated his way out of the crowd. Pouting girls looked around for the second-best football player to grind with.\n\nThe blonde girl with blue eyes just stared, a slight smile playing on her lips. Jesse smiled back.\n\n\\###\n\nBefore he knew it, they were making out behind Bo’s. In fact, she was the one who had pushed him up against the dumpster before passionately mashing her mouth on his. Her perfume was intoxicating. *She* was intoxicating. He began taking off his jean jacket.\n\nWordlessly, she grabbed him by the shirt and led him into the cornfield that backed the bar. His athletic sure-footedness was momentarily forgotten as he tripped to follow, leaving his jean jacket in the dust.\n\nShe pulled him in for another kiss.\n\n“Are we gonna do this here?” He gasped, coming up for air, his lips smeared with red.\n\nThe girl nodded and led him by the hand further into the tall, dark foliage. The country music faded into the distance with only thumping bass and occasional howls of the raucous crowd.\n\nThey continued to kiss, and Jesse went to untie her halter. That’s when she held up a finger of denial and offered her entrancing smile again.\n\n“What? You’re backing out on me now?” he said.\n\nShe took a confident step forward.\n\n“What are you doing?” Surprised, he stumbled backward. Then, in a split second, Jesse Pratt disappeared.\n\n\\###\n\nDonna leaned over the hole. Jesse lay in the dirt on the bottom, moaning and clutching his ankle. It had been at least a ten-foot fall.\n\n“I think it’s broken! Call the guys. Gotta freeze it up before the game tomorrow,” he gasped.\n\nDonna began placing palm fronds over the top of the hole.\n\n“What the hell are you doing? Go get help, you dumb bitch!”\n\nJesse watched, wide eyed as the slivers of moonlight became fewer and smaller as Donna covered his portal to the rest of the world.\n\n“Help!” Jesse yelled, his voice now muffled in darkness.\n\nUp top, all was peaceful. The party at Bo’s was peaking, and there was nothing but a scattering of palm fronds on the ground in the middle of a cornfield. Nothing to indicate the University of Hawaii’s star quarterback was lying helplessly in a ten-foot pitfall trap in the middle of nowhere.\n\nDonna strolled back to the bar, picked up Jesse’s jean jacket by the dumpster and shrugged into it. Comfy. She made her way to the gravel parking lot, started her car and headed back into town.", "Heya Maxibillion!\n\nFriday evening is here and it's time to party!  (I say on a Monday, xD)\n\nI've been to honkytonks like Bo's before.  Lively places.  Definitely not my jam, haha.  But I'm glad the people are having a good time getting hyped for the HOME OPENER!  Nothing like doing jagerbombs for a good night's sleep before a big game.  And I can't *not* think about the innuendos of wide receivers and tight ends xD\n\nFor this line, if he's talking to himself I think italics would be better suited since it's an internal dialogue rather than something he's saying to someone else:\n\n>“We gotta play tomorrow,” he told himself, “take it easy.”\n\nBlondie with blue eyes just staring at him?  The star player?  The star player people are betting on not showing up?  Your foreboding comment from last week?\n\n:fear\\_emoji:\n\nThings heating up in that cornfield, just add some butter and you've got popcorn!  Also maybe some other things.\n\nAha so it \\*was\\* Donna!  Damn, a ten foot drop?  Good thing he didn't break his neck :O  I wonder if there was a backup plan for that.  Then again, I guess corpses are quiet and he wouldn't be found until harvest season.  \\*shudder\\*\n\nWhelp I suppose there's not many worries about security cameras in a small town like this so Donna's probably safe having parked in the parking lot.  And come dawn she'll be back to her black hair and Hot Topic apparel and won't resemble the blonde girl everyone last saw Jesse with. \n\nI wonder how long it'll take people to find him?\n\nGood words!", ">For this line, if he's talking to himself I think italics would be better suited since it's an internal dialogue rather than something he's saying to someone else\n\nThanks, yes, I originally had italics but was too lazy to format it properly.\n\n&#x200B;\n\n>I wonder how long it'll take people to find him?\n\nJeeze, yeah, I hope someone has a reason to go out to that cornfield anytime soon...", "I hope his rescue party doesn't accidentally fall into the pit with him since its covered in fronds xD", "<The Beginning of The Demon Life>\n\nChapter 77\n\n[Chapter Index](https://www.reddit.com/r/HaruSohma/comments/17iraud/serial_sunday_the_beginning_of_the_demon_life/)\n\n\\-----------------------------------------------------------------------------------------------------------------------------------------\n\nAlex takes a couple steps back, staring down at the now pathetic losing demon. Blood spreads across the floor, as a wimping Edom cries at his defeat. But Alex feels nothing. Even upon knowing he has won, he doesn’t once feel any pity. He is like a robot.\r  \n\r  \nAn echoing step perks Alex’s ears, but he notices Edom's body tensing up in particular. Glancing over, he can see Fye draw out his dual-blade, both of them aiming towards Edom. His eyes seem to lighten up a bit, but Alex can’t tell if it is joy. \r  \n\r  \nFye passes by the winning demon, still keeping his gaze on Edom. \r  \n\r  \n“I-I’m one of the commanders of the Demon King! You know what happens if you lay a finger on me!” \r  \n\r  \nAlex takes more steps back, watching death being carried in play. He sees Fye’s sword glowing black, as his heavy footsteps become louder. \r  \n\r  \n“I-I’ll make sure that this kingdom…We will make sure this kingdom burns down!” \r  \n\r  \n*Step…Step…*\r  \n\r  \n“Stop, I order you! And you dare…” \r  \n\r  \n*Step.*\r  \n\r  \n“You…you little human freak!” \r  \n\r  \nEverything around Alex seems to slow down. All he can see is Edom, a charging demon who feels betrayed by his lord, letting out his anger on a broken human. \r  \n\r  \nFye thrusts forward, aiming towards Edom’s neck. It successfully lands, the head falling from its flesh. Black sparks spread around the head, until it crumbles to ash. The same routine repeats throughout his arms, legs, and stomach within a second. \r  \n\r  \nAlex stares in horror, his adrenaline now pumping throughout his system. Edom is no more. \r  \n\r  \n*If I would’ve lost…*\r  \n\r  \nHe stares at the killer. Nothing but silence echoes the building. His feet are glued to the floor, he doesn't know if he should run or fight. \r  \n\r  \n“You.” Fye begins. “You are not a weak demon, you didn’t fail to impress me.” \r  \n\r  \nAlex points his blade towards Fye, his instincts now taking control. \r  \n\r  \n“As the victor, you’ve honored my respect.” \r  \n\r  \nFye turns to him, still keeping that stoic expression. “So, I shall allow you to leave this place alive.” He turns back towards the door, opening it. Without a second thought, Alex quickly runs out of the building. \r  \n—\r  \n\r  \nThe rain cleans the blood and sweat Alex's body, trying to erase the sin he just committed. He actually got someone killed. Not by his own hands, but he was part of the reason why. \r  \n\r  \nThe world begins spinning, his twisted stomach and tense body worsening the sensation. He falls to the ground, trying to swallow back the vomit. \r  \n\r  \n*Pull it together, Alex. He deserved it.* \r  \n\r  \nThat voice. The same voice he heard during Sloth, his own guilty conscience.\r  \n\r  \n“You…I remember you now. You’re the reason why I’m like this! The reason why I did all of those crimes!” \r  \n\r  \n*No. You’re the reason that did all these crimes. I’m just the conscience you desperately push away.* \r  \n\r  \nAlex grits his teeth, his head banging against his skull. The more he talks to…himself, the more it brings these uncomfortable feelings. He stands, continuing to walk through the ground outside the castle. \r  \n\r  \nThe soft sand makes him think of his first fight with Fye, the one fight that almost got him killed. And he easily killed Edom within a single swing. All because he lost a duel. \r  \n\r  \nHis stomach twists again, he kneels down to the ground, coughing violently. \r  \n\r  \n*You’re fucking pathetic! He was messing with you, and you still feel guilty?!*\r  \n\r  \nAlex shakes his head, trying to ignore the voices. \r  \n\r  \n*I know you can hear me, Alex Oswald! Are you going to push me away again? You can’t hide from your past forever!*\r  \n\r  \nThe voice becomes so loud that he can’t hear the rain. \r  \n\r  \n*You want to know your real self, huh? Then why don’t you just accept me? We can cause fear in this hell, even without that stupid king!* \r  \n\r  \n“Why…are you so obsessed with fear?” Alex's voice weakens. \r  \n\r  \n*Fear is something we all have. It is a thing that puts people in their place. You saw it with Edom. We had to put that fucker down.* \r  \n\r  \n“YOU killed him!” \r  \n\r  \n*WE killed him!* \r  \n\r  \n“No!” The floor become blurry, as tears mix with the rain. Alex lets out a weak whimper, covering his ears. He doesn’t want to hear himself any longer. \r  \n\r  \n*You're going to shove me back, huh? You can’t run forever, Alex. Sooner or later, you need me. You said it yourself to Clear, you want to remember.*\r  \n\r  \nAlex stands up, wiping his mouth. He continues walking, ignoring the barking inside of his head. Eventually, the noise stops, and Alex can hear the rain again. The calming sound of water hitting sand and bricks gives him a temporary respite. \r  \n\r  \nEven though he was the reason Edom is dead, the Demon King’s plans fail. At least when it came to killing him. But, he still has Fye as his pawn, and he could make him go on a killing spree as he wishes. \r  \n\r  \n“I need to go back to Evan. I have to tell him everything.” he tells himself, hoping the voice doesn’t respond. And indeed, it stays silent. \r  \n\r  \n“Fear…did I really use fear back then?” \r  \n\r  \nNow that he thinks of it, he remembers Issac feeling scared because of him. Did Alex use Issac’s fear so he wouldn’t be able to save his family? Is this why Issac even pretends everything is okay? Is this why he even forgave him? Out of pity? Or fear? \r  \n\r  \n*Step step step..*\r  \n\r  \n“Alex!” \r  \n\r  \nA familiar deep voice makes Alex feel relief. He sees Evan, staring at him with his brown eyes, full of concern. He notices a black haired demon beside him, holding Evan’s hand. \r  \n\r  \n*Is that…Mark?* \r  \n\r  \nA bunch of soldiers surround the two like guards. And right in front of all of them stands a blonde-haired woman. Her gaze filled with guilt and anger. \r  \n\r  \n“Alex Oswald.”\r  \n\\-----------------------------------------------------------------------------------------------------------------------------------------  \nWPC: 975", "# I Am What You Eat\n\n[Chapter Index](https://www.reddit.com/user/Nate-Clone/comments/1bcb2t0/i_am_what_you_eat/)\n\n**Chapter 5 - Big Mi-Steak**\n\nThe Syrup Swamp was found on the far edges of Scrump, just about the farthest place from Zubber territory as you could be - a perfect place for the Pekfest Nest, no doubt.\n\nNow, all Alfred had to do was wait for his men to find it.\n\nThe sizzits sizzled and the butterbees buzzed as he munched on one of the swamp's famous edible leaves. It had a spongy texture and a sugary kick.\n\nHe gagged and spat it out. Disgusting.\n\n\"I thought you said no one came out here, Cheeney!\"\n\nAlfred heard Wrind's hissing voice nearby. Shame. He was enjoying the peace and quiet.\n\nHe found the steak's eyes red and almost swollen shut on the base of a cliff, one hand clenching a wound on his chest. Cheeney lay next to him, unresponsive.\n\n\"And just what happened to *him*?\" Alfred's nasally yet low voice demanded.\n\nRind gasped and rubbed his eyes, one of them just barely opening to eye him.\n\n\"O-Oh!\" Wrind stood up. \"Alf. We…hit a bit of a snag.\"\n\nHe looked up at the clifftop far above them.\n\n\"Did you find the beast?\" He put his hands behind his back.\n\nRind's other eye opened. \"Yeah, yeah. All trapped and muzzled.\" He sighed. \"Now, could you give a steak a hand? I'm bleeding here!\"\n\nAlfred wiped the cheese leaking from his broccoli hair away, approaching Cheeney. He pinched the longer, more durable string of noodles at his core.\n\nNo pulse.\n\nHis face darkened.\n\n\"No time. Walk it off.\" Alfred told Wrind, grunting as he lifted Cheeney's body over his shoulders. \"We need to bury him. Don't want anyone seeing a Zubber here. Even a dead one.\"\n\nRind's eyes shot open. \"He's dead?!\"\n\nAlfred solemnly nodded. He had only known Cheeney for the past week-long journey from Barbos to here, but he was a good man. He had a high rank, a good sense of humor, and even a loving wife back home. He was also negotiable and always tried to treat him and Wrind with respect, even sharing each of his hunts with the two of them throughout the journey.\n\nIt was rare to meet another bunch of noodles with such close relations to the Don, but he was happy at least one of them wasn't slaving away in the factories.\n\nHe'd have to bury him well. Maybe make a makeshift tombstone. He'd miss him very-\n\n\"Serves the stringy boy right.\" Wrind chuckled. \"Noodles don't belong in the cartel.\"\n\n*Of course.*\n\nAlfred stepped closer, his gritted teeth holding back his rage like the pretzel sticks of a jail cell.\n\n\"Say that again.\"\n\nRind stared at Alfred's green eyes and penne skin, before a sizzling snicker erupted from his gut, his wound leaking out purge. He easily shoved Alfred to the ground, landing on Cheeney's chest.\n\n\"Man, look at you!\" Wrind clenched his wound once again. \"Buncha noodles acting all tough. I'm almost impressed.\"\n\nAlfred quickly stood back up. \"The Don will be hearing about your behavior tonight.\"\n\n\"Yeah, go tattle on me to the boss. Because he'll trust a bunch of angsty teenage noodles over a *steak*.\"\n\n\"That bunch of angsty teenage noodles is Welo's *son*, Wrind.\"\n\nHe got in Alfred's face. \"Lemme tell you something. Up there? There was a weird pink thing. It didn't look like anyone the Don said we'd see out here.\"\n\nHe briefly released his hand from his wound. Alfred winced as he was forced to eye it.\n\n\"He had a blade. It did *this* to me.\" Wrind snarled. \"Do you think you or Cheeney could still stand if you got hit like I did?\"\n\nAlfred knew the answer, but he would never admit it.\n\nWrind leaned in, his mouth almost touching Alfred's ear. He could feel purge spitting into it as he spoke.\n\n\"No. Because you're *noodles*. And I'm *steak*.\"\n\nHe shoved Alfred away.\n\n\"Now, get back to camp and find me something to bandage this up,\" Wrind grunted, his wound growing more severe. \"And don't waste your time with Cheeney, alright?\"\n\nAlfred shouldn't have offered to join this mission. He thought it would send a message to his father and the rest of the cartel - noodles can do anything that steaks can. But, of course, Welo had to make a steak come along with them. And he did his job perfectly; that was the worst part.\n\n“CAWK-CAH-CAAAH-COO!”\n\nOr…maybe he didn't.\n\nAlfred turned back at Wrind, crossing his arms as he stared at the steak's horrified expression.\n\n\"'All trapped and muzzled,' huh?\"\n\n\"Alf, I swear, we trapped the beast. It wasn't making a sound.\"\n\nAlfred grabbed his wrist, stopping him from clenching his wound.\n\n\"Oh, '*we* trapped it'?\" Alfred repeated. \"Tell me, Wrind, what did we make that muzzle out of?\"\n\n\"What…\"\n\n\"What did we make the muzzle out of?!\" His grip tightened.\n\n\"N-noodles! It was made of noodles!\"\n\nAlfred smirked. This was fun.\n\n\"Right. You could never muzzle a beast like that without Cheeney's help.\"\n\nAlfred pushed Wrind against the cliff's wall. \"And I bet you didn't even help him in there.\" His voice rose. \"He's just noodles, right? His life doesn't matter to you, right?!\"\n\nHe could see the sudden guilt on Wrind's face - He knew the answer, but he would never admit it.\n\n\"I'll… I'll fix it!\" Wrind squeaked out as he squirmed.\n\n\"No, you won't. I will.\" Alfred pushed Wrind to the ground. \"I'll show you what noodles can do.\"\n\nHe looked over his shoulder as he walked away. Wrind looked like he had little strength left in him—or life, for that matter.\n\nHe grabbed Cheeney's body and propped it over his shoulders once again, not saying a word.\n\nWC: 942/1000\n\n**Notes:**\n\n* **Theme - Obsession:** Alfred's goal in all of this is for noodles to be seen as equals to steaks, not as inferior, but he goes a bit too far when trying to reach it.\n* Bonus words used: N/A", "Heya Nate!\n\nI need to think of a greeting pun for your name, but the only word that comes to mind that rhymes with 'Nate' is 'Hate' xD  Which I do *not* do, for the record.\n\nSpeaking of puns, the title!  Love it :D  Without reading further it could have been \"Me-Steak\" to imply that our main character makes a mistake, but I should probably read the rest of the chapter before making such judgment calls.  Still, delightful :D\n\nOh hey, a new point of view!  I'm glad I wrote up a whole paragraph about how Basil would know anything about where the swamp was and that it'd be better for us to learn along with him xD  That's what I get for typing up crit *as* I read instead of checking the very next line to make sure it wasn't some new person's pov.\n\nEnter, Alfred.  And I'm suspecting he's *not* Batman's butler.\n\nThese can be combined into one paragraph: \n\n>Alfred heard Wrind's hissing voice nearby. Shame. He was enjoying the peace and quiet.\r  \n\r  \nHe found the steak's eyes red and almost swollen shut on the base of a cliff,\n\nVery interesting design choice!  I like the idea of cheese being used by broccoli as like...some sort of styling gel.  I think the wording could be cleaned up a little maybe?  Perhaps, \"The broccoli man wiped the cheese leaking from his florets away,\"\n\n>Alfred wiped the cheese leaking from his broccoli hair away,\n\nI like the way Alfred isn't necessarily the one in charge, but the dead noodles are.  Or, were.  The respectful tone of those lines is very clear, though I do want to point out that his need to hide the body because of the secrecy of the mission clashes with the desire to erect a tombstone.\n\nSmall typo; \"Rind\" should be \"Wrind\"\n\n>Rind stared at Alfred's green eyes\n\nOh okay, so Alfred is also a pasta.  He's pasta *and* broccoli, my bad.  That might be important to clear up earlier in the chapter as I was under the assumption that he was just broccoli, as everything we've encountered has largely been a singular food so far.  Alfred's the most complex we've encountered at this point, which works out because he's also coming across as the most complex character except maybe for Develyn, who is also more than just a simple egg.\n\nOH! -facepalm- Alfred***o*** I get it now\n\nPersonal preference + flow suggestion, but I think if you put the part with Wrind moving his hand and showing the wound between the lines of dialogue, replacing \"Wrind snarled\" it would have more impact:\n\n>He briefly released his hand from his wound. Alfred winced as he was forced to eye it.\r  \n\r  \n\"He had a blade. It did this to me.\" Wrind snarled\n\nThe back and forth of the power dynamic between Alfred and Wrind is quite fascinating . The conversation flows between who's in charge and who's not very well and the way it moves from one to the other and back feels real natural.  Very well done :D\n\nGood words!", "Hey Zack! Glad you liked this one! Took a bit of a darker direction than I initially thought it my notes, But I ran with it!\n\nI'm glad someone got the Alfred pun this early on, heh, If you didn't get it by the way, Wrind, as in pork rinds (Yes, I know it's a steak, I didn't think that through), and Fet-a-Cheeney.\n\nThere's also one more name dropped in this chapter, but I'm going to challenge you to figure out that pun yourself, I'm rather proud of it XD.\n\nI'll take your notes into account! Thanks!", "<Children of the Frontier>  \n\n\n**Chapter 8:** Scrapbook Entry I — Approach\n\n—\n\nA screaming comes across the sky.\n\nIt is imperceptibly quiet in this vacuum between planets. Its power, masked, save for the brilliant blaze of its thrusters. Two hours departed from Lunochka, on the high-priority lane towards system’s end, the quad-engined vessel leaves behind a comet’s tail as it shoots towards the Warp Ring. From the passenger cabin’s windows one can see the gas trails shooting out, converging, and then bowing back, pushed back and along the ship’s vector by the solar wind.\n\nIt makes for a mesmerizing, almost ethereal sight. Have you ever seen a comet fly outward, away from the Sun?\n\nThis is the first thing that enters Lark’s travel scrapbook. Gel ink marks the upper left corner of the book’s first page, tracing out the observed path of the ionized gas. A welcome entry to christen the coming of a new era. Of course, not without a few imaginaries. Lark’s hand stops for a minute as they ponder over the shape of the arc at its very end. Just a smooth bowing? Some vortex behavior? Lark looks towards the engine’s direction—straight at the cabin compartment’s backdoor, thinking of fluid dynamics. It’s a shame they can’t just poke their head out the glass and look rearward.\n\nImagination. Lark envisions a little spike piercing through the center of that grand trail, like the tip of an umbrella’s shaft. A little reminder of the arrogance that is spaceflight.\n\nTheir hands stop moving. The sketch of the space trail is finished—an enchanting object in its own right, companion to an as-yet undrawn spacecraft.\n\nLark puts the pen away. It’s nice to leave some things on their own.\n\nInterspersed between the sounds of engine roar and the ship’s reverberating hull lies the never-ending sound of conversation. And, dear Mother. Some of these people are chatterboxes. Even though Lark is positioned by the front of the cabin, at the first row, they can still hear just about everything.\n\nIt’s overwhelming. Sensory-wise. Everything.\n\n“Hey there,” comes a voice from behind. Lark turns around to see a boy leaning over the vacant seat next to them. His hair, short and scruffy and curly and black, his skin a warm darker brown, a tad bit reddish. Like clay? His smile is toothy. “Thought I’d say hello to all the people on the ship.”\n\n“Hi.” A nod, and Lark looks away.\n\nThey pick up the pen and start drawing squares on the sheet.\n\nThe boy doesn’t leave. Lark can hear his shuffling behind them, that coarse sound of material on material, these old-fashioned leather seats so *uncomfortably* loud when shifting at all.\n\n“Name’s Jabari.” Another question: “You? Pronouns, anything? I can see you’re an artist. School of Art, maybe?”\n\nLark’s reply is a short “Hm,” and nothing else. On paper: four black squares of varying sizes, filled in, grating and unsettling and ostentatious and *sharp*, like this boy who won’t leave. Abstract unpleasantness given form. They begin to draw yet another box.\n\n“An artist, but not much of a talker, eh?” Jabari chuckles, unseen. “Right. I’ll leave you to it.”\n\nTheir grip on their pen loosens a tiny bit. He’s leaving—\n\n*“Fuckin’ silver.”* Under his breath. There it is.\n\nLark’s eyes glaze over their skin. Pale white, cool. The subtle zebra-like tones of blue striping across their arms. Congenital argyria.\n\nPeople care too much about where they’re from. It’s unpleasant. They’re out, but somehow not out yet, and yet everyone’s got two cents in their pocket about \"silvers\" they need to share. It’s always that. Like the checkpoint. Dear Mother, that checkpoint. It’s like Amrita is a backpack, unwelcome, strapped ever tight.\n\nLark glances back towards the window. Anything to distract them. They’re tired enough as is.\n\nThe constellations come into view.\n\nThe stars are so nice out here.\n\nSo bright.\n\nA new page.\n\nLark picks up the pen and draws the two constellations they can see. *Yueguang*—moonlight—stands proud in front of them, a ranger at the ready. *Bintang*—star—to its side, nocked on the moon’s longbow. Poetic. Even here, voyaging in space, their favorite constellations still keep watch on them.\n\nThe Ranger True was a voyager too, didn’t you know?\n\nThe blank page fills with details of translucent skin and clothing, superimposed on top of the sixteen-star pattern. A little heat erasure for clean-up for the resulting drawing—elegant, proud. A worthy centerpiece. The Ranger True’s smile comforts their heart, as if to say, *never mind these buggers. You are here for yourself.*\n\nThat’s right. Lark is here for themself. Despite what everyone has to say.\n\nThe purpose instills a renewed sense of calm onto their spirit.\n\nThe hours pass. Much of the chatter behind them passes by into idle conversation. The pages continue to fill with the little sights in the ship, constructed images of overheard conversations, patterns to hold emotion. Even in this little macrocosm of the system there is a story to tell.\n\nSomeone approaches Lark’s empty seat again. Politely, this time. “Excuse me? Can I take this seat?”\n\nLark nods. The person puts their bag down in front of them and pulls out a journal bound in some heavy cloth. It looks expensive. Their writing inside fills up entire pages—neat, short little pudgy letters, so consistent you could call it a typeface. And yet it’s only the first few pages.\n\nThe person notices Lark’s eyes glancing over.\n\n“Shit. Sorry.”\n\n“No worries.” A little snicker. “The window up here is larger,” they explain, looking towards the glass viewport. “I wanted to write about the stars.”\n\n“Mmhm,” Lark nods. Then, to make sure: “Sorry, again.”\n\nThe person doesn’t respond other than to shoot a warm smile. Their eyes turn back to their paper and, after a pause, they begin writing again.\n\nThe two write and draw in parallel.\n\n“Nala, by the way,” says the person, minutes later. “She, from Nu-Santara.”\n\nLark ponders for a moment. “Lark. They.” Exclude the planet.\n\n“Nice to meet you, Lark,” comes the reply.\n\n“Likewise.”\n\nThey return to their work, ever silent.\n\n—\n\n< WC: 1000 >\n\n< [7: Security Theater](https://www.reddit.com/r/shortstories/comments/1bbimpw/comment/kv4gnia/?utm_source=share&utm_medium=web2x&context=3) | [Index](https://www.reddit.com/r/Luminesce/comments/196yqyc/children_of_the_frontier_chapter_index/) | 9: . . . >\n\n< Bonus words: *old-fashioned, ostentatious* \\>", "<Out of Kindness>\n\n##Chapter 5: Cloying Pink Obsession\n\nA knock came on the door, the ostentatious and old-fashioned gate to my prison. The stern tapping of the one and only.\n\n\"You may enter.\"\n\n\"Sister.\" Cyprus stood in the doorway, her face a stern mask, but it was weak. Beneath, I could sense her worry, anger, and disappointment. \"What were you thinking?\"\n\nI laughed, a laugh that failed to hide the bitterness and anger that bubbled up from my chest.\n\"What was I supposed to do, Cyprus? Let your precious friend abuse her familiar? To let her kill her again and again, without consequence?\" An accusing finger shot up. \"You allow far too much, sister. You allow far too much.\"\n\n\"I didn't know.\" Whispered, barely audible.\n\n\"And does that excuse it?\" I stood, the chair skittering against the floor. \"Does that absolve you, oh dearest sister?\"\n\n\"No.\" She looked down, her fists clenched.\n\n\"You, who are so powerful yet so powerless. The vampire lord of the mansion who bends fate to her whims. Yet still, she can't see the sins of her beloved friends directly under her nose. Yet still, after three hundred years, she cannot bring herself to free her dearest sister, whom she claims to love. Tell me, what *use* is all your power?\"\n\n\"Enough!\" Cyprus shouted, her voice wavering.\n\n\"I am not one of your subordinates, sister,\" I retorted, my anger boiling over into hot streams down my cheeks. \"You will not have my obedience. I am not Maribell, who is a coward. I am not Lillias, who owes you everything. I am not Kalli, who is naive. I am not Meihua, who does not care. I am Haema. I have seen the night sky and tasted its freedom. I am not your toy, your puppet. \n\n\"I am Seven, I am Four, I am One. But what do these titles mean before the infinite expanse of the stars above which you have taken from my grasp?\"\n\nThe room was quiet, save for my harsh breaths and Cyprus's sniffles.\n\n\"I-I'm sorry, Haema,\" she muttered, her voice shaking.\n\n\"Then let me go, Cyprus. Let me go and never come back.\"\n\nHer head jerked up, her eyes wide. \"No, I can't! If they found out... No, no, no, I can't. Not after I've worked so hard, for three hundred years. I can't, I can't.\"\n\nThe opening did not slip past me, even as distraught as I was. \"Worked so hard for what, exactly? To protect me? Or to protect yourself?\"\n\n\"You,\" she breathed, without a single mote of hesitation. \"Of course, you. I did this out of kindness, Haema. Out of love. To save you.\"\n\nAnd she really, truly believed it. The stains of dishonesty did not mar her soul or taint her words.\n\n\"Oh, Cyprus.\" My shoulders slumped. The anger, the rage, the bitterness all had faded. All that was left was a deep sadness. \"You are such a fool.\"\n\n\"Then so be it. I will be a fool, I will be a tyrant, I will be whatever it takes to protect you. Because you are my sister, and I love you.\" Her hand clutched over her heart, her ruby eyes boring into mine. \"Because, despite it all, you are the most precious person in my life.\"\n\n\"How sweet,\" I replied, an edge returning to my voice. \"Yet what are sweet, honeyed words before the reality of my eternal torment? I would have preferred cruelty, sister. Because this kindness of yours, this love, it is an unending curse, one that I cannot bear.\"\n\nCyprus opened her mouth, then closed it. \"What are you asking of me, sister?\"\n\nI sighed, rubbing my eyes. \"Let me go, Cyprus. Let me go free from your grasp.\"\n\n\"No,\" she repeated, her voice cracking. \"Not when we're so close.\"\n\n\"Close to what?\" I snapped. \"To the day where the humans forget our names and faces and we can roam freely? What are we waiting for, Cyprus?\"\n\n\"...You are sharp, dear sister.\" Her expression grew dark, her eyes narrowing. \"Yes. We are waiting. Three hundred years, I have been waiting. Waiting for the day when the last human who remembered your sin, the final one who would hunt us down, dies of organic causes.\n\n\"In just a few decades, none will remember the devil who destroyed the village. They will not remember the seven-colored soul that could carve the earth and raze cities. You *will* see the night sky once more, Haema.\" As she spoke, determination flared up, lighting a fire within her.\n\n\"So I must trust in you, your words, your plan.\" My voice was dull, listless. I could not bring myself to care. She believed the words she spoke, yet that mattered naught before any real commitment.\n\n\"Yes.\" Her response was instantaneous, her resolve ironclad. Hands clutched by her side, she took one step, then another. Over the invisible line that separated our worlds, she walked. I could not conceal the surprise that flitted across my face.\n\nAnd there she stood before me, her eyes brimming with unshed tears. She took one last step, wrapping her arms around my neck, her cheek pressed against mine. I wanted to scream, to shove her away, to squeeze her back, to rip her heart from her chest. But instead, I stood still, frozen.\n\n\"I love you, Haema.\" Her voice was a whisper.\n\n\"I love you too, Cyprus.\" The words were out of my mouth before I could even think—the truth, the bitter-sweet tang of love that stained my heart.\n\nThe two of us stayed like that, our bodies pressed together, not quite warm yet still so familiar. It had been three hundred years, three centuries since we had shared a hug.\n\nBut it was not to last. The moment was broken as she let go, stepping back.\n\n\"Four decades at most,\" she murmured, the promise weighing heavy in the air.\n\nAnd then, she was gone.\n\n***\n\nWC: 979/1000  \nBonus Words: obedience, ostentatious, old-fashioned, organic  \nr/EnigmaofMaishulLothli\n\n[<= Previous Chapter](https://www.reddit.com/r/shortstories/comments/1bh79tp/comment/kve6obj/?utm_source=share&utm_medium=web2x&context=3) / [Next Chapter =>]()\n\n[Chapter Index](https://www.reddit.com/r/EnigmaOfMaishulLothli/comments/1biad6c/out_of_kindness/?utm_source=share&utm_medium=web2x&context=3)", "<Casting Shadows>\n\n**Chapter 19**\n\nCass's assailant lunged forward, her remaining knife poised to strike.  Before she could catch this one as well, another figure slid between them.\n\nAnatu's dark skin and white robe flowed like water around Cass's waist, rising like a wave up under Nuut's arm.\n\nThe spritely Captain - *former* Captain? - pulled the would-be assassin's momentum around and down.  Their balances shifted and Nuut was flipped up over Anatu's back in a fluid, organic motion before dropping roughly onto the sand.\n\nShe cried in pain, knife falling from an arm twisted nearly to the breaking point.\n\nKebb appeared out of nowhere, one boot stepping onto the blade of the knife while his sword pointed warningly at Nuut's twin.  They were frozen mid-step; whether towards Cass or their sister was unclear.\n\nThe soldiers in the area tensed.  Weapons were drawn.  The other Disciples of Flame that had come with Anatu had their hands up - except the Chol warrior, who had her sword half-drawn - and backed towards each other.\n\n\"Woah, calm down everyone!\" Cass raised her voice and her hands, waving them to get attention.  \"Calm down!  I'm fine.  You *know* I'm fine.\"  She looked around at the fierce expressions of her soldiers.  Obedience overrode instinct and they stowed their weapons.\n\n\"Hey Cit, get everyone to go back to packing,\" she told her second in command.  *Former* second, she reminded herself.  \n\n\"You sure about that, general?\"  Cit's face was easier to read than the stars at night; he didn't like the idea of stepping away given what just happened.\n\n\"I'll be fine.\"  She glanced over at Glaukos, who was stowing his bow back over his shoulder.  Grabbing the beanpole of a man and pulling him closer, she added, \"Besides, anything goes wrong and I've got backup right here.\"  \n\n\"Excuse me?\"  Glaukos asked, nearly collapsing under the slap on the back she gave him.\n\nCit grinned.  \"Fine, fine, I see I'm not needed.  I'll go keep the peace, shall I?\"  He gave Cass a pat on the shoulder as he walked past, shouting at a couple of the guards who still looked tense to help prepare the camels.\n\nShe turned her attention back to Anatu and Nuut, the latter of whom was now on her knees, head bowed.\n\n\"We surrender our pasts to preserve our futures.  Remember that,\" the leader of the Disciples hissed through clenched teeth.\n\n\"Yes, captain,\" the prostrate woman said.\n\n\"*Former* captain,\" Cass spoke up as she walked over.  Nuut looked up at her with a savage glare, her jaw muscles working like she wanted to bare her teeth.  Cass wasn't there to fight though, she just thought a little friendly ribbing would help break the tension.\n\nAnatu held a hand down over Nuut and cleared her throat, catching her eye.  Nuut didn't relax, but looked less poised to strike.  That taken care of, they looked back at Cass and lifted their chin defiantly.  \"Excuse me?\"\n\n\"The armies are all disbanded, right?\" Cass asked, arms crossing over her chest, \"That would make you as much a captain as I am a general.\"\n\n\"No.\" They shook their head. \"My position is within the Disciples of Flame.  I am *still* a captain.\"  The smile they gave Cass was so smug she wanted to practice that interesting throw she'd seen earlier on them.\n\n\"Now if you'll excuse us,\" Anatu continued, bending down to grab Nuut by the arm and pull them to their feet, \"I'll take her and we'll continue checking the supplies before we go.\"\n\n\"Hold on.\"  Cass held out a hand.  \"I want to clear the air first.  She's still traveling with us, right?\"\n\n\"Yes.  I assure you that she won't try that again.\"  The look Anatu shot at Nuut was sharp enough that Cass thought *it* could have done a better job piercing her than the knives had.\n\n\"Yeah, that's fine, but I want to know what I'm about to apologize for.\"  She shifted her attention to Nuut who looked caught off guard by the statement.  Stepping closer, Cass held out her good hand, palm up in a gesture of peace.\n\n\"Apologize?\"  Nuut's expression shifted to narrow-eyed suspicion.\n\n\"You don't just try to stab someone for no reason, do you?\" Cass asked.  \n\n\"She served under me at Imintuta,\" Anatu answered, and that was all she needed to hear.  It was the first major conflict she fought in when the rebellion reached Desheret.  The fortified city was by a large gap in the cliffs and needed to be taken at all costs.\n\nEnter, Cass, her Thiria, and an old-fashioned direct charge at their defensive lines.\n\n\"Ah.\"  Her thoughts at offering an apology to try to make amends suddenly felt *laughably* inadequate.  She only recalled snippets of that battle, having chosen to get blackout drunk afterward to prevent as much of it from following her into her sleep as she could.\n\n\"I was one of the lucky ones, *wahsh*.\"  The venom Nuut put in that word was enough to let Cass know what it meant.  She'd been called it in many languages since she started fighting and learning how to use her curse to its full potential.  It all boiled down to the same thing; *monster*.\n\n\"Right, um...\" The uncomfortable prickling of heat on her back and shoulders reminded her that she had to get ready to travel.  \"I'm sorry for what happened and for what I did to you.\"  Her eyes traveled down to the missing leg, the bronze peg glimmering ostentatiously like gold in the setting sunlight.\n\n*Not the time for a friendly ribbing, then.*  She left Anatu and Nuut to resume inspecting the supplies and headed back to her tent.  The fine robes she was wearing wouldn't be comfortable to ride in through the night, and cooling as they were in the heat of day, the desert chill once the sun was done would dig into her bones without something more substantial on.\n\nUnfortunately, when Cass made it back, her tent was half torn down and packed up by her soldiers.\n\n\\----------  \nWC: 999/1000  \nAll crit/feedback welcome!  \nr/TomesOfTheLitchKing  \n[\\[Chapter Index: Casting Shadows\\]](https://www.reddit.com/r/TomesOfTheLitchKing/comments/17ttzt4/sersun_chapter_index_casting_shadows/)\n\nNotes:  \n- Bonus words: Obedience, organic, old-fashioned, ostentatious(ly), \n- Recommend any new readers use the linked chapter index above; those chapters receive more edits than the ones in past sersun posts", "Hi Zach,\n\nI can't imagine they thought they would get far trying to attack Cass when surrounded by loyal supporters, even though they're no longer officially banded as part of an army.\n\nOne of the notes I had was that I don't feel you need to remind us the army is disbanded anymore -- however I see there's a clarification that Nuut calling Anatu a captain shows how their religious order still remains.\n\nI feel like if I was Cass, I'd be flashing warning signs, while Anatu is loyal, it sounds like this order holds a bond of some form beyond mere military alliances.\n\nAlso, I enjoy the comic relief at the expense of Glaukos again.", "Hey hey Zacky! (Wow, Your little comment about a pun in my name for your greeting, made me think. I need to find words that rhyme with Zack XD)\n\n>remaining knife poised to strike.\n\nI don't know why, but think this part of the sentence could just use some rewording. Like, maybe just add a pronoun at the start of it.\n\nI am enjoying this running gag of referring to officials as *former* officials, throughout this chapter, adds a bit of levity that I appreciate. Still, Cass seems pretty alright considering she just woke up from The-Night-That-Shall-Not-Be-Named.\n\n>Nuuut\n\nExtra u.\n\nI like the detail of Cass trying to drink her memories away. That's a very real but also very sad problem people have. \n\nHm. Maybe that's why she's so cheery! Maybe she can't even *remember* The-Night-That-Shall-Not-Be-Named!\n\n>\"Right, well...\"\n\nVery very minor, but \"well\", to me, just works better as a word that starts a sentence rather than continues off one, just replace the period with a comma, in my opinion.\n\n>the night and, cooling\n\nJust move the comma in front of \"and\".\n\nI don't really have much to say this week! Good worldbuilding and nice stinger ending! Hope the soldiers didn't confiscate what wine she had left!\n\nGood words!", "Howdy Max!\n\nThank you for the feedback :D  Gotta love revenge schemes; typically not much forethought given for what happens after they're satisfied.  As for the re-reminders that the army is breaking up, it's definitely an important point in the story and for Cass.  I'm doing it more to show that Cass is still trying to internalize it/accept it.\n\nAs for Cass and warning signs...I don't get the feeling she's all that observant.  But she's got her good buddy Glaukos there to keep her safe :P\n\nThanks for reading!", "Heya Nate!\n\nI think \"Wacky Zacky\" works :P  Just a suggestion though.\n\nBIP! Pronoun added.  BOP! :nou:  BOOM! well is now an \"um\" to better capture the essence of the uncertainty I was attempting to convey.  Alakazam!  Moved the comma before the \"and\".\n\nI swear I'm trying to \"pick up the pace\" but the words are fighting me xD  According to my outline they were supposed to be in the desert by chapter ten :P  I'm glad it's all still working for ya.  That stinger at the end was something I juuust managed to squeeze in by sacrificing details elsewhere because it made for a much better ending that flowed into next week stronger.\n\nSoon the camp shall be behind them!\n\nThanks for reading :D", "#Welcome to Micro Monday\n\nHello writers and welcome to Micro Monday! It’s time to sharpen those micro-fic skills. What is micro-fic, you ask? Micro-fiction is generally defined as a complete story (hook, plot, conflict, and some type of resolution) written in 300 words or less. For this exercise, it needs to be at least 100 words (no poetry).      \n\nHowever, less words doesn’t mean less of a story. The key to micro-fic is to make careful word and phrase choices so that you can paint a vivid picture for your reader. Less words means each word does more! You’re free to interpret the weekly constraints how you like as long as you follow the post and subreddit rules. **Please read the entire post before submitting.**  \n\n&nbsp;\n\n***\n         \n#Weekly Challenge \n\n**Theme: [Entanglement](https://www.deviantart.com/55goatbones/art/Entanglement-1030586713)         \n**Bonus Constraint (10 pts):** The story has an ambiguous ending. **You must include how you used it at the end of your story.**\n   \nThis week’s challenge is to write a story inspired by the theme of ‘entanglement’. Our lives are made up of more than just ourselves and our own ideals and opinions. We become entangled with other people, their beliefs, their actions, and sometimes that makes things messy. Dangerous, even. What happens when we get mixed up in the wrong things? How do you find your way out? Is it possible? How do you start over when you’re forever linked with a bad name? Sometimes things are so entangled that right and wrong become blurred. Who are the good guys and who are the bad?             \nYou’re welcome to interpret the theme any way you like as long as the connection is clear, and you **follow all post and sub rules**. The bonus constraint is encouraged but not required (it is worth points). You do not have to use the linked image.     \n\n ***   \n# Last Week: [Tea Time](https://www.reddit.com/r/shortstories/comments/1bhzopa/ot_micro_monday_tea_time/?sort=old)     \n- **Winner:** [“Strange Entertainment”](https://www.reddit.com/r/shortstories/comments/1bhzopa/comment/kvz9ozp/?utm_source=share&utm_medium=web2x&context=3) by u/MaxStickies                                 \n    \n  \nYou can check out previous Micro Mondays [here](https://www.reddit.com/r/shortstories/wiki/micro/).    \n\n&nbsp;\n***\n\n#How To Participate\n\n- **Submit a story between 100-300 words in the comments below (no poetry) inspired by the prompt.** You have until **Sunday at 11:59pm EST**. Use [wordcounter.net](https://wordcounter.net/) to check your wordcount.\n\n- **Leave feedback on at least one other story by 3pm EST next Monday.** Only **actionable feedback** will be awarded points. See the ranking scale below for a breakdown on points.\n\n- **Nominate your favorite stories at the end of the week [using this form](https://docs.google.com/forms/d/e/1FAIpQLScXLibiH2uqd8sBTWaVLeQVjGRsnjE5kPdCS6AZfqCRVhzf2Q/viewform?usp=sf_link).** You have until **3pm EST** next Monday. *(Note: The form doesn’t open until Monday morning.)*\n\n###Additional Rules\n\n- **No pre-written content allowed.** Submitted stories should be written for this post. Micro serials are acceptable, but please keep in mind that each installment should be able to stand on its own and be understood without leaning on previous installments.\n\n- **Please follow all subreddit rules and be respectful and civil in all feedback and discussion.** We welcome writers of all skill levels and experience here; we’re all here to improve and sharpen our skills. You can find a list of [all sub rules here](https://www.reddit.com/r/shortstories/wiki/index/rules).  \n \n- **And most of all, be creative and have fun!** If you have any questions, feel free to ask them on the *stickied comment* on this thread or through modmail. \n\n&nbsp;\n***\n\n#Campfire \n- On **Mondays at 1pm EST,** I host a Campfire on our [Discord](https://discord.gg/writingprompts) server. We read the stories aloud and provide live feedback for those who are present. Come join us to read your own story and/or listen to the others! Everyone is welcome and we’d like to have you, we absolutely love new friends!\n\n&nbsp;\n***\n#How Rankings are Tallied\n\n**Note: There has been a change to the crit caps and points!**       \n \n**TASK** | **POINTS** | **ADDITIONAL NOTES**\n|:--:|:--:|:--:|:--:|:--:|:--:|\n| **Use of the Main Prompt/Constraint** | up to **50** pts | Requirements always provided with the weekly challenge\n| **Use of Bonus Constraint** | **10 - 15** pts |  (unless otherwise noted)\n| ***Actionable* Feedback** (one crit required) | up to **10** pts each (30 pt. max)  |  You’re always welcome to provide more crit, but points are capped at 30  \n| **Nominations your story receives** | **20** pts each | No cap\n| **Voting for others** | **10** pts | Don’t forget to vote before 2pm EST every week!    \n  \n*Note: Interacting with a story is not the same as feedback.*\n&nbsp;\n\n***                              \n***\n\n###Subreddit News   \n\n- Join [**our Discord**](https://discord.gg/writingprompts) to chat with authors, prompters, and readers! We hold several weekly Campfires, monthly Worldbuilding interviews, and other fun events!        \n\n- Explore your self-established world  every week on [**Serial Sunday**](https://redd.it/1bmql7r)!   \n\n- You can also post serials to r/Shortstories, outside of Serial Sunday. Check out [**this post**](https://www.reddit.com/r/shortstories/comments/m20mxf/ot_rshortstories_now_has_serials/) to learn more!  \n\n- Looking for more in-depth critique for a story? Check out our new sub [**r/WPCritique**](https://www.reddit.com/r/WPCritique/)!   \n***", "#Welcome to Micro Monday!\n\n- Top-level comments are for stories only.\n\n- Feel free to make suggestions for future posts or ask questions on this stickied comment! I'd love to hear your ideas.", "That day changed me. For better or for worse, life has never felt the same since. What I see now, as I gaze upon the wonder of this world is so incredibly different from what I once saw. Truly that day made me realize just how much suffering permeates through all matters of existence.\r  \n\r  \nI woke up on a day that was particularly damp, and at the time I just thought it was because it must've rained that night but I didn’t notice. I thought it was just because I must've been in such a deep sleep, but boy was I in for quite the awakening. Strangely, when I looked outside my window and saw this odd prevalence of moisture in the environment coursing through the soil, the air and even the clouds, I felt this bizarre urge to go for a walk. Instead of deciding to stay in inside like I typically would under these conditions, I felt compelled to wonder outside and just walk. I lead a pretty mundane life at the time so I decided to let this strange feeling take me. And so I left, and oddly it wasn't very cold at all. In-fact it was distinctly rather humid that day, so all I needed was a long sleeve top. Thus as 1 would expect, I walked… and I walked… and I walked, more than I usually would want to. I just couldn’t shake this feeling to keep walking, almost like something out there was drawing me in. like it was vaguely guiding me to its presence. Before I knew it I was completely infatuated with this urge, and lost myself on what I innitially expected to be a little stroll, walking to where I thought was no where, but much to my surprise, did in-fact turn out to be somewhere specific.\r  \n\r  \nAfter what must've been hours that I now understand couldve been cut shorter with the use of some kind of vehicle, I arrived in a forest shrouded with a dark and heavy green. And suddenly I came down with this sensation like the very weight of this forest's existence chained itself to my heart. By this point, even though there was nothing physically weighing me down, I could barely walk. And so exhausted, I eventually began to crawl on all fours, ankered down by some force unbeknownst to me. Crawling amidst the haze of unrelenting moisture, abounding green, and a heavy heart, I eventually reached where I was being compelled to. The invisible rope tugging at my being dropped finally, and what layed before me is what I can only describe as nature's pure meloncholy. This tree, within the centre of this mystical dreary forest was weeping. It was crying with such sorrow that imposed itself upon my being. Without eyes, or a face, I could see droplets of tears falling from the tips of its many leaves. Strangely enough, the tree looked incredibly healthy, however it came to me suddenly… This forest was dying.\r  \n\r  \nI would come to realise amidst all the sadness emanating from this 1 tree, that could be felt so far from its essence that this intense sorrow was that of vehement grief. As this tree, seemingly within the centre of the forest, could feel its family dying, with every new death brought with it another downpour of dispair wrought tears. Im not sure why I was the 1 it compelled to its location, but that question mattered not to me in that moment. Its sorrow, became my sorrow and a new found connection between myself and mother-nature was born that day. I cried a lot that night, and ended up falling asleep, resting upon the floor that layed above the trees roots. This gargantuan tree and I built a special understanding, and I believe it is that very understanding that would result in what would follow this. \r  \n\r  \nFor days, I remained at its side, living of its very tears that would fall from it for sustenance. And though no words were spoken, a non-verbal communication was shared, and I I could strangely feel its once intense sadness gradually progress into a weary acceptance. It became aware to me, as it was aware to the tree, that the death of this entire forest was inevitable. Afterall it was almost entirely barren, without much life to speak of. And so the both of us, day afterday watched as all the other tress sarounding were rendered to lifeless husks of what they once were. You'd think in such a morbid passage of events, the sorrow we shared would only increase, but I do earnestly believe that because we were together in that time, wallowing in the pain with eachother as opposed to drowning in it alone, closure became possible. Thus as the time came to where the death of this tree was imminent, though my sadness was oh so deep, we were both emotionally ready for tragic end to proceed. And so upon its death I somberly cried \"farewell once weeping evergreen\". \r  \n", "The melancholy of Dave\r\n\r\nOur story begins with baby Dave in his little papoose. \r\nBaby Dave has just been born and is now crying in his mother’s arms, however little Dave\r\n would not realize This moment was the one that sparked all misfortune and hardship in\r\n little Dave’s life. Hello again, Baby Dave is now toddler Dave and he had just had his first\r\n injury, a scrape the first of many to come. Dave is now 10 years old and is going through\r\n elementary school. He had just met his first friend, and they got close after weeks.\r\n However, after one more week news came in that his friend had been in a fatal car\r\n accident and did not survive. Dave, having lost his first and only friend, retreated to his\r\n room, a safe space, away from everyone. Dave is now 15 years old and in high school.\r\nDave is slowly learning to make friends again. However, it would seem that anyone Dave \r\nwas close to would suddenly and mysteriously pass away. Of course, Dave was oblivious\r\nAnd chalked it up to a freak accident. Dave is now 20 and has landed his first job. He made\r\n note that his manager was terrible and gave him unnecessary talks and meetings to\r\n Attend. Every time Dave showed defiance the manager shot it down and Dave was later\r\n fired from his 9-5 job. Though it would not affect Dave he now had no income source and\r\n So, he was forced to start working at a fast-food restaurant. Dave is now 25 and has found\r\n a new job working as an accountant for a wealthy man named Stanley. Dave’s new\r\n employer was quite kind, and he took a liking to Dave shortly after he was hired. Dave\r\n was also quite fond of Stanley and in a week, they were already on a first name basis.\r\nHowever just like poor Dave’s first friend Stanley too was killed in a horrific accident.\r\nDave is now 30 and very depressed having lost another friend to a tragedy. Dave climbs\r\n onto his apartment buildings rooftop and thinks about his life, his 2 friends his parents \r\nthat never cared for him and now this. Dave jumps. Dave is now dead.\r\n\r\n \r\nDave is now at the gates of heaven and saint peter greets him.\r\n“you're not supposed to be here yet Dave” says the saint.\r\n“You have much to still live for”\r\n“I wish not to live any longer” replies Dave, staring into the ethereal plane\r\n“I wish to speak to God” Dave says\r\n“Follow me” Saint peter says\r\nSaint peter leads Dave to a white room.\r\n“Where are we?” Asked Dave in a ponderous tone\r\n“We are in Gods chamber, my friend” responded saint peter.\r\n“What are your questions, my child?” crooned God\r\n“I have lived a life of turmoil and so I come to ask, why did you give me this life?”\r\nGod pauses to think, then he shows Dave a screen and to Dave’s horror it showed him,\r\n selecting every moment of his own life. Disbelief subsumes Dave and he breaks down.\r\nGod offers Dave a second chance and Dave accepts.\r\n\r\n\r\n\r\n\r\n\r\n\r\nOur story begins with Baby Stanley.\r\n\r\n\r\n\r\n", "**Welcome to the Short Stories!** This is an automated message.   \n\nThe rules can be found on the sidebar [here]( https://www.reddit.com/r/ShortStories/about/sidebar).\n\n**Writers** - Stories which have been checked for simple mistakes and are properly formatted, tend to get a lot more people reading them. Common issues include - \n\n* Formatting can get lost when pasting from elsewhere.  \n* Adding spaces at the start of a paragraph gets formatted by Reddit into a hard-to-read style, due to markdown. Guide to Reddit markdown [here](https://www.reddit.com/wiki/markdown)    \n     \n**Readers** - ShortStories is a place for writers to get constructive feedback. Abuse of any kind is not tolerated.    \n     \n***  \n\nIf you see a rule breaking post or comment, then please hit the report button.           \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/shortstories) if you have any questions or concerns.*", "There once was a man, who lived near an amusement park.\r  \nHe went there often, enjoying the park and all the wonderful rides it had to offer.\r  \nAlthough the park had many rides, it had a vacant spot in the middle of the park, right next to the coffee shop. The man often sat in the coffee shop, on the outside terrace and looked at the vacant spot, wondering, what was there to be.\r  \nOne day, a travelling ride found its way to that amusement park, and they started setting it up onto that vacant spot next to the coffee shop.\r  \nThe man was intrigued by that new ride and decided to take a closer look as they were setting it up. It was the biggest and the scariest ride he had ever seen, and there was something in front of it that no other ride had. There was a height limit to that ride and the man, sadly, was very short.\r  \nLater that evening, when the man was sitting at the amusement park coffee shop and observing the new ride from afar, someone came and sat down next to the man. It was the operator of the new ride. They introduced each other and the operator told the man, that they had just finished building the ride and if he wanted to, he could come and be the first to try the ride.\r  \nThe man agreed, making himself look taller, although knowing, that he was too short for the ride.\r  \nThe man and the operator walked towards the ride and upon reaching it, it became clear that the man was too short to ride the ride.\r  \nBut since it was late, no one else was around and the operator had been drinking that evening, they allowed the man to ride the ride. The man sat in the seat, while the operator strapped in the man. The ride was short, as they often are and after the ride, the man went home. He returned the next day, only to find that the ride had become very popular and there was a queue for the ride. The man waited in the queue, until it was his time to ride the ride, always knowing that he was too short, but hoping, that since last night the operator had allowed him to ride it, so will they allow again.\r  \nThe man was up, but the operator did not allow him to ride the ride. \r  \nTime went by and the man went to the amusement park every evening, hoping, that the operator would come to the coffee shop and allow him to ride the ride. But the operator never came. And what was even worse, that now they had started to pack up the ride, it was going to another amusement park, in another country, far away.\r  \nThe man followed the ride, visiting the park every day, sitting at the coffee shop, waiting for the operator to approach him and allow him to ride the ride. Sometimes it happened, but rarely, when the operator had been drinking and was a bit reckless.\r  \nYears went by and the man went from country to country, following the ride, admiring it, sitting nearby, hoping, that he would soon get the chance to ride it again.\r  \nHe had begun to appreciate the ride so much, that the ride was the only thing that caught his eye, despite that fact that he had travelled with the ride to all parts of the world and was not allowed to ride it. No matter what else was in that place, the man only kept looking at the ride.\r  \nSome time passes, and again, one evening, while the man was sitting at the coffee shop, admiring the ride, he was approached by the operator, and they allowed him on the ride once more. But this time, the operator asked the man, why are you following a ride you can almost never ride? There are so many other places, so many other rides. And the man said that every time when I ride the ride, you need to strap me in and sometimes your hand touches my hand, your hair touches my face, I can sense you close to me. Because you see, it was never about the ride, it was always about the operator.\r  \n", "**Welcome to the Short Stories!** This is an automated message.   \n\nThe rules can be found on the sidebar [here]( https://www.reddit.com/r/ShortStories/about/sidebar).\n\n**Writers** - Stories which have been checked for simple mistakes and are properly formatted, tend to get a lot more people reading them. Common issues include - \n\n* Formatting can get lost when pasting from elsewhere.  \n* Adding spaces at the start of a paragraph gets formatted by Reddit into a hard-to-read style, due to markdown. Guide to Reddit markdown [here](https://www.reddit.com/wiki/markdown)    \n     \n**Readers** - ShortStories is a place for writers to get constructive feedback. Abuse of any kind is not tolerated.    \n     \n***  \n\nIf you see a rule breaking post or comment, then please hit the report button.           \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/shortstories) if you have any questions or concerns.*", "Remove superfluous commas and find a thesaurus to help deal with excessive use of the same word like \"ride\"", "Thanks :)", "1\r  \nAt the stroke of midnight, under the  glow of the moon, a  gunshot ripped through the tranquil aura surrounding Wagner Mansion, shattering the silence like glass. The sound reverberated through the halls, echoing the terror that had unfolded within.\r  \nMr. Smith, the loyal butler to Mr. Wagner, was gripped by an icy fear as he dashed towards his master's quarters, his heart pounding in his chest like a drum of impending doom. With each step, he prayed   that his worst suspicions would not be realized.\r  \nBreathless and filled with fear, Mr. Smith burst into the room, a silent plea on his lips, begging the god to spare his beloved master from harm. But as the scene unfolded before his horrified eyes, his very soul was rent asunder by the nightmare that lay before him.\r  \nThere, upon the cold, unforgiving floor, lay the lifeless body of  Mr. Wagner in the crimson tide of his own lifeblood. The stench of gunpowder hung heavy in the air, a bitter testament to the violence that had torn apart the serenity of the night.\r  \nIn the stillness of Mr. Wagner's hand lies his beloved firearm, the very instrument he chose to bring his life to its final chapter.\r  \nAs the weight of the truth bore down upon him, Mr. Smith could only stand frozen in horror, his mind reeling with unanswered questions and his heart heavy with grief for the tragic fate that had befallen his cherished master.\r  \n2\r  \nDetective Jack William arrived at the Wagner Mansion in the dead of night, the sprawling estate now teeming with uniformed officers. It was to be expected; Mr. Wagner was no ordinary man. Ranked as the third wealthiest individual by Forbes in the year 2050, his demise was bound to draw attention.\r  \nEntering Mr. Wagner’s room, Jack found that the body had been relocated, the area fenced off with yellow tape. A police inspector approached, extending a hand in greeting. \"Hi, I’m Inspector Mathew,\" he introduced himself.\r  \n“Hi, I’m Inspector Mathew,” he introduced himself.\r  \nReturning the handshake, Jack replied, “Hello, I am Detective William.”\r  \n\"I've heard plenty about you,\" Mathew smiled warmly. \"You're quite the legend in our precinct.\"\r  \nJack chuckled modestly. \"I just try to do my job.\"\r  \n“Well, your reputation precedes you, Detective William,” Mathew continued. “Your dedication and diligence are commendable.”\r  \nAs the conversation unfolded, Mathew leaned towards a conclusion. “But I don’t see much to investigate here. Seems like a clear case of suicide.”\r  \nJack nodded in agreement,  “ But according to protocol I still have to report it.”\r  \n\"Of course,\" Mathew agreed. \"Especially considering it's Mr. Wagner.That guy is insanely rich and a public figure . I don’t know why this type rich bastard commits suicide. If I had money like him, I would never want to die. I mean you can go wherever you want , whenever you want ,buy whatever you want, Why do you want to die ?”\r  \n“Perhaps for Mr. Wagner, money held a different value. For us money is something big but for someone like Mr. Wagner it is maybe nothing more than a piece of paper.”\r  \n\"So, any thoughts on what might've pushed him to do it?\" the Inspector asked.\r  \nJack tilted his head in thought, then remarked, \"You know, I have a feeling it might have to do with his dead wife. The guy was head over heels for her, you know?\"\r  \n“Yeah , I know that, This guy treated her woman like a queen . After all this dude almost died in search of Emberglow lilies in the amazon jungle just to give them as an anniversary present to his wife on the 10th marriage anniversary.”\r  \nJack nodded, \"Yeah that incident kind of became an internet sensation , every major newspaper covered that news. \"\r  \nMathew laughed, remembering his own wife's reaction to the story. \"You know, my wife read one of those articles and she goes, 'You never go on crazy adventures for me.' And I'm like, 'Honey, I love you, I love you, but risking my life for flowers? ' That's  rich people's nonsense !\"\r  \nHearing this Jack starts to laugh . After a while, he sobered up and posed a question, “ Did you search the place?”\r  \n“Well my men  already searched the place, but didn't find anything special . Just got a diary in Mr Wagner’s desk .”\r  \n“Did you read the diary? Maybe the motive is written there.”\r  \n“Not yet.” replied Mathew, “How about we read it together ? Maybe we will find the reason . I want to know what drives a billionaire like Mr Wagner to kill himself.”\r  \n“We can do that,” said Jack “Let's go to my office. We can read the diary there.”\r  \nWith that settled, the two officers wrapped up their work at the scene and made their way to Jack's office.\r  \n3\r  \nJack handed Matthew a cup of freshly brewed coffee before settling down beside him, “ Ok inspector , let's start reading the diary . I wanna know what kind of secret Mr. Wagner is hiding in his diary.” \r  \nMathew opens the diary and starts reading the diary out loud and his eyebrows furrowed in concentration, “ Whoever reading this diary ,know this, after finishing reading this you will have two choices. You can either expose me to the entire world or you can burn this diary and my secrets will be a secret forever. Either Way I don’t care , I just don’t want to carry this burden to my grave . Now it's your burden.”\r  \nJack takes a sip of the coffee,his eyes narrowing thoughtfully.  “That’s a weird way to start a dairy,” says Jack.\r  \nMathew chuckled , “ Mr. Wagner sure knows how to grab the attention . He is a true businessman . Now I am curious too . What kind of secret is Mr. Wagner hiding ?”\r  \n“Don’t stop at the first page.” Jack urged. “ Start reading.”\r  \n“Sure.” Mathew starts to read out loud , “My name is James Wagner . With my surname you already understand I am a member of the famous Wagner family . I was the sole inheritor of the biggest empire created by my grandfather Robert Wagner and carried by my father James Wagner. So the math is simple , after my father I will be the one who will carry my Wagner family’s legacy . There is just a small problem. I am a worthless , talentless, piece of shit.”\r  \nMathew paused, allowing the weight of those words to sink in before continuing.\r  \n “I didn’t know that until I was 18 . That was my fault actually . My little accomplishment was celebrated like I won the whole world. This made me a little arrogant . But when I turned 18 , I realized , I am not a talented boy . My peer’s , friends' achievements are so much more than mine.What I once thought were achievements were merely celebrated mediocrity. I am just a brat who is living on his father’s money and thinking that he is talented. I got severe depression and top of that I was diagnosed with ADHD . I kept that secret from my parents because I didn’t want them to worry . I tried so many things . Sports, singing, arts etc. but nothing works . I just stopped trying and tried to live my life normally .”\r  \n“It’s kind of sad,” says Jack. “ Being mediocre is just a curse in men’s life. Doesn’t matter who you are or where you come from.”\r  \nMathew replies with a sad voice , “ It’s true man. Sometimes it seems like no matter how much money or privilege you have, you're still stuck in being average.” \r  \nJack nods in agreement and says, “ But I think it's just a part of life.”\r  \n“Yeah I think so. ” says Mathew . Then he resumes reading.\r  \n Passed my highschool with a decent grade and was admitted into a prestigious college off course with the help of my father’s money. I couldn’t even think about getting admission to a college like Luminos University with my grades. But at that time , I just stopped thinking about it . I started my college life and there I met Olivia. It wasn’t love at first sight but I started to love her as I started to get to know her. We were best friends or atleast in her point of view . Everything was going perfectly , John came . John was my childhood friend. John is a true perfectionist, always aiming for the best in all he does.His characteristic is totally opposite of mine . While I settled for average success, John aimed to be the best in everything he pursued.We were supposed to go to the same university at the same time . But his father wasn’t as rich as mine . Besides, he will not use his father’s money for his college . So he studied for one year , gave his SAT exam, scored 1585 and got a full fund scholarship in  Luminos University . So he came to my college a semester after me. I was so happy to see him. I introduced him to Olivia and I think that was my biggest mistake.They started spending time together . It wasn’t long before they forged a bond—a connection so profound it could only be described as love.  In front of my eyes I saw my love to fall in love with another John. Whenever I saw Olivia hanging out with John or sharing the same straw for a drink or smiling at John’s joke , it felt like someone stabbed my heart with a knife. I used to cry every night. I thought if I stopped seeing Olivia I could get over her . But that felt impossible. Whenever I tried to ignore them , John always did something to make me  join them. It felt like John indirectly saying, “ Hey your love is mine , I wrapped her around my fingers with my charms and you have to watch it .”  My sorrow gradually turned to hatred for John . My best friend , the only guy who I considered as my brother, became the person I hated most. Every word from John felt like a taunt, a cruel reminder of what he had lost. The hatred festered, dark thoughts whispering sinister solutions.. I couldn’t stand him and my hatred became so great that I was thinking of killing him . \r  \nFate, however, took a grim turn. One day John got arrested . A 9 year old girl was raped in that city and police arrested him as a suspect . Someone tipped the police that John is the main culprit and when police searched John’s room , they found child pornography in John’s computer . So naturally he became the biggest suspect . That incident destroyed John’s reputation . His  picture perfect image started to crumble . He was released  after some days because police were able to find the real culprit. But the damage was done . He may not be the real culprit of that crime but police found child pornography in his computer which labeled him as a pedophile.Our college canceled his scholarship . Olivia broke up with him , his family disowned him. He was jumped on twice by some locals and got beaten brutally . Everyone started to see him as garbage to society . \r  \nI was enjoying his downfall . Everything that happened to him felt like a blessing to me . Moreover because of his break with Olivia I became more close with Olivia and eventually we started dating. Then one day I got a phone call from the police . John had committed suicide in a motel. He cut his wrist vein and bled to death. He wrote three letters before suiciding . One for his parents , one for Olivia and one for me . His parents refused to take the body and also tore the letter without reading it  . Olivia also didn’t read his letter. I was the only one left. I read his letter and that shooked me to my core. In his letter he wrote that when he was accused of that heinous crime he wasn’t afraid because he knew he was innocent but what broke him was when I told him not to show his face . I was the only one who he considered as his friend and when he saw that I also thought that he was guilty, that broke him. So he decided to take this path. \r  \nAfter reading his letter, a wave of guilt crashed over me because I was the one who planted those videos on John's computer.It was a twisted plan fueled by jealousy and hatred. I knew if I called the  police anonymously and told them the suspect was in John’s house,they would definitely search that house and when they find those videos on John’s computer they will arrest John as a suspect and after that incident our college will revoke his scholarship. \r  \nAt that moment, blinded by envy, I couldn't see beyond my desire to bring John down. But reading his heartfelt letter shattered my facade. What had I done? I had betrayed the trust of someone who considered me a friend, all because of my own insecurities.\r  \nAfter that day, I couldn't escape nightmares. Every night, I saw John's face, reminding me of what I'd done. Sleep became hard, replaced by constant worry. But Olivia was my comfort. Her being there helped me feel calm sometimes, even with everything else going on.\r  \nBut when Olivia passed away, it felt like I had lost my anchor. With no reason to carry on, the nightmares intensified, gnawing at my sanity.\r  \nNow I have made a decision. I accepted that I had become the villain of my own story, but if it meant I would get Olivia for the rest of my life, I would embrace that role without hesitation. Now it's time for my redemption \r  \n\r  \n\r  \nMathew finishes reading the diary. The shock is evident on his face as he sits back in his chair, the weight of its revelations pressing heavily upon him. He tries to rush to the door, but Jack grabs him firmly by the hand.\r  \n“Where are you going?” ask Jack.\r  \n“To report it .”Matthew replies urgently.\r  \n“Do you understand what will happen if you expose Mr. Wagner?” Shouts Jack. “Wagner enterprise will fall down and thousands of people will lose their jobs. It will be havoc.”\r  \n“ But it is wrong if we hide it,” Matthew protests, his determination unwavering.\r  \n\"My friend, Mr. Wagner and John are both gone. Exposing this now will only create more trouble. Let's keep it between us,\" Jack urges, his tone urgent.\r  \nThen with swift decisiveness, Jack takes the diary from Matthew and ignites it with his lighter, the flames quickly consuming the pages. Matthew watches in silent resignation as the truth is engulfed by fire, lost to the ashes of secrecy.\r  \n \r  \n4\r  \nIt is almost 2 am in the night.As Jack sits in his office chair late into the night, a faint smirk plays on his lips. \"Thought I was the only one wrecking lives for love,\" he mutters to himself. \"Guess I've got company.\"\r  \nHe rises from his seat and wanders over to the window, peering out into the darkened sky. \"Don't sweat it, Mr. Wagner,\" he murmurs softly. \"Your secret's safe with me. I'll take it to the grave, alongside mine. Nobody's gonna know we're the bad guys.\"\r  \nWith those words hanging in the air, Jack stands there, a solitary figure framed against the night, his thoughts swallowed by the silent expanse beyond the glass.\r  \n\r  \n\r\r  \n\r  \n\r  \n\r  \n\r  \n\r  \n\r  \n\r  \n\r  \n\r  \n\r  \n\r  \n\r  \n\r  \n\r  \n\r  \n\r  \n\r  \n\r  \n\r  \n\r  \n\r  \n\r  \n\r  \n\r  \n\r  \n\r  \n\r  \n\r  \n\r  \n\r  \n\r  \n\r  \n\r  \n\r  \n\r  \n\r  \n\r  \n\r  \n\r  \n\r  \n\r  \n\r  \n\r  \n\r  \n\r  \n\r  \n\r  \n\r  \n\r  \n", "**Welcome to the Short Stories!** This is an automated message.   \n\nThe rules can be found on the sidebar [here]( https://www.reddit.com/r/ShortStories/about/sidebar).\n\n**Writers** - Stories which have been checked for simple mistakes and are properly formatted, tend to get a lot more people reading them. Common issues include - \n\n* Formatting can get lost when pasting from elsewhere.  \n* Adding spaces at the start of a paragraph gets formatted by Reddit into a hard-to-read style, due to markdown. Guide to Reddit markdown [here](https://www.reddit.com/wiki/markdown)    \n     \n**Readers** - ShortStories is a place for writers to get constructive feedback. Abuse of any kind is not tolerated.    \n     \n***  \n\nIf you see a rule breaking post or comment, then please hit the report button.           \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/shortstories) if you have any questions or concerns.*", "*This short story is a part of the Mieran Ruins Collection. The rest of the stories can be found on this [masterpost](https://old.reddit.com/r/AstroRideWrites/comments/mgv92s/mieran_ruins_collection/).*\n\nAll was quiet in Ura city hall. Not even a mouse dared to stir because of the cat Goldtail. He was satisfied with his work and bathed in the sun coming through a window. Much like the relaxed feline,  Evelyn was taking a nap on her desk. A bit of drool came out of her mouth and damaged a document about precautions to take in a tornado. When would those be necessary? Becca sat by the front of building in case anyone needed help from the city. It was an uncommon occurrence as most people in Ura could handle themself and realized the mayor was an idiot, but they liked the sheriff and her deputy.\n\nDerrick, the deputy in question, was deep in the library reading one of the few remaining fiction books again. This was a book published in 1924, and it told the tale of a lone cowboy fighting a group of pirates. It made little sense, and the prose was awful. The book was still moderately enjoyable and passed the time well. Nearby, Larry was reading rules and regulations determined how to escape captivity as the town mime.\n\nThe silence was held in tact as a group of three people snuck into the library. They crouched behind the bookshelves and moved through the stacks. One person slipped on a book and fell flat on their face unleashing a thud. Derrick ignored the noise while Larry went to check it out. When Larry saw the people, he opened his mouth to scream, but a sound didn’t escape his mouth. He was committed to the role. He ran out of the library to get help. \n\nDerrick stayed in his spot reading his book. He had reached the chapter where the cowboy was about to spring a trap on the pirates with gold from the mines. A knife was on his neck before he could finish which was a rude way to interrupt someone.\n\n“Come with us.” The knife-wielder had a nasally voice. Derrick sighed and placed the book to the side. He placed his arms behind his back.\n\n“What are you doing?” the knife-wielder asked.\n\n“Aren’t you going to restrain me?” \n\n“Uh, we don’t have ropes.” The knife-wielder looked to his group who shrugged. “We should’ve brought that. Why don’t you two just grab one hand each and walk out with him.” The two kidnappers did as they were told. Derrick found this arrangement more comfortable.\n\n“Could you pick up my book? I was getting to the good part,” Derrick asked.\n\n“Sure.” The knife-wielder bent over and picked up. Derrick was escorted by the kidnappers who held his hand while they walked.\n\nEvelyn’s office was the closest to the library. Larry ran in there and began to point outside. He gesticulated wildly with his arm indicating knife and then held his hands behind his back. Evelyn remained asleep. Larry waved his hands before her to wake her up, but she stayed rested. Larry rolled his eyes and moved on to his next target.\nWhile the front hall was empty, Becca stayed alert. She kept one eye at the door and another at the crossword puzzle she found. This crossword was from twenty years before the war which made it more challenging, but she would solve it. Her intellectual pursuit was interrupted by a glove hand. Becca looked up to see Larry’s face.\n\n“Could you go ask Derrick? I’m busy here,” she said. Larry slapped his hand with his face. He considered breaking his vow and saying what happened, but that would break regulation. Such a transgression was unforgivable. He waved his hand before her again.\n\n“In a minute,” she said. Larry slammed his fist on the table before her. Becca looked up.\n\n“What is it?” she asked. Larry began to mime reading a book and sighing. He looked up from the book with a sour face. “Derrick.” Becca said. Larry held a finger up to his neck; then, he put his hands behind his back. Becca tilted her head in confusion. Larry scratched his chin for a moment. He grabbed Becca’s handcuffs and put them on his own hands. “Oh my god, he’s been kidnapped.” Becca ran to Evelyn leaving Larry with the handcuffs on.\n\nWhen Becca found Evelyn asleep, she first tried to push Evelyn awake gently. When it became clear that wasn’t going to work, Becca removed the paper from underneath her and rolled it up. After hesitating over whether it was the right thing to do, Becca whacked Evelyn with the paper. Evelyn shot up.\n\n“It was Becca’s fault,” she shouted.\n\n“I’m right here,” Becca said.\n\n“Exactly whatever it was you did it.”\n\n“I didn’t kidnap Derrick,” Becca said. Evelyn leaned back and scanned Becca.\n\n“Becca, you don’t treat your employees that way,” Evelyn replied. Becca shook her head.\n\n“No, Derrick has been kidnapped, and I need your help to find him,” Becca said. Larry ran into the room waving his arms trying to get her to remove the handcuffs. “Not now.” \n\n“Why do you need me? You’re the sheriff.”\n\n“I need backup. Also, if you help me, I’ll make your lunch for a week.”\n\n“You already make my lunch.”\n\n\n“I’ll be sure to include cornbread in your lunch going forward.”\n\n\n“Deal.” Evelyn walked outside her office. “Come on. I know he always lounges in the library so there must be clues there.”\n\nThe noise woke Goldtail up. He looked up at Larry struggling to get the handcuffs off and was amused. Goldtail could use his inherent feline escape abilities to assist the mime, but this was more entertaining. Besides, clouds were gathering outside ruining his sun; he needed something to keep him entertained.\n\n---\n\nr/AstroRideWrites", "**Welcome to the Short Stories!** This is an automated message.   \n\nThe rules can be found on the sidebar [here]( https://www.reddit.com/r/ShortStories/about/sidebar).\n\n**Writers** - Stories which have been checked for simple mistakes and are properly formatted, tend to get a lot more people reading them. Common issues include - \n\n* Formatting can get lost when pasting from elsewhere.  \n* Adding spaces at the start of a paragraph gets formatted by Reddit into a hard-to-read style, due to markdown. Guide to Reddit markdown [here](https://www.reddit.com/wiki/markdown)    \n     \n**Readers** - ShortStories is a place for writers to get constructive feedback. Abuse of any kind is not tolerated.    \n     \n***  \n\nIf you see a rule breaking post or comment, then please hit the report button.           \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/shortstories) if you have any questions or concerns.*", "[Link to serial master post for other chapters](https://www.reddit.com/r/RainbowWrites/s/JxGKlyy8jF)\n\nWhen everyone in the dormitory had recovered from the shock of what had just happened, they started to gradually tidy away the aftermath of the search. \n\nAs Madeline and Billie tidied up their bunk, Madeline kept glancing over her shoulder at Joanna and Ben, sobbing together in the opposite corner of the room. “Should we go over and talk to them?” she asked. \n\n“I don’t know,” Billie replied. “If it was you that had been taken away… I’m not sure I’d have been fit to talk to anyone for a week.”\n\nMadeline sighed. “I just feel bad ignoring them.”\n\n“And you want to know what happened,” Billie added with a knowing look.\n\nIt was infuriating how well they knew her. “And I want to know what happened,” she admitted, before turning to face them more fully. “Oh! What happened with you by the way? I’m assuming that the guard didn’t find the walkie?”\n\nThey shook their head. “Nope. I told you — I’m well-practised at hiding stuff under bindings and many layers.” \n\n“Of course. However could I have doubted your skills?” \n\n“Besides,” they added, “when he searched me he was distracted staring after you.”\n\n“Huh?” Madeline’s jaw hung open, brow creasing as she stared at Billie in utter disbelief.\n\n“Not that I can blame him.” They leaned in, slipping a hand onto the small of her back to pull her closer. “And it could be pretty handy having a guard on side.” \n\nBefore Madeline could even think how to respond, they gave her a quick peck on the lips and rapidly moved on. “Still… I’m not sure I’d want to risk it again. But leaving them here is a risk too…”\n\nMadeline nodded, chewing her lip in thought and trying to ignore the heat blossoming in her cheeks. “That woman said that they only search us sometimes. Then again, they probably only search the dormitories occasionally too. And at least if we leave them here we have some deniability.”\n\nBillie gave her a sidelong look. “You mean we can say they aren’t ours? And risk getting our bunkmates into trouble?”\n\n“No!” Though part of her had thought that — the toll of years of living alone and looking out for only herself — she was happy to realise that she had automatically rejected that idea. “No, I meant that we could deny realising they weren’t allowed. We could claim that we used them to talk to each other when we weren’t together, to avoid irritating our roommates and such. Heck, we could even be somewhat honest and say that we were separated from friends and family who had a corresponding walkie-talkie and that we didn’t want to lose the chance to contact them and find them again.”\n\n“That’s true. Either way, we probably aren’t due another search for a while, so we have a little time to figure out a good place to keep them.”\n\nMadeline nodded to herself, gaze drifting away from Billie as she stared absent-mindedly down at the floor, thinking. \n\nAs an idea crossed her mind, she snapped to attention again. “There’s always the washroom!”\n\n“The washroom?”\n\n“Yeah, hidden in the cistern of a toilet — wrapped up in something waterproof of course. Like how they make toilet hooch in *Orange is the New Black.*”\n\n“Hah! It’s good to know you didn’t *just* read books for entertainment.”\n\nMadeline smiled coyly. “We all have our guilty pleasures.”\n\n“And it looks like yours has solved our problem.” They paused, eyes unfocused in a way that let Madeline know the cogs were whirring inside. When they spoke again, it was slowly. “That said… We should probably keep them both in different places, so if one is found and confiscated, we still have the other.”\n\n“True.” Madeline nodded slowly as she thought. “So do we keep it in a bag, somewhat out in the open like we have nothing to hide? Or…” She scanned their immediate surroundings for possible hiding spots. An idea clicked into place as she noticed fraying and loose stitching poking out the side of her bed. She reached down and pulled at the edge of the mattress, digging her fingers into a small hole and working it open until it was about the right size. \n\n“Well,” Billie said, “It looks like you’ve got that covered. I’ll go grab a plastic bag to keep my walkie dry when I hide it.”\n\nAs Billie went to rummage in their chest, Madeline’s gaze drifted back to Joanna and Ben. Sobs were no longer wracking their bodies. They were just sat, quietly embracing each other on the bed that had been Sarah’s. \n\nMadeline figured now was as good a time as any. She made her way over to them slowly, weaving through their other roommates still tidying up the aftermath of the search. When she reached them, they were completely oblivious to her presence, faces buried in each other’s shoulders.\n\nShe cleared her throat. “Sorry to bother you,” she said softly as they both turned tear-stained faces towards her, “I just wanted to come and check on you and ask if there’s anything I can do… I don’t know. I’m sorry. This was stupid.”\n\nShe turned to leave, heat creeping up her face. What had she been thinking? Now was most definitely not the time!\n\n“Wait!” Joanna’s strained voice stopped her in her tracks.\n\nMadeline turned back around.\n\n“Thank you for coming over.” The woman gave her a wan smile, daintily tucking a strand of tear-soaked hair behind her ear. “It’s nice to know that someone else here cares.”\n\n“Well, I do care.” She edged closer, but the closer she got the more she felt like she was looming over the pair of them. “Do you mind if I…?” She gestured to the mattress.\n\n“Go ahead,” Ben said.\n\nMadeline settled down next to Joanna. She wondered if she should reach out to pat her on the shoulder, or to squeeze her hand. She knew what comfort Billie’s touch brought her. But these were relative strangers. Would they still appreciate it? Or would they find it weird and uncomfortable?\n\nDeciding against it, she opted for a sympathetic smile instead. “I know that I haven’t known any of you for long. But until recently, I hadn’t spoken to another human in at least a year. And I hadn’t had a pleasant, friendly conversation with anyone for much longer than that. So in a way, you three are some of my closest friends in this strange world we’re living in.” She sighed. “Did the guards tell you anything? Do you know if Sarah will be coming back?”\n\nJoanna shook her head, tears spilling over from her swimming eyes.\n\n“They didn’t say much,” Ben said, his voice trembling. “They found a pen-knife that Sarah had kept. She kept it for us, so that we’d at least have something to defend ourselves with between us if we needed it. But when they found it she wouldn’t let either of us take any responsibility. She said it was just hers.”\n\n“And you have no idea where they took her?”\n\nBen shrugged. “Nowhere good.”\n\nMadeline didn’t know what to say to that, and for a while, silence descended. She was just about to leave them to it, when a thought occurred to her — something she could do to alleviate her guilt a little. “Would you like me to ask one of the guards?” she said. “I can’t promise anything, but some of them seem friendly enough. And it can’t get either of you into trouble by association if it’s me asking.”\n\nJoanna turned to look at her with wide eyes. “Would you?”\n\n“Of course! Otherwise, I wouldn’t have offered to!”\n\n“Thank you!” The woman flung her arms around Madeline, damp blonde hair flying over Madeline’s face. “Thank you so much!”\n\nWhen Joanna had finally stopped hugging her, Ben gave her a quick nod. “Yeah. Thanks.”\n\n“Don’t mention it,” she said as she pushed herself up. She left them with a final tight smile before hurrying back to Billie.\n\n---\n\n***Author's Note:*** *Next chapter due on 31st March*", "**Welcome to the Short Stories!** This is an automated message.   \n\nThe rules can be found on the sidebar [here]( https://www.reddit.com/r/ShortStories/about/sidebar).\n\n**Writers** - Stories which have been checked for simple mistakes and are properly formatted, tend to get a lot more people reading them. Common issues include - \n\n* Formatting can get lost when pasting from elsewhere.  \n* Adding spaces at the start of a paragraph gets formatted by Reddit into a hard-to-read style, due to markdown. Guide to Reddit markdown [here](https://www.reddit.com/wiki/markdown)    \n     \n**Readers** - ShortStories is a place for writers to get constructive feedback. Abuse of any kind is not tolerated.    \n     \n***  \n\nIf you see a rule breaking post or comment, then please hit the report button.           \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/shortstories) if you have any questions or concerns.*", "The bottom screw on the middle hinge of Taylor Etter’s backdoor had been missing for three weeks. The door may have squeaked ever so slightly more than usual upon opening and closing, but it was otherwise unnoticed.\n\nIt began, as it always does, with small things: the screw, a bulb in an unplugged lamp in a basement box, and a single shingle from the roof. They, and so much more, were all gone without a trace or care as Taylor went from one day to the next, unknowing that he had lost anything at all.\n\n“You’ve lost something,” the voice said.  \n\nTaylor paused behind his keyboard and peered over his shoulder.  A moment later, he continued on, scrolling through the day’s news and short videos of strangers dancing on the screen.  \n\n“Another one!” the voice called. “Gone!”  \n\nHe stopped. Taylor x-ed out several windows and scanned the room with his eyebrows scrunched.  \n\n“Hello.?” he said and asked. He looked left then right then over the broad oak desk in front of him. His phone was on silent, and the Bluetooth speaker was not connected. There was nothing on the desk except a stack of disordered papers, 3 pens (one without a cap), his medicine, and a few trinkets on a shelf that was meant to house the mess.  \n\n“Is someone there?” he asked to nobody and nothing. “I have a gun.”  \n\nHe did not.  \n\nTaylor removed the lid from his medicine and pressed the bottle to his lips before swallowing deep. The coffee he had poured with optimism was cooling on the kitchen counter beside a toasted muffin he would later throw into the trash.  \n\n“Just me,” the voice said.  \n\nTaylor’s eyes darted toward the shelf and he nearly fell to the ground as he stood. He ran his fingers over the contents of the shelf: a clay pawprint of his dog who had passed, a lucky cat sculpture he had picked up some years ago in Chinatown that did not work, and green porcelain from he had had since dating Katie back in college.  \n\n“But, even I’ll be gone so-oo-oooon!” the frog said.  \n\nTaylor laughed and shook his head as he picked up the porcelain figure. His expression was of someone losing everything without knowing and unlike any other man discovering a talking figure of a frog.  \n\n“That was you, Bibby”? he asked to the figurine and smiled. The medicine was kicking in but he still took another dose. He closed his fist around the frog and felt the muffled voice humming on his hand. “I won’t lose you.”  \n\nA moment later, he was laid back in the chair, his hand still tight but his lower lip beginning to drop as his eyes became heavy and he dozed off into sleep.  \n\nHe awoke around 7PM that evening with his stomach growling and his back aching. Taylor place the frog back on its shelf then carried his medicine towards his bedroom, walking by one curtain missing on the foyer’s window, over a several floorboards no longer nailed down to the joist, and a plastic house plant sitting on his nightstand with only five leaves remaining.  \n\nTaylor took his medicine instead of food, and he was asleep again within the hour.  \n\nWhen he awoke the next morning, a cool breeze was flowing through his room over his day-old clothes and a spilt bottle of medicine at his side. He stood and sauntered towards the window and reached to pull it shut; but the frame was fully down already and the lock was latched.  \n\nHe reached his palm out flat to touch the glass but found, to his surprise, that his hand was now outside. The pane of glass was gone. Quickly, he craned his neck out through the window and peered down at the ground below. There was no sign of the pane, and the window’s frame did not seem damaged.  \n\nThe next step had begun.  \n\nThe little things like screws and nails were only noticed by keen eyes when they went missing; but anyone with a pulse was aware when the bigger parts started to go. Taylor ran from the window to his desk, where he picked the frog up from its side as he sat down.  \n\nOh! A dose!   \n\nHe had nearly forgotten.  \n\nWith the medicine burning down his throat, he squinted at the frog. He had read that hearing voices was a side effect, but thought that only occurred in patients who had stopped taking their medication. He may have read that wrong or perhaps forgotten other details, two other side effects that he ironically remembered.  \n\n“It’s cold in here,” the frog said.  \n\nTaylor nodded as if an old friend had simply commented on the weather.  \n\nAnother dose.  \n\n“I sure hope we don’t lose the furnace before Spring.”  \n\n“Ho-wha-who,” Taylor muttered. “Who is taking these things? What are they taking?”  \n\n“No one’s taking anything,” the frog said.  \n\n“You said I lost something.”  \n\n“Yes.”  \n\n“Then, who took it?”  \n\n“No one.”  \n\n“Then, I haven’t lost it.”  \n\n“You did.”  \n\nTaylor clenched both fists until his knuckles turned to white. His face was red, and his leg was shaking while the frog remained green and motionless the way a figurine of a frog should be. “I don’t understand.”  \n\n“The chain on the front door is gone,” the frog said.  \n\nTaylor leaned back in his chair and looked down the hall. The deadbolt was locked, but sure enough the chain above it was missing with only a rectangle of faded paint sitting in its place.  \n\n“Who took it?” he asked. “Who takes a chain, or a, or a, a god damn window?”  \n\n“No need to swear,” the frog said quietly. “No one took anything.”  \n\n“Well, I don’t have a god damn window or a chain or whatever else is gone,” Taylor rebutted. “So someone must’ve took it.”  \n\nHe was angry.  \n\nTaylor talked to himself as he reached towards the capless bottle on the desk and lifted it with hands shaking. A moment later, he wasn’t worried about the talking frog or the morning breeze inside or the bathroom faucet he did not even know was missing. He leaned back and laughed.  \n\n“Goodnight,” the frog said.  \n\nDespite the chaos around him, Taylor did not dream. He slept seemingly deep in darkness devoid of speaking trinkets and disappearing windows, seeing only black until he sat up and shook an empty bottle.  \n\nHe went out for a refill and came back to a front stoop without a welcome mat and a living room couch with one throw pillow without its partner.  \n\nAnother dose, another sleep, and it was morning once again.  \n\nThe next day went the same as the one before and the two or three that followed. He awoke, he took his medicine, he talked to a frog that sometimes talked back and sometimes made him laugh (but sometimes made him very angry), and he went to sleep. Each day, the missing pieces became more prominent: a vase he had inherited when his grandmother passed, a door to the far-left kitchen cabinet, and two paddles from the ceiling fan above his bed.  \n\nFor so long, Taylor had been living his life the way one watches grass grow: nothing was happening, but something was happening; and he often wondered if he would even know when whatever was happening had stopped.  \n\nIt was for this reason Taylor remained relatively unfazed. That is, until one morning he was sleeping across three barren joists.  \n\n“Where did the floor go?” he asked.  \n\nHe took a dose and walked carefully over the missing boards until he reached his desk.  \n\nAs he picked up the frog, a single drop of rain splatted against its shiny green head. Taylor looked up and saw a gray sky where his roof had been. He held the figure to his chest as he turned in a circle. Two walls were gone but for their studs, and the floor looked more like a window to the basement beneath.  \n\nHe noticed that his desk was bare as well, but that cat had never been lucky anyways.  \n\n“It’s all gone,” he said.  \n\n“I told you,” the frog ribbited in reply.  \n\n“You didn’t.”  \n\n“I did,” it said. “We all did.”  \n\nTaylor tiptoed over the few floorboards that remained towards a telephone that was no longer there.  \n\n“I’m calling the police. I’ll kill whoever did this.”  \n\n“I wouldn’t do that,” the frog said.  \n\n“Why?” Taylor asked. “They took.”  \n\n“Because then I’d be alone,” the frog interrupted.  \n\nTaylor paused. He went down to his knees to crawl the last few feet to the kitchen with the frog in one hand and a bottle cradled in the other arm. The tile there, though missing in patches, was still a solid surface with the subfloor showing underneath.  \n\n“I did this?”  \n\nThe frog said nothing, in a more important way than an inanimate object does.  \n\nThe rain was falling steady in his office now, and the wind was blowing through the walls. “I’ve lost it all,” he said. He looked down at the frog and said “I’m sorry,” apologizing to everything and everyone that he had lost at once. He nearly took another dose of medicine, but feared he’d fall asleep and wake up on or below the dirt beneath his home.  \n\n“It’s not too late,” the frog said.  \n\nTaylor turned the bottle over in his hand. There were warnings for pregnant women and for anyone operating a machine or under the age of 21. There was no caution of its cunning and baffling power for a man like him.  \n\nHe turned the bottle upside down, and the alcohol poured out mixing in a confluence with the rain. As the last few drops of whiskey fell, he heard a faint clink of metal against the tile.  \n\nTaylor looked at the frog and then around, ashamed of the damage done but hopeful for for what remained and could still be found. The frog was silent the way it should be, The wind blew outside where it belonged, and the puddle at his feet slowly began to dry.  \n\nWith shaking fingers, he picked up a small brass screw that belonged to the middle hinge of a backdoor that was long-gone.  \n\nIt began, as it always does, with small things.", "**Welcome to the Short Stories!** This is an automated message.   \n\nThe rules can be found on the sidebar [here]( https://www.reddit.com/r/ShortStories/about/sidebar).\n\n**Writers** - Stories which have been checked for simple mistakes and are properly formatted, tend to get a lot more people reading them. Common issues include - \n\n* Formatting can get lost when pasting from elsewhere.  \n* Adding spaces at the start of a paragraph gets formatted by Reddit into a hard-to-read style, due to markdown. Guide to Reddit markdown [here](https://www.reddit.com/wiki/markdown)    \n     \n**Readers** - ShortStories is a place for writers to get constructive feedback. Abuse of any kind is not tolerated.    \n     \n***  \n\nIf you see a rule breaking post or comment, then please hit the report button.           \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/shortstories) if you have any questions or concerns.*", "“It just never occurred to me that he would do that.”\r  \n\r  \n“It never occurred to you?”\r  \n\r  \n“Yes, I know it sounds strange now. It sounds strange to say it,” he said with a stilted laughed. “Of course he would do it, how could I not expect it? It’s the one thing you ought to expect from a scorpion.”\r  \n\r  \n“Yes, so why would not it occur to you? That is, after all, what scorpions do—”\r  \n\r  \n“I know, I know. Trust me I know! And everybody has reminded me since. He was the first one to do so: ‘I could not help myself, it is my nature,’ he said as he smiled, and we began to sink into the river.”\r  \n\r  \n“But how—,” the young lady in blue scrubs and with a stethoscope around her thick neck began again.\r  \n\r  \n“Look, you can’t explain what doesn’t occur to you. Does it occur to you right now that the capital of Kentucky is Lexington? No. Does it occur to you that these hospitals walls could have been blue instead of white? Of course not!” She looked around at the walls. She never noticed they were white. She saw the news on the TV across from the patient. What’s that all about, her mind drifted.\r  \n\r  \nHe continued, “There are infinite things that don’t occur to all of us, all the time. Why should they? How can you account for things you never think of? It’s impossible, it is like explaining why the color red is red—it just is; or, explaining how you forgot to buy milk at the store—you just forget, it’s not like it’s a conscious decision to forget, if it was, it wouldn’t be a forget—I mean, a forgetful—no, a forgot.” He paused. “What is a memory called that doesn’t return?” His mind splashed around, diving into the muddy waters of the subconscious, trying to come back with the right word. “I’m sorry, I think the venom is still reflecting me, I’m strungling,” he caught himself, and slowly pronounced each syllable, “strung—ling—to get the words.”\r  \n\r  \n“Well, you are lucky to be alive, you were under water for a long time,” she said, “but it will be a long path to full recovery, if it’s even possible. The doctor says you may never,” she paused and then the door swung open.\r  \n\r  \n“That’ll be enough, Nurse,” said the Doctor. The nursed stepped to the back of the room, underneath the TV. The doctor told foggy-minded-frog that the venom was all out, it was the Caeliferexa pills that were causing him to feel groggy. He also told him that he may never leap again—he was submerged for so long that some neurological functions were incapacitated, possibly permanently. “We have a great rehabilitation team here, you are in good hands. If you have to suffer from this tragedy, this is the place you’ll want to be. And we’ve got a great snack bar here too,” he said with a big smile. The lighthearted statement sank deep into air, and the nurse tried to make an intervention to resuscitate the conversation. \r  \n“Just be glad you’re not one of those guys,” she said pointing to the TV above her head. The frog, lying in bed, looked up at the cable news show and saw the naval vessel underway. There were hundreds of sailors and soldiers standing on the deck and saluting as the ship pulled out of port. \r  \n\r  \n“They said it’s an amphib ship, going to Port Aqrab.” \r  \n\r  \n“Port Aqrab?” he squinted his eyes, “the Californixa must really be kicking in.” She laughed.\r  \n\r  \n“Yes, Aqrab. But the Admiral said there won’t be boots on the ground. It’s just a humanitarian mission.” \r  \n“No boots? What if—” His mind ran deep, looking for the right phrase. But before he could come up with it, the Admiral came on the screen and issued a statement saying that it was in fact simply a mission to deliver supplies to the Aqrabi people, and that it was not a combat operation. He emphasized there would be no combat troops in the area.\r  \n\r  \nThe newsman asked a question, “Do you anticipate that the Aqabi will try to fire on them—on the operation?”\r  \n\r  \nThe Admiral replied, “Look, I mean, that’s certainly a risk, again, but if the Aqabi truly does care about their population, then again, one would hope that this international mission to deliver aid to people who need it would be able to happen unhindered.”\r  \n\r  \nThe frog, lying in bed, with the bandages on his back picked up the remote and turned off the TV. The doctor, the nurse, the wounded frog all looked at the blank television in silence.\r \n\n“We cannot help ourselves,” said the frog. “It is our nature.”\r\n\n&#x200B;\n\n\\*\\*\\*\n\n&#x200B;\n\nFollow u/quillandtrowel at Medium or Twitter (links in bio).  \n", "**Welcome to the Short Stories!** This is an automated message.   \n\nThe rules can be found on the sidebar [here]( https://www.reddit.com/r/ShortStories/about/sidebar).\n\n**Writers** - Stories which have been checked for simple mistakes and are properly formatted, tend to get a lot more people reading them. Common issues include - \n\n* Formatting can get lost when pasting from elsewhere.  \n* Adding spaces at the start of a paragraph gets formatted by Reddit into a hard-to-read style, due to markdown. Guide to Reddit markdown [here](https://www.reddit.com/wiki/markdown)    \n     \n**Readers** - ShortStories is a place for writers to get constructive feedback. Abuse of any kind is not tolerated.    \n     \n***  \n\nIf you see a rule breaking post or comment, then please hit the report button.           \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/shortstories) if you have any questions or concerns.*", "\"The locals call it Ilhóma.\"  \n\"What does that mean?\", asked Jen curiosely. As he only got a shrug as an answer, he turned to the translator.  \n\"Shaper, processor, blacksmith\", Jen read aloud to his colleague. Min turned around, still deep in thought. \"The mountain is about 3300 metres high\", he continued absent-minded. \"When men and women of the tribe turn 20 planet-years old, they must climb to the summit.\"  \n\"As a ritual to end their childhood?\", Jen further inquired. The constant digging for answers from his colleague was slowly getting on his nerves.\n\nMin shook his head. \"It's more of the start to adulthood than the end of their childhood.\"  \nJen lifted an eyebrow. This differentiation seemed rather redundant.  \nMin noticed his scepticism. \"Climbing such a summit without modern gear... changes you\", he explained. \"And this tradition seems to go back millennia. There are frescoes, glyphs, small huts left by previous climbers... This mountain is shaped by the people as much as it shapes the people. Can you imagine, what it is like to seek shelter in a small cave, which has maybe housed thousands of your ancestors? Which were all on the same journey as you are right now?\"\n\nJen shook his head. Such deep connection to the past seemed nearly impossible to him.  \n\"Me neither. Climbing this mountain must equate to walking through the entire history of mankind.\"\n\nMin lifted his bag of tools. \"Come. Lets get back to the ship, before it gets dark. And trust me: You don't want to be outside in the dark on this planet.\"\n\nThe indigenous people spotted the researchers, before they saw them. Chatter and laughter surfaced next to Jen in the thick undergroth. He smiled and shook his head. Their senses were incredible, just as their speed, with which they moved silently through the woods.  \n*They must be artificially enhanced,* thought Jen once again. He has brought up his theory, but it was immediately slapped down. All indications point toward a natural evolution.  \n*Probably for the better.* Jens thoughts turned dark, whenever his mind wandered to Saignan. And what the Federation ordered them to do, when they discovered the origins of the Gja´sa...\n\nThe small village slowly came in sight. It's green and brown huts were a crass contrast to the bright white of the shuttle, which has landed right in the middle of the central square.  \n\"Are you sure, that it was a good idea to land in the middle of their village?\", murmured Jen to his colleague. Min grinned.   \n\"Well, think of it this way: Would you like to have strange visitors arrive out of sight or somewhere, where you can have an eye on them and their strange craft?\"  \n\"Fair point\", replied Jen and turned around. He still hasn't seen any of the children, which have  accompanied them for the last hour.   \n\"Them and us may have been in contact for quite a while now, but it is better to be safe than sorry\", continued Min. He jumped over a small creek, but all out of a sudden, froze. \"Wait\", he whispered. Jen immediately stopped in his tracks.  \nMin slowly raised his hands, but a sharp snap stopped him. Jen gasped for air. An arrow has appeared in his colleagues left thigh.  \nMin looked down. \"Well, fuck.\", he calmly said, before all hell broke loose.", "**Welcome to the Short Stories!** This is an automated message.   \n\nThe rules can be found on the sidebar [here]( https://www.reddit.com/r/ShortStories/about/sidebar).\n\n**Writers** - Stories which have been checked for simple mistakes and are properly formatted, tend to get a lot more people reading them. Common issues include - \n\n* Formatting can get lost when pasting from elsewhere.  \n* Adding spaces at the start of a paragraph gets formatted by Reddit into a hard-to-read style, due to markdown. Guide to Reddit markdown [here](https://www.reddit.com/wiki/markdown)    \n     \n**Readers** - ShortStories is a place for writers to get constructive feedback. Abuse of any kind is not tolerated.    \n     \n***  \n\nIf you see a rule breaking post or comment, then please hit the report button.           \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/shortstories) if you have any questions or concerns.*", "Freefall  \nA Short Story By Sargon Promethium  \n\n\nThe only sense that the Man had when he was loaded onto the helicopter was his touch, feeling the cool air assaulting his freshly battered skin. Perhaps it was the ending Spring air, that always had a little nip of coolness that signified its end, or maybe it was the beginning Summer air, coupled with the air picking up the cold ocean current along the coast. He didn’t know how long he was there, so he couldn’t be certain of the true season, just certain of the fact that this was his last season. Before the ride, he was stripped down to his undergarments, a humiliating ordeal that the guards took great pleasure in, blindfolded, gagged, and deafened by earmuffs, hearing only the slight whirl of the helicopter blades. Now, sitting on the floor of the cabin, he remained like a statue, being unable to ascertain his true surroundings, who was around him, what they were saying, if they even felt a tinge of remorse for their actions. As he felt the helicopter begin to ascend, it brought the Man back to a similar time of hopelessness, on the farm.   \n\n\nGrowing up, the Man lived on a farm not owned by his parents, but rather the head of a foreign fruit company that laid their claim on his land with the help of the Regime. They, along with the rest of the workers, lived in measly shacks on the outskirts of the property, exposed to the elements throughout the year with the poor design and materials of their homes. In their hobble, lay the Man, his parents, and his younger brother. Everyday was the same, with them toiling away at the fields, at the expense of their lifespans, with people keeling over on a regular basis, only to be immediately replaced. The Man had eventually grown to at least tolerate his conditions, being at the servitude of this unknown giant that controlled them all, but his Brother, he couldn’t handle it as well, It could’ve been the lesser years of work he had compared to the Man, but either way, he didn’t possess what everyone else had. Instead, he possessed something far greater.  \nFrom an early age, the Brother showed signs of high intelligence, teaching himself how to read and examine books that were snuck from the Owner’s house by age 8. Being the only literate family member, he led his family and eventually other households through Bible studies, being the only thing that some families owned. The family’s combined salary was miserable, however, whatever they could save went to the Brother’s education. Everyone knew that the Brother had to take advantage of this, including the Man, who personally pushed his Brother to be the best he could be. Eventually, the family was able to put the Brother through school with what little they had. While in school later than most, the Brother’s intellect allowed him to skip several grades, and soon, graduated into High School, and a few years after that, was on his way to the College.  \nEveryone cheered for the Brother when he got accepted. He hoped to complete College and finally go to Law School, in hopes of becoming a lawyer that could change the very system that had to endure for decades. By this point he had won numerous scholarships, and was able to send some money back to the family. Now with one son gone, the parents turnt to the Man. They knew he was good with his hands, so he began working for the local mechanic, gaining a reputation for his honest work ethic. This helped when, one day, a young woman about his age entered the garage for a broken headlight, after a large bird had flown into it while driving. After repairing the light, and talking with her for almost an hour, the Man mustered up the courage to ask her on a date, to which she agreed. Four years later, the two had wed, and soon after, had a baby girl. Since then, even up to that day, he thanked the birds for bringing him such a wonderful person to love.  \nDuring this span of time, the Brother had also made a name for himself, but rather a nationwide name. He quickly went through College and Law School and made a career against corrupt government officials, even going as far as the Inner Circle of the Head of State, getting many thanks from the Head himself. After a few more major cases, he soon turned his eyes to politics, running for his home district in the Legislative Assembly, and winning with a wide majority of votes. Now, both boys had brought the family great pride and joy, with one carrying on the legacy, and the other hopefully shaping their very nation.   \nFor two years, it is how it remained, until one day, the Brother visited the Man at work. The Man, by this point, owned the garage, as the old owner passed away a few weeks prior. The Brother asked the Man if he had heard of the recent attacks on some military barracks, which he did. He thought perhaps the Brother was building a case against them, maybe taking it to the Supreme Court. Then the Brother asked him to meet at a certain address that night, which he agreed to, despite the odd request. It took him to an old tavern in the middle of the Capital, where in its basement, he met what he called “The Club”, because that’s all that it was, and it's all he thought of it as.  \nThese men, crowded in the basement, were united together for the one goal of changing the State. It was full of the Brother’s fellow politicians, who had seen just how far changing attitudes and laws of the government can get someone in changing one’s State, and were now using brute force to meet their democratic quota. These men were the ones behind the recent attacks, and while the Man was initially apprehensive of working with who he deemed terrorists, the Brother reminded him of all that they went through, of what all their fellow countrymen have gone through under the Regime. The change has to happen now, or at least sooner than later, and sometimes people have to take immediate action to see their results. With this, the Man was the newest Club Member.  \nAt first, the Man remained in his own garage, installing discrete armour plating on some of the politician’s cars, in case they would be needed in the fight for the Capital. Eventually, the growing demands and vehicles needed proved too much and too suspicious for the small garage, so some politicians bought a remote garage away from prying government eyes. Here, the Man could work on higher end military vehicles, such as armoured trucks with large guns and even cannons installed, vehicles he had only heard of. All the while, he had his best mechanic put in charge of his garage, so as to alleviate some suspicions.   \nOne day, the Man was called to a weekly Club meeting, something he hid from his wife by saying he went out with his mechanic crew for drinks and games, hopefully not making her think of an affair or this, where it was told that the coup would occur three months from that date. Finally, a date was set in stone, and everyone, including the Man, promised to have the necessary resources ready for that date, and the Brother, who promised to try and recruit more people to the cause. After the meeting, the Brother pulled the Man aside and said that if the coup failed on that day, that the Man and his family were to meet at the Brother’s villa on the border, before escaping for a new life, a good life he reassured. These would be his final words to the Man.  \nAfter several minutes of straight travel, with no deviations, the earmuffs were removed from the Man’s head, and he heard the muffled voices of the pilots, and the heightened whirling of the blades spinning overhead.   \nA familiar voice coming from beside him yelled into the Man’s ear, so as to be heard over the helicopter, “Can you hear me, sir? Nod if you can.”  \nThe Man, with the gag still on him, nodded in compliance.  \n“Good, because I just got news that they dispatched a squad to the location you said, and they’ve just arrived.”  \nThe Man stood there, seeing nothing but darkness, and unable to say anything, unable to do anything, just like his unknowing victim. He remained there in shock, not knowing if he should break down or not.  \n“Did you hear me, I said they’re at the place.”  \nThe Man still remained still, processing how he ended up in this situation.  \n“Jesus, can you nod for me, let me know I’m not talking to a brick wall again?”  \nThe Man finally hesitated a nod, muffling a small cry of anguish.  \n“You trying to say something? I can’t tell.”  \nThe Man bowed his head down and silently sobbed, something the voice realized.  \n“Yeah, most of you do this sort of thing, at least the ones up here. Cry, pray, hell, even try to attack me. That’s why you got the gag on you now.”  \nThe Man continued sobbing, wondering of the fates of his loved ones.  \n“You know, people like you come and go, trying to disrupt the order of things, and where does it get you. Right here. You people need to realize that. No wonder you're all so easy to capture.”  \nIt was here, up to his final moments, he again thought back, this time back to the end of it all.  \nAfter the meeting adjourned, the Man returned home to his wife and daughter. After asking where he was again, and getting the same reply, they all sat down together and watched a movie, with his daughter clutching her brown teddy bear in her small arms. After the movie, and his daughter had gone to bed, he and his wife had gotten into an argument.  \n“I called the garage today, asking when I could see you to bring some lunch. You know what they said? They said you haven’t been there in weeks! And-and on top of this, you’re sneaking around, saying you're with the other mechanics, but I called around too, and guess what, you aren’t anywhere with the others. What am I supposed to make of this?” his Wife asked.  \n“I can explain this, just not yet, okay. I promise I will.” the Man replied.  \n“You promise? What am I supposed to make of this? What’s so important that you can’t tell me?”  \n“Honey, I want too, but what this is, is bigger than us, I can’t say anything.”  \n“Why not, I am your wife for heaven’s sake. We never keep secrets from each other.”  \n“This is not me trying to keep secrets. This is me trying to protect you, to protect us! I am helping to change everything, for all of us.”  \n“Well, unless you tell me exactly what’s happening, you're staying on the couch, and you can’t tell me then, then you're leaving.” His Wife then left in a huff, leaving him in the dark living room with just his thoughts. He walked out onto his front yard, and lit a cigarette. How was he going to tell them that he’s a part of an anti-government movement, would they understand? As of now, he’s just been the mechanic, but come D-Day, and he could very well become a killer, something he figured might happen, but even then against the Regime, he would regret. How would his family see him afterward? A monster? A hero? It was all too much for him, and he almost puked on the lawn, until he saw a black car slowly come around the turn towards him.  \nIt crawled along down the road, towards his house. He never thought anything of it, it was dark, and this was a crowded neighbourhood. So, he composed himself and gave a friendly wave to the driver. This caused the car to stop. Maybe they thought he was telling them to stop, the Man thought. So he walked over to them to tell them it was alright, and that’s when all the doors opened. Men in suits sprang out, one with a burlap sack in his hand, and rushed the Man. They gave him a series of punches, some to the face, and a lot to the gut, before putting the sack over his head and dragging him to the car. Some house lights began to turn on to search for the commotion, but by that time, the Man was already shoved in the back seat and the car had sped away.   \n“Who are you?” the Man asked, recovering from the hits.  \n“People looking to ask you questions.” one of the suited men replied, as the Man frantically collected his thoughts, not being able to see where he was going, only feeling a turn in the road every so often. Eventually, it came to a quick stop, with the Man hitting his head on the console, erupting the car in laughter.  \n“It’s a wonder his head never rang like a bell!” one of the back passengers boomed, opening the door and dragging the Man out. The Man could hear the distant sounds of birds chirping, singing their songs of freedom as they flew together in harmony. If only he could be one of them, the Man thought, being led into a building. Walking through its halls, he could hear the sounds of loud hits being landed, and the wails of agony echoing through. This would soon be him, but he had to remain strong. Even when they led him into a room, handcuffed him to a chair, and removed his hood, he still held fast, with a stoic look upon his face, almost challenging his oppressors. They looked at his expression, and each cracked a smile. They knew that eventually, no matter how long it took, they would break him, and get whatever they needed from him. With that, they left him in that room, for an hour, until the Inspector believed the ordeal could properly begin.  \nThe Man screamed hard for that hour, wondering when it would begin. After a while, he began wishing for it, not so much as to feel the pain, but to just get it over with. He wondered if they would kill him afterwards, or dump him at his house. Maybe they had other Club members in the other rooms, or maybe even his family. This terrified him, and his screaming eventually turned to almost begging, begging that they would harm him, and not them. He would never know, all he knows now is the haunting fluorescent lights overhead and the threat of his own demise. Finally, the suits heard his anguished cries, and called the Inspector to the room to begin the interrogation.  \nEntering the room before the Man was the Inspector, a towering, slender man that had to duck under the doorway to enter.  \n“Comfortable today, sir?” the Inspector asked, hanging up his suit and hat on a nearby rack. The Man looked at the tall figure looming before him, speechless.  \n“Sir? Gonna answer my question?” the Inspector said.  \n“Go to hell.” the Man replied, after a moment of silence, to compose his thoughts.  \nThe Inspector chuckled, “Ah, haven’t had a fighter in a while. Most of you people don’t have a backbone after all.”  Does this mean that others have talked, thought the Man, because if so, he wasn’t going to be the one to do so.  \n“You see,” the Inspector replied, sitting down at the chair across from the Man, “everyone else has talked. We know where everyone else is, at least, everyone except Brother Dearest. You do know where I’m going with this right?”  \n“I’m not telling you anything, you bastard.” the Man replied, gritting his teeth.  \n“Oh, I knew you’d be special. Finally some fun for today.\" The Inspector boomed back, getting up from his chair and walking to the coat rack, and drawing two studded gloves from his coat pocket. “I haven’t been able to use these all day, it's like reuniting with an old friend.”  \n“I told you I’m not talking, this is pointless.” the Man yelled out, as the Inspector slipped on the gloves and walked over to the Man, who began to fear what was coming.  \n“If so, there is still a reason to try. For our security. You understand that.” the Inspector answered, throwing a right hook into the Man’s cheek, leaving lacerations and loosening some teeth. He had no time to compose himself, as the Inspector landed blow after blow on his face and abdomen. All he could do was wince in pain each time, trying to still show at least some semblance of authority in this situation.  \nThe Inspector ceased the punching, and crouched down to the Man’s level, “Your brother made quite a name for himself, he got himself quite a few properties. I’m sure one of them is a safehouse, and I’m sure he told you which one it was.”  \nIn between his short breaths, the Man breathed, “Go to hell.” He was ready now for the next series of blows.  \nInstead, the Inspector got up, and said to him with a calm demeanour, removing his gloves, “You will tell us, we have our ways of opening people up. And I know what’ll open you up.” He walked over to the rack, put the gloves back in his pockets, and put back on his coat, before momentarily leaving the room.   \nWhat is he talking about, the Man thought. At one Club meeting, one of the politicians talked about the different kinds of torture that these people, the Secret Police would put you through. From beatings to waterboarding, they did it all. So the Man was left to wonder what monstrous device would be used against him. It was therefore a great shock then, when all the Inspector brought in was a teddy bear.  \nIt was his daughter’s brown teddy bear.  \n“How did you get that?” the Man frantically asked, his eyes widening.  \n“We have our ways sir. You should know that by now.” the Inspector replied, throwing the bear onto the Man’s lap, making him thrash around in anger, trying to loosen his restraints.   \n“What have you bastards done?!” the Man screamed out, as the handcuffs began to cut into his wrists, and the bear fell from his lap.  \n“Nothing yet, but that can change, unless you tell me something good.” the Inspector replied, bending down face to face with the Man, who by now was in tears. Just a few hours prior, everything was going according to plan, and now what? What was his family thinking of him now? What is happening to them now? They have to be here, the bear has a stain that the girl gave to it when she was younger. It was all too much, and he put his head down, and sobbed.  \n“The time for sorrow has sailed long ago, so it's best you tell me something now, or else.”  \nThe Man jolted his head up, yelling, “Please, no! Don’t hurt them, please!”  \n“Tell me something so I won’t have to.” the Inspector answered, watching the Man take a few deep breaths.  \n“He-he’s probably at his villa on the border.” the Man finally replied.  \n“Probably?” the Inspector inquired.  \n“Please, it's a place he told me to meet him if things went south.”  \n“So definitely?”   \n“Yes-yes definitely, okay? Please just don’t hurt them.” the Man sobbed, again lowering his head.  \nThe Inspector smiled and picked the bear up, “You’ve just done this nation a great service, and it thanks you.” before leaving the room, assumedly to get people to go to the villa. He left the Man in that interrogation room for a half hour, leaving him alone with his guilty conscience. He was still sobbing when two men came in to take him for “processing”. At club meetings, the politicians there discussed this. They had heard from rumours that after interrogations, they would “process” people by stripping them almost naked, and deprive them of their senses by blindfolding, gagging and placing earmuffs on the individual, to make them feel subhuman. From there, they would be summarily executed, but that is where some sources differed. One spoke of a basic firing squad, while another spoke of a gas chamber, and there was even talk of “death flights”, where they would take people in helicopters and ditch them overseas. This was best used to explain the lack of evidence, but it was mostly just hearsay. As the Man was loaded onto the helicopter, however, he realized it was anything but.  \n“Approaching the drop zone.” a Pilot over the intercom boomed out.  \n“Your final encore is approaching sir!” the Inspector yelled, taking the Man’s blindfold off. The sudden brightness made the Man wince, but the dark colours of the helicopter interior soon made it easy to focus. Here he was, once again, with the Inspector, and looking outside, he saw nothing but an endless floor of ocean hundreds of feet below.  \n“We’re a ways up, aren’t we? Most people have this reaction too. It’s like watching the life leave their eyes.” the Inspector boomed.  \nThe Man began hyperventilating through his nose, something the Inspector could notice, but all he did was chuckle.  \n“You know, you showed me a good time. I don’t get to do these often, but when I do, I make sure I get the special ones. So thanks for that.” the Inspector spoke, as he pressed a button by the side of the cabin door, opening it up, making the cold air whip around the interior of the helicopter.  \n“Sadly, this is where we must depart. Again, thank you for your service, sir.” the Inspector said, gripping a handle on the ceiling, and kicking the Man out of the plane, without a moment’s hesitation, or a moment for the Man to collect his thoughts.   \nHere he is now, freefalling through the air, about to hit the water at a speed he can’t even comprehend for his life. All he wanted was a better tomorrow, for him and his family, a chance at something new. Now, he won’t even have a tomorrow. The Regime has robbed him of everything, his hopes, dreams, his life, and his tomorrow. His and many others’ tomorrows, for the crime of trying to live a good life. He thought back to when he met his wife. His wife robbed that bird of its life, but thanks to that, they had a good life together. A sacrifice for the greater good. Is this how the government would view him? His brother? The countless others who died fighting for what was right? Would they view them as nothing but a bird dead from an accident? At the very least, that was an accident, what they are doing is nothing short of evil, and now, the Man would have to spend his final moments praying that everything somehow works out for whoever is left. As a flock of birds flew by his soon-to-be corpse, he began wondering not just about those left, but about heaven himself. He was told, like many before, that you meet long gone loved ones in heaven, and they greet you at the pearly gates. Up to that point, he was unsure of heaven’s existence, but now, he prayed for everything, from salvation, to forgiveness of any of his life’s transgressions. Even in his final moments, seconds before he splattered onto the ocean, he was praying above all else, for the hope that when he got to heaven, he wouldn’t see his family there. Not yet.  \nHe is just one of many, hundreds in fact, who litter the ocean floor. He is in a place where only the dead know. Even decades after, with the trials and searches that would follow, only a few would turn up, leaving the many left out there at the mercy of the ocean, and with their final chance of peace from their unfortunate demise. It is these people who have disappeared, and many more like them all across the globe, who are gone but most certainly not forgotten. For it is in their memory that mankind must strive to not just do better, but to be better, better than what we were yesterday, to strive for something greater. It is in their memory that we shall strive for a better tomorrow.  \n", "**Welcome to the Short Stories!** This is an automated message.   \n\nThe rules can be found on the sidebar [here]( https://www.reddit.com/r/ShortStories/about/sidebar).\n\n**Writers** - Stories which have been checked for simple mistakes and are properly formatted, tend to get a lot more people reading them. Common issues include - \n\n* Formatting can get lost when pasting from elsewhere.  \n* Adding spaces at the start of a paragraph gets formatted by Reddit into a hard-to-read style, due to markdown. Guide to Reddit markdown [here](https://www.reddit.com/wiki/markdown)    \n     \n**Readers** - ShortStories is a place for writers to get constructive feedback. Abuse of any kind is not tolerated.    \n     \n***  \n\nIf you see a rule breaking post or comment, then please hit the report button.           \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/shortstories) if you have any questions or concerns.*", "Have you ever wondered how magic feels?\n\nHow it must be, wielding and unknown power, that makes the hair on your neck stand up?\n\nA Power, rushing through your body, almost electrifying every single cell?\n\nI have. And I have dreamt of it. Let me show you...\n\n&#x200B;\n\n\\---------------------------------\n\n&#x200B;\n\nHi there people,  \n\r  \nmy name is Morris, I’m a (mostly dark / grimdark) fantasy writer from Germany, and I finally found the courage to start putting my craft out there. I write in english and am currently 3/4 through with my first novel and decided to write short stories that take place in the world I’ve created, leading up to the novel. It's a passion project that I started to slowly build up a following, gather feedback and critique and to simply hone my craft further. I think nowadays it's important to be connected to the people of your niche, no matter which channels one choses. It might not seem like a big step viewed from the outside, but it's huge for me. Especially since I never thought that I'll write short stories - I always had \"larger\" things in mind, but now I realize it's the small things that might even matter more. \n\nAnyway, before I'm trailing off further, let me explain briefly what I intend to do with all of that, because that's probably why you're here:\n\nThe short stories I write will be published on YouTube as free audiobooks. They might vary in length and theme, and some of them might even be linked in a way, but they'll all take place in the world I've created. The first story will be uploaded next Sunday (31.3.2024), at about 10 AM EST. Yesterday I released a short teaser for the story – a 1:40 min video that introduces the story and what I’m planning on doing on YouTube. \r  \n\r  \nAll of that is hard work and I don't use any AI. The writing, the animations, the narration, the art - it's all hand crafted and 100% made by me. I know AI is on the move, but I am very confident that work like this will never cease and people will always tend to like things that took a lot of effort to produce (if the outcome is good). Maybe you’ll have a minute or two to check it out and see if it is for you - as I said, the teaser is just barely two minutes long. I'm confident it will hook you into wanting to listen the whole story:\r  \n\r  \nhttps://youtu.be/d4nV4YI9Pag\r  \n\r  \nHere is the blurb/elevator pitch of the full story, that I will be releasing on 31.03.2024:\r  \n\r  \n\\*\\*The Curse of Sorcery\\*\\*\r  \n\n\nNine years after the shattering of the sixth prophet – a red star that had circled the earth for decades – the twelve-year-old boy Mereth awakens to telekinetic powers. Though what initially seems like a miraculous gift turns out to be a dire curse, draining and weakening him whenever he reaches out for his newfound magic. Abandoned by his father, and afraid of being hunted down by the government ruled in the capital Rhaz, Mereth decides to fight for control over his powers, hoping to escape a destiny he has never asked for.\r  \n\r  \nThank you so much for your time!\r  \n\r  \nMorris", "**Welcome to the Short Stories!** This is an automated message.   \n\nThe rules can be found on the sidebar [here]( https://www.reddit.com/r/ShortStories/about/sidebar).\n\n**Writers** - Stories which have been checked for simple mistakes and are properly formatted, tend to get a lot more people reading them. Common issues include - \n\n* Formatting can get lost when pasting from elsewhere.  \n* Adding spaces at the start of a paragraph gets formatted by Reddit into a hard-to-read style, due to markdown. Guide to Reddit markdown [here](https://www.reddit.com/wiki/markdown)    \n     \n**Readers** - ShortStories is a place for writers to get constructive feedback. Abuse of any kind is not tolerated.    \n     \n***  \n\nIf you see a rule breaking post or comment, then please hit the report button.           \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/shortstories) if you have any questions or concerns.*", "For most of my life I wasn’t a believer in divine intervention or anything divine, to be honest. When the question of existence occasionally came to my mind I just convinced myself that even if there is an answer, it’s not worth finding.\r  \n\r  \nThat is, until on my thirteenth birthday I was given a Casio keyboard by my parents. Who for the eleventh year in a row thought they’ve struck gold and finally found a thing I have a talent for. \r  \n\r  \n“This one has 400 sounds in it”, my mom said, very proudly, as if it would convince me to learn the instrument. I said my ingenuine thanks and threw the box in the closet, thinking it would stay there.\r  \n\r  \nThe same night I was kept awake by a terrible, terrible fever. Too weak to move or to call for help, I was lying in a puddle of my own sweat. At first I tried closing my eyes and forcing myself to go to sleep, but after what felt like hours, I gave up. I started feeling an immense pressure on my chest, when I noticed a square shaped shadow looming over me. Throughout the entire episode, I had this melody stuck in my head, not of any song I could think of. It played on repeat and no matter how hard I tried I could not silence my mind or make it play any other song. At sunrise my pain ceased.\r  \n\r  \nAt first I chalked it up to a virus. And after the second night of torment I told my parents of my episodes. We went to check with the doctor, who ran all the tests and couldn’t find anything wrong with me. By the fourth night I figured it wasn’t a sickness of the body but a sickness of the mind. \r  \n\r  \nOn the seventh night I realized it was not a sickness of the mind, but a blessing from above. My episode started as usual, intense fever and sweat. Except this time rather than driving me mad the same melody spoke to me deeply. I found the simple lick very profound and beautiful. I realized it carries a message in the form of words, which I was able to decipher. \r  \n\r  \n\"הָכֵן נָא אַלְבּוֹם מוּזִיקָה, וְהוֹצִיאוּ לֹא מְאֻחָר מִיָּ\"ד בַּאֲדָר ב' תשפ\"ד\".\r  \n\r  \n(Make a music album, and release it no later than the 14th of Adar II, 5784)\r  \n\r  \nThe next morning I unpacked my casio keyboard and started educating myself. I learned all about music theory, composition, sound design, mixing etc. I began listening to all the classic acts: Rolling Stones, Beatles, David Bowie, Nirvana. After a few days, when I felt ready, I opened up my Digital Audio Workstation and started laying some tracks. I made sure every little detail is right. I chose the right snare sample, adjusted the knobs on the reverb effect until I got the perfect tone. I listened to what I have made and was pretty impressed by my own abilities. Yet I couldn’t help but ask myself, is my music good enough for God?\r  \n\r  \nThe episodes did not stop, although my suffering has. Each night different melodies were played that helped me better understand my mission. Essentially, rock and roll has been killed by big, satanic corporations, as an act of defiance to God. And good music simply ceased to exist after the year 2000. The music kids listen to these days not only lacks in harmonic and lyrical depth, but is also blasphemous. My job is to make the greatest music album of the 21st century. Which will serve as a piece of art but also a test for the human race. While those in charge of big corporations and pop stars such as Taylor Swift and Drake will be doomed to burn for eternity. The average human will be given a choice between heaven and hell. By listening to my album, you choose heaven. The 14th of Adar II will be the day of judgment.\r  \n\r  \nAnd after a few weeks of hard work my album was ready. The most ambitious rock opera, consisting of 12 songs that feature my keyboard playing and vocals. With deep lyrical content that surely will convert anyone to an appreciator of REAL rock and roll music. Fittingly entitled “THE BEST ALBUM”. I designed a beautiful album cover in my computer’s paint program, submitted my music into every possible streaming service. And now all left to do was to wait for the day of judgment. And despite God's reassurance I will admit the wait was anxious.\r  \n\r  \nOn release date at midnight, I did not go to sleep. I had the streaming statistics open on one tab, and the Billboard Hot 100 on the other. At 1am no stats had changed and my album was nowhere to be found on the Billboard. At 2am there was still no change, 0 listeners and 0 streams. At 3am I decided to send my music to my few friends and relatives, by 4am I was posting to every internet forum I could find.\r  \n\r  \n“I IMPLORE YOU TO LISTEN. YOUR FAITH DEPENDS ON THIS ALBUM”. I made sure to make my messages very urgent. But at the best case my posts would get ignored, at the worst case I would be made fun of by the damned internet trolls.\r  \n\r  \nAfter hours, I got a comment that made me realize something.\r  \n\r  \n“This shit sucks, LMAO”.\r  \n\r  \nJudgment has been done. \r  \n\r\r  \nI tried my best, I really did. I do not understand where I failed, but I did, and for that I will be punished in hell. \r  \n\r  \nAnd YOU should feel guilty too. YOU let the devil into your home, YOU watched from the side and cheered as Rock and Roll was being SLAUGHTERED by big corporation and Taylor Swift. YOU sang along to the devil’s music, therefore you are complicit too and will burn in hell for that. \r", "**Welcome to the Short Stories!** This is an automated message.   \n\nThe rules can be found on the sidebar [here]( https://www.reddit.com/r/ShortStories/about/sidebar).\n\n**Writers** - Stories which have been checked for simple mistakes and are properly formatted, tend to get a lot more people reading them. Common issues include - \n\n* Formatting can get lost when pasting from elsewhere.  \n* Adding spaces at the start of a paragraph gets formatted by Reddit into a hard-to-read style, due to markdown. Guide to Reddit markdown [here](https://www.reddit.com/wiki/markdown)    \n     \n**Readers** - ShortStories is a place for writers to get constructive feedback. Abuse of any kind is not tolerated.    \n     \n***  \n\nIf you see a rule breaking post or comment, then please hit the report button.           \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/shortstories) if you have any questions or concerns.*", "Riley was speeding down the highway with a bottle in his hand and a gun in his waist. After months of careful thought and consideration, he was going to kill his mother. \n\nRiley had been locked in an acrimonious custody battle with his mom, Savvy, over her second son, his kid brother, Eli. It had been three years, three more than he’d seen her at any other point in his 27 year long life, and he was done playing her games. \n\nThat night his lawyer told him it was no longer about trying to win custody for Riley but trying to decide who he would want Eli to go to in the event it must be someone else. And that was the best case scenario. \n\nHe would gladly rot in prison if it meant she’d rot in the grave. Anything to keep Eli out of her hands. This way he’d at least go to a relative, or even Riley’s girlfriend, Peyton. They were practically married by now, anyways. She was more of a mother to Eli than Savvy would ever be. \n\nRiley left Peyton and Eli sleeping in their trailer in Driscoll, Indiana. A pin drop farm town with more cows than people. On the way out, he slammed a couple shots to get his nerve up. He’d never fired his gun before. \n\nHe was three miles from the extended stay motel Savvy was camping out in for the duration of the court proceedings when he passed the speed trap. More like blew past it. 68 in a 25. The cops almost had trouble catching up to him. By that time he was in Kelly, the adjacent town, a little larger and a lot dirtier. \n\nRiley almost didn’t stop but instinct took over so he jerked it to the shoulder when he saw the lights. A curly red-headed cop tapped on the window. “Alright kid. Shut the engine off, license and registration.” Riley produced them wordlessly, without eye contact. “You were driving erratically. Have you had anything to drink tonight?” Riley shook his head, no. “How about a verbal response, kid?” The officer said, not really asking. \n\n“Nothing,” Riley insisted, still keeping his gaze locked straight ahead. The lines had worn almost clear off the highway. At this hour, only long-haul trucks occasionally whizzed past. “That’s not what it smells like. I would appreciate if you’d step out real quick.” Riley shook his head again. He was at a loss. It was against every ounce of self preservation he had to disobey the police. The only thing that could override his own survival instinct was that of his protective instinct for family. \n\n“Can’t hear you son. I need a verbal response.” “No. Can’t do that. Won’t.” On the outside he was stoney.  Inside, he was quivering, guts down by his shoes. “You are being detained as part of an OWI investigation. I am issuing you a lawful order to step out of your vehicle.” Riley white-knuckled the wheel. He considered throwing it into drive, flooring it, and taking his chances. But he knew his truck was on its last legs at typical speed. It wouldn’t survive, let alone win, a chase. Before he could think of an alternative he heard— “Firearm, passenger side floor!” \n\nAs quickly as the officer spotted it, he pulled his own. “Step out of the vehicle now son or I will take you out. Clear?” Riley was stuck still. The cop’s partner had leapt out of the cruiser and appeared at Riley’s side window by then. A tall, older Kenyan man with a lapel-full of awards and a nameplate “Ofc. Kibeta”. He peered in the window to assess the situation. Looked at his partner. And noiselessly signaled to turn their body cameras off. \n\nThe red haired officer eyed his partner skeptically as the tape stopped rolling. “McCartney, you do a plate check on this guy already?” Kibeta, the older officer, asked. “Yeah,” his partner replied. “Let me see it.” “Why?” Kibeta led McCartney away from the window. \n\nThey took cover behind their car and spoke in hushed tones. “That’s Trevor’s… something. Brother, maybe? I’m not sure.” Kibeta explained. “Can’t be, they don’t got the same last name.” McCartney contested. “It’s a complicated family. I’m sure that’s him. Trev used to bring him by a few times, try to scare him straight.” “God damn it.” “It is what it is. Put a speed strip down in case he gets crazy, otherwise just wait.” The red haired cop did as his partner asked and threw a row of spikes in front of Riley’s truck so he could not drive away on impulse. Meanwhile, Kibeta ran his fingers through what remained of his hair and called Trevor, their Lieutenant. \n\nTrevor and Riley were cousins. On some days they were brothers. On some days here and there, more like father and son. On many more, sworn enemies, at least from where Riley sat. Trevor was about a decade older than Riley. When he was enlisting for his second tour with the Marines, Riley was getting his first face tattoo. \n\nTrevor had tried everything he could think of to bring Riley over to his school of thought. He’d tried relating to him and being his friend. He’d tried overachieving and being a role model. He’d tried limitless compassion. He’d tried bribes. He’d tried empty threats. He’d tried making good on the threats, mentally and physically. Even though Riley was bigger and taller, he was easy enough to punish. It’s all he’d ever known. \n\nWhen a child entered the picture, Trevor was done guessing. He didn’t agree with a single thing Riley did about Eli and had largely distanced himself as a result. Although Riley didn’t agree with a single thing Trevor did about his kids, these last few years were when his advice would’ve been the most warmly welcomed. Sure, he had Peyton and his grandmother as co-parents, but that wasn’t the same resource as another man, one with a few years’ experience. More than once Riley had been sat awake at 4:00am falling apart over a picky eating phase or a call home from the school, wishing more than anything that he could text Trevor to ask “Is this normal?” Even if he knew he wouldn’t actually take any of the advice. \n\nHe half knew these guys were calling Trevor. He half hoped he wouldn’t come. Jail, or even prison, felt easier than letting Trevor see him like this. Or worse, having to ask for his help to get out of it. \n\nTen minutes didn’t pass between Trevor getting the call and his stepping foot on scene. He didn’t walk over right away. He sized up the officers first. He and Kibeta went way back, but McCartney was a rookie. He wasn’t sure if the kid was a real cop yet or still trying to shoot a sequel to Serpico. \n\n“How far’d you get?” Trevor asked, joining them at their vehicle. “I recognized him in time.” “I owe you, brother.” Trevor side-hugged Kibeta. “He’s going through it right now. He’s in a custody battle with his mom, it’s a mess.” Trevor explained, half sheepishly, in light of the circumstances. “I know that trip. She a dementia patient?” McCartney asked. “No, no, like he’s trying to get custody of a kid instead of her getting the kid.” “He had a kid with his mother?!” The rookie whispered to Kibeta. “I told you. Complicated family.” He mouthed back. \n\nBy this time Trevor had wandered off, pacing, strategizing. He returned with a plan, cleared through his CO, who’d known Riley since before he had any tattoos let alone the ones on his face. “Fellas here’s the plan,” Trevor explained. “Take him to the station. Not central, he’s not getting booked in, just drive him—“ “What are we, chauffeurs now?” McCartney interjected. “Hey!” Kibeta admonished him. “You’re shut up when the Lieutenant’s talking, that’s what you are.” Kibeta nodded at him to continue. He pressed on. “Rip him a fat traffic citation. I’ll leave his truck where his girl can find it. But nothing else. The kid’s life hangs in the balance of this custody case and as much as I’d like to see this dickhead get what’s coming his way, not at the expense of his kid. Drive him down. I’ll handle it. Trust me. By the time I’m done, he’ll wish it was jail.” \n\nEven Trevor’s old friend wasn’t letting the exclamation point on the end of this sentence slip past. “Trev. The piece.” “What about it?” “Yeah. What about it?” “Look, he’s a licensed carry. I wouldn’t have issued him a license to drive, let alone this, but I don’t agree with plenty of things the state does, so, here we are.” Kibeta cared more about his friendship with Trevor than nailing Riley and McCartney cared too much about getting his career off the ground than to risk aggravating his Lieutenant, so they moved on. “What if he won’t get out. How far can we take it?” McCartney asked, resigning himself to the situation. “He’ll obey lawful orders.” “I wouldn’t bet the farm on that,” the rookie cautioned. \n\nTrevor marched up to the side of the car, his first interaction with Riley in several months let alone that night, and pounded on the window with his fist. “*Get. Out*.” He said in the quiet tone that’s louder than a raised voice. \n\nRiley got out. Now being so cautious he did not even move his hands to sweep his long hair out of his eyes. The officers yanked him away, more forcefully than was necessary. The ride to the station was silent. \n\nRiley could tell from the route they were taking that he was on his way to the station, not booking. He knew both destinations well enough from all his misdemeanor trips in his younger days. But since fostering Eli, he didn’t even park illegally. Nothing that could be used against him in court. \n\nNow, he wasn’t sure if this detour was good or bad. Either Trevor was stepping up to save him, or he just wanted ten minutes alone to wail on him for being a fuck-up and putting his name out there in the process. \n\nOnce, when Riley was barely 16, he’d gotten popped for underaged drinking and curfew. Trevor had already given him a few breaks. This was before Trevor had given up on him ever going to college, or enlisting, or maybe both, so he was protecting Riley’s record like a daughter’s virginity. When all Riley’s other friends were carted off in groups in squad cars going one way, he was alone in a cruiser going another. \n\nWhen he pulled up at the station that time, Trevor was waiting. He took him in back and gave him a choice: Go to central, get booked in, have a criminal record, and need to ask his grandma to bail him out — or take three minutes of whatever Trevor could throw at him, no self-defense, no striking back. \n\nHe figured nothing Trevor had could sting worse than calling his grandmother from jail would. And not only because she might turn around and give him more than three minutes if she found out. He had a short speech about how if Riley had learned to fear consequences from an earlier age, he wouldn’t be in the predicament he was in then, and how he was just trying to correct him, not really hurt him. That all went in one ear and out the other when Riley realized, at the end, that he’d lost a tooth. \n\nJust about the only positive that came of the event was that Trevor’s coworkers realized he was serious about not getting family off for shits-and-giggles. People called Trevor a lot of things through the years but, despite how many times he pulled Riley’s feet from the fire, he was never known as an enabler. Perhaps also because in his entire career, Trevor had never pulled another string, done another favor, or otherwise helped out another living soul. He saved all he had for Riley. Whether Riley wanted it or not. \n\nHandcuffed to the squadroom interrogation table, Riley poked his tongue through his missing tooth-hole, and wondered what was coming. If he’d known it would be this, he would’ve done a couple more shots before hitting the road. \n\nHe couldn’t decide whether to fixate on the situation immediately at hand or the lack of resolution achieved for keeping Eli away from his mother. Instead he fixated on which to fixate on, until Trevor burst through the door. \n\n“What the fuck is your problem?” He exclaimed, leaning over the table. Riley instinctually moved to protect his nose and mouth but the handcuffs jerked him short. “Relax. I’m not gonna come at you.” “For now, at least,” He qualified. \n\nRiley scanned to see if the “record” lights were flashing on the cameras in the room. Each were dead black. Trevor must’ve had those shut off as well. His body tensed at the thought, but simultaneously, his mind told him he had little to lose.\n\n“When can I call Peyton?” He asked in response to Trevor’s question. At least he was no longer beholden to his grandmother to spring him. A new dimension of freedom. On some level, he knew this would evaporate the already shallow puddle of Trevor’s remaining goodwill.  \n\n“Maybe I will tune you up just to get some sense flowing back,” Trevor hissed. “Peyton? You’re thinking about her right now? I just saved you from never seeing the kid again, let alone getting custody. You will talk to me.” Riley sat in thick, conflicted silence, unable to fidget properly enough to think with his hands cuffed as they were. “Last chance,” Trevor cautioned. Riley felt dejavu to 10-years-old, being grilled about his report card.  \n\n“You’re just gonna judge me. It doesn’t matter what I say or don’t,” Riley whispered, hanging his head. Trevor’s wife had been dragging him deadweight to family therapy, because of the degradation of his relationship to his own pre-teen son. Who, ironically, felt closer to Riley than anyone. As such, Trevor had been learning a lot about opening lines of communication, active listening, and the development of boys becoming men. In many ways, Riley had been a grown man since the day he could walk, by necessity. As a result, in other ways, he was still that same 10-year-old hiding his report card under his mattress. \n\n“What do you mean judge you? I’m a cop. The judge is a different arm of the law,” Trevor quipped. “Just because I don’t agree with you on much don’t mean I don’t respect you. You’re the only guy I ever had to look up to,” Riley admitted, his voice cracking. Trevor stopped leaning over the table and sat down at eye level across from him. “I’m not gonna just tell you I couldn’t keep ahold of my own brother being safe, the only important thing I’ve ever been trusted to do,” Riley continued, trying to restrain his emotion. “You’re an asshole but you always, always, no matter what, kept me safe. No matter how hard I tried not to be. You did that for me and I have a car and a bank account. Eli’s seven! I couldn’t even keep a kid safe in my own house.” \n\nTrevor took a deep breath. Beneath the bad attitude and the worse haircut, Trevor still saw that 10-year-old, too. “That’s because you’re basically my kid brother, Riley. The only one I’ll ever have. I’m glad I made you feel safe but in actuality, I failed you. If I had kept you safe, we wouldn’t be sitting here. Ever, forget ‘again.’” \n\nRiley shook his head. “This is on me. This is stuff I did—“ Trevor extinguished the self-immolation. “No *I did* a lot of things, too. Things I regret, in one direction or another. In the name of trying to keep you safe. Now that you have Eli, maybe that’ll put some of it in perspective and you can start thinking about forgiving me a little. I’m not asking you to forget. But forgive me a second chance.” \n\nRiley could see Trevor working to restrain his own emotions, a blue moon occasion. “Now that I have Eli, I know nothing‘s over family. So, yeah. Past is past. We’re good.” Riley went to fist bump him but was yanked back by the cuffs. Trevor came around and undid them.  \n \n“The judge in your case. I can see if anyone who owes me a favor has an in with him. I’m not making any promises. But if I do that, you’ve got to be more receptive to my… you know.” “Meddling?“ “Coaching.” The two said simultaneously. “Coaching,” Trevor reiterated. \n\nYeah, whatever, fine.  Just get me my kid. Even get him to Janice or a neighbor or, if it has to be like that, a CPS foster family. Just don’t give him to Savvy. You know how she is. You know what she did…” Riley trailed off, still ashamed to talk about something that couldn’t be any less his fault. \n\n“Yeah, yeah. I’ll make it happen. I’ll take care of it. She will not win. In court or anywhere else. I know I’ve got like, seven hours, tops, to get my arms around this so I’ll work the channels and get back with you when I know more.” Trevor was already tapping away at his phone keys, thinking back to friends of friends of friends who could potentially be of influence. And praying he’d never want the connections for himself, later. \n\nRiley was released, led out a back way. Peyton had coordinated with a friend to pick up his truck but she was at work by the time he walked out so couldn’t come for him. He was already missing a day’s pay, they couldn’t afford to both be out. So, he walked a mile to the bus in 35 degree weather, with no coat. Once he got off in Driscoll, he’d try to hitch to the trailer park. If he couldn’t, he’d have to choose between walking six more home, or facing Peyton at work.  Trevor had his gun, and probably would forever. \n\nAs he tried to warm himself on the feeble windowside heater of the bus, he thought about the agreement he’d just made with Trevor. He considered what that “coaching” had consisted of in the past and why he was not more receptive to it. It started with superficial stuff like, “Change your hair,” “Change your hobbies,”“Change your job.” But by the time he and Trevor had grown apart it was escalating to “Change your politics,” “Change your religion,” “Change your love life and parenting.”\n\nBetween work, court, and the crisis, he’d been awake for almost 48 hours. He tried to grasp the peace of mind he felt he should be granted by Trevor’s promise to bring Eli home for good. Unequivocally, there was nothing more important. \n\nBut, as he sat thinking about his past with Trevor, his future with Eli, and the juxtaposition of them both, he couldn’t help but feel as though he’d made a deal with the devil. Had he really won if Eli still wasn’t entirely his own to raise? \n\nFor the time being he was content to lose that battle if it meant winning the war. So, he turned his attention to getting home and getting dressed for court that afternoon, to make one last ditch effort at getting his mother away from Eli in a (mostly) legal way. ", "**Hello Ziggurat** \n\n“Temporal Traversing Utility Vehicle,” Dr. Yurisov had cheered, at the station, showcasing my new home, my new *skin*. “That’s what we settled on. Designation Three-Six. You’re all set, my boy.”\n\n“Excellent,” I had said, with a nerdy grin. The street urchin I was could die and someone who mattered could take his place. I tuned out Yurisov’s geek-talk.\n\n“Two settings, no, sorry, three,” he said, to himself, I suppose; he wasn’t even looking at me. “When tethered to real space and the timeline is stable, you’ll go Passive. Otherwise it’s Fight Mode, and Flight Mode. Assume if the exosuit enters one of these modes, that you’ll be jumping.”\n\n“Uh, sure,” I’d agreed. \n\n*Sucker.*\n\n—————\n\nPerceiving the ripples was a stretch for someone farsighted, and I lost my glasses amidst the chaos at the siege of Baghdad in 1258 CE. *What a horror show,* I thought. Even still, my eyes adjusted a few jumps back; I could now instinctively categorize the components of space-time, the waves and their various cadences. Everything was a waveform, until space was added to the temporal equation. \n\n“Remember, Cade,” Dr. Yurisov had repeated before I ejected into the timeline, “Time comes first, then space, then matter, all of it glued neatly by observation.” \n\nLooking back I’m not sure how much of his philosophy towards time travel was just the repetitions of a crackpot and how much was actual science. *But, he can’t be all wrong,* I’d thought. *I mean I’m here… wherever “here” is.* Even still, this shit stinks of guesswork. It stands to reason I’m the first one who’s made it past the Meridian Zone, not that they’d ever tell me the truth. Shit luck, for the dozens who tried and got caught in the paradox. \n\nThe hardest part was imagining Amelia’s face, as she locked me into the suit for the real deal, not just another test run. I could tell something was off; she looked like a different person. *She must have been there to smooth the nerves,* I thought. That part hurt, it hurt a lot. \n\nBut then I was in, and then out, and then *through.* The timeline breathes, as if it’s alive. It *is* alive. \n\nIt was not happy to see me. \n\nAny evolved beings who uncover my metallic husk millions of years from now will see, and they’ll understand: **some doors best remain closed.** But it was too late for me, and I knew it, so I resigned myself to the experience. TTUV 3-6, my new skin, came with some bells and whistles, to put it mildly. And at the Battle of Okinawa in 1945 I’d gotten out of hand testing all of these weapon systems, comfortable in my knowledge that the real world analogues of my Japanese and American victims alike would be fine, gently nurtured by time sans my interruptions. The suit didn’t give me a choice. Every time I was approached with the faintest hostility—**GRRZZZ**—it just liquefied every lifeform around me. Every time I got complacent, content? **Whoosh!** Back a few centuries, I go.  \n\nIt had a mind of its own. Or a objective I was not made aware of—either way, this shit is bonkers. I’m a ghost, spending hours or mere moments looking upon history’s highlight reel, a lonely Frankenstein without a tether. \n\nFirst, there was my childhood to retrace, in all of its dystopian grayness, with the colorful backdrop of our advanced civilization. We can crack time travel but not homeless orphans—pathetic. I willed the suit to skip through the whole thing. And then it was First Contact with the Xuyo, the event that made this possible. “*Beings of light who brought knowledge to mankind freely,”* I thought. “*So called.*” Right before I was born, these grifters showed up, said they wanted to stay with us on Earth. *Glad to be the only person alive ignorant to how that ends up,* I joked to myself. \n\nIt was the little things.\n\nI kept going, retracing my steps back through the familiar specs, before “crossing the Rubicon,” as Caesar had explained to me. I suppose even when we make choices in the present moment we can correctly predict the philosophical effects upon future ages, sometimes. Anywho, biggest regret was how the Final War on Earth flew by me; I didn’t even get a chance to snap a photo with my suit. \n\n*The one time I wanted a picture,* I had moaned to myself, as the suit went into Flight Mode. *Its not every day that you get to spot the crisscrossing trails of thermo-nuclear weapons en masse.* I sped past all that, and when I tried to go back, I was met with a tremble-worthy truth: I **couldn’t** go back, as in forward, as in.. back home. \n\nSo, as early as eight hours after ejecting into time, my situation hit me in the gut. \n\nNo one in the project deemed me worthy of the knowledge concerning the *”one-way-trip”* aspect of our—or, my—experiment. \n\nAt the fall of the Berlin Wall in 1989, I sat alone, six jumps in. I was stuck in this fucked up prison; everyone was so so joyous, so hopeful in celebration all around me. The duality drove me numb. Eager for meaning, I sat there and tried to rationalize their weighing of the scientific imperative against my own life and self-determination. I suppose the fact that I was a dreg with no family or status eased their burden in condemning me to a life of perpetual steps backward into unfamiliar times. *Happier times, albeit in some cases,* I dwelt on. \n\nIt didn’t help much, but I told myself, perhaps lying, I was lucky for the experience. And I knew they were watching my every backwards step, cold with analysis. Some part of me wanted to say “fuck you,” through success. “I can’t go forward?” I said. “Well, I’ll just have to go all the way back.” \n\n—————\n\nMy resolve began to falter after a few hundred intervals. *Longer than most could manage,* I assured myself, looking over the violent, primordial Earth. Truly, it pains me to admit that I’m over two thousand jumps deep now, into the past. Now, it was the far, far, distant past——a bizarre nightmare. \n\nThe first hundred hoops were smooth, unique, or recognizable at least, all the way back to Ancient Egypt and the pyramids. Yada yada. The same stuff happens there and in other pockets in some kind of cycle for a *very long* time. That, in itself, could be unsettling—as it stretches our known history an additional hundred thousand years or so—but that’s all after the “Bird Faces” demolish the… bad building. \n\nI call it the “Foundry.” I’m not sure what else to call it, but it’s where they make people. Words can’t describe the macabre picture I would wish to showcase, but never to paint. *Trial and Error,* I had thought. It must all be necessary for these… beings. \n\nLater on, a cadre of Bird Faced, angelic super beings show up, wipe out the whole operation, and just let the “humans” go wild and free. I took it that those beaked badasses were some kind of ancient UN or cops or something. But they didn’t seem overly interested in… helping. \n\n*My God,* I thought, checking the date. \n\n*32,895,421 BCE… in an old, old, old, creation. In a time before songs.*\n\nAs for the beings involved in the.. Foundry. Let your imagination run wild, if your eyes are cursed by this recording, your ears by this transmission, by my honest attempt to archive the ghastly, monstrous things I’ve seen. **Nothing** is sacred to those monsters. If they created us, I can’t keep living, but I’ve seen enough to suspect they brought us here from somewhere else, and I’m not resigning until I find that clue, and solve that riddle. \n\nWhat sort of beings would undertake such horror, and to what end? I have spent months of my own time—and aeons in the waxing of matter and sentience—on the Earth, wondering. \n\n*I’ll just have to keep going back,* I thought. *Keep.. keep.. keep g-going back.*", "**Welcome to the Short Stories!** This is an automated message.   \n\nThe rules can be found on the sidebar [here]( https://www.reddit.com/r/ShortStories/about/sidebar).\n\n**Writers** - Stories which have been checked for simple mistakes and are properly formatted, tend to get a lot more people reading them. Common issues include - \n\n* Formatting can get lost when pasting from elsewhere.  \n* Adding spaces at the start of a paragraph gets formatted by Reddit into a hard-to-read style, due to markdown. Guide to Reddit markdown [here](https://www.reddit.com/wiki/markdown)    \n     \n**Readers** - ShortStories is a place for writers to get constructive feedback. Abuse of any kind is not tolerated.    \n     \n***  \n\nIf you see a rule breaking post or comment, then please hit the report button.           \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/shortstories) if you have any questions or concerns.*", "`[HEADS UP: Mind control & minor body horror (don't worry, he's made of paper)]`\n\n/////\n\nA storm looms in the Pannel City night sky. A top one of the tallest skyscrapers in the city, a man in a blue and silver armored suit brood alongside the stone gargoyles. As he looks down on the city, inside his helmet, his suit feeds him information from every source it can access on his hub. Blog posts, news, police radios, and even video apps scroll across his feed rapidly.\n\n\r“This is Central 6u-D, checkin’ in,” says Central. A green orb appears over the man’s feed, pausing it. “Agent Kanna, respond.” \n\n\r“Vortech responding,” says Vortech, “19-1-6-5, over and out.” The man blinks, and the orb disappears, only to return a second later.\n\n\r“Denied,” says Command, “You’ve been running the suit in green without moving for your entire shift, and tech support is not happy. They want you back so they can run a complete diagnostic.”\n\n\r“The suit’s fine,” says Vortech.\n\n\r“Not our call,” says Central. Suddenly, Vortech’s entire feed, save for Central’s orb, disappears. “Need you back here ASAP.”\n\n\r“Can’t you stall them?” asks Vortech. “Say I’m dealing with an elusive blotling.”\n\n\r“One, no,” says Command, “and two, wouldn’t work anyway because Dr. Wayne’s been hovering over my shoulder for the last thirty minutes, threatening to take my headset.”\n\n\r“Great,” groans Vortech. “Scale from one to ten?”\n\n\r“8.5 and rising fast,” answers Central.\n\n\r“Then I’m taking the long way back, over,” says Vortech.\n\n\r“Copy that, see you in hell,” says Command, “over and out.” Vortech lets his body fall forward, off the edge of the building, and starts free-falling. Vents on his claves, waist, forearms, back, and chest open, firing massive gusts of wind, launching Vortech through the air. As he flies across the city skyline, a red exclamation mark appears on his hub.\n\n    \r[E-SOS: Agent Wilhelm Requires Assistance]\n\n\r“…Ugh. At least it’ll get Wayne off my back,” says Vortech. “Suit, rescue override, respond to the alert, and prep for combat.” Vortech’s hub re-activates, switching from surveillance to combat, as he flies towards the alert.\n\n\r\\\\\\\\\\\\\\\\\\\\\n\n\rVortech hovers over a series of abandoned dockside storage houses. “Suit, radio Agent Wilhelm again.” A dial tone rings in the headset for a few seconds before hanging up. “Great.” A pillar of black tendrils suddenly launches through the roof of one of the storage houses in front of Vortech. He flies over and dives through the hole left in the ceiling, making a superhero landing “You called?”\n\n\rThe inside of the building is dark, with the only light coming from the windows. The floor is just one big puddle, and water drips from the ceiling. Vortech looks at his HUD to see the temperature at around forty-five degrees. “Suit, activate chest lights.” Two panels on Vortech’s chest slide open, revealing two headlights.\n\n\rVortech walks through a maze of crates and damaged storage containers, jerking at every few sounds like a squirrel. He finds one storage container ripped in half. On closer inspection, he finds a strand of hair caught on one of the jagged ends of the container. “Disgusting” \n\n\r“…Vor-”\n\n\rVortech quickly hovers backward, lands, and aims his arm cannon at the person behind him, finding it to be a drenched Agent Wilhelm.\n\n\r“Friendly! *Friendly!*” whispers Wilhelm, hands in the air. Vortech lowers his arm.\n\n\r“Wilhelm?” asks Vortech.\n\n\r“Keep it down. I can’t believe you actually came,” whispers Wilhelm. He points further into the building. Wilhelm starts walking but is stopped by Vortech grabbing his arm.\n\n\r“Wilhelm, what’s going on?” orders Vortech. Wilhelm shushes Vortech.\n\n\r“It’s ToonMan,” whispers Wilhelm, “he attacked us!”\n\n\r“*ToonMan* attacked you?” asks Vortech.\n\n\r“Yes,” answers Wilhelm. “Jacobs called me about some disappearances in the area. Apparently, she had a lead and…”\n\n\r“Let me guess,” says Vortech, “when you got here, ToonMan was waiting for you?”\n\n\r“Bingo!” says Wilhelm, “He took my blaster and communicator and chased me around the warehouse for sport. Luckily, I lost him after diving into the loading dock.”\n\n\r“So, ToonMan used Jacobs’ communicator as a trap?” asks Vortech.\n\n\r“Yes,” answers Wilhelm, “we have to stop him before more agents arrive.” Vortech stares at Wilhelm for a few seconds.\n\n\r“Sure,” says Vortech, “here’s the plan…” Vortech blasts Wilhelm in the chest with a gust of wind from his arm cannon, causing Wilhelm to slide on his back. Before he can get up, Vortech lands one of his boots on Wilhelm’s chest and points his arm cannons at him. “I’m gonna lock you up and let some guys and lab coats figure you out.”\n\n\r“What are…you doing?!” yells Wilhelm as he struggles to free himself.\n\n\r“Drop it, blotling,” says Vortech. “Whatever you’re playing at isn’t working. Just surrender and save both of us the trouble.” Wilhelm quits trying to free himself and glares at Vortech. His eyes go from pale brown to dark green, and blackness bleeds into his hair.\n\n\r“Who do you think…you are?!” demands Fake Wilhelm.\n\n\r“I’m the guy who’s spent every day of the last five years of his life learning, training, and hunting ToonMan,” says Vortech. A dozen dark green lights appear on the ceiling above Vortech and Fake Wilhelm. “And only he would be *dumb enough* to fall for a trap this bad.”\n\n\r“And yet he’s still alive,” says Fake Wilhelm, “What’s that say about you?” Vortech blasts Fake Wilhelm in the face with a gust of wind, drying him off a bit.\n\n\r“It says that I don’t have time to deal with you,” says Vortech. Black hair-like tendrils slither out from the darkness surrounding the two. Vortech picks Fake Wilhelm off the ground, noticing the tendrils. He blasts each of them, forcing them back. “Look, tell me where Wilhelm and Jacobs are, and you’ll at least be conscious when I take you in.” Parts of Fake Wilhelm’s hair bleach back to white, and he looks at Vortech with one of his eyes back to normal.\n\n\r“In…*here*…!” The real Wilhelm struggles to speak, his good eye frantically shifting between looking at Vortech and the ceiling. Vortech looks up at a pulsing black mass of hair the size of a monster truck attached to the ceiling, with a green glow at its center. The hair creature fires a beam of water at Vortech. He tries to step back to dodge, but a tendril wraps around Wilhelm, pulling him from Vortech’s grasp and into the path of the water.\n\n\rVortech watches as Wilhelm’s hair darkens again, being overtaken by the hair creature “If it makes you feel any better, ToonMan didn’t fall for my first plan either.” The hair creature speaks through Wilhelm. “But when at first you don’t succeed…” Jacobs walks out from the shadows, drenched, with pitch-black hair and green eyes. Several more people walk out with the same appearance. Vortech tries to fly above them but is knocked out of the air by a shipping container.\n\n\rThe shipping container slams Vortech into the ground, but he recovers quickly, blasting it off him. Only for a figure to slam into again, hard enough to make a crater in the ground. Vortech sees a distressed ToonMan wrapped and bound with black hair tendrils piercing in and out of his body, using him like a puppet. “Try, try, and try again!”\n\n`.`\n\n`.`\n\n`.`\n\n`.`\n\n`.`\n\n`Thanks for reading, and I hope you enjoyed the story!`\n\n`If you have any comments, critiques, or criticisms, please don't be afraid to let me hear 'em (as long as they're constructive (or funny)). If you want, head over to` r/ToonTales `for more of my short stories.`\n\n`Stay safe, drink water, and be kind to yourself and others.`\n\n`ToonMan, AWAY!`\n\n`[`[Original Prompt](https://www.tumblr.com/creativepromptsforwriting/745576724672233472/prompt-1085?source=share)`] || By` [@creativepromptsforwriting](https://www.tumblr.com/creativepromptsforwriting) `(Tumblr)`\n\n`{Written: 03/21/2024}`\n\n\r", "**Welcome to the Short Stories!** This is an automated message.   \n\nThe rules can be found on the sidebar [here]( https://www.reddit.com/r/ShortStories/about/sidebar).\n\n**Writers** - Stories which have been checked for simple mistakes and are properly formatted, tend to get a lot more people reading them. Common issues include - \n\n* Formatting can get lost when pasting from elsewhere.  \n* Adding spaces at the start of a paragraph gets formatted by Reddit into a hard-to-read style, due to markdown. Guide to Reddit markdown [here](https://www.reddit.com/wiki/markdown)    \n     \n**Readers** - ShortStories is a place for writers to get constructive feedback. Abuse of any kind is not tolerated.    \n     \n***  \n\nIf you see a rule breaking post or comment, then please hit the report button.           \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/shortstories) if you have any questions or concerns.*", "   After a good long sleep my mom wakes me, she takes me outside and I’m never sure why. There’s nothing interesting outside in the dark, I don’t see as well as I used to but she always does stay by my side. Though when we come back inside she puts a food in the box that makes noise, then she goes outside by herself. \n\n\n   My mom is very brave, she leaves for so long all alone without me or my brother to accompany her. I get lonely and miss her oh so much, my brother is around but I dont know him as much as I know my mom. I mostly sleep when she’s away, I’m not interested in doing much else anymore. \n\n\n   I wait for her to come home, it’s getting a little late now. She must get so very tired from being outside all day, I do not like staying in the outside too long now. She came back and now I greet her with my big boy voice and make sure she knows I missed her, she takes me back outside. Oh! I know why she takes me outside, to go potty! I always get a treat when I go potty it’s so great I love her! \n\n\n   It’s dinner time now, my food is so good I lick the bowl every time. After dinner I get a bit sleepy so I take a nap, but I wake up a couple times to make sure she’s still home and safe. We go back outside again, but I forgot why. \n\n\n   Now time for real bed, she puts on a show for us to listen to every night. I can always smell her when she’s home, even when I cannot see her. She eats her dinner and sometimes I get some of her dinner too! \n\n\n   I wish I could see her face more clearly like I used to, or be able to get on the bed again. The last time I got on the bed I hurt myself because I wanted to follow her but my legs aren’t as good as they used to be. And now I’ve gotten older the doors keep changing how they open, the house always seems so much different every day. \n\n\n   My mom has gotten older too but she does so much, she never forgets our routine and always comes home for me. I wonder what she does all day long, I bet she gets some running in and plays with many toys. She used to be home all of the time, but that was at the old house we lived in. \n\n\n   Mom woke me up, she’s taking me outside but I don’t know why. She’s put the food in the box that makes noise, and she’s going out the brave the dark by herself. My brother is here though, sometimes I don’t remember who he is. \n\n\n   Mom just came home, it’s early this time I think. I get so so happy when she comes home, I run around especially for her cause she always gets so happy with me. I don’t quite remember why we’ve come outside, but she said that’s okay and we will try again in a little while. But I do not get a treat and I don’t know why. \n\n\n   I remembered! It’s for potty, that’s why we go outside. I did get a treat this time I’m so lucky! Now it’s time for bed and I am so sleepy, I feel like I sleep so much now but I’m just so sleepy all the time. I love my mom, I am so happy she is here with me at night. I can’t see very well, and I can’t see well at night especially but I know she is there. \n\n\n   My mom always makes my bed dry again, and my crate smell nice for me on the weekends. She doesn’t leave on the weekends if she does it’s not for as long, I love hanging out with her. Watching her do things, she plays with water and some weird disk things. \n\n\n   I sniff the floors for any food, I lick it anyway just in case. My brother tries to play with me but I’m not sure what he’s doing? He is weird, not like me; he is small, and can jump very high onto the food eating surface. I’m more interested in what mom is doing, I follow her everywhere. \n\n\n   I love my mom, even though I am getting old and tired she is still here for me. My mom always comes back for me, and I know I will not be here much longer but I know she will be here til the end. I might not remember a whole lot but I remember her every time. \n\n", "Nothing like a little teariness with my morning coffee. What a beautiful story. Now excuse me as I have an appointment to go pet and love on my old dog, a little longer today….", "Thank you, and yes love the sweet old babies. I’m doing the same this morning 🫶🏻", "**(Read in a country guy’s voice)**\n\nChristovert was the oddball of the village, the kind of teenage boy you just don’t quite know what’s up or down with, and his downs were always a cause for calamity. His outbursts were erratic but understandable; he wasn’t a comely fellow, and he wasn’t particularly strong or witty. As far as my wife, Lucille, and I knew, his parents were cold, and disappointed in life, he was an only child, and every friend he ever made at the schoolhouse was a cruel rouse; in a small hamlet like ours, with a few dozen younglings chirping day in day out, that takes its toll on a kid. \n\nOne could imagine my surprise when he saved us all from the freebooters. \n\nI should have gathered something was afoot this spring, as I always kept a distant eye on him; I figured that no one else was and that someone ought to try. But he hardly knows my name, just that I’m a simple, friendly geezer who smiles his way. He always went out and around the hedgerows behind the Cobblestove’s manor, playing with his ropes and gadgets, firecrackers, and pet imp, Djarin. I hate that little daemon, but his tricks make the boy smile. An imp like that is something between a dog or monkey and a low level sorcerer. A friend of mine had one when I was a kid and it accidentally banished him to some Eldritch god’s dimension. Fucking imp just stared there into space for a few seconds, scratched his groin, which was just a flat hump, and sort of just waddled away into the hinterlands. \n\nI hate those fuckin’ creatures.  \n\nWhen Christovert first strayed from his afternoon routine I assumed it was something to do with his family. Had I been a more decisive man, I’d of investigated his absence. Because what really happened was a tale for the ages. \n\nWeeks went by and I noticed I hadn’t seen Christovert at all; I’d been busy with the grippin pain from pulling out all these snokkleberries. And that was doubly problematic because none of the King’s officials had been around our town yet to inform us the big news, that the Dark Lord had been resurrected again. Lucille was furious. King Dathran was a lot of things, but wise, or a hero, were not on that list. Lucille’s brother, Kel, had died in the last Dark Lord War. King Fatty had a whole show put on for him, and we were all told it couldn’t happen again. I really think somebody ought to put more effort into permanently killing this son of a bitch. \n\nI digress. \n\nWell, the freebooters like working for the bastard; I suppose they ain’t got much else to do. Trolls, goblins. tattoo-faced weirdos, pirates, dark mages, werepeople, batpeople, satyrs and all kinds of trouble some how get together—I have not the faintest idea how. Oh, and **imps** sometime, too. I’m sure you could guess where this is going. \n\nTurns out, that little fucking imp had done and tricked Chrisovert into going on some quest. I’m not really sure what happened but, it woke up the Dark Asshole and I suppose the Djarin was bringing that poor boy back here to be sacrificed. \n\nTurns out, that girly little elf knife used as the enchanted gateway had an “opt out of demonic possession protocol” of some kind, courtesy of a pretty elf lady ages ago. So, as they’re getting back to our side of the hinterland, me and Charlin, Tommy, and Septimius are squared up overlooking the northern front, all of us unfit to carry a rifle or musket, but still trying.  \n\nNext thing we know these diverse dark forces are coming our way, with Christovert among them in chains. One minute later that boy is free and vibrating at incredible speed, bouncing around, into and through these poor guys. Irrelevant gunfire and smoke start to emerge as I spot several instances of friendly fire, outdone by Chris’ turning one after the other into a soggy, visceral mist of blood and whatever other fluids and gases we’re holed up in some of these fellas and creatures. Tommy blew chunks halfway through the cull, never taking his eyes off the spectacle, which only lasted about two minutes. By my math that’s about one bad guy disemboweled every second and a half. Them demon curses are always more useful when combined with the charm of voluptuous elven maiden, turns out. Food for thought, spread the word. \n\nWhen I say those men, those monsters down there got eviscerated that is the under selling of the millennium. And it’d be normal for ‘Ol Chris to be traumatized after something like that. Well, he wasn’t. To my utter most consternation, as we ran to greet him and went through the particulars, we came upon the problem of Djarin still breathing his toxic little self, so I pulled Chris aside and I did what I should have done years ago; I told him that I was willing to Iook after him, to adopt him, take care of him, and love him like he was own son. He said he indeed did notice my concern and sheepish attempts to look after him. It was wholesome. \n\nMoments later he revealed to me the element of the story most could only know in hindsight, but I knew from experience—that this whole apocalypse was engineered by that squeaky little, perverted imp. \n\nTwo seconds was all I could wait and I shot that fucker right in hump where his dick would be.", "**Welcome to the Short Stories!** This is an automated message.   \n\nThe rules can be found on the sidebar [here]( https://www.reddit.com/r/ShortStories/about/sidebar).\n\n**Writers** - Stories which have been checked for simple mistakes and are properly formatted, tend to get a lot more people reading them. Common issues include - \n\n* Formatting can get lost when pasting from elsewhere.  \n* Adding spaces at the start of a paragraph gets formatted by Reddit into a hard-to-read style, due to markdown. Guide to Reddit markdown [here](https://www.reddit.com/wiki/markdown)    \n     \n**Readers** - ShortStories is a place for writers to get constructive feedback. Abuse of any kind is not tolerated.    \n     \n***  \n\nIf you see a rule breaking post or comment, then please hit the report button.           \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/shortstories) if you have any questions or concerns.*", "That was fun!", "Haha thank you!", "I’ve been living, for the past seven years, with my girlfriend Jessica. I don’t know how, but it’s been seven years. I could swear it was last week that we were moving in. Scared but prepared to finally live together. Happy as one could be.\n\nNow it’s the millionth time we’re having breakfast across from each other. We each make an effort to say something once in a while in between all the media scrolling. We like to pretend we are interested in what the other has to say. I don’t know what I hated most. The silence or the obligation of having to say anything.\n\n“You need to fix the hole in the wall. It’s getting bigger and there is a huge black spider living inside”\n\n“What hole? What spider?”\n\n“Are you serious? What hole? Never mind Jack”\n\nJessica got up, turned around and left the kitchen. She left a half eaten toast on the plate and a lukewarm mug of tea on the table. Tea that she never drank anyways. I truly believe she just enjoyed making it to annoy me. Because she never drank it. And it annoyed me to no end. Like we were swimming in money, to keep wasting it on expensive tea.\n\nI was going to get up and go look for her, but I decided not to. Let her cry if she does. Cleans the soul. I'm tired of it. I cry too, and no one ever comes to see what is wrong.\n\nI got up and looked around. No hole. Was it even in the kitchen? I guess not. Was there even a hole? Who knows. Jessica had a sick sense of humor. This would be the kind of thing she would find funny. Make me go around looking for a hole, just to mess with me.\n\nI sat down and finished my breakfast. But I felt bad. So I went to look for her.\n\n“Jessica?”\n\nShe was not in the living room. She was not in the bathroom. Maybe the bedroom?\n\nI nudged the door a bit.\n\n“Jessica?”\n\n“What Jack?”\n\n“Jessica, I didn’t hear you talk about any hole. I’m sorry. Where is it?”\n\n“You never listen Jack”\n\n“Do you think I do it on purpose? Do you think I wake up and think about forgetting stuff just to piss you off? If I didn’t hear it, I didn’t hear it. Is it that hard to understand? Can’t I just be stupid or an airhead?”\n\n“Forget it…”\n\n“I’m sorry ok? Just tell me where the hole is. I’ll take a look at it now. Sorry I didn’t pay attention before”\n\n“It’s in the living room, Jack. How can you not see a hole there?”\n\n“Where in the living room? I swear I didn’t see a hole. Are you fucking with me?”\n\n“Jack, everyone can see a hole there. Anyone but you. Please let me get ready for work. Go away”\n\n“Are you serious?”\n\nNo response, so I walked away.\n\nI went straight to the living room to check out this hole. I check everywhere. No hole. Behind the tv maybe? No hole. Behind the couch? No hole. On the floor? No hole.\n\n“Fuck this”\n\nI went to take a shower before getting ready for work. When I got out of the shower, she was already gone. No goodbye, no nothing. Unbelievable.\n\nBefore leaving for work, I took another glance around the living room. No hole. She was definitely fucking with me. There was nothing here, and there wouldn’t be.\n\nWhen I got back from work she was in the living room reading a book.\n\n“Hey”\n\n“Hey”\n\n“How was work?”, I asked.\n\n“Pretty good. Want to go make dinner with me?”\n\nI was surprised with her mood. Usually when we have a less than friendly morning, there is always an aftershock in the evening. I was glad there wasn’t one, because I didn’t have the patience today. I didn’t want to make dinner either. I wanted to take my clothes off and sit in front of the tv watching some dumb movie. I was tired.\n\n“I’m tired Jessica, can we just order some pizza and watch a movie instead?”\n\nHer face turned back to the book, and she almost teared up.\n\n“What?”, I asked, already starting to get annoyed at a potential aftershock after all.\n\n“I bought something special for us to make. I thought we could spend some time doing something together. But never mind I guess.”\n\nAnd now I felt like shit. How was I supposed to know?\n\n“Shit Jessica, I’m sorry. That sounds great. Let’s make dinner together. What are we making?”, I said with fake excitement, but I don't think she noticed.\n\n“Lamb with potatoes”\n\nThat was my favorite. Sometimes I really do feel like an asshole.\n\n“I love you, you know?”, I said, trying to make up for my shitty mood.\n\n“I know”\n\nWe went into the kitchen and we made dinner. We had music coming out of my phone. Stuff we heard when we were much younger and just started dating. We were cooking and singing. She was smiling and trying to make me dance. But I don’t dance, so I avoided it. I hugged her from behind instead, and didn’t let go.\n\n“You have to let go, if you want to eat unburnt food”\n\nAnd so I did. \n\nWe had dinner, we drank some wine, and we went to bed afterwards.\n\nI don’t remember the last time we spent time together like this. Then we fucked. And that was even rarer these days.\n\nShe got up to go to the bathroom. I stared at the ceiling.\n\nI thought about how much I still loved her. Despite everything lately. Despite the clear void that was looming above our heads. She was still the love of my life. And would forever be. There was still something here to work on.\n\nShe came back and laid next to me. And my intrusive thoughts popped up. It was unbearable to hold it in. I tried and tried, but I couldn’t help it. I never could.\n\n“So?”\n\n“What?”, she asked.\n\n“You? Screwing with me this morning? Making me believe there was a hole in the living room.”\n\n“You think I was screwing with you?”\n\n“C’mon Jessica. I went to the living room like an idiot and searched everywhere for a hole that doesn’t exist”\n\n“Can you stop Jack? You’re not being funny. If you don’t want to fix it just say it”\n\n“I would fix it, if there was a hole to fix”\n\n“You want to play this game? Ok, you win. There is no hole. I don’t know why I even try”\n\n“C’mon don’t do this. Ok, I believe you. Just show me where it is then”\n\n“Goodnight Jack”\n\nJessica rolled to her side of the bed. And said no more.\n\nI picked up my phone, my cigarettes and went outside to the balcony. I couldn’t sleep anyways. I was scrolling through pointless social media, trying to forget the perfect night I had just ruined, when I got a text from my brother.\n\n“Yo. How are things going man?”\n\n“What’s up? Going good, why?”\n\n“You know, just asking”\n\n“C'mon, I know you. What are you trying to get at? Just come out with it”\n\n“First you have to say you won’t take this the wrong way. You’re my brother and I love you, so I’m just trying to look out for you, ok?”\n\n“Hmm, ok? Should I be worried? What is going on?”\n\n“It was something I noticed the last time I went there”\n\n“What? Last Sunday?”\n\n“Yeah”\n\n“Just say it dude”\n\n“The hole in your wall”\n\n“Wtf Dan. Did Jessica tell you to say that?”\n\n“What? No. It was just something I noticed. I’m trying to help. It’s pretty big, dude. I thought that maybe you couldn’t fix it alone and I was trying to lend a hand. Since you didn’t mention it, I assumed you were ashamed of it”\n\n“I really don’t see how this is supposed to be funny. Is it some inside joke that I don’t get? Is it some new game the kids are playing that I still haven’t heard?”\n\n“Ok Jack. Suit yourself. But just so you know, the longer you take to fix it, the bigger it's gonna get pal”\n\n“Are you done?”\n\n“Whatever dude. Bye”\n\n“Bye”\n\nNow I knew they were fucking with me. Pretty big hole? There is no hole. That’s what they want. They got you talking about the hole. They’re already winning. I guess that’s the game.\n\nI put out the cigarette in the ashtray and went inside.\n\nJessica was already sleeping. I decided to go watch some tv, to see if I could get my eyes to tire. I sat on the couch, and there it was.\n\nIn the wall to the left of the couch. I got up to make sure. It was so small, but it really looked like there was a hole after all. This cannot be it. A huge hole? This is the talk of the town? My finger wouldn’t even fit inside. If this was it, then I still don’t get the joke. I’ll fix it tomorrow. But looking at it now, it was perfectly made. Like a tube. No flaws around it. Completely smooth. I wondered what made this. Didn’t even seem possible. Even a drill would leave hard edges in some way. I kept getting my eye close to it. Then more and more. But the closer my eye got to it, the darker it became. My head would block out the light. I swore I saw something inside. I felt my forehead touch the wall. I put it on an angle, but no luck. I took my phone and turned on the flashlight. Got as close as I could with my right eye and flashed inside to try and see. There was something black inside. What was it? I stood back and blew on it. And it came out. One black leg at a time. Its legs, thick and long, curving out of the hole. They shined to the light of the living room. My heart skipped a few beats, and this huge spider crept out, slowly, trying to escape. Or trying to back me off. Without thinking about it, I kicked the wall with the sole of my shoe, trying to kill that thing. I was sure I saw it fall on the ground, but I couldn’t see it anywhere. I looked around, frantically, but no luck. I looked at the sole of my shoe, but no luck. I flailed around, maybe it had gotten on my clothes. And felt my whole body shiver.\n\n“Fuck, fuck, fuck. Where is it? Did it go back in the hole? Did I miss it?”\n\nI flashed the light back at the hole, keeping my distance from it. I couldn’t see anything. I didn’t know if it went back inside, or if it fell on the floor and scurried away. One thing was for sure. I hadn’t killed it. I then got an idea. Tape. But I couldn’t let it out of my sight. What if it crawled back out when I went to get the tape? I had to risk it.\n\nI ran to the kitchen closet and got out the tape. And ran back into the living room. I taped the hole shut. Once and twice. And then again just to be sure. If it was inside, there is no way it’s coming back out. But what if it wasn’t?\n\nIf I couldn’t sleep before, it would be impossible now. I couldn’t let go of the thought of both the hole and the black creepy crawly.\n\nI moved the couch and went into the kitchen to get a chair. I brought it to the living room, setting it right in front of that hole. I sat and stared straight at it. I wanted to see if the tape moved. If that evil spawn was inside, maybe it would try to touch the tape. Maybe I would see it move. But it didn’t. For ten minutes I sat there. Nothing. Ten minutes more. Nothing. I felt the need to go outside. I looked around again, hoping to find some black thing hiding somewhere else. Found nothing, yet again.\n\nI lit a cigarette outside, and tried to put my mind off it. But I couldn’t let the thought of it go. It was unbearable not to think about it. I tried watching videos, but they all seem to mention holes and spiders. I threw the unsmoked cigarette. I paced back to the chair, and sat down.\n\n“What the fuck?!”\n\nThe hole had gotten bigger. How? Impossible. But the tape was barely covering the hole now. I could see very small gaps at the edge of the tape.\n\n“Don’t be stupid Jack. It’s obvious that the spider clawed at the tape, trying to get out”\n\nBut no. The tape was in perfect condition. Only smaller. Either the hole got bigger, or the tape shrank. The latter made much more sense. I had to get more tape. I took it from the little table next to me, where I had put the roll before. I took strip after strip. I had the taste of glue on my lips and teeth. The hole was sealed now.\n\n“Fuck me”\n\nIt really was bigger. I could feel it in the middle part of the tape, when I ran my finger on top of it. It was definitely bigger. I would say it was now as wide as two fingers. Maybe more.\n\n“Fuck me. What is this?”\n\nI couldn’t find a reasonable answer for whatever this was. I was late and I was tired. But I still sat there. Watching, staring. Once in a while, I had to touch it. I had to run my finger over the tape. I had to see if it was getting bigger. And it was. Little by little, but it was.\n\n“What are you doing Jack?”\n\nIt was Jessica. Somehow it was already morning. It had come out of nowhere.\n\n“Jessica! I can see it now. I can see the hole”\n\n“Have you been up all night?”\n\n“I couldn’t sleep. I tried to fix it, but it keeps getting bigger”\n\n“You can’t fix it by staring at it, Jack”\n\n“I know that. I put some tape over it. But it isn’t working. I need you to stay here, so I can go to the store and get the right stuff to fix it”\n\n“I have to go to work, Jack. So do you. We can talk about this later”\n\n“Are you serious Jessica? You have been bitching about this hole since yesterday morning. I saw it and I stayed up all night trying to find a solution. And now you say we can do this later? Are you serious?”\n\n“I’m not going to try and fix a hole now, Jack. You had plenty of opportunities before. It can wait until we get back. I’m going to get ready for work, and so should you”\n\nShe went into the bathroom and I heard her turn on the shower.\n\n“Fuck her”, and I continued staring at it, trying to come up with a solution.\n\nAn hour had passed, just like that.\n\n“Are you not going to work?”, she asked.\n\n“I called in sick. Are you really not going to help me?”\n\n“I’ll see you later, Jack”\n\nAnd she left.\n\nI got up and ran to the door. I opened it in one hard swing.\n\n“Jessica!”\n\nShe didn’t look back.\n\n“FINE! I’LL DO IT MYSELF!”, and I slammed the door as hard as I could, to make a point.\n\nAnd I got back to the chair and stared. Then I picked up my phone and called her. I got no answer, so I called again. Nothing. I wanted to apologize, but she didn’t pick up. So I called again. With each call getting angrier and angrier. She wouldn’t answer. So I sent her a voice message.\n\n“Can you pick up the fucking phone? I’m trying to apologize! This is what I get for trying to fix something? So I didn’t see it before. Fuck! I see it now! Do you have to be a bitch about it? At least I’m trying. What are you doing?”, and I hung up.\n\nHours passed and I still stared at the hole. Getting bigger and bigger. I was running out of tape. The floor was filled with cigarette buts. I couldn’t even bother going outside to smoke. I ran out of smokes. I ran out of tape. The hole kept getting bigger. Slowly, but surely.\n\nIt was night time now. No Jessica. She was supposed to be home hours ago. Where was she? So I called again. Nothing. And I called again. Nothing. I threw the phone on the table.\n\n“Fucking hole!”, I yelled. Straight into the mesh of tape.\n\nThen my phone beeped. A message. It was from her.\n\n“I’m not coming home tonight. I need to stay away for a few days. I’m staying at a friend's place. Please stop calling me every second. I can’t be in that apartment anymore. I’m afraid to get back in there with you. Please Jack. Stop.”\n\nSo I texted back.\n\n“Are you for fucking real?! I’m just trying to fix something YOU asked for!!!!”\n\n“I don’t know if it can be fixed anymore. Bye Jack”\n\nI tried calling back, cause I couldn’t write and stare at it at the same time. But she didn’t pick up. Then I tried again and the call wouldn’t go through.\n\n“FUCK!”, and I threw the phone at the wall. It ripped some of the tape. I was so sick of this hole, so I got up, and started to rip every last bit of tape from the wall.\n\n“Come on fucker! Come on!””\n\nThe tape was gone. The hole doubled in size. And I stood in front of it, defying it, waiting for something to come out. But there was nothing inside. Just a void. An empty endless void. It was growing and consuming the wall. Then all around me, and I could see nothing. I felt faint, and I collapsed.\n\nI remember waking up to the sound of my brother's voice.\n\n“Jack, are you ok? Jack, wake up”\n\nApparently, people from work had been trying to call me for a whole day and got no response. They called my brother, who was my emergency contact, and he came to see if everything was alright. It wasn’t.\n\n“Dude, what the fuck Jack? What is wrong? Are you ok?”\n\nI wasn’t.\n\nJessica never came back. We talked a few days after all this happened to figure things out and we ended things.\n\nI still live in the apartment, and the hole is still there, but I’ve accepted it and learned to live with it. I accepted there was no fixing it. Funny thing is, I think it’s starting to shrink. The less I think about it, the more it shrinks. It will take time, but in time, it’ll be gone.\n\nSlowly, but surely.", "**Welcome to the Short Stories!** This is an automated message.   \n\nThe rules can be found on the sidebar [here]( https://www.reddit.com/r/ShortStories/about/sidebar).\n\n**Writers** - Stories which have been checked for simple mistakes and are properly formatted, tend to get a lot more people reading them. Common issues include - \n\n* Formatting can get lost when pasting from elsewhere.  \n* Adding spaces at the start of a paragraph gets formatted by Reddit into a hard-to-read style, due to markdown. Guide to Reddit markdown [here](https://www.reddit.com/wiki/markdown)    \n     \n**Readers** - ShortStories is a place for writers to get constructive feedback. Abuse of any kind is not tolerated.    \n     \n***  \n\nIf you see a rule breaking post or comment, then please hit the report button.           \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/shortstories) if you have any questions or concerns.*", "It needs an edit for punctuation and small bits of language, but this is really good.", "Nice. I like the metaphor."]