[{"post_title": "Promote your business, week of April 8, 2024", "post_url": "https://www.reddit.com/r/smallbusiness/comments/1bymqbs/promote_your_business_week_of_april_8_2024/", "post_main_text": "Post business promotion messages here including special offers especially if you cater to small business.  \n\n**Be considerate. Make your message concise.**    \n\n**Note:** To prevent your messages from being flagged by the autofilter, don't use shortened URLs.", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "This is a friendly reminder that r/smallbusiness is a question and answer subreddit. You ask a question about starting, owning, and growing a small business and the community answers. Posts that violate the rules listed in the sidebar will be removed. A permanent or temporary ban may also be issued if you do not remove the offending post. Seeing this message does not mean your post was automatically removed.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/smallbusiness) if you have any questions or concerns.*"}, {"comment_author": "Negative_Theory3081", "comment_text": "I've created a custom image creation service for beauty and cosmetics small businesses\\~!\n\nThis is a service that lets you request and create custom marketing images for solopreneurs and small businesses. You can choose whether to pay after receiving the result. You don't have to study how to write a prompt.\n\n[https://aimforanything.com/](https://aimforanything.com/)"}, {"comment_author": "Thats_Great_To_Hear", "comment_text": "Australian jewellery subscription box service! Get 4 surprise pieces of jewellery handpicked especially for you and matched to your style. \n\nwww.juli.com.au\nInstagram: @juli.com.au\n\nAussie shipping only atm but hoping to expand global one day ☺️"}, {"comment_author": "kissbiz", "comment_text": "I help people with monetizing their hobbies and skills.\n\nwww.sidehustlegpt.app"}, {"comment_author": "Affectionate_Pilot99", "comment_text": "If you own a small business, chat to us. \r\n\nInvesting in your online presence has never been easier or more affordable. Let's work together to create a website that not only showcases your talents and offerings but also helps you stand out in today's competitive digital landscape.\r  \n\r  \nContact me anytime if you are interested. [https://snowieswebsites.shop/](https://snowieswebsites.shop/)"}, {"comment_author": "nikhilsharmass", "comment_text": "Do you have a lot of visitors on your website, but they are not converting? *You may need a CRO audit* \n\nMy CRO audit service makes sure that your website is good enough to convert, and you are not leaving the money on table.\n\n**[Get your CRO audit](https://audit.nikhil.pro)**\n\n—\n\nAre you just starting up and getting no sales/less sales? I can help you with your paid marketing (incl. Google, Meta and Emails) \n\nI have over 5 years of experience and have generated over 10M+ for 100+ brands!\n\n**[Book a call with me](https://nikhil.pro/meeting)**"}, {"comment_author": "ikkeaviy05", "comment_text": "Need a developer or designer on your team?\n\n[devcrewph.com](https://devcrewph.com)"}, {"comment_author": "palebt", "comment_text": "Accept card payments for your business with just your phone.  \n  \nTap to Pay on Android & iOS.  \n  \n[paidforstripe.com](https://www.paidforstripe.com)"}, {"comment_author": "e-comfundamentalist", "comment_text": "Allow me to introduce EquityMatch, your go-to platform for connecting university students with the entrepreneurial world!Benefits:\n\n🔍 Explore New Horizons \n\n🤝 Expand Your Circle: Connect with fellow students, seasoned entrepreneurs, and potential investors who share your passion for creating change. Build meaningful relationships that can fuel your entrepreneurial journey and academic pursuits.\n\n🎤 Pitch Your Vision: Ready to share your big idea with the world? Join our weekly pitch events to showcase your innovation, gain valuable feedback, and attract the support you need to bring your vision to life. \n\n📡 Stay Connected: Stay in the loop with live streams of exclusive events, workshops, and expert panels. Gain insights, stay inspired, and never miss a beat in the dynamic world of entrepreneurship. \n\n🔓 Start for Free: Take the first step towards your entrepreneurial dreams with complimentary registration! Sign up now and explore all that EquityMatch has to offer without any upfront costs.\n\n \n\nJoin us now [https://www.equitymatch.co/subscribe-to-deal-room/](https://www.equitymatch.co/subscribe-to-deal-room/)"}, {"comment_author": "Jorshington", "comment_text": "Hey there! I'm Josh, and I'm a **freelance copy and content writer** specializing in writing web copy for US-based SMBs and content such as articles and blog posts. Let me do what I do best--which is to help your organization position itself as an authoritative voice and gain exposure--so you can focus on running your business!\n\nI'm based in Amsterdam, but I've lived in the Caribbean, U.S, Ghana, and Spain. I have a proven track record of researching and writing for often complex fields (such as law or medicine) and translating it into more readable, everyday language that engages and converts your readers and clients!\n\nI offer cutting-edge and engaging content at competitive rates. Drop me a PM to request additional samples or to see how we can work together!\n\nSamples: https://docs.google.com/document/d/1A3YPkHaGBfarJTG0IhDgZCbJuQ9tbwtqwQolonT6OjE/edit?usp=sharing"}, {"comment_author": "ClydeGraham1312", "comment_text": "Introducing my fashion label [Green Riot](https://www.greenriot.net/i/international-plant-punks-welcome).\n\nVegan apparel for plant lovers – strictly sustainable, earth-positive, and worldwide, climate-friendly shipping!\n\nOur [Etsy store](https://greenriot.etsy.com) is full of cool shirts and other stuff - this is your chance to help a DIY-business out 🤝\n\nLet me know what you think of our new [Tofu Love bundle](https://www.greenriot.net/p/tofu-love-bundle-tofu-love-socks-and-crewneck) 💚🌱\n\n👉 [Etsy Store](https://greenriot.etsy.com)| [Instagram](https://www.instagram.com/greenriot.apparel/) | [Website & Shop](https://www.greenriot.net) 👈"}, {"comment_author": "EggandSpoon42", "comment_text": "We design, install, and repair off grid solar power, especially for RVs and vans. \n\n[indie-solar.com](https://indie-solar.com)"}, {"comment_author": "EffortlessWorkflows", "comment_text": "Hello Everyone! We help small businesses organize, optimize and automate operations. Ultimately, our approach enables you to expand your business’s capacity without increasing your payroll.\r  \n\r  \nWe’re inviting you to join our waiting list this month. Tell us about 1 or 2 business processes you’re itching to automate, and you could be selected for a personalized business automation makeover at a nominal fee, covering our initial assessment and setup costs.\r  \n\r  \nInterested? Learn more and apply here: [https://effortlessworkflows.com/waiting-list/](https://effortlessworkflows.com/waiting-list/) \r  \n\r  \nLet’s make your business more efficient together!"}, {"comment_author": "Desired-Effect", "comment_text": "Desired Effect executive coaching and management consultation. My clients all have less than 1000 employees.\n\nExpertise in KPI monitoring systems, process recording and remediation, retention methods and tracking, leadership systems, pay for performance, performance management, and workshops for your leaders can help improve efficiency and effectiveness.\n\nCheck it out here: https://www.desiredeffectcs.com/\n\nBook a quick compatibility zoom here: https://calendly.com/desiredeffect/compatibility\n\nBest of luck with your business operations!"}, {"comment_author": "orchidtoyscom", "comment_text": "[OrchidToys.com](https://orchidtoys.com) is our adult toy store. We offer discreet shipping on all US purchases! Use code \"reddit10\" to get 10% off your purchase. For every purchase you make we give a portion to charities we believe in. If you are an onlyfans model/streamer or in a long range relationship we now offer [Lovense](https://orchidtoys.com/collections/lovense) toys like the [Lush 3](https://orchidtoys.com/products/lovense-lush-3-0-sound-activated-camming-vibrator-pink)"}, {"comment_author": "GroupJDC", "comment_text": "Full Service Accounting, Payroll, Tax Services 40+ years combined experience\n\n[Groupjdc.com](https://Groupjdc.com) for free consultations"}, {"comment_author": "GardinerAndrew", "comment_text": "**$99/mo All-In-One Website Packages**\n\nIncludes: custom website, hosting, maintenance, unlimited updates, content creation, on-page SEO and domain. Cancel anytime, no contracts. \n\nPerfect for businesses needing a new website or a more affordable monthly maintenance package!\n\n[WorldwideWebDesigns.com](https://WorldwideWebDesigns.com)"}, {"comment_author": "fatcatbookkeeping", "comment_text": "Fat Cat Bookkeeping, bookkeeping for your small business or personal finances.\n\n\nwww.fatcatbookkeeping.com\n\n\nRecently switched to this profile so the username matches my business name. Please feel free to see my main account for years-long post history and additional info: u/themostfluffycat"}, {"comment_author": "RealisticProgrammer2", "comment_text": "Get your business name and logo printed out in vinyl. Use it for the front of your shop or on your car or give to people to put on water bottles. Custom design, choose your size and color.\n\nOr just get something fun. Check out our shop. \n\nhttps://Customvinyldecor.com"}]}, {"post_title": "In this post, share your small business experience, successes, failures, AMAS, and lessons learned. Week of April 8, 2024", "post_url": "https://www.reddit.com/r/smallbusiness/comments/1bymrsq/in_this_post_share_your_small_business_experience/", "post_main_text": "This post welcomes and is dedicated to:\n\n* Your business successes\n* Small business anecdotes\n* Lessons learned\n* Unfortunate events\n* Unofficial AMAs\n* Links to outstanding educational materials (with explanations and/or an extract of the content)\n\nIn this post, share your small business experience, successes, failures, AMAs, and lessons learned. Week of December 9, 2019 \n/r/smallbusiness is one of a very few subs where people can ask questions about operating their small business. To let that happen the main sub is dedicated to answering questions about subscriber's own small businesses.\n\nMany people also want to talk about things which are not specific questions about their own business. We don't want to disappoint those subscribers and provide this post as a place to share that content without overwhelming specific and often less popular simple questions.\n\nThis isn't a license to spam the thread. Business promotion and free giveaways are welcome only in the Promote Your Business thread. Thinly-veiled website or video promoting posts will be removed as blogspam.\n\nDiscussion of this policy and the purpose of the sub is welcome at https://www.reddit.com/r/smallbusiness/comments/ana6hg/psa_welcome_to_rsmallbusiness_we_are_dedicated_to/", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "This is a friendly reminder that r/smallbusiness is a question and answer subreddit. You ask a question about starting, owning, and growing a small business and the community answers. Posts that violate the rules listed in the sidebar will be removed. A permanent or temporary ban may also be issued if you do not remove the offending post. Seeing this message does not mean your post was automatically removed.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/smallbusiness) if you have any questions or concerns.*"}]}, {"post_title": "25 M. 170K+ net worth. I want to start a business but I don’t know how. ", "post_url": "https://www.reddit.com/r/smallbusiness/comments/1byjybd/25_m_170k_net_worth_i_want_to_start_a_business/", "post_main_text": "I’m a 25 year old guy and I have a high paying job but I want to own a business because I want to have more freedom and not rely on my employers. I was thinking about applying to own a UPS store because they provide training and resources needed to own a store or open a new one. I also thought about owning a mall kiosk after I went to the mall today. Maybe buying a laundromat. \n\nBasically my question is what’s the best and most lucrative business to have in the current day? I also have no idea how to start a business. I know nothing about licensure or getting products or even what I’m supposed to know. What should I do to make my dream a reality?", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "This is a friendly reminder that r/smallbusiness is a question and answer subreddit. You ask a question about starting, owning, and growing a small business and the community answers. Posts that violate the rules listed in the sidebar will be removed. A permanent or temporary ban may also be issued if you do not remove the offending post. Seeing this message does not mean your post was automatically removed.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/smallbusiness) if you have any questions or concerns.*"}, {"comment_author": "Global_Discussion_81", "comment_text": "More freedom? That’s laughable. \n\nYou’re going to work more hours and have more stress and anxiety than working a high paying job.\n\nMy best friend has the same mentality as you. He works maybe 35 hours a week on a busy week, can work from home 2 days a week if he chooses, and gets paid 150k. Not to mention all the pto, 401k match, and other benefits. Social media has glamorized entrepreneurship. The stats still don’t lie that most businesses fail. \n\nIf you’re making over 100k a year, save and invest your money in your 20s and early 30s. If you don’t live an extravagant lifestyle, you can likely retire/dial back/open a business in your 40s. \n\nDon’t start a business without a plan. Malls are dead. Where are you going to open a UPS store that doesn’t already have service?"}, {"comment_author": "happytobehereatall", "comment_text": "A+++ comment"}, {"comment_author": "lookwhatwebuilt", "comment_text": "Right?! People think that owning a business is automatic financial freedom, and they want it without having to do anything but post on reddit about wanting it. It takes many years and a lot of expensive lessons, take it from me or anyone else who’s gone through it."}, {"comment_author": "yyc_engineer", "comment_text": ">You’re going to work more hours and have more stress and anxiety than working a high paying job.\n\nThis is such an underrated comment. Rarely comes out. Because most of those that write these basically were successful and have blacked out those periods on account of PTSD. So, it's unicorn and rainbows and 'enjoyable challenge' lol.\n\nReality is that by the time many (including me) figured this shit out.. I was balls deep and pot committed without option to backtrack. So, you have to see things through. Being a highly paid employee is likely the best life you can have. \n\nBeing a successful entrepreneur means your next generation will have that life.. not you."}, {"comment_author": "MinimumSeat1813", "comment_text": "I worked with this accountant. Every single husband of hers wanted to have their own business. None of them liked it when they realized they had to work harder. \n\nIf you want to work harder for years, then starting a business may be for you."}, {"comment_author": "december33rd", "comment_text": "Lol. It’s been 11 months since I started my business, and I have taken zero vacations so far. Zero PTO. Closed my business for two weeks during Christmas and New Years, which was 50% of my monthly income. \n\nProbably put in 80 hours this week trying to resolve an urgent problem crucial to my business. Still only profiting about $10k a month. \n\n40 hour work week with benefits, good pay, no stress from risk of failing business, and such are strong benefits as being an employee. \n\nUpside to being a business owner? The work I put in has direct correlation to my income. \n\nBeen trying to put together a team to run my business without my constant involvement since day 1, and it’s still not complete. Slowly getting there. When I get there, i’ll have more time to work ON my business than work in it. \n\nIt’s a nonstop grind being a business owner. If you stop the grind, your company will most likely slowly fail. People going from a cushy corporate job to being a business owner thinking that it’s gonna be less work are mistaken. It can get there, but it’ll require you to put in the work to set that up. \n\nGood luck OP"}, {"comment_author": "ContributionSuch2655", "comment_text": "DEAD ON."}, {"comment_author": "Stunning-Ad-2563", "comment_text": "Hi. Read 4 hour workweek. Due to the internet, businesses can be massively profitable with only 2 hours of work per week."}, {"comment_author": "L44KSO", "comment_text": "Well said!"}, {"comment_author": "ActiveInteresting535", "comment_text": "Is your friend hiring?"}, {"comment_author": "m007368", "comment_text": "I lost 20lbs the first few months after buying a business. Just waking up stressed and being unable to eat.\n\nI got sued and an alleged workers comp case in the first six month.\n\nIf I didn’t have a pension from my previous job I would just walked away."}, {"comment_author": "jayc428", "comment_text": "Your comment should be pinned to the top of the main board, it’s dead on accurate. \n\nAs you said social media has glamorized business ownership causing too many people to just jump in without a plan or proper funding because they saw some YouTube channel, who’s ironically only business success is convincing people to watch their channel about business success. \n\nThe reality is it’s a never ending minefield. \n\nStats on small businesses failing after 1 year is 20%, after 2 years is 30%, after 5 years 50%. \n\nAverage owner salary is $69k.\n\nOnly 6MM small business even have employees outside of the owner. \n\nOnly around 5-10% of small businesses exceed $1MM in sales in a year. More than half don’t break $100k in revenue. \n\nNot looking to be a doomer but people should really know what the landscape looks like before they commit time and money into something assuming it will work because some YouTuber said so."}, {"comment_author": "TackoFell", "comment_text": "Self employed consultant with two employees here. I work less and make more. \n\nDepends what you’re trying to do. But OP clearly isn’t well set up for something like a consulting company"}, {"comment_author": "Global_Discussion_81", "comment_text": "The amount of times my partners and I didn’t pay ourselves so my employees were paid….there were/are periods of time where I wish I could just show up in an office, put in my 40 hours and go home. Sadly, I don’t think I’m hirable in the corporate world. \n\nI don’t think most entrepreneurs will be successful unless they have experienced the feast or famine times. Something you’ll never experience simply going from high school, to college, to a job."}, {"comment_author": "JJWoolls", "comment_text": "It is a non-stop grind... but when you get it there it IS worth it. I'm 45(almost 46) and I just spent 5 1/2 years growing and building something and I now work less and have \"good\" options to transition to. In 3 years I expect to have great ones.\n\n\nIt's not guaranteed.\n\n\nIt's not easy.\n\n\nAnd that is why it makes sense for some. Because starting/owning a business is a risk/reward proposition. It won't pay off for all of you. \n\n\nGood luck. Take calculated risks. And understand why you are doing it. "}, {"comment_author": "cacawachi", "comment_text": ">Upside to being a business owner? The work I put in has direct correlation to my income. \n\nThis is the most important and probably the only benefit from being a business owner, as an employee, oftentimes you get penalized when you do something that will benefit the company, contrary if you are a business owner,you increase efficiency by 5% and directly benefit from it and everyone is happy.\n\n>Been trying to put together a team to run my business without my constant involvement since day 1, and it’s still not complete. Slowly getting there. When I get there, i’ll have more time to work ON my business than work in it.\n\n\nDelegate tasks no matter how small they are, and make sure you have good and trusted managers, and start this as early as possible (even if you are just starting up)"}, {"comment_author": "Ausernamenottaken-", "comment_text": "What is you business/ industry and what services do you provide."}, {"comment_author": "hairlikemerida", "comment_text": "We’re moving our business to another facility right now and we’re encountering lots of construction hiccups and an incompetent city hall (we’re moving to a different state).\n\nI haven’t deposited a paycheck since August so that my guys still get paid. I process my paycheck and then immediately adding the net back into the QB ledger. Currently sitting at 40k owed to me.\n\nI don’t think people like OP realize that you can do everything right, but you just get knocked down at every turn. Every single step of a project can be bad news. It’s like a video game with a quest that has ten tasks in it and each one of those tasks has fifteen tasks…and you have 10 quests at the same time.\n\nI haven’t been on vacation in five years. Definitely before the pandemic. I’m 26 and my hair has a lot of grey. I have anxiety all of the time.\n\nGranted, my family’s businesses have considerable assets and most people see that and think we have it made, but the truth is that the past five years have just been an absolute terror. This November should be the conclusion of all of the chaos, but it’s taking everything in me not to sink, even knowing that there is a light at the end."}, {"comment_author": "RedHotSnowflake", "comment_text": ">Sadly, I don’t think I’m hirable in the corporate world.\n\nWhy's that?"}, {"comment_author": "Professional_Show918", "comment_text": "So you want to work 80 hours a week for free ?"}, {"comment_author": "drhip", "comment_text": "Noo, I work for myself, even 88 hours a week, and it’s not free, only cost me some sleep, oops"}, {"comment_author": "Salt_Shoe2940", "comment_text": "1). Take, at minimum, introductory business courses in accounting, finance, marketing, public relations, management, and business law.\n\n2). Master a niche field OR a find a problem or void in society and devise a profitable solution.\n\n3). Save money to invest in the business before you start it. Make sure your personal credit is in decent shape."}, {"comment_author": "Trashcan_Johnson", "comment_text": ">I want to have more freedom\n\nYou will have all the freedom of choosing when to work your 60-80 hour weeks. Don't think owning a business means less work and more money. It's usually more work for equal money as a good paying job."}, {"comment_author": "Legitimate_Lion1359", "comment_text": "From someone that worked for a mid-size corporate then a small business then a huge corporate and now owning a small business…..Unless you have a novel idea for a start up then I don’t see you being ready to open a small business. There is a LOT even when you think you know everything. If you really dream about having your own business (like I did) work for a small business for 2-3 years. You will understand a lot of the troubles and assuming you are a smart person (which I am sure you are at 25 with where you are in life) you will find your answer. Without that experience chance of failure is quite high. Again my humble opinion…"}, {"comment_author": "eugenekko", "comment_text": "You're replacing your 9-5 with a 24/7. If freedom is what you're after, you're already on the path. Do your 10-15 years, max out your retirement investment accounts with more on the side, buy and pay off a house, and you're golden."}, {"comment_author": "JJWoolls", "comment_text": "It's more work with less money.... and if you are lucky/smart(with time)... more work with the same money.... and then if lucky/smart(with more time)...more less work and hopefully good money. I wouldn't change it for the world. Because I am betting on me. But if I was betting on someone else I would not take the bet."}, {"comment_author": "cawala", "comment_text": "At 25 with high paying job I would do one of two things. First, keep the high-paying job and start something on the side. This will give you time and financial security to go through the growing pains of starting a business. The second, would be to find a small business that you would want to start and work for them till your ready to start your own. You will learn the business, make conections and be better prepared. \n\nLooking back I wish I had done the second option when I was 25. Instead, I got into an industry that is impossible to start a business in."}, {"comment_author": "ilearnrussian", "comment_text": "comment section is filled with a bunch of weirdos. if you want your own business, own your own business. having a net worth of yours at 25 tells me you have some fundamental skills which go a long way. now that we know business is challenging and risky, thanks to the comments… take that into account and pursue what you want to pursue. unless you’re going to let a bunch of redditors talk you out of it. which in that case then it was probably a good thing. \n\nmy advice to you, with whatever you do, is to go at with passion, a desire to learn, and have integrity. what is meant to work will work."}, {"comment_author": "PopuluxePete", "comment_text": "You're young and likely still dating.  \"I left my high-paying corporate job to follow my dreams and open a kiosk at the mall.\" Is not something I think most suitors would want to hear."}, {"comment_author": "thrillcosbey", "comment_text": "You should market study the business a bit more I know a few of the coin op and car wash operators, it is an option, speak to some people in the industry you want to get into first before you decide , get a mentor or better yet a sherpa and a mentor. \n\nScores is a good place to start and its free!"}, {"comment_author": "rossmosh85", "comment_text": "Owning a business often doesn't mean more freedom.  If you're lucky, you can grow it to that point, but most small businesses are jobs that also pay a dviidend/distribution payment."}, {"comment_author": "datSubguy", "comment_text": "Owning a successful small business is like raising a child. There are lots of great times, and lots of terrible times."}, {"comment_author": "nokarmawhore", "comment_text": "You know what's worse than having to rely on employers? Having to rely on employees you don't know.\n\nThere's a lot of successful businesses you can do. You can look at upflip videos and see if there's anything you'd like to do from there. Then once you find something you're interested in, do some research around where you live at competition and if you can do a better job. Good luck!"}, {"comment_author": "HuskyNotPhatt", "comment_text": "I own a business. I make incredible money. I have no time to enjoy the incredible money. So no time=no life. You can make money but honestly it gets old if you can’t ever leave or do anything else. Your one day off will be ruined by phone calls and errands. It never ends."}, {"comment_author": "hucknuts", "comment_text": "As someone who used to have this exact amount of cash, and started a buisness. For the love of god don’t. Park it in the stock market, focus on your career and enjoy your weekend free time and sanity. \n\nJust rather than quitting dip your toes see if it’s for you. It’s glamorized everywhere if you have a high paying career I’d kill for that."}, {"comment_author": "AutomaticBuyer9872", "comment_text": "Lisa Song owns a few independent pack and ship stores (similar to UPS). There are videos with her on YouTube with Ryan Pineda and Codie Sanchez (2 famous business social media personalities). \n\nGetting into a franchise has some benefits over having an independent shop. Like you said, UPS provides training to its franchisees. You also have the established name and all the systems and processes developed. \n\nOwning a franchise is definitely not mailbox money (even if you are in the mailbox business). You will have to be involved in some capacity, depending on the type of business. It seems to me that the UPS store is set up as a semi absentee model."}, {"comment_author": "RosieInsights", "comment_text": "I agree with legitimate Leon. You could work for a small business in the meantime while you're figuring things out.  That way you got some income get coming in and you get an education for free. \n\nYou could also think about joining a small startup."}, {"comment_author": "loochthegooch", "comment_text": "Entrepreneurship can be tough, but there is a science to it. It’s really nice when you find something you really enjoy doing, chances are others enjoy it as well and within that community you can find problems to solve.\n\nmaking money is a great end-game. I find, however, that to get through the early months without money, you have to at least enjoy what you do.\n\nTry talking to as many people, businesses, communities as you are interested in. Ask them what they struggle with. You may start to notice patterns of problems across the 10, 50, 100, or more people you’ve spoken to. These are signs that there is a problem you can solve. If the pain is great enough, or the benefit clear enough, they pay you gladly.\n\nAlso don’t underestimate the trades, services businesses, etc. there’s a reason they are always in demand. Although it can seem crowded, you can easily standout in smart ways.\n\nGood luck my guy. You will do great things. Happy to help if you want to shoot me a dm, I’m part of a community of service businesses that help one another to grow"}, {"comment_author": "hierosir", "comment_text": "There's a lot here. And some terms need to be defined before we can answer. Firstly - what do you mean by wanting \"more freedom?\"\n\nDo you want more spare time? Or do you to have more authority over your life? \n\nIf it's spare time, it's likely not through a small business (though not impossible. You could choose to have a \"lifestyle business\", meaning you make choices to give time, not economic reward.)\n\nIf it's more self actualization - yes, a business is a good way to go. \n\nNow, what business? My advice would be to not think about \"what's the best business for money?\" At least not as your first axiom.\n\nInstead think about \"what problem am I most interested/capable to solve for others?\"\n\nThink of that first. And then think about \"how can I make solving this problem most economically viable?\" (That's where you think about business model.) Eg. You could choose to help people with removing garbage. Garbage is the problem you're solving. You could choose to solve that by running around with a bag and pick it up by hand - charged per hour. OR you could give people big bins where they deposit it themselves on premise, and you come around with a truck to collect it weekly/monthly, for a recurring fee.\n\nThe latter is likely a better business model to solve the same problem.\n\nAfter you get this far... All businesses need some fundamental skills. 1. Marketing, 2. Sales, 3. Fulfillment, 4. Operations.\n\nWithin each bucket there's lots of sub skills.\n\nMarketing: building a website, copywriting, running ads, email automations, SMS marketing, buyer intent/journeys, etc.\n\nSales: sales cycle design, B2B sales, b2c sales, objection handling, tonality, sales team management, sales talent hiring, etc.\n\nFulfillment: customer journey design, workflow automations, etc.\n\nOperations: IT, HR, Legal, Payroll, Tax etc.\n\nLearn these peacemeal as your business requires. YouTube & Google are your friend. At first when you have no money to hire people to do the above FOR YOU, youll have to do it yourself. But as time goes on you can hire people (employees, vendors, freelancers, software) to do it for you."}, {"comment_author": "karlitooo", "comment_text": "The laundromat game has been popularised by Codie Sanchez recently, she talks about how she got into it [in this interview](https://www.youtube.com/watch?v=XkxZCJ2pYqs)"}, {"comment_author": "heatdish1292", "comment_text": "Hahahahahahaha more freedom he says!"}, {"comment_author": "golden_score4250", "comment_text": "Don’t look for something to do, look for a problem you can solve. Work backwards from there. \n\nOnce you have an idea, dm me and I can give you some tips."}, {"comment_author": "Browsinandsharin", "comment_text": "It would probably be better to learn to buy a business that is already running and not too much extra labor and then when you get used to that expand and or buy another one"}, {"comment_author": "Browsinandsharin", "comment_text": "Also not for everyone but because of your financials and youth it could work out"}, {"comment_author": "ichoosejif", "comment_text": "pressure washing"}, {"comment_author": "Rags2Rickius", "comment_text": "Freedom comes with either:\n\nFull automation of something (unrealistic)\n\nHiring employees \n\nThe first one will require the second one to some extent \n\nThen you need to manage those employees \n\nThere’s no such thing as more free time"}, {"comment_author": "RealisticProgrammer2", "comment_text": "Don't start a business, buy one that is already cash flowing. Still won't be easy, but better chance of success."}, {"comment_author": "JohnnyBoySloth", "comment_text": "\"More freedom\" and \"Not rely on my employers\" lol.\n\nA business can get to a point where it's passively bringing you income but unless you build that by putting in 80 hour weeks, it's unlikely to happen by itself. \n\nYou may not have to rely on employers, but you will have to rely on other things such as: Employees, vendors, paying customers.\n\nMake your dreams a reality by studying what the reality of running a business is. Not asking what business you should buy, because it's not that simple."}, {"comment_author": "SnooBananas2002", "comment_text": "You have to be certain on what your business is going to be. Don't go in to \"try\", go own like a boss and take it by the horns and own it."}, {"comment_author": "Life-Mine-3549", "comment_text": "Business does not equal freedom. \n\nBe prepared to work your ass off for at least 2-3 years before you get a breather. \n\nI’m 27, been doing the entrepreneurship stuff since I was 22. \n\nHave hit 7 figures gross 2 out of the 5 years. \n\nNet is roughly 40%. It’s good, but I work my ass off still have haven’t delegated enough to step out of completely key positions. \n\nSo a high paying job isn’t always bad. Just be strategic"}, {"comment_author": "stuiephoto", "comment_text": "This will be harsh.\n\n\nTo be a business owner, you need to be resourceful. You are the owner. You're human resources. You're the janitor. You're the IT department. You make every decision and must be a jack of all trades. There is a reason that most small businesses fail. \n\n\n>thought about owning a mall kiosk\n\n\nDid you *actually* think about this? The fact that this idea is even in your head makes me think you have a lot more learning before you are ready. Malls are a dying business model. They are closing all over the country. People don't shop in malls anymore. Additionally, a mall kiosk isn't a \"small business\" so much as just a job. There's almost no potential for growth. \n\n\n\n\nThe lower the bar for entry, the less potential there will be. Starting at the lowest, you commonly see people on reddit starting \"businesses\" selling stuff on etsy and eBay. This has the lowest bar for entry and you won't make a living doing this. \n\n\nUPS stores have a relatively low bar for entry-- that bar being cash.  If you have the cash you can have a store. This creates the potential for market saturation and also creates the potential for you to fuck up majorly and choose a poor location. UPS stores are not what they once were. With shipping software becoming more mainstream day by day, youre entering a market where you are needed less and less. As old people die off, your customer base dwindles. The younger generations are printing their own postage at home more and more.  Looking at the stats, it appears that as much as 60% of the UPS store locations break even or worse. Most locations make the owner less than minimum wage -- or worse. \n\n\nI would do a lot more reading before you get sucked down a path. "}, {"comment_author": "tinyforth", "comment_text": "Don’t do it. It’s double the work for less money."}, {"comment_author": "ardoza_", "comment_text": "Acquisitions"}, {"comment_author": "EastValuable9421", "comment_text": "It's starts out with 80 he weeks. Then over time you'll gain more and more freedom."}, {"comment_author": "ste6168", "comment_text": "Start a business to have more freedom… lmao.\n\nYou’ve clearly never started or ran your own business.\n\nIf freedom is what you want, keep the 9-5…"}, {"comment_author": "JayjMont", "comment_text": "You won’t have more freedom as business owner. Every day, every night, every minute I’m on call. \n\n\nDon’t get me wrong, I love it. But be prepared to commit your life to it for the first few years, at least."}, {"comment_author": "kbwalk3", "comment_text": "Sounds like a franchise would be good for you. Hook up with a franchise broker and let them show you what's out there."}, {"comment_author": "Abusedbyredditjerks", "comment_text": "I’m business owner and owning a business isn’t a freedom. You also work more hours than you should, compromise weekends and holidays… the only and only benefit of having own business is not listening/folllwiung someone’s else lead. Like if you aren’t people person maybe it’s gong or make a cut for it … I would say if you aren’t making 300k MINIMUM on your own, and I mean salary, don’t even open your own business it’s not worth it"}, {"comment_author": "Peterd90", "comment_text": "Talk to a reputable franchise and business brokers in your area and find out the options.  They will save you a lot of time and they are typically paid for by the franchisor or business seller.  They will welcome talking to a prospective buyer with cash to close.  \n\nFiling to start a new LLC or S Corp is relatively easy.  Finding a good business is hard.  In my case, I targeted older business owners that wanted out of the business and  off their lease obligations.  Lots of boomers that want to retire."}, {"comment_author": "seyedalijavid", "comment_text": "Dont"}, {"comment_author": "Unusual_Photo_4964", "comment_text": "You should consider buying a business"}, {"comment_author": "Complete-Stomach9355", "comment_text": "There are businesses which don't need that much work but initially u might have to give more hours than a job either ways because the mind needs to adjust"}, {"comment_author": "AValhallaWorthyDeath", "comment_text": "OP, I would suggest reading/listening to The Millionaire Mind and go from there. Thomas Stanley is the author of The Millionaire Next Door and he presents his data of researching the wealthiest people in our society in an eye opening way."}, {"comment_author": "couldbutwont", "comment_text": "What do you do now?"}, {"comment_author": "Complete-Stomach9355", "comment_text": "If u r innyc we can meet and go for coffee I can solve some blocks u might have"}, {"comment_author": "Slepprock", "comment_text": "Its a good goal. \n\nBut you really need to find what type of business works best for you.  Some people just want something that is easy and makes money. Others what something that gives them purpose.  The best businesses are the ones that you never saw yourself doing, but love anyway. \n\nI went to college for electrical engineering and also got my MBA.  But I hated the corporate life.  I now own a cabinet shop and come home covered in sawdust everyday.  Something I would have never imagined 20 years ago.  But I love it.  I have the freedom of being my own boss.  Which isn't freedom from work, but freedom from doing shit I don't want to do. I never plan on retiring, because its so enjoyable.  \n\nThis isn't my first business though.  I had some other failed attempts when I Was younger.  \n\nYou just need to try a lot of things and figure out something that you love.  I wouldnt' get involved in any franchise things though.  My family did that when I was a kid and it sucked."}, {"comment_author": "vickdaa", "comment_text": "Purchase a business and learn till it fails...it will since its your first unless you are lucky"}, {"comment_author": "TigersBeatLions", "comment_text": "Owning a business does not give you more freedom. You mentioned good ones..UPS (those mail boxes are key revenue), laundry matt.\n\nThere will be pros and cons to all of them."}, {"comment_author": "WorldofCreatives", "comment_text": "Get a validated idea from www.startmyidea.com They send new ideas everyday based on market trends"}, {"comment_author": "JimErstwhile", "comment_text": "SCORE is a free program staffed by business owners and others experienced in business. They offer classes to help folks looking to get started in business. I took a class and it was very helpful."}, {"comment_author": "justbrowzingthru", "comment_text": "Everyone dreams of being a business owner and not relying on an employer for a paycheck, and being able to set their own hours.\n\nSo some spend their life savings and take out loans to be a business owner.\n\n Now they have to rely on customers for their paycheck and employees that may or may not show to work to work for them, and they are on call 24//7\n\nCovid has made it very difficult to get and retain quality employees and managers.  \n\n170k to open your own business isn’t much.  \n\nI dont know what you consider high paying.\n\nBut UPS stores and mall kiosks are not high paying.\n\nThere are always existing ups type stores up for sale for less than opening.   \n\nFor instance an upscale franchise selling for $219,500 comes with owner cash flow of 64k.\n\nA good chunk of their business is Amazon returns And if Amazon ever stops using them, oh boy. \n\nFor your price, a sweaty startup would probably give you the best shot at replacing your income, but it will involve more working hours."}, {"comment_author": "GalacticThievery", "comment_text": "Malls are dead bro"}, {"comment_author": "sk8xnick", "comment_text": "Bro before thinking bout a business think on this first:\n\n1. Am I a wild predator or I'd rather have a smooth balanced life?\n2. Am I a good manager (good means you're tough and cruel when needed and you know when you need to be that kind of man)\n3. Calculate the risks and potential profits. Maybe it's worth investing in a real estate. \n4. Do I have something to offer to the crowd that solves the problem. Or Can I create a problem, convince people that they need solution and sell solution (97% of the market does it.   \nLately there are videos online on microscoping toothpastes, food, etc, showing microorganisms and micro pieces of trash. So we will see new products to get rid of these. But we've lived millions of years here and swallow numerous micro trash from air, ocean, showering.. it all dies. BUT this is marketing. \n5. I can find partner a few levels up there for mutual side projects."}, {"comment_author": "matthias_lee", "comment_text": "Dont do Delis, loooong hours,  too much perishables, big electricity bills for refrigeration, profit margins are small on pretty much everything except for beverages..  Liquor stores are much better, but you still have to deal drunks/addicts.."}, {"comment_author": "Full-O-Anxiety", "comment_text": "Social media for entrepreneurs are like supermodels to teenage girls.\n\nCompletely unrealistic and unattainable for the average person. Most will fail, few will flourish."}, {"comment_author": "Echizen88", "comment_text": "Anything business on the internet. If you own a physical place, there will be no freedom! And tougher to scale."}, {"comment_author": "StilFindingName", "comment_text": "Would you share whats your job? is"}, {"comment_author": "wpgMartialArts", "comment_text": "If you own a business, the freedom you’re looking for… it’s in the future, maybe, if you are lucky.\n\nUntil then prepare to work 60-80 hour weeks, have 0 holidays or sick days.\n\nHave employees that get paid more than you, for far less work, and do get sick and vacation time.\n\nIf you are cool with that for the next couple years, go for it :)\n\nFreedom and stability are not something you get from the start though."}, {"comment_author": "gage540i", "comment_text": " What are you good at? Do you enjoy working with people, creating things, or solving problems? Choose a business that aligns with your skills and passions. Research the industries you're interested in. Look for trends, growth potential, and competition. Consider factors like location, target audience, and the overall economic climate.\n\nFranchises like UPS Stores offer training and support but require an initial investment and ongoing fees. Research franchise ownership requirements and success rates.\n\n Kiosks can have lower overhead costs but may have limitations on product range and customer traffic. Research kiosk success rates in your target mall and the type of products you sell.\n\n Laundromats offer a steady income stream, but require equipment maintenance and management. Research laundromat profitability in your area and consider competition.\n\n**Starting a business is a marathon, not a sprint**: Be prepared for hard work, long hours, and unexpected challenges.\n\nDon't be afraid to start small and scale up as you gain experience.  Congratulations on taking the first step toward your dream!"}, {"comment_author": "SDoNUT1715", "comment_text": "Lol you don't own a business. A business owns you. If you want to be able to just work 9 to 5 and worry about work, then you shouldn't own a business. You take that shit home with you."}, {"comment_author": "Shmogt", "comment_text": "Don't bother. Stick to your high paying job and use the money to invest in completely normal things like an etf of the S&P 500. Starting a business with no business knowledge and throwing money at it will only result in stress and you losing all your money. Only start a business if you already have a great idea that could actually benefit people. That's when you start looking into what you need to do, the costs, etc. Don't just look for anything and assume it will go well because you are using lots of money to get into it"}, {"comment_author": "frozenwalkway", "comment_text": "rather you gamble half of it in the stock market than gamble all of it on a business lmao"}, {"comment_author": "DopeboySkrilla", "comment_text": "Look into franchising"}, {"comment_author": "Reveal-Great", "comment_text": "You have to know what product or service you are uniquely positioned to provide. Otherwise you will get drowned out by competitors. If you don’t offer anything unique, you can bridge this gap by learning and specialising in something. Then find a niche, market to and serve them better than anyone else."}, {"comment_author": "Terrible-Vegetable-3", "comment_text": "A few years ago, I took around 100k out of my savings and started my own company in the field I was working in. I worked as a site forman with my engineering background with absolutely no experience in management or sales. Long story short, the first year was pretty stressful but we made it. I make insane money now, but I work at least 60 to 70 hrs a week minimum, chain smoke cigarettes and while packing chaw all day, I'm always on the phone putting out fires and I rarely get to spend time with my family. My family is happy and stress-free, but my life is miserable and I know the stress will kill me eventually. \n\nIs it worth it??? Hell yeah.\n\nMake sure you pick a business you know and 100% understand."}, {"comment_author": "perduraadastra", "comment_text": "Keep your job."}, {"comment_author": "resonatingcucumber", "comment_text": "Business is hard. My last business my partner screwed me out of my dividends, had to take a loan. Since it wasn't paid for a year the HMRC tax bill from the previous year stacked up so 6 months ago I was 35k in debt with a 18k tax bill and decided to take my last 3k and set up my own business. \n\nI worked 100+ hours per week for months luckily it's working out and I now have paid the tax bill, down to 15k in debt but it's going to be a year at least before I am able to start saving again as the next tax bill will come due and all my money has been spent trying to get back on my feet.\n\nI work evenings, weekends. If I burn out I just have to find a way through, there is no one else to turn to. My life is work and no one really gets it. It strains relationships, pushes friends away. \n\nI took a whole weekend off this week and I'm not excited to start work this week. There are a thousand tasks to do and I can't afford to hire someone till I'm back on my feet. \n\nI earn around 15-20k profit but it's not like I can touch that. I have all my big projects coming to an end, my next set of big projects are quoted but no one is appointed so it's looking like a slow down before summer starts. I'm having to do active business development during the day. Chargeable work at night. If I'm tired it doesn't matter I have to get it done. If I get stuck I have to figure it out and quickly or I won't  be paying rent this month. \n\nFinancial freedom is not something a business gives, it's a tool to build wealth but it's the hard road. No one tells you about the choice of do I grow the business or pay myself so I can get groceries. No one tells you about how to deal with a liability claim due to a pissed off client where you went above and beyond. No one tells you that some days you'll be stressed due to the work and the next will be your pipeline of work is drying up. The next day it's all looking healthy and the day after your biggest contract falls through leaving you short and back to square one.\n\nIt's the hard road and I always tell people unless you are financially set already with a good safety net it's going to likely fail."}, {"comment_author": "The_Northern_Light", "comment_text": "Mate you’re going to get wrecked if you proceed"}, {"comment_author": "CampShermanOR", "comment_text": "Don’t do it. I had your exact mindset. Wish I’d climbed the corporate ladder instead. Has probably cost me a million dollars over 15 years."}, {"comment_author": "killasirr", "comment_text": "You're asking the wrong question. It's not about what's the most lucrative business or industry, chances are there's people who are better and more qualified doing it already. What you need to do is some deep self reflection. What are you so profoundly good at? What value can you bring to others? How can you monetize your value? How can you reach x amount of people and showcase that value? Read as many books as you can, reflect on your skills and experiences, talk to CEOs and founders and you'll gain clarity."}, {"comment_author": "Matrix-Agent", "comment_text": "Buy an online business - hire someone who's an expert at that to run it for you"}, {"comment_author": "arefxp", "comment_text": "You are not wrong to seek freedom, however i wouldn't start any physical business when big money is made online. \n\nIf i were you, id do the job for a year or so, in the time id start developing a linkedin or twitter network and an email list in a high demanding niche, educate myself and focus on personal branding. \n\nIf you are good in front camera, tiktok, youtube a great option. \n\nIf you do it correctly, consistently and people find value in your content, at some point within 4-6 month you should start earning money from the list/network. Then its a maintenance. \n\nIf you can scale gradually and steady, you could let go of job after year and half or so. Then id diversify the money, create multiple stream of income.\n\nHope that helps"}, {"comment_author": "jkg2001", "comment_text": "Well, what business can you do semi-passively that’s easily scalable and you can start immediately? \n\nOnline sales.\n\nSell on eBay or Amazon. Don’t give up. Finding your best few profitable products can take 2-3 months. Youll get there though."}, {"comment_author": "Weather53", "comment_text": "A lot of people in the comments just don’t get it. Just because Joe down the street is a slave to his business and never understood how to scale it and take himself out of the equation, doesn’t mean everybody is the same way."}, {"comment_author": "Independent-Oven2063", "comment_text": "Let me help you!"}, {"comment_author": "ecommarketingwiz", "comment_text": "Hey OP \nYou can start a business but you need to take it slower. \n\nThere are 3 main routes \nThe service route: \nYou can sell something that you know how to do on the side. \nBy having a side hustle you will learn how to get customers, handle the operations, do the accounting etc \nIf you manage to scale it, you will have your business ready in 2-3 years \n\nThe product route \nIf you want to sell a product, you need to build substantial knowledge about it. \nI propose that you pick one product and order a small quantity first. \nTry to sell it to friends and family and local consumers or businesses and if you find it easy to sell, then order a bigger quantity and then a bigger quantity etc. \n\nThe buy a business route: \nThis is the most tricky one as you will have to spend money upfront. \nI suggest that you look for businesses in your area that are very successful but their owners want to retire. \nOffer them a buyout but ask them to stay another year in, so that they can teach you the basics of the business. \nThis can be the safest route to having your own business. \n\nGood luck 🤞"}, {"comment_author": "Admirable_Camp_8135", "comment_text": "Don’t quit your day job… start a business on the side and see where it takes you… most first time businesses don’t succeed. You really need a business that interests you or you are  knowledgeable about, learning on the job is expensive."}, {"comment_author": "YTScale", "comment_text": "You clearly have a skill that’s made you this much.\n\nStart a business with that skill. Offer it to multiple clients.\n\nSo many people abandon the skillset and experience they’ve worked for to start a business totally unrelated… It can work, but you’ll find it 10x easier to start making some revenue just offering your current skill as a service to clients.\n\nThis is exactly what I did. Signed 3 clients in 30 days for $160k revenue by simply offering my service (my previous job responsibility) to multiple clients."}, {"comment_author": "Pinoybl", "comment_text": "The grass isn’t greener on the other side.\n\nYou’ll have less time, but work on what YOU want.\n\nWill make less money and less freedom in the beginning.\n\n“Best and most lucrative” is a pipe dream and unrealized\n\nEvery business has its pros and cons. No business has an upside WITHOUT A DOWNSIDE."}, {"comment_author": "Trollz4fun2", "comment_text": "Read Rich Dad Poor Dad by Robert Kiyosaki. It's pretty good place to start on your Capitalist journey. Specifically pay attention to the ESBI cash flow quadrant"}, {"comment_author": "BusinessPlanMan", "comment_text": "Mybusinessplanman.com"}, {"comment_author": "ayyy_MD", "comment_text": "spammanplan.com"}, {"comment_author": "PopuluxePete", "comment_text": "You're young and likely still dating.  \"I left my high-paying corporate job to follow my dreams and open a kiosk at the mall.\" is not something I think most potential mates would want to hear."}]}, {"post_title": "Roast my product", "post_url": "https://www.reddit.com/r/smallbusiness/comments/1bytcm5/roast_my_product/", "post_main_text": "Hi all, I am looking for some feedback on a tool I made.\n\nBackground:  \nOn the side, I do some one-on-one consulting, it's incredibly small, I get maybe 1-2 clients a week on average. It's been picking up a little bit and I notice I don't do a good job of following up on leads. To assist me in this, I looked into CRMs and I was not very fond of the pricing structure, nor how complicated they are. I ended up spending more time learning the tool than potentially the time it would save me. So I decided to make my own that is tailored for myself.\n\nThis is basically a pre-alpha prototype. The core functionality is to integrate it into gmail and you manage all of your clients within gmail. You create your own pipelines and you assign a status to each client and whenever you progress in the pipeline you just drag that email over the new status to update it. When you send an email to a new lead, it will remind you after 7 days to follow up if theres been no response.\n\nHere is a demo, please let me know what I can do to improve it: https://twitter.com/mingmakesstuff/status/1777256668604273106", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "This is a friendly reminder that r/smallbusiness is a question and answer subreddit. You ask a question about starting, owning, and growing a small business and the community answers. Posts that violate the rules listed in the sidebar will be removed. A permanent or temporary ban may also be issued if you do not remove the offending post. Seeing this message does not mean your post was automatically removed.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/smallbusiness) if you have any questions or concerns.*"}, {"comment_author": "jsl96-", "comment_text": "Looks awesome! Sent u a dm"}, {"comment_author": "Sudden-Jello-8585", "comment_text": "The drag and drop is actually a very nice feature. There’s potential here for sure"}, {"comment_author": "bestusenetreviews", "comment_text": "Looks solid, nice work"}, {"comment_author": "mr-ratel", "comment_text": "Looks great, like something I could use"}, {"comment_author": "mayallbeingsbepeace", "comment_text": "Looks easy and fun!"}]}, {"post_title": "Partner using company card for personal expenses", "post_url": "https://www.reddit.com/r/smallbusiness/comments/1byo95c/partner_using_company_card_for_personal_expenses/", "post_main_text": "One of my partners has been spending tens of thousands of dollars for at least the last 6 plus months on our company credit card for take out, gas, groceries, ubers, etc, and is claiming his majority ownership in the business gives him unilateral decision making in all spending and that it's his right as the managing partner to do so. \n\nThis was an issue a few years ago when we first launched after he spent several thousand dollars for similar personal expenses. At the time, it  was addressed with firm warning, a repayment schedule, and very clear instructions from me and our other partner that this was not okay, and that all further expenses be preauthorized or paid by him personally and then submitted for reimbursement. \n\nI don't know what to do as he's now refusing to own up to this behavior as he seems to think it would be an admission of guilt which we could then use against him, despite us having video/audio recordings, slack conversations and the books that already clearly demonstrate the truth.\n\nThe business is growing like mad, is very profitable, and he has been instrumental in building it, despite a laundry list of quarterly colossal fuck ups. He is also, by and large, the face of the company and has all but promised mutually assured destruction if taken to court. \n\nMy current request is that he own it, commit to a repayment schedule, and since this is a repeat offence, I want him to relinquish majority decision making to either all three of us by vote, or just my allow my other partner to serve as president/ceo for the foreseeable future.\n\nAny advice or feedback from this sub would be greatly welcome here. ", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "This is a friendly reminder that r/smallbusiness is a question and answer subreddit. You ask a question about starting, owning, and growing a small business and the community answers. Posts that violate the rules listed in the sidebar will be removed. A permanent or temporary ban may also be issued if you do not remove the offending post. Seeing this message does not mean your post was automatically removed.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/smallbusiness) if you have any questions or concerns.*"}, {"comment_author": "LucidHams", "comment_text": "Please hire a lawyer… this could get nasty. Learn from my mistakes… business lawyer up."}, {"comment_author": "saltiesailor", "comment_text": "Working on it."}, {"comment_author": "Discom0000", "comment_text": "Perhaps you can all agree on an expense account for each partner with either the same limit or weighted using the equity split in place. Treat the money spent so far as an advance on his expense account. \n\nAt least that way everybody gets to live it up in the same way and if there are plenty of profits to go around it won’t sink the ship. \n\nDo consult your tax attorney on the tax implications and what is allowed to be expensed and what isn’t.\n\nMaybe it is also time to start paying some dividends to shareholders to give everyone some spending money."}, {"comment_author": "saltiesailor", "comment_text": "I like it! It's not perfect, but this is the sort of thing that let's everyone save face. Thank you friend!\n\nUnfortunately, this partner is already on full salary and now needs more so he doesn't 'have' to keep using the company card. It's an impossible situation."}, {"comment_author": "december33rd", "comment_text": "My solution to this is to have a personal expense credit card for the partners. Spend what they need on the card, categorize it as expense, subtract the amount from what they get paid as dividends/salary. This way, all partners can enjoy the tax benefits of being a business owner with fairness."}, {"comment_author": "NotPromKing", "comment_text": "Not a lawyer, but if this is an LLC spending like this could run the risk of “piercing the veil” and opening you all up to losing personal assets if you get sued."}, {"comment_author": "Global_Discussion_81", "comment_text": "What’s his financial compensation like? Just trying to put myself in his shoes. It sounds like he may think he  feels like he is owed more because of the work he put in, he’s the majority owner, and as you put it, the face of the business. \n\nIf the business is growing, and there’s profits to go around. Monthly or biweekly payouts wouldn’t be outrageous."}, {"comment_author": "saltiesailor", "comment_text": "Was making $50+k which we bumped to $70+K."}, {"comment_author": "waverunnersvho", "comment_text": "The business isn’t that profitable if that’s all the managing partner makes. \nHave him buy you out. Take what you can get  and run. Let it be a lesson in never having partners."}, {"comment_author": "lastgreenleaf", "comment_text": "We also don’t know what the roles of the other 2 partners are. Are they silent partners who are underpaying the managing partner, who is running the show and making it “grow like mad and be very profitable”? What percentage of total revenue is ~$20k in discretionary expenses? \n\nI feel like a ton of context is missing here. "}, {"comment_author": "saltiesailor", "comment_text": "We are in growth mode so the plan is for all profits go into new locations and more inventory."}, {"comment_author": "saltiesailor", "comment_text": "Annual revenue just hit 7 figures and our other sometimes paid partner runs literally everything....non of us are silent. \n\nIs $20k in discretionary expenses on personal expenses for gas, fast food, etc, normal and considered best practices? If I'm being unreasonable I'd like know sooner than later."}, {"comment_author": "QWatcher_2024", "comment_text": "May I know what what's the field your business in?"}, {"comment_author": "ten_jack_russels", "comment_text": "I’ve been in this boat before.  It caused a massive tax problem.  1 time in my life I had a partner on a venture and they did exactly what your mp did.  I wanted to send him to bealize and almost did.\n\nIt cost me a ton of money, destroyed the business.  Set me back.  It’s not how many times you get knocked down, it’s how many times you get up."}, {"comment_author": "GameFuckingStonk", "comment_text": "Cancel all existing debit and credit cards issued to partners. Agree on an expense account for all 3 partners. Sign up for Brex or Ramp to monitor it. Treat his current spending as an advance against his expense account. Automate the decision making to cut off the spending after certain $ spent is reached every month or a receipt is not provided within a week."}, {"comment_author": "JJWoolls", "comment_text": "If he is the face of the business and if the business needs him to survive he has leverage over you. You need to figure out how to deal with this before you can really do anything. \n\n\nI had a partner that had leverage. Took years of maneuvering to get him to a place he did not before we could really work out the relationship.\n\n\nGood luck."}, {"comment_author": "saltiesailor", "comment_text": "Thanks for that. I'm quite sure I could grow it without him, it would just require a very expensive rebrand."}, {"comment_author": "ragnar_danneskjold1", "comment_text": "You should have an \"operating agreement \" that should detail how you operate as partners and a business.  Hopefully, it claries expenditures, use of company funds, etc. Oftentimes, there are limits on spending and may need additional partner approval.  Hopefully, you had one done when the company was formed. If not, you are in an uphill battle. \n\nOp agreements are the key to keeping things managed by rules, guidelines, and legal black and white. It removes emotion and most speculation. \n\nIf you are gonna pay an attorney, and you do not have one, it would be a valuable investment and protect the company moving forward."}, {"comment_author": "2020willyb2020", "comment_text": "“A qualified business expense “ or is salary"}, {"comment_author": "zzmgck", "comment_text": "Sounds like a great way to learn more about how the IRS operates."}, {"comment_author": "WebbyBabyRyan", "comment_text": "He’s the face of the company, and was only making $50K but yet you’re “very profitable?” Gas/Ubers/groceries is not a big deal 🤣 you’re acting like he’s going to Bora Bora once a month on the company card. \n\nI’d say get over it. You sound like the problem"}, {"comment_author": "badcat_kazoo", "comment_text": "Eating out, gas, and taxis can all be justified as a business expense when used for business. Groceries a bit harder to do unless you have a business’s gathering at your home.\n\n\nIf written off as a business expense can anyone prove it was not?"}, {"comment_author": "Buffalo-Trace", "comment_text": "If it’s not hurting ur working capital.  It depends on how u r structured.  If u r an scorp 1099 all of his expenses.  If ur a partnership make sure these owner draws get assigned only to him at tax time.\n\nBut this is the least of ur problems.  It’s more do u want to be in business w a partner that does not respect the other partners, your operating agreement, or the potential liability his actions r causing?  He’s never going to stop when money gets tight for him personally."}, {"comment_author": "Bobby___24_7", "comment_text": "You seem like a jealous as b"}, {"comment_author": "rates_trader", "comment_text": "That is called embezzlement, fyi \n\nthere is a reason why businesses have business bank accounts"}]}, {"post_title": "Minimum \"reasonable salary\" on $68K income?", "post_url": "https://www.reddit.com/r/smallbusiness/comments/1by9ynb/minimum_reasonable_salary_on_68k_income/", "post_main_text": "Second question of the day...\n\n  \nI recently set up a S-corp and am in the process of setting up payroll for my business. What is the minimum reasonable salary on a $68K net income? My accountant said $20K but that seems really low esp given that the average salary on Glassdoor for my profession (copywriter) is around $63K.", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "This is a friendly reminder that r/smallbusiness is a question and answer subreddit. You ask a question about starting, owning, and growing a small business and the community answers. Posts that violate the rules listed in the sidebar will be removed. A permanent or temporary ban may also be issued if you do not remove the offending post. Seeing this message does not mean your post was automatically removed.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/smallbusiness) if you have any questions or concerns.*"}, {"comment_author": "finiac", "comment_text": "Reasonable salary is facts and circumstances based. What would you pay someone to do this job for you based on where you live"}, {"comment_author": "Engine_Mammoth", "comment_text": "This person is correct.\n\nYour reasonable comp is likely all of your net and it likely wasn't the best year for you to elect sub s."}, {"comment_author": "Lustwander46", "comment_text": "Well I live in Spain so my cost of living is much lower than it would be anywhere in the US. So not sure that is relevant to me. I'll give this some thought tho. Thanks!"}, {"comment_author": "Mister_Analyst", "comment_text": "If you're located in Spain, how did you set up an s Corp?"}, {"comment_author": "Acceptable_Job1589", "comment_text": "The og comment is correct. Determine what it would cost to pay someone to do the work from you. That's what reasonable comp is.  In some instances that may be 100%+ of your revenue. Therefore, you should probably take it all as W2 comp.\n\nI've also heard CPAs argue that if you take 70% as W2, it would be difficult for the IRS to argue against that. Not sure where they got 70%, but I've heard four CPAs independent use this number.\n\nAlso, not that you are automatically going to get audited, but it's important to know what the penalties could be if the IRS found you weren't taking reasonable comp. I've seen business have to a.) pay payroll taxes on the failed amount b.) penalties for failing to pay the payroll taxes timely and c.) fees to the IRS agents time. It's no small issue as these can be in the thousands or tens of thousands."}, {"comment_author": "Cookieisforme", "comment_text": "My accountant thought it was appropriate to pay what i would pay someone local to do the job (also abroad)."}, {"comment_author": "Lustwander46", "comment_text": "My entire business is remote. As a US citizen, I pay taxes in the US and for tax and legal purposes, am a US resident"}, {"comment_author": "East-Magician-9412", "comment_text": "Half correct. Reasonable salary is based off of what you would pay someone to do the same job but that’s only one determining factor. A $20k salary is going to reduce your profit more than $20k and that number is determined based on the profit after the $20k salary. Your accountant is correct but if you feel the need to validate his opinions there are webinars on CPAacademy.com that discuss all factors when it comes to reasonable compensation in the US. There are also webinars on foreign companies doing business in the US and the regulations you may or may not be subject to. Edited to add that depending on business regulation where you’re currently located it may be beneficial to organize where you are to avoid the US tax machine meddling in your business."}, {"comment_author": "billythygoat", "comment_text": "Do you live in the US a majority of the time?"}, {"comment_author": "bubumamajuju", "comment_text": "Look dude the IRS doesn’t give a fuck how close to the 60/40 suggestion you are on 60k. Stretch it to whatever is reasonable and justifiable. \n\nIf 60k is the avg salary for a US educated / native employee - you bopping around Spain with a lower COL shouldn’t matter. What you pay yourself just needs to be justifiable in some way. You can say it’s justifiable because you’re highly qualified copywriter. A similar worker in Spain isn’t a good and this doesn’t deserve the same salary. Case closed. You’re not being thrown in jail over this shit. The guideline is meant for people who setup s corps with several hundreds of thousands to millions in income and then don’t take any distributions. \n\nWhether you do 60 is no different than 80. Just take some distributions and have a reason to justify your salary. They’re not squeezing blood from a stone"}, {"comment_author": "Dissk", "comment_text": "He's not going to answer that because this is obviously a shady situation (as if it wasn't obvious from the original post)"}, {"comment_author": "billythygoat", "comment_text": "Of course. By law you have to live in the US a majority of the time to be a resident."}, {"comment_author": "Natural_Face9804", "comment_text": "I've always done like 65%. So if you want to make 60k, I'd do $42,250 on W2 and $22,750 as a draw. If you want to be a bit more conservative you could do 70-30..."}, {"comment_author": "e__z__p__z", "comment_text": "And then those draws pass through the LLC to your AGI and you pay state and federal tax on them. So what does having a low ball reasonable salary save ?"}, {"comment_author": "Natural_Face9804", "comment_text": "Payroll taxes on the ~35%"}, {"comment_author": "NotDogsInTrenchcoat", "comment_text": "There is no tax savings. You still owe the taxes either way, they just aren't withheld immediately when taking a draw. You will owe all normal income/FICA/medFICA when you go to file."}, {"comment_author": "e__z__p__z", "comment_text": "What do you mean by payroll taxes? You’re going to pay state, federal, FICA, etc on the 35% you draw out. Draws are not tax free income"}, {"comment_author": "Salt_Shoe2940", "comment_text": "You save on self employment tax."}, {"comment_author": "e__z__p__z", "comment_text": "Which is what I’m trying to wrap my head around. I was a single member LLC with no salary last year…accountants told me they ran the numbers and by switching to an S corp and paying myself the reasonable salary I would save tens of thousands ultimately but I don’t understand where that savings is coming from?"}, {"comment_author": "Natural_Face9804", "comment_text": "Distributions are not subject to payroll or self-employment tax. That's the big advantage of S-corp election."}, {"comment_author": "Salt_Shoe2940", "comment_text": "This is. .  . . . false as hell.\n\nSource: I am managing member of a multi-member LLC taxed as an S-corp and have been since 2018. I think I would know a thing or two. Plus, I have taken courses in business finance, accounting, business law, and taxation."}, {"comment_author": "Salt_Shoe2940", "comment_text": "Savings come from self-employment tax."}, {"comment_author": "NotDogsInTrenchcoat", "comment_text": "Company profit beyond your salary nets you tax savings if it's not taken out of the S-corp. That isn't possible with an LLC since LLCs are treated the same as sole proprietors where all business income is treated as personal.\n\nEdit: I see where there is misunderstanding. You were recommended to become an S-corp because as an employee of your S-corp, you do in fact get out of paying medicare and social security taxes on the difference between total profit and your reasonable salary. I missed some earlier post where you mentioned being told to switch to S-corp."}, {"comment_author": "PhilShackleford", "comment_text": "Payroll tax vs corporate disbursement tax. Disbursement might not be the correct term.\n\nBasically, anything over your \"reasonable salary\" is taken out of the s-corp as a disbursement and is taxed at a much lower rate.\n\nEdit: LLC is a legal distinction (i.e. protects your personal assets) and s-corp is a tax distinction (there are many)."}, {"comment_author": "PhilShackleford", "comment_text": "Can't the excess after salary be taken out as a corporate disbursement which is taxed lower than payroll/marginal tax rate?"}, {"comment_author": "VillageHomeF", "comment_text": "mad.  I wasn't even going to consider changing to S-Corp taxation on LLC until we all make at least $80k salary since that is what I have read.  guess I need to ask an accountant."}, {"comment_author": "Acceptable_Job1589", "comment_text": "Yes, ask a CPA. Reasonable comp has nothing to do with an arbitrary number like $80k. Has everything to do with what should that job reasonably cost in compensation to an employee on the open market."}, {"comment_author": "VillageHomeF", "comment_text": "does it matter how many hours worked?  anything very low would be poverty level so thought it has to be a decent number."}, {"comment_author": "Acceptable_Job1589", "comment_text": "Sure it is all part of facts and circumstances. But hrs worked is only a small consideration In that."}, {"comment_author": "Shadow14l", "comment_text": "Look for the shittiest paying jobs for this position in your area. Download copies of those positions and the pay. Use those. In the extremely, almost completely unlikely event that you have to go to tax court about this… you have proof."}, {"comment_author": "GroupJDC", "comment_text": "Reasonable salary is based on your revenue level if you don't have enough, say you had $0 revenue, do you think a reasonable salary is $63K? How would you pay such a salary with $0 income? If you make $100-$150K, then yes a reasonable salary is $63K since your revenue backs it up."}, {"comment_author": "Lustwander46", "comment_text": "I made $76k but net income (after expenses) came out to around $68k. My accountant said a \"reasonable salary\" would be $20k but that seems very low. But maybe my risk of being audited is very low since I make under $100K?"}, {"comment_author": "Acceptable_Job1589", "comment_text": "Reasonable salary has very little to do with revenues. Obviously compensation should go up or down relative to revenues going up and down. That's the facts and circumstances consideration. But I witnessed audits about reasonable comp and 1099 contractors vs employees. The IRS is going to compare what it would cost on the open market to accomplish the tasks you as the business owner are doing. If you only pay yourself $20k I'm W2 but the IRS reasonably found that the market rate for those tasks is $35k, then you back payroll taxes, penalties, etc."}, {"comment_author": "Piper-Bob", "comment_text": "None of the IRS publications indicate that revenue is a factor at all."}, {"comment_author": "LemonGirlScoutCookie", "comment_text": "Your accountant is correct"}, {"comment_author": "christoff12", "comment_text": "I don’t think Reddit is the place to get a second opinion on professional advice from an actual accountant.\n\nYou’re saying “that seems very low” and expressing worry about being audited. Are these not factors you believe your accountant would, well, account for?\n\nIf you lack trust in the accountant, I’d get another.\n\nEdit: terms like “reasonable” have specific definitions in legal/policy settings that we laypeople may either misunderstand or be ignorant of"}, {"comment_author": "GroupJDC", "comment_text": "Your audit risk is already low, there are companies that make millions and pay themselves $10K lol. \n\nIf you don't expect to make much more income than your current levels there really is no point in becoming an S corp. \n\nSome accountants and people just willy nilly become S corps without doing any sort of analysis. If you want to feel better do 50%, also reasonable income applies to the actual amount of work you're spending in that main role for your business.\n\nSay you're only doing 20-30% as c copywriter, and 70% general business management, you're reasonable income would be based off of that 20-30% of the main business activity not all your combined roles, as that would get pretty wild. \n\nanyway what your accountant is telling you is fine feel free to go over above and beyond. \n\nhope this helps"}, {"comment_author": "GroupJDC", "comment_text": "I meant based on your revenues when you don't have enough to cover a reasonable salary, obviously it's not based on revenues when you have enough revenue to pay a reasonable salary."}, {"comment_author": "GroupJDC", "comment_text": "ok feel free to take out a loan to pay yourself a reasonable salary then lol"}, {"comment_author": "Lustwander46", "comment_text": "Well it's my first time using this accountant so yes, I do lack a bit of trust. But I guess you're right. If he says it's ok, then it probably is."}, {"comment_author": "Lustwander46", "comment_text": "Thanks! I hope to grow my business and make more money but at the same time, I'm not someone that's ever going to be working 40+ hour workweeks. That's why I love having my own business. \n\nI have found that I've saved a good deal compared to my freelance income. So I think even with my \"low\" income, having an S Corp is worth it."}, {"comment_author": "Piper-Bob", "comment_text": "Might be cheaper than penalties and interest when you get audited."}, {"comment_author": "GroupJDC", "comment_text": "yes you're going to get audited for having $0 revenue and not going into debt to pay yourself a reasonable salary. \n\nHere is a really deep dive on reasonable compensation, even though IRS guidelines don't mention anything definitely reasonable compensation plays a factor when you're actually taking distributions out of your company. \n\nTo be able to take a distribution you need to be greater than net $0:\n\nhttps://rcreports.com/blog/what-if-an-s-corp-owner-can-t-afford-to-pay-reasonable-compensation/"}, {"comment_author": "Piper-Bob", "comment_text": "If you’re never going to turn a profit just get a job. If you’re profitable in the future you can get audited and there’s no statute of limitations on tax evasion."}, {"comment_author": "The_Money_Guy_", "comment_text": "Not that you need a CPA for this specific question, but it sounds like you should get a CPA"}, {"comment_author": "Lustwander46", "comment_text": "I have one... But as I mentioned in my post, he told me the minimum salary I could pay myself is $20k and that seemed too low to me so I wanted to get other opinions from people who have done this before"}, {"comment_author": "yogaballcactus", "comment_text": "I am also a CPA. No one really knows what the answer is. It depends on the “facts and circumstances”, which means it’s a crap shoot. I usually tell clients to pay themselves what they’d have to pay someone else to do the work they do and take the rest as profit. I’m willing to help them come up with the number, but I rarely outright give them the number - I don’t know what they’d need to pay someone to do their job, so how could I know what the right number is? \n\nIt helps if you have employees or fixed assets. If your business owns a machine and you hired someone to run the machine and you aren’t really involved in the day to day then you don’t need to take a whole lot as wages. And if you aren’t involved at all then you can take no wages. But if your business is just you and nothing gets done when you aren’t there then how are you going to argue that the money you make isn’t coming from your own personal efforts and, therefore, subject to payroll taxes? "}, {"comment_author": "Wut_Wut_Yeeee", "comment_text": "I've set mine at 34k with 100k net profit. Accountant approved."}, {"comment_author": "Lustwander46", "comment_text": "That's helpful, thanks!"}, {"comment_author": "MysteriousTooth2450", "comment_text": "I would go with 1/4-1/3 of your company’s revenue.  Your accountant is correct."}, {"comment_author": "Lustwander46", "comment_text": "Good to know. Thanks!"}, {"comment_author": "CathbadTheDruid", "comment_text": "Are you concerned with taking \"too little\"?  \n\nIf you're trying to shield income and not pay taxes, one way or the other the government is going to get paid and no amount of number shuffling will change that. You're not big enough to be able to pull off the tricks that giant corporations use to pay no taxes.\n\nIf the corp made $60K in profit and your job would normally pay $60K and you \"paid\" yourself $10K, you're going to have a problem."}, {"comment_author": "JurAssIsThicc", "comment_text": "This is all new to me.. could you explain like I'm 5..."}, {"comment_author": "CathbadTheDruid", "comment_text": "If you pay yourself far below market rates, the IRS will assume you're trying to avoid paying personal income taxes by underpaying the wages for the job."}, {"comment_author": "InternationalEye4927", "comment_text": "If what you did cost 6 Doritos, but you only got paid 1 Dorito then the IRS will come take all your Doritos and make you pay more Doritos to them."}, {"comment_author": "excitedtrain704", "comment_text": "If my business only produced 68k I would pay myself  other than what might be needed for emergencies/mortgage true expenses. All that needs to go back to business unless you don't really want it to grow much more"}, {"comment_author": "plussizejourney", "comment_text": "I base it off 2-3 average pay for same or similar position shown on indeed Glassdoor etc. Take the middle pay so then you have screenshots of how you got that salary"}, {"comment_author": "Acceptable_Job1589", "comment_text": "Yes, this exactly. Save screenshots each year to keep in the work papers of your taxes. Make sure to consider raises for yourself as well as that may be typical in the industry."}, {"comment_author": "Direct_Classroom_331", "comment_text": "Good rule of thumb wages should be around 25% of gross."}, {"comment_author": "tornadoRadar", "comment_text": "60/40"}, {"comment_author": "aredd05", "comment_text": "Why not pay the entire thing in a W-2 and claim foreign earned income exclusion? I don't know if that's a thing still but I did it in 2013 and it was up to 94K tax free."}, {"comment_author": "aredd05", "comment_text": "Still a thing, up to 110K basically. \nhttps://www.irs.gov/individuals/international-taxpayers/foreign-earned-income-exclusion"}, {"comment_author": "Geminii27", "comment_text": "If you're paying yourself less than you could make doing that job for someone else, why are you working for you (and also doing all the work involved in running a business)?\n\nWhat would it cost you to hire someone to do your copywriting work, and another person to run your business for you? Add 'em up, there's your minimum."}, {"comment_author": "Pierlu88", "comment_text": "Op is gonna have to pay double taxes in Spain and us unless he refuses to register himself and use any public service 😂"}]}, {"post_title": "Abstract27 Ltd: Easy to use, SEO optimised, hassle-free.", "post_url": "https://www.reddit.com/r/smallbusiness/comments/1byuwdo/abstract27_ltd_easy_to_use_seo_optimised/", "post_main_text": "We run a French web agency based in London, UK. We set up and host, Ghost CMS websites for bloggers, startups, small businesses and entrepreneurs.", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "This is a friendly reminder that r/smallbusiness is a question and answer subreddit. You ask a question about starting, owning, and growing a small business and the community answers. Posts that violate the rules listed in the sidebar will be removed. A permanent or temporary ban may also be issued if you do not remove the offending post. Seeing this message does not mean your post was automatically removed.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/smallbusiness) if you have any questions or concerns.*"}]}, {"post_title": "Need a website built", "post_url": "https://www.reddit.com/r/smallbusiness/comments/1byeiwi/need_a_website_built/", "post_main_text": "Hey all, first post on here. 18 year old entrepreneur running a tutoring operation in the UK. \n\nWant a website built that looks professional to help with confirming sales with clients, all sales are done over the phone right now. What’s the best place to find someone to do this? Not well equipped enough to do this myself, so what do you guys think?  Fiverr? Or somewhere else, \n\nAlso how do I make sure I don’t get scammed? I already have a domain.\n\nThanks all, very grateful for any feedback. ", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "This is a friendly reminder that r/smallbusiness is a question and answer subreddit. You ask a question about starting, owning, and growing a small business and the community answers. Posts that violate the rules listed in the sidebar will be removed. A permanent or temporary ban may also be issued if you do not remove the offending post. Seeing this message does not mean your post was automatically removed.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/smallbusiness) if you have any questions or concerns.*"}, {"comment_author": "BusinessJourneyJoy", "comment_text": "I order sometimes from Fiverr. And in most cases I get decent results.\n\nFeedback score in general says me how good a vendor is. But also I try to select the vendor with less feedback number and that the vendor provide narrow services. Otherwise there is a high probability that vendor will hire subcontractor for that and quality lowers.\n\nOne more thing. If you need a website just as a visiting card and a lending page with your phone - you can use a single vendor for creating such site. Because that could be easily done by one person. But if you want more complicated functionality and don't have a big budget - I would suggest to order design and development separately from two individuals. That will increase the probability of having good quality and lower prices. Make sure you arrange the format of visuals between designer and developer."}, {"comment_author": "KHANE_1", "comment_text": "thanks for the comprehensive reply bro, I appreciate it a lot :)"}, {"comment_author": "Citrous_Oyster", "comment_text": "Avoid fiver. You’ll get scammed hard everytime. If you need a dev I know one in the uk who can help. Message me if you want and I’ll send you his email. I’m a developer myself and I actually have him build some of my sites for me. Super awesome guy and incredibly knowledgeable."}, {"comment_author": "Kayanarka", "comment_text": "I use WIX. It is pretty easy for DIY, and you can hire people in the app to help you with various aspects."}, {"comment_author": "p3rls", "comment_text": "I'm sure this kid is getting 500 DMs from wordpress devs (if you can call them that) trying to scam him when all he needs is some landing page bullshit like WIX does perfectly well."}, {"comment_author": "KHANE_1", "comment_text": "Loool you’re right, got at least 20 dms since last night. I’ll look into Wix, thanks :)"}, {"comment_author": "KHANE_1", "comment_text": "Should probably add that I don’t need to take any payments on the site. Perhaps might implement a feature to collect contact info, so might need to adhere to the DPA for that"}, {"comment_author": "pmercier", "comment_text": "r/agency, stay safe out there!"}, {"comment_author": "Ferr22777888", "comment_text": "Mm"}, {"comment_author": "Global_Ad4165", "comment_text": "If you're trying to develop a website that is a beginner friendly and can just watch some 1 hour or several minutes of YouTube tutorials, consider checking out WIX for its simplicity or exploring [https://startbootstrap.com/](https://startbootstrap.com/), because it has many templates and you can just select the one that meets your requirements."}, {"comment_author": "These_Appointment880", "comment_text": "Lots of places to get a site done, varying prices and results depending on your needs and price ranges. There can be some good ones on Fiverr and upwork, there can also be some really bad ones. Typically best to try and look for some referrals from people you may know."}, {"comment_author": "smcfarlane", "comment_text": "Fiverr is rock solid. Use them for all my projects."}, {"comment_author": "henryeaterofpies", "comment_text": "If this is for marketing purposes hire an agency that specializes in that.\n\nI could 100% make you a website, even one that works and looks like an example if you had one you liked but I'm not a designer or branding expert."}, {"comment_author": "Admirable_Camp_8135", "comment_text": "Use a local company so you can knock on their door if you need them…"}, {"comment_author": "nt2subtle", "comment_text": "You don’t need anything fancy. A couple of pages. \n\nBiggest tip I can say, is If you have the time, build it yourself with something like webflow and pay for some copywriting and image assets. It will save you a bomb. \n\nBest of luck."}, {"comment_author": "triangle-mil", "comment_text": "Peopleperhour"}, {"comment_author": "CheesyTacowithCheese", "comment_text": "I have a developer who is making my website for a business I’m launching. His pricing is very reasonable and has a verifiable portfolio.\n\nI recommend him if you are looking for someone."}, {"comment_author": "jbnuto23", "comment_text": "I do web designs and could build you a site. Shoot me a dm if interested."}, {"comment_author": "Nevoy_92", "comment_text": "Hey mate,\n\nFeel free to DM me I run a consulting and development agency in Canada (Nu Terra Labs) and more then happy to help out.\n\nCan at least help you figure out what you may need and figure for costs.\n\nAs a lot of people said fiverr is also a good choice if you’re on a tight budget and doing it yourself to at least kick off is a solid option. A lot of no code tools to get you off your feet!"}, {"comment_author": "LimeLight200", "comment_text": "I can help you. I know its hard to trust someone randomly, but you can give it a try."}, {"comment_author": "Low-Helicopter-2696", "comment_text": "Let us know how many DMs you get from people offering to build you websites lol"}, {"comment_author": "KHANE_1", "comment_text": "Got about 20 so far Loool"}, {"comment_author": "Low-Helicopter-2696", "comment_text": "If it's e-commerce, try Shopify.  It's pretty easy to learn and will look very professional."}, {"comment_author": "BelleDreamCatcher", "comment_text": "It’s so easy to make your own. Currently my website is on Google sites and my shop is on Gumroad. I literally only pay for my domain."}, {"comment_author": "Trsh-usr", "comment_text": "FIVEERR HIGHLY RECCOMEND THEM. I have a personal referral.\nMy drywall website cost me about $150\n\nIt has some minor imperfections since i made adjustments myself but they are more than happy to correct them.\n\n[Drywall website](https://sdrywallpro.com)"}, {"comment_author": "Marachuga", "comment_text": "I used godaddy all the way through domain and hosting and managed to get it working. I went with a third party to build my first one and regretted it"}, {"comment_author": "KWTechSolutions", "comment_text": "A lot of people seem to miss out on one rather crucial information. You should handle the hosting yourself (such as buying on hostinger) to prevent your data from being held hostage by your vendor. \n\nFor building it, I'd always recommend you try learning and doing it yourself since you are young. You can try using wordpress (download a plugin called elementor), it is entirely free (you don't have to pay for any upsells)."}, {"comment_author": "seerofseersreddit", "comment_text": "This is what I do. Celebrating 20 years in business helping small local businesses. Www.oceansidelocal.com . You will not be disappointed!"}, {"comment_author": "seerofseersreddit", "comment_text": "We make complete and beautiful 5-6 page websites for $599 . Www.oceansidelocal.com"}, {"comment_author": "po10cySA", "comment_text": "I'm a freelance software developer, been developing for 18 years (8 years freelance, 10 years in corporate).  I have built many complex and simple systems, they have all been successful.  I can provide a portfolio and am happy to do calls.  \n\n  \nGenerally what would happen to avoid scammers is agree to payment terms whereby a % of the quoted costing get's paid at different milestones that will ensure you can see the product and test it and release funds at different intervals that you are happy with.\n\nPlease pm me if you have any questions at all."}, {"comment_author": "anieanjalijha", "comment_text": "I think Fiverr is one of the great option. I also sell my services on the Fiverr as well. It's totally safe and provides the decent results as well :)"}, {"comment_author": "Miserable_Advisor151", "comment_text": "3 hours on youtube will teach you how to build a nice one"}, {"comment_author": "420xGoku", "comment_text": "Just get a premade template from WordPress or square or whatever there are like a million places that sell them for like $40 that come with drag and drop/WYSWYG backends"}, {"comment_author": "cozysthrowaway", "comment_text": "I do freelance web dev to pay for a psychology degree. I also work together with a good team of cost effective Indian developers and I oversee their code quality. Fiverr is good but if you know nothing of code and you plan on scaling the business with SEO/google ads I'd either hire a consultant or ask around on reddit for someone to look over their portfolios and ensure they're writing efficient code set up for speed/marketing, or at least use [https://pagespeed.web.dev/](https://pagespeed.web.dev/) to check if their websites are performant. If they're not getting at least 90+ scores they're writing bad code. Best of luck and feel free to pm, I don't have any projects going on right now and would be fully available to you if interested"}, {"comment_author": "Annimios", "comment_text": "Hello, I found this interesting! I'm starting out as a freelancer in the web development space a d wanted to know how to create a good website and find clients, can I shoot you a DM?"}, {"comment_author": "The_sabi_guy", "comment_text": "I can help you design one to your liking or taste, before the developer codes, which I don't code, I can come in in terms of Designing, motion graphics or video editing for maybe an online marketing ad for your brand."}]}, {"post_title": "How to learn how to run a business on the job ", "post_url": "https://www.reddit.com/r/smallbusiness/comments/1byujzy/how_to_learn_how_to_run_a_business_on_the_job/", "post_main_text": "Hey everyone, I’m looking for a bit of general advice really. I’m currently looking to change job, and my main goal is to eventually startup a wearable tech company. The thing is, I lack knowledge of how to run a business and fundamentally handle finances. Of course, this presents a major hurdle between where I am now (front-end consultant with a background in medicine) and actually getting a company off the ground successfully.\n\nI’m wondering if anyone has any advice, or stories on how they learned to make this move. Currently my job leaves me with no time / headspace outside of work to work towards my goal, so I’m especially interested in job roles that people have found especially useful, as I would prefer to learn skills in real-life context (not necessarily in health tech).\n\nThanks in advance, and sorry for such a broad (and probably naive) question!", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "This is a friendly reminder that r/smallbusiness is a question and answer subreddit. You ask a question about starting, owning, and growing a small business and the community answers. Posts that violate the rules listed in the sidebar will be removed. A permanent or temporary ban may also be issued if you do not remove the offending post. Seeing this message does not mean your post was automatically removed.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/smallbusiness) if you have any questions or concerns.*"}]}, {"post_title": "Want to grow a small business but don't know how", "post_url": "https://www.reddit.com/r/smallbusiness/comments/1byubgq/want_to_grow_a_small_business_but_dont_know_how/", "post_main_text": "Hey everyone. So I've been having this thought for a while now and I've been putting it off because I don't know where to start. I have been gifted with the ability to paint anything anywhere and seeing that so many people are buying clothes that has some cool designs makes me think that I could take my painting skills to another level by painting such designs on clothes. \n\nBut the only problem is I don't know how to start and how to take it further. Any advice or tips?", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "This is a friendly reminder that r/smallbusiness is a question and answer subreddit. You ask a question about starting, owning, and growing a small business and the community answers. Posts that violate the rules listed in the sidebar will be removed. A permanent or temporary ban may also be issued if you do not remove the offending post. Seeing this message does not mean your post was automatically removed.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/smallbusiness) if you have any questions or concerns.*"}, {"comment_author": "SRGNT-CHILL", "comment_text": "Video, speed it up & promote on socials \n\nYou can really dial in a target audience when paying for advertising on socials.\n\nIf it’s something you can do in real time maybe doing live demos in busy public spaces"}]}, {"post_title": "Inheriting profitable general contracting company that hasn’t lived up to potential. What would you do first? ", "post_url": "https://www.reddit.com/r/smallbusiness/comments/1bykoro/inheriting_profitable_general_contracting_company/", "post_main_text": "About to inherit a commercial and industrial general contracting company that does around 4-5mm in annual revenue. Profit margins are healthy but could probably be better. 8 W-2 employees, work is mostly subbed out to a network of subs with whom we have long term relationships.\n\nFor reasons I won’t get into, father is slowly divesting himself of the business and leaving it to myself and brother. Brother has been with the company for years and has tons of technical knowledge and great intentions, but organization, business management, etc are not his strengths. Brother admits this and that is part of the reason I’m entering the picture. Father would remain in the picture in a new business development role for the next 12-18 months.\n\nFrom what I’ve uncovered, the business has a great product. We do right by our clients and my father in particular has great relationships with them; we actually have some conversations on going that could spike our revenue around 30% in the next 18 months. \n\nProblems hindering growth are:\n- poor project management\n- poor organization\n- inconsistent re-investment\n- business is over reliant on father’s years of relationships to earn new business\n\nWe’ve drafted an operating agreement that will ensure we’ve got healthy operating income and sufficient reinvestment into the business to do things like hire a dedicated PM. \n\nI’ve been in corporate America the last 15 years working in various ops and project management roles and I’ve managed ops/marketing budgets of up to $30mm. But I have no experience in the construction industry. \n\nI don’t want to be ridiculed here. It’s a major career shift but I’m actually excited about this, and I think I’m bringing a lot of the tools to make this a success. I would love some opinions that aren’t from family especially knowing we could see a significant revenue jump shortly. \n\nWhat would you focus on first? Any major watch outs? \n\nThanks in advance!", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "This is a friendly reminder that r/smallbusiness is a question and answer subreddit. You ask a question about starting, owning, and growing a small business and the community answers. Posts that violate the rules listed in the sidebar will be removed. A permanent or temporary ban may also be issued if you do not remove the offending post. Seeing this message does not mean your post was automatically removed.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/smallbusiness) if you have any questions or concerns.*"}, {"comment_author": "sawyermidddd", "comment_text": "I come from a similar ops/GTM background, currently in tech but previously in commercial real estate with a $250m+ family-run developer. When the founder/CEO (boss's dad) retired, the biggest challenge we faced was making the business resilient and scalable without him.   \n  \nLike your dad, my boss's dad had great relationships from decades in the business and grew the business through partnerships with friends. Any time something went wrong, such as a disagreement with a GC, he could smooth things over by taking the guy out for drinks. \n\nWithout his charisma, we had to really focus on streamlining processes, developing better communications with vendors, and focusing on the numbers. Instead of relying on him to fix problems, we needed to implement procedures to make sure that things didn't go wrong in the first place. \n\nThe other thing I would recommend spending some time on is business planning. Look at historic client turnover rates and assume they get worse in the near-term after your dad retires. How much new business will you need in order to keep the firm operationally stable and how will you reliably generate that new business?\n\nHappy to chat more if anything was unclear!"}, {"comment_author": "fortunate_son_1", "comment_text": "“Instead of relying on him to fix problems, we needed to implement procedures to make sure that things didn't go wrong in the first place.”\n\nAll great advice but this especially jumped out. This was helpful thank you! Also agreed on the client turnover piece — it’s my second biggest concern at this point. Behind establishing proper PM best practice. I’m a big believer that you solve one problem at a time so I’ve decided to go:\n\n- Fiscal management (eliminating waste and operational overspending) — first 30 days \n\n- project management (establishing standard workflow and best practice, implementing software, improving project profitability) — first 60-90 days \n\n- new business and marketing — first 90-120 days\n\nThoughts?"}, {"comment_author": "sawyermidddd", "comment_text": "Those are all good objectives and the ordering makes sense based on your description of the business, but you might be making unfounded assumptions.   \n  \nI wouldn't aim to change anything within the first 30 days. Take that time to build relationships with employees, clients and vendors. Understand their professional goals and how they have been working with your firm so far. Really dig into the business and understand what's working and what's not. Then you'll be able to cut/add/change with more confidence.\n\nIf you change too much too fast based on unfounded assumptions, you run the risk of losing their trust."}, {"comment_author": "fortunate_son_1", "comment_text": "Also good advice, tells me I should push everything on this list out a month and prioritize learning and relationships alone that first month."}, {"comment_author": "sawyermidddd", "comment_text": "yeah -- there's no rush to do anything. The business is in fine shape so take this time to learn and get to know people"}, {"comment_author": "GroupJDC", "comment_text": "I mean if you have experience in project management.... no need to ask anyone here just implement based on your experience. The personal relationship part is hard, but that's much easier this is my son vs this is some random person taking over."}, {"comment_author": "fortunate_son_1", "comment_text": "I figured PM best practice is probably pretty similar industry to industry but it’s such a different niche that’s where I’m concerned"}, {"comment_author": "ohwut", "comment_text": "The “this construction business could be successful if we just ram project management down their throats” is essentially a meme in the industry.  Everyone thinks the special sauce missing is a spreadsheet.\n\nAnalyze where the business fails due to project management. Are deliverables not being received by clients? Is scheduling subs causing conflicts?  Understand what you’re actually concerned with. Site conditions? Safty initiatives? Labor availability? Materials?  If you’re not in construction do you understand bid management, takeoffs, field management and BIM?  \n\nWhile the core concept of “keeping track of pieces” is important construction projects are each unique and temporal compared to most enterprises which see project management simply dealing with human capital.\n\nYou’re also going to have a very uphill battle in getting employees and subs to buy-into the project management. A huge chunk of these guys are drunk and there to complete a specific manual task. They aren’t going to check boxes, sit through standups, or micromanage every single process. "}, {"comment_author": "fortunate_son_1", "comment_text": "This is all fantastic advice. I’ve gone through that exercise as pertains to PM and discovered that the main issues arise when:\n- sub drops off and we don’t have a timely back up - timelines are over promised and client gets disappointed \n- invoices aren’t routed to AP quickly enough and so “surprise” accounting \n- we aren’t consistent with our billing schedule and feel the financial squeeze at certain times of year"}, {"comment_author": "Temporary_Couple_241", "comment_text": "My suggestion is to take time to learn the business processes. You can do the office and financial work and make changes as you go to improve. I would then start to look at processes in the field by focusing on problems as they occur. Do a sit down with the people involved and determine the root cause and then work out a plan of how to fix before it is a problem. Focusing on using the people to solve problems instead of telling them will bring team rapport.  Make it a better place to work for all."}, {"comment_author": "radutrandafir", "comment_text": "Stepping into this general contracting gig with a mix of excitement and a tad of uncertainty is totally normal, but you're walking into a pretty sweet setup. You’ve got a solid base, with revenue and profits looking good, plus some real potential for growth. Here's the game plan: First off, your ops and project management chops are going to be a game-changer for tackling the project management and organization hiccups. That’s your bread and butter, so start there.  \nYour dad's relationships are gold, but it’s time to spread those wings a bit. Use what he’s built as a springboard to bring in new blood and diversify those client connections. With your background, I bet you’ve got some fresh marketing strategies up your sleeve to pull this off.  \nOn the reinvestment front, it's about being smart with the cash. Pinpoint where it’s going to make the biggest impact. Could be tech, could be people like a new project manager—you’ll figure out what’s going to move the needle.  \nCulture-wise, keep the vibes positive and inclusive as you bring in new ways of doing things. And don’t forget to deep dive into the construction specifics. It's a whole different beast, but with your knack for ops, you’ll get the hang of it.  \nWatch out for the usual gremlins like folks being wary of change, biting off more than you can chew, and staying on top of all those pesky regulations.  \nYou, your brother, and your dad make a strong team. Lean into that, keep the communication flowing, and you’re set for a pretty exciting ride."}, {"comment_author": "Sherifftruman", "comment_text": "If possible you probably need him on board more than 12-18 months if the business relies on his contacts. You’ll need to spend a lot of time glad handing them and also they will want to see projects completed under your leadership to solidify their confidence."}, {"comment_author": "fortunate_son_1", "comment_text": "On the bright side, my brother really has that angle at least partially covered as he’s been being groomed to take over that element for the last 2-3 years so he been slowly supplanting my father. But it is still a concern."}, {"comment_author": "SafetyMan35", "comment_text": "First thing I would do is try to get things organized (especially for your brother).  Ask him to explain his tasks and how he does them and look for opportunities for automation or centralization.  \n\nAs an example, my wife makes custom made products that may or may not be sold every year.  From year to year the component list doesn’t change significantly.  We have 1500 individual components that can be used to make any one of 800 different kits and the kits each contain 20 or so components.  Initially she was going to each kit specification and updating the price for each component manually and it was taking hours to do.  I created a database that worked similar to the way she works that was linked with a master component list so if she needed to change the price of a component it would populate through every kit that used that component.  Because I created an automated system that worked similar to the way she worked she used it.  If people have to change the way they work to use a tool they will never use it"}, {"comment_author": "CSCAnalytics", "comment_text": "“I have no experience in the construction industry” = sell the business."}, {"comment_author": "nyto11", "comment_text": "Focus on cash flow, sales, replace you worst 10% employees, make your company bulletproof. Pretty much same as any company. Earn respect of crews and learn to do all the jobs."}, {"comment_author": "Quirky_Highlight", "comment_text": "You are in way over your head, you should know that going in.\n\nWhether or not that is a problem depends a lot on your ability to learn literally everything."}, {"comment_author": "WickedDeviled", "comment_text": "Make sure your local SEO is on point. You will get consistent leads from it."}]}, {"post_title": "Rug Tales & B2B Chats", "post_url": "https://www.reddit.com/r/smallbusiness/comments/1byg0jt/rug_tales_b2b_chats/", "post_main_text": "Hey Reddit,\n\nI’m dipping my toes into the B2B waters and could use your collective wisdom. I’m part of a family business in India, where we pour our souls into creating handmade rugs and carpets. It’s an art passed down through generations, and now we’re looking to share it with the world.\n\nWe’re in search of regular bulk buyers who can appreciate the craftsmanship and stories behind our work. If you have any advice on building these kinds of partnerships, or if you’re in the market for some authentic, handwoven beauty, let’s connect.\n\nAppreciate your insights and looking forward to potential collaborations", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "This is a friendly reminder that r/smallbusiness is a question and answer subreddit. You ask a question about starting, owning, and growing a small business and the community answers. Posts that violate the rules listed in the sidebar will be removed. A permanent or temporary ban may also be issued if you do not remove the offending post. Seeing this message does not mean your post was automatically removed.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/smallbusiness) if you have any questions or concerns.*"}]}, {"post_title": "Questions regarding starting an entertainment non-profit in California", "post_url": "https://www.reddit.com/r/smallbusiness/comments/1bytj5o/questions_regarding_starting_an_entertainment/", "post_main_text": "I'm looking to start a non-profit that provides opportunities for new music artists to perform at hosted events and local venues. We'll also have inspiring photographers, tech experts, and more on board. Plus, some of our profits will support music and arts programs.\n\nHere are some questions I have:\n\nGetting Started: What are the steps involved in starting a non-profit like this? Any advice or resources you could share would be greatly appreciated.\n\nVolunteering: How would volunteering work for these events and within the non-profit itself?\n\nPermits and Regulations: What permits would I need to run these events smoothly and legally? Are there any regulations I should be aware of?\n\nFunding and Sponsorships: How does funding typically work for non-profits like this? Are sponsorships a viable option, and if so, how can I secure them?\n\nFeel free to share any insights or experiences you have, and please point me towards any relevant past posts or resources. Thanks in advance for your help!", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "This is a friendly reminder that r/smallbusiness is a question and answer subreddit. You ask a question about starting, owning, and growing a small business and the community answers. Posts that violate the rules listed in the sidebar will be removed. A permanent or temporary ban may also be issued if you do not remove the offending post. Seeing this message does not mean your post was automatically removed.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/smallbusiness) if you have any questions or concerns.*"}, {"comment_author": "SafetyMan35", "comment_text": "To get started, talk with an attorney.  The paperwork and requirements for a non profit can be intense.  \n\nFor volunteers, you actually want to be a charitable group, most likely a 501(c)3.  Talk with an attorney \n\nLicenses and permits are going to be a local thing, often times down at a city/town level.  Check with the local government and an attorney.  \n\nIf you are a non-profit, you aren’t collecting sponsorships.  If you are a charitable organization you can and they would be tax deductible to the giver.  Talk with an attorney as again it is extremely complicated."}]}, {"post_title": "This is exhausting and I need to rant", "post_url": "https://www.reddit.com/r/smallbusiness/comments/1by1wk8/this_is_exhausting_and_i_need_to_rant/", "post_main_text": "I'm exhausted and feel like I'm doing too many things for my brain to handle, my ecom jewellery label has been running for 10 months, I've made about 38k in revenue, and I'm profitable. \n\nI design, make, video, content create, all of it - I do myself.\n\nI work 7 days and I'm utterly exhausted, I don't know how to handle this uncertainty. Meta advertising is incredibly difficult when you're selling something thats more vanity than problem solving, advertising in general is enormously expensive. \n\nI haven't advertised on Meta for the last 3 weeks cause there's been insane turbulent results, I know my ads probably aren't perfect but at the same time I struggle with wanting to maintain my brand identity without relying on cringe advertising hooks and cheap salesman tactics. \n\nI still need to update my packaging, I know my website needs work, I'm spending 80% of my time trying to figure out content creation, making and editing videos for tiktok and insta in the hopes one will go viral because in my industry that seems to be the only ticket out.\n\nI'm unsure how to approach UGC marketing which is what's \"in\" atm.\n\nEverything just feels tough atm and I just want to throw the towel in. \n\nYou can visit my site here if you'd like studiointernalaffairs.com[Internal Affairs ](http://studiointernalaffairs.com) \n\nI guess I constantly feel behind, I feel like if I'm not creating semi viral content I fall behind and I'll have weeks with 0 sales.\n\nI'm a designer, but in this day and age we're all content makers, and I hate that /rant\n\nEdit: AND I know my product is legit because a Chinese site ripped my Facebook ad, and stole my product and sold a fake version for $40 usd - I saw the ad on Facebook with 1000s of comments.\n\nI even ended up receiving complaints from customers thst bought the fake one saying it doesn't work", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "This is a friendly reminder that r/smallbusiness is a question and answer subreddit. You ask a question about starting, owning, and growing a small business and the community answers. Posts that violate the rules listed in the sidebar will be removed. A permanent or temporary ban may also be issued if you do not remove the offending post. Seeing this message does not mean your post was automatically removed.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/smallbusiness) if you have any questions or concerns.*"}, {"comment_author": "russyellow92", "comment_text": "Just visited your website and your content and jewelry looks really nice.\n\nIt's okay to rant,it's okay to feel burnout,but it's not okay to give up on this kind of niche business."}, {"comment_author": "Pristine_Ice5914", "comment_text": "Thank you, I know my jewellery is strong the type of comments and emails are receive reflect that. Usually being along the lines of \"this is amazing, you're gonna blow up, this is truly amazing etc\"\n\nBut it feels like when your mother tells you you're handsome, everyone tells me my stuff is amazing but I struggle with relevancy."}, {"comment_author": "SheddingCorporate", "comment_text": "You can showcase some of the responses you get - that is literally UGC right there! If someone writes in to tell you they love their ring, ask them if they'd consider making a quick video to show it off and say what they love about it. No fancy equipment needed, just their phone is all they need to make that video. \n\nVideo testimonials are powerful, especially from real buyers who've made that investment and can actually show off the rings in daily life situations. Ideally, some of these would be in different situations - guys  sitting around at a bar, or kicking back watching a game on TV, etc. \n\nWhile you wait for the video testimonials, at least post screenshots of the emails and DMs you're getting raving about the rings! People like to see proof that other people love the rings. It builds a sense of community. Which is what UGC is really all about."}, {"comment_author": "thor11111", "comment_text": "Is it made from silver?"}, {"comment_author": "Pristine_Ice5914", "comment_text": "Yes"}, {"comment_author": "Miqotegirl", "comment_text": "Number one thing you have to do: get a shorter website name. I mistyped that website name four times on my phone."}, {"comment_author": "The-Lifeguard", "comment_text": "100%. They didn't make the site a link and it's guaranteed I'll have to swipe back and forth from reddit to chrome 3x. I wanted to see, but not enough for that effort."}, {"comment_author": "Pristine_Ice5914", "comment_text": "Yeah, I figure with the way things are nowadays most people visit websites through links anyway, and then it's already in your cookies. I don't recall the last time I typed out a website name\n\nMade it a link, myb"}, {"comment_author": "ISAMU13", "comment_text": "Copy Paste?"}, {"comment_author": "DEVILS_LOCK_420_69", "comment_text": "Reddit won’t let me copy text for some reason (iOS)"}, {"comment_author": "Miqotegirl", "comment_text": "I can’t on my phone. I tried lol.\n\nAlso, smaller names for websites are more successful. It’s more catchy."}, {"comment_author": "ISAMU13", "comment_text": "Really? Are you using the official app?"}, {"comment_author": "Miqotegirl", "comment_text": "Yes"}, {"comment_author": "Optimisticatlover", "comment_text": "Hire some one \n\nDelegate"}, {"comment_author": "arnaiaarnaia", "comment_text": "Firstly:  From what I gathered from your post you are making well received products that are bringing in constant revenue. That is GREAT. You are doing great so far. \nWhen you are handling all the aspects of your business that go beyond that, it is completely normal to feel overwhelmed. It IS overwhelming. You are wearing plenty of hats at the same time. You are trying things for the first time in many areas and of course there will be mistakes made. And lessons learned. \nTake the feedback/critique you received on your online content as valuable pointers on how to get better. There is a lot of free information out there to optimise what you are struggling with: creating authentic content about your business that doesnt feel like an ad but instead functions as a road to get potential customers to know and trust you. Showcase your products and your business in a way that is appealing without being all 'BUY!' \nHope this helps!"}, {"comment_author": "RisetteJa", "comment_text": "Hello there :)\n\nI totally feel you! I’m a one person business too, and make jewelry also (totally different tho, assembly jewelry and lower prices that yours (altho my prices are higher than my competition, i still sell well cause of unique design, good branding and excellent photos). Been in business for over 17yrs now, 15yrs full-time.\n\nWhen i started, there was soooo much less stuff to do. Like photos had to be ok, and that was enough to sell. No videos was the absolute norm. SEO wasn’t a thing on etsy, and it barely was a thing in general. Social media was… well twitter or facebook, that’s all there was. Basically, there was so much less to do to be “selling appropriate”, and so much less competition as well. \n\nI learned and learned and learned (only thing j outsource is yearly taxes). And at some point in 2017-2018 i hit a wall. I just couldn’t do more anymore, i didnt wanna learn a new goddamn thing again, i’d had enough. I also didn’t wanna outsource because of 1- funds and 2- altho i accept some outside pov, honestly, no one knows my products, and my buyers, more than me. No one can write an instagram post that sounds like me…\n\nSo, i realized my only option was cutting out stuff. And that started with social media. The hours i was putting into instagram did bring *some* sales in, but it was NOT proportional to the time i invested, like at all. Same for Pinterest or Facebook. So, these were put on the backburner (aka a post here and there that i would cross-post, but i stopped putting myself pressure to keep a tight schedule, to keep pushing this at all cost. It became “if feel like it so i’ll do it, and if not i won’t.” That gave me back literally HOURS to… STOP AND REST. Which in turn made me more productive when i did work, cause i wasn’t burned-out-and-panicked. ;)\n\nIn comparison, the time i invested in overhauling my etsy SEO had clear direct positive impacts on sales, so I decided that this was a thing i’d keep some focus on. It was also clear that the time i invested in photos were crucial to my sales, so that stayed. A good chunk of my business is consignent locally in over 10stores, and those sales are stable and work well, and diversifies the eggs in my basket, so that stayed. ……. However, the time i spent trying to figure out Google SEO wasn’t working much, cause let’s get real, as a canadian wanting to reach US customers thru google, it’s nearly impossible as a small business, since google knows i’m in canada and so they show me to canadians (which is fine, but we’re like less people than California alone, that ain’t gonna cut it lol) So, you guessed it, i put that on the backburner again. Sometimes i work on it if i feel like it when i list something new, and if now, oh well, later perhaps.\n\nAlllll that to say (sorry for the novel lol), you don’t have the income to hire out really, so your option is cutting out stuff. From your post, i’d say “stop trying to go viral”. It’s 1- a lot of time to do reels and all that and 2- everyone wants to go viral on there, but most never do. That’s just real life facts. “Going viral” is not a realistic solution to more sales, so, drop it. \n\nJust an extra thought, YOU NEED TO REST. I know it sounds impossible, but i promise you, down time is essential if you’re in this for the long haul. Find the schedule that works for YOU! If what you need is one whole day, then do that. If it’s something else, do that. (For example, it took me a while to figure out what worked best for me, but now it’s: i work 7 days, but i take most mornings off. That’s what works for me since afternoons are my productive time, and this way i can enjoy my mornings off without guilt cause i know later i’ll be working. So yeah, it’s 7 days, but it’s not all day every day. I’ve also had my best year yet last year, and ive never worked less before… i’m a machine in the afternoons cause im so rested haha it’s like i do things so effectively that it compensates the lower hours, it’s crazy!)\n\nAlright, i’m stopping now. Sheesh so sorry that was exhaustive 😳😂 Write me in private if ya wanna talk more :)"}, {"comment_author": "onlyitbags", "comment_text": "First of all love this post! And I want to ask what source you like for learning Etsy SEO? I legit find it confusing. Do you use their google ads? Thanks"}, {"comment_author": "RisetteJa", "comment_text": "I don’t have a choice in using offsite ads cause i went over the threshold a ling while back, so i do… but i wouldn’t if i could choose.\n\nFor SEO i follow karabuntin’s (on YouTube) no non-sense suggestions, paired with Marmalead as a tool."}, {"comment_author": "onlyitbags", "comment_text": "Thanks for the replay and the resource.  Oh yes I think I heard about the forced ads.  Good to know the feedback on that"}, {"comment_author": "Salty-Tomcat8641", "comment_text": "Have you thought about getting some help? Maybe hire someone to run your marketing campaigns"}, {"comment_author": "DEVILS_LOCK_420_69", "comment_text": "On the production side social media video editing is frighteningly cheap"}, {"comment_author": "CheapBison1861", "comment_text": "Feeling overwhelmed is the first step to delegating. Hang in there!"}, {"comment_author": "Basshead0514", "comment_text": "I've been struggling with feelings like this for a while and it's all due to burnout. I have a property inspection business and I do really enjoy it, but achieving work/life balance has been tricky since we started to scale. The business is doing well but I'm burned the hell out most days.\n\nI'm in the process of hiring help. Also surround myself with people in my industry. Trust me, it makes things bearable.\n\nThis is a good problem for you. Having to ask for help is a signal of growth. Believe me, I get it. It's hard."}, {"comment_author": "DEVILS_LOCK_420_69", "comment_text": "Your work is good, and I’m not a business lord, but I think you need to find a “story” to leverage. I remember seeing the person who runs Studio Cult give a talk, and remember her saying how frustrated she was sometimes that she wants to focus on making but she can’t because most of her time is spent marketing or doing some form of market research. She seemed to really understand her audience not just on a demographic level, but how to attract them.\n\nIt could be you say that you’re the ONLY legit version of this jewelry AND talk about the process and how it is difficult to manufacture. That seems kinda super tiktokable. I also think just posting the videos you have here in a TikTok-friendly aspect ratio with a trending audio would do something for you (I don’t know what has happened since the universal music ban, but I feel like the music from Silence of the Lambs when Buffalo Bill was dancing has been a trending audio, seems like it miiight be on brand but just find something)\n\nSpeaking from experience that artists are not (typically) rich so maybe you have to find a way to work towards their desires to attract them and generate a sale, or find a segment of that population that tends to have higher income or more discretionary income.\n\nFor example, if you know your audience is male identifying maybe you subtly target them by having a conventionally attractive woman in the ad (sorry making some assumptions about desire and gender etc), and she isn’t wearing it but “approves” of or likes the ring in some way. I don’t know how much a model costs but you probably have a friend of a friend who might do it."}, {"comment_author": "DEVILS_LOCK_420_69", "comment_text": "(You might also give a discount to a customer who fills out a survey or who is willing to do a 5 min zoom or follow up in some way, so you better understand your audience. You csn maybe target larger orders or repeat customers here)."}, {"comment_author": "MzBix", "comment_text": "Don't underestimate the value of rest. You cannot work 7 days a week. Take a vacay, and I promise, your sales will improve. 🙌\n\nAlso, good job! 38k is great!"}, {"comment_author": "PeachesLyfe08", "comment_text": "You need to hire support. You are doing too much. Bottom line, you don’t get to quit."}, {"comment_author": "SpecialistMulberry47", "comment_text": "You have an offer of 5% off, never in my life have I seen a website discount of only 5%.  It’s always 10% or higher"}, {"comment_author": "Pristine_Ice5914", "comment_text": "It was 0 when I was getting more sales tbh, most reputable jewellery brands don't do sales - tbh neither do I.\n\nThis stuff is hard to make, and lowkey already affordable considering its made to order"}, {"comment_author": "evilblackdog", "comment_text": "I used to do the same.  I've since adjusted my margins so 10-15% off is no big deal"}, {"comment_author": "East-Magician-9412", "comment_text": "I feel you on this. I have a service business so I have zero experience running sales/discounts, but as a consumer theres a lot to be said for the products that are hard to get and never on sale. I spent almost twice the sticker price for sneakers that were hard to get, opted into notifications, signed up for a membership. I was practicing all of the same behaviors with a brand of pajamas until they went through marketing debacle and now offer sales and coupons every few weeks. I’m not going to pay full price today when I know it’ll be on sale next week. \n\nPut your profit into an assistant to help with operations. One day at a time, one customer at a time, one task at a time."}, {"comment_author": "Piper-Bob", "comment_text": "You mention wanting a video to go viral. It seems to me your current offerings are probably too niche to do that. Your products are obviously high quality and visually compelling, but realistically not many people want to wear a devil. \n\nFWIW, when I was on Facebook they consistently fed me ads for things that I was interested in."}, {"comment_author": "Pristine_Ice5914", "comment_text": "I agree! However it's not that niche either. It's niche but the US has a population of 333 million. \n\nAnd I've had a few videos go semi-viral esp on tiktok because the captivating motion of the eyes opening and closing of the rings draws people in, and their in awe (at least going by the comments)\n\nAND I know my product is legit because a Chinese site ripped my Facebook ad, and stole my product and sold a fake version for $40 usd - I saw the ad on Facebook with 1000s of comments.\n\nI even ended up receiving complaints from customers thst bought the fake one saying it doesn't work."}, {"comment_author": "sharkera130", "comment_text": "u/Pristine_Ice5914 hang in there friend, your jewelry looks really cool!  Question about your shopify site, I noticed you've got shopify payments set up, but where is your company registered?  In Australia or in Armenia?  I'm also trying to get shopify payments set up, but my company isn't registered in one of the supported countries."}, {"comment_author": "clinto_bean", "comment_text": "Definitely tap into what resources you can. Friends, interns, maybe hire cheap help. \n\nUp your prices, test out your margins and see how you can scale without breaking your workflow. \n\nThere’s lots of virtual assistant services out there that maybe be able to relieve some stress."}, {"comment_author": "Temporary_Couple_241", "comment_text": "I don’t understand why you want to viral on a social media site. Sounds like you are very close (if not there) of being overwhelmed. If your product goes viral, how are you going to keep up with the sales?  Then people will be upset that you can’t make their orders in a timely basis. \n\nMy suggestion is to work with the customers that you already have and increase sales to them and the people they know.  This can be done by a monthly email newsletter sent out, discounts for referrals and maybe discounts for an order with multiple items. Give a discount when they sign up for your newsletter and send a discount code in each email. Market to your demographic through Google. Have someone do this for you as your talents resides in making the pieces. \n\nI am also in a very niches business and use the tactics above and it works. It does not explode overnight but I consistently sell more product year over year. Spend your energies in creating product and let others take the marketing off you.  Other people can do the emails and you can yell at them when it doesn’t go out instead of yourself. \n\nMostly, chill out at least one day a week and do something for you. It will recharge your batteries."}, {"comment_author": "marktandem", "comment_text": "Interesting designs. How much does a ring typically sell for? \n\n  \nJust off the bat you're only doing commissions, which means your marketing strategy will need to be different. \n\n  \nYour website is good, your domain name isn't ideal but it's quirky which works for the type of products you sell. \n\n  \nOne major thing you need to do - add information on pricing range, and delivery time on your website. I'm sure that's the first thing that pops on to people's mind for 90% of the people interested. Not having that information means an extra step in the buying process - people need to email you to find that out, and then decide if they want to buy. Most people won't bother to send the email, and then when you do reply a lot will have forgotten why/what they wanted to buy. Frictionless is key to online selling - think Amazon and their one page checkout. A lot of purchases are 'impulse' purchases too, you show them why they want something and they buy it. \n\n  \nI'm in your target market - late 20s male, living in a major city (London). I would buy one of these if more information was presented. \n\n  \nHonestly in terms of marketing I don't think there's a lot you need to do. Your type of product means stuff like SEO, PPC, Affiliate marketing etc are not needed. You basically need to create 5 or so strong social media ads, target them very well to the right demographics, and not worry anymore. If you're not great with advertising, pay someone $500-$1000 to set it up, and maybe like a $200 monthly retainer to optimise it for you. That's cheap compared to usual rates - but your business isn't complex and you can do social media posts yourself with an occasional video here and there. I do marketing for my own websites so if you're interested I can work with you on this for a lower rate."}, {"comment_author": "LBAIGL", "comment_text": "OP, can you reach out to micro influencers who would promote your products for free?"}, {"comment_author": "Pristine_Ice5914", "comment_text": "Okay so, this generally just does not work.\n\nMost influencers now are charging $1000+ for promotional shoutouts, there's 1 or 2 I've done that did work out well but even they were like \"your content looks like an ad, needs to look more UGC, ORGANIC\" \n\nIn other words, make an ad, but make a fake ad (:\n\nThe jewellery I make is complex, and takes time. Having to send this out for free to people in the off chance I'll have a return (if even) is just...."}, {"comment_author": "LBAIGL", "comment_text": "So I checked out your jewelry and your website & IG. Beautiful work, but nothing jumps out at me and creates an emotional connection to the jewelry.\n\nTry to switch it up a bit - try to create a few reels that breakdown the process of creating a piece of jewelry. Those seem huge right now.\n\nAlso, I know the dark background is meant to highlight the jewelry but it seems very niche. As in, only those into a goth aesthetic would appeal to it.\n\nTry to see if you could create an influencer contract with someone who could create a UCG type video that subtly shows off the ring Lilium, for example. That beautiful ring with the green stones jumped out at me, but I think if you experimented with a few different ways to show it off you'd get more engagement.\n\nI just immediately thought of an influencer who attends a farmers market - at least in my area, chunky ornate jewelry is in. It is common to see some gorgeous, model like woman walking around with a ring like Lilium on her finger grabbing homemade items.\n\nWomen especially wear jewelry with an emotional connection..it makes them feel pretty, glamorous, strong, etc"}, {"comment_author": "Pristine_Ice5914", "comment_text": "I agree but the reality is it IS niche, I'm not trying to make a mainstream wide audience brand - this isn't for the everyday girl going out spring break shopping etc. It's not that vibe.\n\n70% of my customer base are men, mostly from LA and NY, and mostly other artists."}, {"comment_author": "The_Jobholder", "comment_text": "if your market is the us I would use the spelling “jewelry”"}, {"comment_author": "Brawnh", "comment_text": "Theres a guy by the name of Pablo on Instagram who makes and documents his jewelry making journey and is also pretty successful. See if you can replicate his content strategy.\n\nI agree with most of the comments on here, you should look into outsourcing. There are lots of VAs working from the Philippines etc helping business owners out at reasonable rates."}, {"comment_author": "nsxn", "comment_text": "I’m with you. I wouldn’t spend a ton of money on micro influencers on IG or tiktok. Likes are great for social validation but such a small amount of the clicks result in sales of higher ticket items. Google and even Bing ads are better.  \n\nI’d also recommend getting out there and networking and attending events. If most your sales are in NY and LA that’s where you need to be and starting to make a name for yourself. The best opportunities I’ve had originated from semi random conversations with people I have met at conferences, clubs, galas and trade shows. Not as familiar with your niche but in mine it’s a small world with everyone connected to everyone via friends, your friends network has a ton of potential. There are so many people out there willing to help if you can help them in turn. \n\nSmall business networking events in your local area can be great also.  I have nothing in common with folks there but I’ve received great legal advice from attorneys, found cheaper insurance, and event met a personal assistant who is now one of my good friends and helps me with shows. \n\nDoing everything yourself and sticking with IG vids is great if you are happy with your current revenue.  If you want to scale higher though you are going to need to do the above and start handing off tasks."}, {"comment_author": "SheddingCorporate", "comment_text": "Can you hire a VA to do some of that content creation? The rings you create are gorgeous, and I suspect a lot of men would love to have one of these.\n\nIn your shoes, I'd also go order a few of those fake Chinese ripoffs and then create some content showing your rings side by side with theirs, pointing out the inferior craftsmanship, etc. This may take more of a budget than you're wiling to invest right now, but a nicely done video of hot men dissing less hot men wearing the fake rings could create some buzz.\n\nI looked at your Instagram - love the aesthetic. But you're missing a trick there - you're not using any hashtags. While we no longer need to stuff each post with 30 hashtags, using a handful of relevant hashtags will help the right people find your stuff. \n\nAlso recommend showing the behind-the-scenes work. It's always fascinating to see an artist weave their magic.\n\nFor UGC - I'm not sure men are as into showing off their bling as women are: could you hire women to talk up the rings, say how their hot guy loves wearing the ring they got him, that sort of thing? Men like to watch women, and if the women are then showing off something that makes them think they, too, could be hot, they'll buy. Humans are very suggestible. :) Of course - this is a completely different vibe to what your current social media posts are, but I still think there's a place for them on your IG page. Maybe as stories rather than reels or regular posts.\n\nPS: Typo in your FAQ - the very first answer there says .926 silver rather than .925 ... yes, I'm being picky. :P"}, {"comment_author": "Dish-Awkward", "comment_text": "I just hired a virtual assistant after grinding like this for almost 3 years straight. It was an immediate pressure release and the only regret i have is I wish I would have done it sooner. \n\nIf you are ok with offshoring to a place like the Philippines, Columbia, South Africa, India, etc. You can find a full time capable VA for $1k-$2k/month"}, {"comment_author": "cryptocheeta", "comment_text": "Hey, I just went through your website and I really like what you are doing! I have some clients not a similar niche but majority of their sales channel is not meta ads its few selected influencers on affiliate marketing, I would suggest go for that and once you have some volume then outsource,\n\nFor you I would suggest make protocols, standard design SOPs doc that is ready to be shared with any freelancer who can do that work on the getgo and start focusing on expansion and outsourcing these design content jobs.\n\nIf you need any help with how Affiliate marketing can help you Iam ready to help FOC. \n\nBest of luck!"}, {"comment_author": "Pepakins", "comment_text": "You are going to have a turbulent period for the first few years of your business. My father worked 7 days a week when he started up the landscaping business years ago. I'm managing it now and still work 7 days a week. Between paperwork, work itself and customer inquiries/quotes, there isn't much time in the week. But you'll have slow periods where you wish you had more business. Just keep going and it'll pay off. Your brand is good and if you are profitable in the first year, you are WAY ahead of most. Wishing you all the best."}, {"comment_author": "Strictlybiznas", "comment_text": "Check out the book E-Myth revisited"}, {"comment_author": "ZealousidealOne9950", "comment_text": "You're profitable, so you have a little money to spend on a freelancer to help with some of the marketing stuff.\n\nInvest your energy on the things you enjoy and are your \"secret sauce\" that only you can handle,  and outsource the rest. \n\nThis will allow you to continue to scale!"}, {"comment_author": "simcore_nz", "comment_text": "I’d just encourage you to be reasonable with your expectations about what your business is and can be, and how much you can personally do at certain stages of its lifecycle (early stage).\n\nWhat’s most important to your customer and continued growth? Quality? Packaging? Focus on that and allow some other things to be sub optimal."}, {"comment_author": "Necroking695", "comment_text": "You’re in eCom, ads should be like 20% of your revenue\n\nTurning ads off for too long (2-4 weeks) resets the learning period, if you need breathing room just lower the budget"}, {"comment_author": "december33rd", "comment_text": "This would have been me if I hadn't hired so many people to delegate responsibilities to. I still work a lot but it helped me to get multiple projects going at the same time that wouldn't have been possible by myself. I recommend   book Who Not How by Dan Sullivan and Benjamin Hardy. 10x is Easier than 2x is also great. just lightly listen to audiobook while you drive or something.\n\nYou can't really grow a business if you do everything by yourself. When you have profits, you need to invest in people. People get things done. Business grows when things get done."}, {"comment_author": "Joris_Bay", "comment_text": "Make the site design more like trynood, make a shorter url / name. Make ugc yourself with your phone / talking head. Show how the product is made on the site and product page. Show reviews. Show who you are, how you make it and why you make these designs and why are they unique. Show all you company official info in the footer. How long does shipping take and cost? Show it on each page."}, {"comment_author": "CryptoNoob546", "comment_text": "No offense but you’ve only been doing this for 10 months… \n\nMost of us who have had created successful businesses have worked for very hard for an insanely long time to achieve what we have. Everyone thinks it’s overnight success and it’s rarely the case. \n\nOne of the hardest things any business owner deals with is anxiety. Taking massive risks is not easy. It’s also not for everyone. If you feel like this is too much for you, there’s nothing wrong with “quitting”."}, {"comment_author": "Pristine_Ice5914", "comment_text": "Believe me, I understand how dumb I could sound. Many are in business for years before even making a cent, I feel like I can't complain. I get it, but yeah. The hustle, always gotta be running culture gets to me"}, {"comment_author": "jbnuto23", "comment_text": "Hey! Your products are beautiful! If you need help taking off some of the load my small agency can help. Whether you need help with ad graphics, social posts, web design, package design, we can help take that weight off your shoulders so you can focus on running your business and creating beautiful products!"}, {"comment_author": "Wise_Cut_2543", "comment_text": "It sounds like this might be your sole income right now.  Can you intentionally and specifically reduce your input into the business project and go get a full time job or something to accomplice this venture?  Noone can deny that e-commerce is flooded and is also limited.... Sit them down on the table with me and they will likely lose the chess game on this one against me.\n\n\nFor now, I have basically reduced my ad spend to $1/day(just to keep the system going).  I have way too much to do besides watch the ad platforms egregiously take my ad budget.  I'm still trying to also talk to suppliers that think they can run me over too...\n\n\nIf you're project I'd already going slow and has all these limitations then can you get a job and make your business project intentionally run slow while \"word gets around\"...??"}, {"comment_author": "DubiousLollipop", "comment_text": "Have you thought about doing influencer marketing instead of generating all the content yourself?"}, {"comment_author": "Ikeeki", "comment_text": "That’s a lot of time spent for 38k"}, {"comment_author": "macabresob", "comment_text": "Right? And people are telling her to start outsourcing tasks. With what money? Can't imagine the margins."}, {"comment_author": "Ikeeki", "comment_text": "Ya if you can make more money at McDonald’s working less then I dunno if it’s worth it"}, {"comment_author": "Pristine_Ice5914", "comment_text": "I'm an industrial designer and freelance on the side, I'm also not living in the US, most business either fail or don't make money for years. I'm already in the positive, but thank you"}, {"comment_author": "Ikeeki", "comment_text": "Gotcha in that case outsourcing makes sense if you got a day job"}, {"comment_author": "enzybabe", "comment_text": "Can you run a competition to boost your engagement a little bit online ?"}, {"comment_author": "Pristine_Ice5914", "comment_text": "I've thought about this but give-aways ruin engagement because you'll run a giveaway get a load of comments and engagments for that post and then afterwards it tank's back to normal so insta punishes you.\n\nBecause to the algorithm give-aways and buying comments likes looks very similar"}, {"comment_author": "shannon_lorena", "comment_text": "I agree with the comments. You have a lot of options. I consult individuals and businesses with marketing, social media and branding needs. Not saying me, just saying you might already have someone in your life who could help you or you could pay for an hour consultation. You could pay someone to create a monthly advertisement/social media content campaign. Have someone teach you. Or hire someone to do the marketing for you. Good luck!"}, {"comment_author": "TheElusiveFox", "comment_text": "OP I know you are just here to rant, but the best advice I can give you if you are asking, is to hop on a site like fiver or upwork and look for some help... You cant do it all alone"}, {"comment_author": "Pristine_Ice5914", "comment_text": "Okay, so. I've had a few comments suggesting this.\n\nThank you for your reply, but I'll be honest\nThe type of work, and the niche I'm in. I can't hire cheap help off fiverr- this isn't a saas, or IT industry. There's a level of artistic skill and an \"eye\" someone needs to create content that adheres to the brands values, help like that isn't found on fiverr, nor is it cheap."}, {"comment_author": "TheElusiveFox", "comment_text": "So I didn't say anything about cheap help, IT, or SaaS.\n\nYou expressed that you are overwhelmed with work, and by the tone of your post are stuck in the weeds operating your business, and burning the candle at both ends trying to solve a problem you don't necessarily have the expertise to solve around marketing ad spend.\n\nHiring a third party contractor, whether a freelancer, or some consulting agency is about hiring some one with expertise that you don't necessarily have to help solve a problem you either don't have time to solve yourself, or don't have the expertise to solve yourself, or both.\n\n>There's a level of artistic skill and an \"eye\" someone needs to create content that adheres to the brands values, \n\nIt doesn't matter what industry you are in, hiring doesn't mean you don't review a contractors work for quality and discuss expectations around deliverables ahead of time.  Nor does it necessarily mean you are hiring some unskilled labour, or even some one from India or Brazil who can't necessarily communicate on a level you expect.  It just means that you are hiring for a specific task, and when the task is done, the contract is over.\n\nThat being said you are right, you get what you pay for, and if you don't have the skill to manage people or the ability to do due diligence and vet some one ahead of time you can easily waste your valuable time and money instead of saving it."}, {"comment_author": "curt94", "comment_text": "Are you trying to make money or art?"}, {"comment_author": "East-Magician-9412", "comment_text": "This is r/smallbusiness. We all want to profit from our craft."}, {"comment_author": "LocationDisastrous45", "comment_text": "Look at hiring someone remote in a lower median income country than where you are.\n\nI’m in the US and run a company. My team is in the Philippines and Argentina and they are rockstars and cost 1/10th what US hires would cost.\n\nDM me if you need hiring tips or resources."}, {"comment_author": "fiveroundshootout", "comment_text": "Why are you paying money to drive traffic to a website that is not optimized for conversion?"}]}, {"post_title": "What Skills Must I Learn to Do Well for Myself in Business?", "post_url": "https://www.reddit.com/r/smallbusiness/comments/1bypxke/what_skills_must_i_learn_to_do_well_for_myself_in/", "post_main_text": "Little bit of info.  I'm 21 working towards a degree in accounting.  Looking to pursue my masters, but I want to know what skills may be important to give myself good footing if I were to start a business.  I've heard that learning how to sell and marketing would be an invaluable skill, as is coding and such in this economy.  What do you think would enable an individual to see personal and financial growth at a faster rate than what most of society is at right now?", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "This is a friendly reminder that r/smallbusiness is a question and answer subreddit. You ask a question about starting, owning, and growing a small business and the community answers. Posts that violate the rules listed in the sidebar will be removed. A permanent or temporary ban may also be issued if you do not remove the offending post. Seeing this message does not mean your post was automatically removed.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/smallbusiness) if you have any questions or concerns.*"}, {"comment_author": "Shmogt", "comment_text": "Your job as the business owner is to bring in potential buyers. How to generate leads and how to create offers would be excellent skills to focus on. You're already good for the accounting and tax part based on your current skills. How to hire and get a sense of who actually knows what they're doing and who doesn't is key too. Communication and being able to read people is important"}]}, {"post_title": "Should I hire a CPA or do payroll myself?", "post_url": "https://www.reddit.com/r/smallbusiness/comments/1by7y9e/should_i_hire_a_cpa_or_do_payroll_myself/", "post_main_text": "This is my first year in business as an S-corp and truth be told, I'm totally clueless when it comes to taxes. \n\nMy accountant told me that he charges $500 for payroll set-up fee plus $85/month. First question: is that a normal and fair price? \n\nI see that I could do it myself with a service like Gusto for $40/month, which would obviously be preferable given how much I would save. But is it a big headache/are there many risks to doing it myself? \n\nCurious to see what most people do and recommend. ", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "This is a friendly reminder that r/smallbusiness is a question and answer subreddit. You ask a question about starting, owning, and growing a small business and the community answers. Posts that violate the rules listed in the sidebar will be removed. A permanent or temporary ban may also be issued if you do not remove the offending post. Seeing this message does not mean your post was automatically removed.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/smallbusiness) if you have any questions or concerns.*"}, {"comment_author": "BathroomFew1757", "comment_text": "How many employees do you have? Gusto is super easy. Just do it yourself"}, {"comment_author": "Lustwander46", "comment_text": "Just me!"}, {"comment_author": "ParisHiltonIsDope", "comment_text": "Just you? Yeah absolutely do gusto. Your accountant has a minimum bar for his services and that's based on multiple employees, that's why his price is so much. It's not even worth turning on his computer just to do one employee"}, {"comment_author": "BathroomFew1757", "comment_text": "Oh yeah, gusto for sure. No need to over complicate it"}, {"comment_author": "003E003", "comment_text": "do not hire a CPA to do payroll for one person. spend a little bit of time to learn how to do it and do it yourself it'll take you well less than 5 minutes a paycheck. I use QuickBooks."}, {"comment_author": "thorleifkristjan", "comment_text": "Seconding Gusto! One of my favorite professional services to work with."}, {"comment_author": "ironicmirror", "comment_text": "Just you? Your CPA is ripping you off.\n\nIf you don't like gusto (it is good) find a local payroll place... My brick and mortar payroll company changes my 45 per pay (8 employees) and 80 to do the required state filings ever quarter.\n\nGusto is cheaper, but I pay for the convince of 1) never worrying if the fed/state/local taxes are correct and 2) never having to run a payroll report... Just call Bill and tell him what I need and it is done."}, {"comment_author": "ali-hussain", "comment_text": "The fees your accountant is charging are on parif you ask an accountant. Just use gusto. Of it's just you, you might just be able to use your banks system. It's not a if you'll sue yourself if you are late in sending the check."}, {"comment_author": "jou-lea", "comment_text": "I’ll do it for free lol"}, {"comment_author": "One_Art8675", "comment_text": "I use intuit online and have for years. 28 employees simple to use. Once your basic info is entered it will pay your taxes , file reports etc"}, {"comment_author": "Necroking695", "comment_text": "It wont file your personal return, just employee taxes"}, {"comment_author": "One_Art8675", "comment_text": "I never said it does. It will only file your quarterly taxes , 941s etc.  I have been using intuit for over 10 years online for payroll"}, {"comment_author": "PencerMan", "comment_text": "Are the quarterly taxes the same as estimated taxes? Or is the difference that one is employee/employer taxes and the other is income tax?"}, {"comment_author": "Necroking695", "comment_text": "Same, its pretty great\n\nBit pricey tho, i spend like $240/mo on it, not including cc processing fees"}, {"comment_author": "bj1231", "comment_text": "Shop.  I suspect you can get it for less. Like anything else, get at lease 3 bids!!!!\n\nConsider a bookkeeper rather than a cpa"}, {"comment_author": "TenNickels", "comment_text": "Most cpas these days are using gusto-type services because they are cheaper. So might as well cut out the middle man."}, {"comment_author": "bigkutta", "comment_text": "Thats actually a good price for him running your payroll as long as payroll taxes are paid, W2s issued etc. Especially if he will do your corp taxes also. Try a big company for that and it will cost you a lot more"}, {"comment_author": "Intelligent-Plum420", "comment_text": "I tried to sign up for Gusto bc I heard good things, but when I initiated the funds transfer from my bank Gusto did nothing and it sat there until I missed the payroll, after realizing it I called customer service, sat on the phone for 45 mins only to get someone in the Phillipines who could only make a service ticket, that also went nowhere and learned that this is how Gusto customer service is always. I canceled immediately and went to Onpay who has ten times better customer service and can be reached in multiple ways without 45 min to 1 hour waits."}, {"comment_author": "SkankOfAmerica", "comment_text": "Let your CPA do it, especially since your company is an S-Corp, and especially since you say you're totally clueless vis-a-vis taxes.  Their price is absolutely reasonable."}, {"comment_author": "bj1231", "comment_text": "first year in business....\n\nDo you really need an S corp\n\nBreak-even is about $90,000 NOI"}, {"comment_author": "theglobeonmyplate", "comment_text": "Online payroll services are super easy cheap and take care of everything. I use sure payroll it's 35 a month. They automate everything, pay payroll taxes automatically issue the direct deposit."}, {"comment_author": "ExMouth7", "comment_text": "I second this. The price is reasonable and it will allow you to focus all your energy on the business. You can change to a lower cost option in the future when your overall stress comes down."}, {"comment_author": "SkankOfAmerica", "comment_text": "This! Times infinity."}, {"comment_author": "bj1231", "comment_text": "check out ADP, the payroll company"}, {"comment_author": "giggity_giggity", "comment_text": "I do payroll myself for around a dozen people twice a month with SurePayroll. It’s super easy. I wouldn’t consider having someone else do it because I can’t imagine it saving me any time at all given that I’d have to communicate hours, bonus, commission etc each time anyway."}, {"comment_author": "tinyforth", "comment_text": "85/month is not bad"}, {"comment_author": "radutrandafir", "comment_text": "$500 plus $85 a month for a CPA to handle your payroll? Pretty standard stuff, but prices can swing based on what your biz needs. You could save some dough by jumping on something like Gusto for 40 bucks a month, which is totally doable and not too tough to figure out.  \nGoing DIY means you've gotta keep up with all those pesky tax rules and deadlines. If you're cool with a bit of homework and staying organized, you could pocket some savings. If that sounds like a headache or you're super busy, paying a bit more for a CPA might just be the hassle-free way to go. It's all about what's worth more to you: your time or your money."}, {"comment_author": "Stevenab87", "comment_text": "Gusto. They are a payroll service so it’s not “doing it yourself”. Best of luck!"}, {"comment_author": "golden_score4250", "comment_text": "It depends on your goals & timeline. If you want to continue scaling, generally best to focus on your area of expertise and pilot a provider before you have a massive team. If you want to just maintain and you have capacity, it’s an unnecessary extra expense."}, {"comment_author": "hurry-and-wait", "comment_text": "I have used Gusto and Paychex. I would 100% recommend Gusto, but have your accountant set it up for you and take you through it. I have found Gusto really easy to adjust and work with, just had my accountant set it up so that I could be certain I didn't make any mistakes. Paychex is definitely not set up for small businesses. We were paying much more and it was a nightmare to use."}, {"comment_author": "Lustwander46", "comment_text": "Thanks! What did your accountant charge to set it up? Is it basically just the set up that is complicated and then from there everything is automated?"}, {"comment_author": "hurry-and-wait", "comment_text": "Unfortunately I don't recall. It wasn't much. You definitely do not need the $85 monthly maintenance though. Truthfully I can't say set-up is complicated since I didn't do it. I do know that after set-up every adjustment I have made has been super simple. I have used their chat and phone assistance a few times and been satisfied there too. I'm planning to put all of our vendor invoices there as well so that it can generate the 1099's in the future as well."}, {"comment_author": "Lustwander46", "comment_text": "Good to know. Thanks for the reply!"}, {"comment_author": "GaryARefuge", "comment_text": "You are better off having a CPA do it the first time even if you want to do it yourself. Make sure it is all set up properly and done the right way. Make sure YOU will do it the right way. Don't take stupid unnecessary risks.\n\nIf you can't afford a CPA to do this for you, you can't afford to hire employees. Don't be in a rush to grow faster than you're capable of supporting. Don't be in a rush to fuck up."}, {"comment_author": "Lustwander46", "comment_text": "I'm a solopreneur so I don't have employees (and frankly, like it that way). I set up a S-corp purely to save on taxes. My business only made around $75K ($68K after expenses) last year but still, the amount I saved in taxes was significant compared to running my business as a freelancer. I don't want to cut corners here but also don't want to pay for unnecessary expenses given that I'm not making that much."}, {"comment_author": "GaryARefuge", "comment_text": "Things seems unnecessary until you fuck up and have to face the consequences. \n\nLeverage [SBA.gov](http://SBA.gov) and [SCORE.org](http://SCORE.org) for support if you're financially limited."}, {"comment_author": "MechanicalPulp", "comment_text": "I pay myself through an S-Corp that owns my equity in my business. I use Quickbooks and it is silly how easy it is and I didn’t have to pay anyone to set it up."}, {"comment_author": "rashnull", "comment_text": "Do you even need an scorp? Aren’t you already a sole prop? What benefits do you get with an scorp ?"}, {"comment_author": "funkyonion", "comment_text": "Some banks will offer free online payroll when you have a business account, ask them first.  I, myself, have zero faith with ADP.  They are not competitive, and I have seen them make disastrous mistakes."}, {"comment_author": "picklejuice18", "comment_text": "941 each quarter, free to do it yourself. The downside you have to mail the form along with a check to the IRS so simple and yet so many CPA’s can’t even get that right"}, {"comment_author": "flowerfarmgirl", "comment_text": "You can bank transfer your payments thru the Irs web site. still have to mail the paperwork."}, {"comment_author": "jcsladest", "comment_text": "I think the price is generally fair for a CPA, but you don't need them. Gusto or a similar service is easy, automated, and modern."}, {"comment_author": "thalassicus", "comment_text": "I used Gusto for payroll and certain compliance issues and then a bookkeeper to update Quickbooks with monthly P&L/cash flow. Once your expenses are categorized correctly in month one, your bookkeeper needs very few hours to simply audit correct categorization and handle one off expenses. \n\nAnother advantage of Gusto is employees accessing W2s through their portal at no extra cost rather than that burden being on you."}, {"comment_author": "MysteriousTooth2450", "comment_text": "I do my own for $40 a month. It’s a bit to set up but once it’s set up it’s easy…well worth the savings of $500 a month. I use wave accounting for their accounting software and for their payroll. Software is free, payroll is $40 a month for one employee (me). They even do my state quarterly and federal taxes…I just verify the info and sign and they do the rest. I used to do my one yearly taxes too but that got too complicated as I made more\nmoney. Now I use my accountant for my yearly taxes only."}, {"comment_author": "TLX2015", "comment_text": "What type of analysis are you doing with your books?  Do you do horizontal or vertical analysis?  Cash flow or CapEx planning?  Long term planning? Risk analysis?\n\nThese are things a good CPA or accountant will do along with compliance.  Then you can focus on creating products lines and building customers.  Accountants don’t just do taxes and bookkeeping."}, {"comment_author": "MysteriousTooth2450", "comment_text": "I do none of this.  I don’t need it. I sell nothing and have no customers. I suppose if the  type of business I had is one that does those things I’d need an accountant. For the O0 making 68k a year in their business it would be a huge expense and money out of their family’s pocket to pay a cpa $500 a month.  A consult with an accountant once a year is probably all the OP needs to do all the things that need to be done with their business until they make more money."}, {"comment_author": "MysteriousTooth2450", "comment_text": "I guess I do have customers but I’m not actively seeking more at all.  I’ve got more work than I can keep up with already. I make enough money. Not looking to grow any further.  Different than most businesses I guess."}, {"comment_author": "TheElusiveFox", "comment_text": "I won't tell you whether or not to hire some one...\n\nWhat I will suggest is that if you do hire some one, hire them for a quarter, with the understanding that they will either be double checking your work, or explaining their work to you, if after a single quarter you feel that its a waste of their time, then move on... on the other hand if you feel that they are finding ways to save you hundreds/thousands on taxes, or preventing expensive mistakes that you hadn't thought of then great keep going.."}, {"comment_author": "Famous-Broccoli-154", "comment_text": "Gusto all the way. His price is ridiculous."}, {"comment_author": "jerseynurse1982", "comment_text": "Is gusto for taxes also ?"}, {"comment_author": "Famous-Broccoli-154", "comment_text": "Gusto handles all payroll taxes and applicable paperwork. But you'll still need a CPA to handle income taxes, sales taxes, etc. \n\nI've used every payroll company out there and gusto has been hands down the best. Their customer support is garbage, should you need it, but I've only needed it once. Even with that, they're still worth it. And employees love it."}, {"comment_author": "SeaSide82", "comment_text": "Does Gusto handle quarterly tax too? What should I consider? Thanks"}, {"comment_author": "Churchbushonk", "comment_text": "That’s a pretty good price."}, {"comment_author": "PatSabre12", "comment_text": "I use gusto for a team of 6. It’s extremely easy and support has always been great the few times I’ve needed it"}, {"comment_author": "geetarman84", "comment_text": "Gusto"}, {"comment_author": "accomp_guy", "comment_text": "ADP is a great service I like better than gusto"}, {"comment_author": "acedelaf", "comment_text": "Neither, do it yourself and use tax1099.com to file quarterlies."}, {"comment_author": "NobleCapitalist", "comment_text": "CPA."}, {"comment_author": "KaleidoscopeNo6578", "comment_text": "Gusto is totally worth it. We've been using it since 2018. You can have as many contractors enrolled as you need - you’re only charged when you pay them. They send 1099s and W2s for you; I don’t have to deal with sending any tax forms this month! Payroll is automated; you don’t have to do a thing once it’s set up. They allow employees to set up charitable contributions pre tax and also elect to send part of their paycheck into different bank accounts for budgeting purposes.   \n  \nWe don’t use them, but there are other things built in like time/project tracking, performance reviews, and time off request forms. We get our health insurance options through them too! If you use my referral code to sign up, you’ll get a $100 gift card after your first payroll is run. [https://gusto.com/r/kelly2157](https://gusto.com/r/kelly2157)"}, {"comment_author": "TheSavageBeast83", "comment_text": "Do it yourself. The problem with a CPA is you're trusting a stranger with your money and your livelihood. \n\nAs shitty as the IRS is, if you call them, they will actually give you clear cut answers on what you need to do."}, {"comment_author": "GroupJDC", "comment_text": "While we offer full service packages to our clients, if you're a single employee than sure use Gusto, thing is if you have a problem with any of the filings, W2's, relevant tax issues at the end or during the year.\n\nThese payroll processors mess up sometimes and you need to correct things. In the past I've personally used Patriot Software, but I hear good things about Gusto too.\n\nThe question is do you want some extra peace of mind or take on the responsibility if things get messed up.\n\nBecause now if something does get messed up, guess what your CPA is going to say I'm not doing your payroll, $500 a pop to fix whatever. \n\nBut if a single employee you should be ok, again weigh the potential risks vs costs."}, {"comment_author": "sioec", "comment_text": "I use gusto for 5 employees and love it. Easy, inexpensive and they are immensely helpful anytime I’ve had a question. "}, {"comment_author": "GroupJDC", "comment_text": "Again all payroll providers are easy inexpensive I've used quickbooks, patriot, we currently use quickbooks for clients.\n\nThe issue is what happens when they mess up a filing up, or didn't collect and remit proper amounts, you're going to be paying an accountant a hefty amount to fix everything (940, 941, w3's, w2's), all these companies supposedly have guarantees but they rarely back them up when the time comes.\n\nI had patriot mess up some filings, and all these places have some horror stories when it comes to payroll, and their guarantees are literally worthless."}, {"comment_author": "Macstugus", "comment_text": "I'd checkout Square payroll. The same people who make the POS system has an ecosystem of software applications. "}, {"comment_author": "1969vette427", "comment_text": "Paychex"}, {"comment_author": "Dublin79", "comment_text": "Never, ever use anyone to handle your payroll\nOther than a service such as gusto, paychex, ADP etc. Not even a CPA firm (although most are now just setting you up on these platforms)."}, {"comment_author": "sldavis102907", "comment_text": "I work for a CPA firm and handle several payroll accounts and have for 35 years.  At lease if we screw up we pay any penalties.  The big platforms will NOT do that.  You also have no idea who is even working on your account.  I spent a couple of years working for this type of company in the tax division and it was scary how little the payroll preparers actually knew what they were doing.  They were just data entry clerks."}, {"comment_author": "Lustwander46", "comment_text": "Why not?"}, {"comment_author": "Dublin79", "comment_text": "Not true. I have had gusto cover penalties multiple times. I’m not saying gusto is perfect, and I’m not saying all CPA firms are terrible at handling payroll. I’m just saying Gusto is in the payroll business, CPA firms for the most part are not."}, {"comment_author": "Dublin79", "comment_text": "I am a CPA and have seen many horror stories where clients relied on their CPA to take care of their payroll filings. The payroll firms do it best."}, {"comment_author": "meganboston", "comment_text": "What are your thoughts on collective? They’re newer I believe and offer to do everything for you."}, {"comment_author": "No_Vegetable_8554", "comment_text": "Would you be interested in talking to me about your payroll book of business? I work at Heartland."}, {"comment_author": "JeffTS", "comment_text": "Hire a CPA. Well worth the money. If the IRS comes knocking, they can represent you. Mine charges around $800 for corporate filings and about $150 for my personal filings. \n\nThe price is kind of high though for payroll. I had no setup fee and pay about $150/quarter. But, I'm also the only employee so that could be a factor."}, {"comment_author": "Lustwander46", "comment_text": "I am also the only employee in my business and make under $100k. Mind sharing the name of your accountant? I may contact him if that's ok!"}, {"comment_author": "JeffTS", "comment_text": "You should really hire a CPA that is local to you so they can not only account for federal tax laws and filings but also state and local tax laws and filings (i.e. sales tax)."}]}, {"post_title": "How to market a shirt company?", "post_url": "https://www.reddit.com/r/smallbusiness/comments/1bysisj/how_to_market_a_shirt_company/", "post_main_text": "Hi guys,\n\nI started a shirt company recently. We sell cotton printed shirts at super affordable rates. I'm part of a 4th generation business a family and we think low margins and good quality is the way to customers. But since inception eventhough people are showing interest there seems to be not much sales. Please help me in giving strategies to grow the business.\n\n\n", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "This is a friendly reminder that r/smallbusiness is a question and answer subreddit. You ask a question about starting, owning, and growing a small business and the community answers. Posts that violate the rules listed in the sidebar will be removed. A permanent or temporary ban may also be issued if you do not remove the offending post. Seeing this message does not mean your post was automatically removed.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/smallbusiness) if you have any questions or concerns.*"}, {"comment_author": "gotonyas", "comment_text": "What’s your website and social handles?"}, {"comment_author": "Dismal_Rain_1274", "comment_text": "I have an instagram page , link:\n\nhttps://www.instagram.com/heritageshirts?igsh=MXkxdWl3ODl3dTRmZg==\n\nI don't have a website though"}, {"comment_author": "gotonyas", "comment_text": "Thanks buddy. Just had a look. No one is going to want to DM you or call a phone number to place an order to be honest mate. You need an online store that covers off all your features and sizing charts and all that stuff that people want to know before they purchase. Sending a DM isn’t sustainable for you either, what happens when you miss some messages, or lose your phone, or off sick? Gotta get an online store bro. Check these guys out, they do it very well and I now buy all my underwear from them for me and my son. It’s expensive, double the price of the underwear I used to buy, but it’s quality, their site is easy to use and understand the sizings, and the patterns and colours are unique and ever changing. \n\nhttps://stepone.life/?view=sl-FAD1C6F8\n\nId recommend subscribing to their mailing list as well as other clothing brands, and copy what they do as they ALWAYS send sms and email offers and discounts which prompts the customer to spend money. \n\nBest of luck"}, {"comment_author": "Dismal_Rain_1274", "comment_text": "Hey, thanks a lot man. It means a lot. I usually get some shit comments when I ask about this topic. Thanks man appreciate it"}, {"comment_author": "Stunning_Mortgage466", "comment_text": "Since you just started. Do everything organically. Don't do paid ads until you've proven that you have market for your products. Research! Never forget that too. Also, try doing some TikTok or reach out to any micro influencers and make some deals. It can either be a 10-15 sec video for a free couple shirt or something. \n\nThe problem with your market right now is it is saturated. Even if you say you have good quality, a lot of similar businesses also use that language. Do something that will make you standout."}]}, {"post_title": "Selling business", "post_url": "https://www.reddit.com/r/smallbusiness/comments/1bysgpr/selling_business/", "post_main_text": "Selling football kit Dropshipping business. Dm for more info", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "This is a friendly reminder that r/smallbusiness is a question and answer subreddit. You ask a question about starting, owning, and growing a small business and the community answers. Posts that violate the rules listed in the sidebar will be removed. A permanent or temporary ban may also be issued if you do not remove the offending post. Seeing this message does not mean your post was automatically removed.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/smallbusiness) if you have any questions or concerns.*"}]}, {"post_title": "Small business for sale", "post_url": "https://www.reddit.com/r/smallbusiness/comments/1bysg7g/small_business_for_sale/", "post_main_text": "Hi guys, I have a small business for sale. Online dropshipping football kits. 70k+ followers on insta. Message for more info ", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "This is a friendly reminder that r/smallbusiness is a question and answer subreddit. You ask a question about starting, owning, and growing a small business and the community answers. Posts that violate the rules listed in the sidebar will be removed. A permanent or temporary ban may also be issued if you do not remove the offending post. Seeing this message does not mean your post was automatically removed.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/smallbusiness) if you have any questions or concerns.*"}, {"comment_author": "OverallResolve", "comment_text": "Why would anyone be interested when you’ve given almost no details? Why are you selling? Would it be profitable if you hired someone to do all the work?"}, {"comment_author": "Unique-Syllabub1321", "comment_text": "You can’t give too many details as it would get removed. Hence why I said message for more details"}]}, {"post_title": "Is buybiz legit?", "post_url": "https://www.reddit.com/r/smallbusiness/comments/1byoqix/is_buybiz_legit/", "post_main_text": "Got about 20k I want to invest but I’m torn between starting a business or buying one that is already up. Browsed on buybiz and I’ve found a couple companies I’d buy has anyone went through their process?", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "This is a friendly reminder that r/smallbusiness is a question and answer subreddit. You ask a question about starting, owning, and growing a small business and the community answers. Posts that violate the rules listed in the sidebar will be removed. A permanent or temporary ban may also be issued if you do not remove the offending post. Seeing this message does not mean your post was automatically removed.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/smallbusiness) if you have any questions or concerns.*"}, {"comment_author": "autobot12349876", "comment_text": "Haven't bought yet but I'm also looking. My friend who has bought numerous businesses does recommend biz buy sell.  You probably want an established business but seller valuations are crazy nowadays"}]}]