["Post business promotion messages here including special offers especially if you cater to small business.  \n\n**Be considerate. Make your message concise.**    \n\n**Note:** To prevent your messages from being flagged by the autofilter, don't use shortened URLs.", "This is a friendly reminder that r/smallbusiness is a question and answer subreddit. You ask a question about starting, owning, and growing a small business and the community answers. Posts that violate the rules listed in the sidebar will be removed. A permanent or temporary ban may also be issued if you do not remove the offending post. Seeing this message does not mean your post was automatically removed.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/smallbusiness) if you have any questions or concerns.*", "**$99/mo All-In-One Website Packages**\n\nIncludes: custom website, hosting, maintenance, unlimited updates, content creation, on-page SEO and domain. Cancel anytime, no contracts. \n\nPerfect for businesses needing a new website or a more affordable monthly maintenance package!\n\n[WorldwideWebDesigns.com](https://WorldwideWebDesigns.com)\n\nOur most recent website build is [TinsleyHeatingAndCooling.com](https://tinsleyheatingandcooling.com). For a full portfolio of work please feel free to reach out!", "**Let’s unleash creativity! Need some art or design?**\n\nLogos, graphic design, paintings, illustrations, original art. Let’s get creative… I’d love to hear about your project!\n\nhttps://www.designedbydecker.com/", "**Want to automatically follow-up with customers, clients or patients regularly via intelligent AI-generated or static text messages using just your phone and actual number?**\n\nCheck out the innovative CommuniqAI app [here](https://play.google.com/store/apps/details?id=dev.mtc.ga&referrer=utm_source%3Dredditsmb)!\n\n**How is this app different from other simple CRM, automation and messaging tools?**\n\nWell, the app is incredibly user-friendly, subscription-free, and combines features from from all these areas. It excels at making contact decisions based on recent texts and calls, combines automation with a CRM focus, and provides AI-generated, contextually-aware messages. It also eliminates the need for manual logging and will display your actual conversation histories in notifications for quick reference. CommuniqAI is designed to intelligently keep you connected with important customers with minimal interruption.\n\n**Please know the app can also be used to keep in touch with anyone effortlessly, including friends and family!**\n\nThe landing page is at https://communiqai.com, but it has not yet been updated to reflect our recent AI-generated and customer-focused messaging features.\n\nThank you!", "Facebook Ad agency. Guaranteed results. \n\nNo upfront payment. \n\nOnly for Limited  business at a Time. \n\nGet your results first then pay\n\nWe made 5x on $2000 spend for our client", "Need inspiration for creating headlines and facebook ads?\n\nI always get stuck on creating copy since I don't usually do them, so I created an app to help with the creative block [https://writebetterads.com/](https://writebetterads.com/?utm_source=reddit_smalbiz&utm_medium=web&utm_campaign=reddit_smallbiz)\n\nFor first 15 accounts it gives 10 credits instead of 3.\n\nLet me know if you get any issues.\n\nYou will need to provide an brief about your product or app and it will generate examples of headlines and subheadlines for landing pages or if you want facebook ad campaigns examples.\n\nI'm extending it next week with twitter and reddit ads.", "**Professional and Budget-Friendly Graphic Design Services for Your Business**\n\nSee my work and client testimonials:\n\n[**https://johnery.com/clientele/businesses-and-startups.html**](https://johnery.com/clientele/businesses-and-startups.html)\n\n[**https://www.instagram.com/johnerycreatives/**](https://www.instagram.com/johnerycreatives/)\n\nEmail me for a free consultation: [contact@johnery.com](mailto:contact@johnery.com)\n\nHi everyone! I'm a freelance graphic designer specializing in graphic design services for businesses and startups. From logo design to marketing materials to social media graphics, I provide a full range of services for your needs, with a focus on creating visually appealing work that engages your customers well.\n\nI understand that times are hard for most businesses in the current situation. As such, I'm happy to work with your budget, while delivering quality work for your business. If you're interested, feel free to send me a message and I'll try my best to answer any questions you may have.\n\nI look forward to hearing from you!", "Feeling Overwhelmed? Unlock Your Productivity with Our  Free Notion Template.\nhttps://adnnotion.gumroad.com/\n\nImagine the frustration of:\n\nLosing track of brilliant ideas that could transform your work or life.\nWasting hours searching for important notes\n scattered across notebooks and apps.\nFeeling constantly stressed and overwhelmed by information overload.\nSound familiar?\n\nNow \nReady to take control of your overflowing mind?\n\nDon't wait – download your free template now!\n\nhttps://adnnotion.gumroad.com/", "The Happy Camper Restaurant services  \n\n\nFood supplier  \n\n\nPayment processor  \n\n\nAdvertising and Marketing  \n\n\nContact us at 2813059183", "Hi! I'm an artist! I create artworks that either tell a story, make you smile or look pretty in your home!\n\nBuy my products here and support your girl!\n\n[Buy my artwork](https://www.redbubble.com/people/RayaKumera/shop?asc=u)\n\nI also do commission work for illustrations and design. Reach out to me on Instagram to know more!\n\n[Commission me!](https://www.instagram.com/raya_kumera/)", "Unlimited **web and mobile design and development** at a **fixed monthly** price, with the freedom to **cancel or pause anytime.**  \n  \n[**frontendgenie.com**](http://frontendgenie.com)", "Introducing my fashion label [Green Riot](https://www.greenriot.net/i/international-plant-punks-welcome).\n\nVegan apparel for plant lovers – strictly sustainable, earth-positive, and worldwide, climate-friendly shipping!\n\nOur [Etsy store](https://greenriot.etsy.com) is full of cool shirts and other stuff - this is your chance to help a DIY-business out 🤝\n\nLet me know what you think of our new [Tofu Love bundle](https://www.greenriot.net/p/tofu-love-bundle-tofu-love-socks-and-crewneck) 💚🌱\n\n👉 [Etsy Store](https://greenriot.etsy.com)| [Instagram](https://www.instagram.com/greenriot.apparel/) | [Website & Shop](https://www.greenriot.net) 👈", "Accept card payments for your business with just your phone.  \n  \nTap to Pay on Android & iOS.  \n  \n[paidforstripe.com](https://www.paidforstripe.com)", "why you? why not use directly stripe?", "Stripe provides the payment APIs, but it doesn't provide a POS to accept payments from your mobile device.", "Looking for quality Zimbabwe Shona or Ndebele products, look no further. Timeless Nguva offers minimalistic Zimbabwean digital products such as digital calendars and planners. For more information visit: https://timelessnguva.mydurable.com", "Hello my name is Martin and I have created [https://ennza.co](https://ennza.co). Ennza allows businesses to assign URLs to phrases, making it easier for people to find your business.   \n\n\nImagine having a phrase on the side of a van or advertisement rather than a hard to remember URL or a QR that means nothing when your customer is not in front of it. I'm looking for small businesses to reserve their phrases and open up the power of spoken word.   \n\n\nI'd highly appreciate feedback!", "**Best HR Softwrae for Small Businesses in Malaysia - RM 3 Per Employee - QuickHR**\n\nA HR software that provides an intuitive all-in-one solution for Payroll, Leave, Claims, Attendance Tracking, and Employee Onboarding, enhancing user experience while saving time and resources for your business priorities.\n\n**Try it for Free -** [**https://quickhr.my/**](https://quickhr.my/)", "**Best HRMS Software in Singapore - QuickHR**\n\nQuickHR is a Human Resource Management System (HRMS) that’s been built with a simple goal- eliminate the problems that plague traditional HR platforms and HR software. Every part is designed with security, stability and ease-of-use in mind. QuickHR frees HR professionals from tedious administrative tasks to focus on what they do best- build better organisations.\n\nTry it for free - [https://quickhr.co/](https://quickhr.co/)", "Hey! Tomas here, rescuing business apps & websites from Brooklyn, NY.\n\nWe help non-technical business owners make your website do a better job bringing new customers than it did yesterday.\n\nUnlike other agencies, we're not about flashy launches and big PR but rather consistent, daily updates so that your new marketing idea can come online in a few hours and not weeks.\n\nThink of it as having a star developer on your team but for a fraction of the price tag.\n\nRead more below and reach out!\n\nhttps://colladeo.com/services/website-rescue/", "**Free AI Consulting Call**\n\n30-minute free talk, you tell me about your struggles and workflows and I will figure out if AI can help you optimise processes. If so, I will create a small template or small automation with AI to speed up your workflows for FREE. You will need to cover software costs (in case paid software is needed)\n\nBook your call: [https://calendly.com/daniguiradov/30min](https://calendly.com/daniguiradov/30min)  \nEmail Contact: [daniguiradov@gmail.com](mailto:daniguiradov@gmail.com)", "Hey there! I'm Josh, and I'm a **freelance copy and content writer** specializing in writing web copy for US-based SMBs and content such as articles and blog posts. Let me do what I do best--which is to help your organization position itself as an authoritative voice and gain exposure--so you can focus on running your business!\n\nI'm based in Amsterdam, but I've lived in the Caribbean, U.S, Ghana, and Spain. I have a proven track record of researching and writing for often complex fields (such as law or medicine) and translating it into more readable, everyday language that engages and converts your readers and clients!\n\nI offer cutting-edge and engaging content at competitive rates. Drop me a PM to request additional samples or to see how we can work together!\n\nSamples: https://docs.google.com/document/d/1A3YPkHaGBfarJTG0IhDgZCbJuQ9tbwtqwQolonT6OjE/edit?usp=sharing", "**Find the right programmer.** [Technical Interviewers](http://techinterviewers.com) provides vetted coders that are hand-picked for your needs. Our screening process uses IT professionals as interviewers so that you get only the best. Not ready for a developer yet? We also offer planning and consulting sessions to help you turn your idea into a real product.", "Hi! I'm Justin and run a small business consulting company. \n\nI am actually the #1 management consultant on Upwork in the world and am trying to expand my knowledge (at a fraction of the cost of big firms). If you are having trouble with sales, marketing, etc - book a free consultation with yours truly! \n\n&#x200B;\n\nWebsite's here: https://aryocg.com", "ATTENTION SERVICE BUSINESS OWNERS, **Sam** here, owner of **Opasite - Web Design**.\n\nWe build and then manage your service business's website, saving you all the time and frustration of fiddling with website design tools. We take care of your online presence, so you can focus on your business!\n\nOur all-inclusive Do-It-For-Me website packages include:  \n💻 Professionally Designed Website  \n📝 Expert Content Writing  \n📈 Search Engine Optimization  \n😊 Managed website and on-demand content changes  \nAll this for **only $99/mo**\n\nSee more details here: [~https://opasite.com~](https://opasite.com/)\n\nInterested? Have questions? Let's chat! Email me at [~sam@opasite.com~](mailto:sam@opasite.com) or send me a chat to get the conversation started.\n\nP.S we're looking for white-label partners. If you have a complimentary service to ours or you're an agency looking to outsource your web design activities, send me a chat.", "[OrchidToys.com](https://orchidtoys.com) is our adult toy store. We offer discreet shipping on all US purchases! Use code \"reddit10\" to get 10% off your purchase. For every purchase you make we give a portion to charities we believe in. If you are an onlyfans model/streamer or in a long range relationship we now offer [Lovense](https://orchidtoys.com/collections/lovense) toys like the [Lush 3](https://orchidtoys.com/products/lovense-lush-3-0-sound-activated-camming-vibrator-pink)", "Ever wanted to watch your pets life through their eyes?\n\n [CollarCam](http://www.petcollarcam.com) is the tiny, fun HD Camera for your pet's collar! 🐱🐶 Simply attach and click play to record! \n\n💧Waterproof to 98ft\n\n📏1inch wide & weighs 0.4oz\n\n💨 Motion detection mode\n\n🌙 Night vision mode\n\n🔊 Crisp audio to hear ever purr and woof\n\n🆓 Free 32gb memory card & adapter\n\n🇺🇲 Free shipping to the USA \n\n[Check us out here!](http://www.petcollarcam.com)", "Brimstone Coffee is an information portal about coffee, recipes, reviews, and industry news.\n\n[https://brimstonecoffee.com](https://brimstonecoffee.com)", "Larafast - Laravel SaaS Boilerplate - [https://larafast.com](https://larafast.com)\n\n  \nIt contains, Payment Systems (LemonSqueezy/Stripe), Admin, Blog, SEO, 30+ Themes, Ready to use components. \n\nAvailable in TALL and VILT Stack.", "Worktabs is a cloud based kanban style work organiser that has quotation/invoicing and online payment capabilities.\n\nCurrently there is a one month free trial of the pro version on offer.\n\n[www.tryworktabs.com](https://www.tryworktabs.com)\n\n&#x200B;\n\nIf any user of this subreddit would like to have a go and provide feedback via our questionnaire, please drop me a DM and we can offer an extra 6 months free.", "**HUMAN RESOURCE SERVICE PROVIDER FOR SMALL BUSINESSES!**\n\n\\*Free Consultation\\*\n\nAs a Certified HR professional consultant at PAC Solutions, we provide cost-effective solutions to address all your HR requirements. From creating employee handbooks and implementing policies to managing payroll and more, we’ve got you covered. Our flexible pricing options include both set monthly rates and hourly billing, tailored to suit your company’s needs.\n\nDirect Message me on here for more information.", "**AI-Powered Car Reviews Summary**  \n  \nHello, everyone. I want to share with you our new Discord server, featuring the Vogadu bot. We are using AI to summarise car reviews and highlight key features, potential issues, and what people like about various car models. Everyone is welcome to join the server here: [https://discord.gg/x8zXqvNz8g](https://discord.gg/x8zXqvNz8g)", "Introducing SpiruVedic: Where Nature and Innovation Harmonize🌱\n\nAt SpiruVedic, we embark on a journey rooted in botanical wisdom and modern ingenuity. Our brand is not just about products; it's a testament to our commitment to your well-being. Led by a team of dedicated botanists, we breathe life into our herbal offerings, meticulously crafting solutions that redefine the essence of wellness.\n\nOur vision transcends conventional herbal remedies. We understand the potency of Spirulina and its profound benefits for health. However, we also recognize the challenges it presents – the pungent odors, unwelcome textures, and taste disparities. SpiruVedic emerges as the bridge between tradition and innovation, addressing these drawbacks with finesse.\n\nWe pride ourselves on delivering products that embody quality, affordability, and convenience. SpiruVedic isn't just about nourishment; it's about elevating your experience. Our formulations are designed to be more than supplements – they're delightful companions on your journey to health.\n\nOur commitment extends beyond mere functionality. We believe that wellness should be an enjoyable pursuit, seamlessly integrated into your lifestyle. Hence, we infuse Spirulina with balanced flavors and textures, making it a delightful addition to your daily routine.\n\nSpiruVedic isn't just a brand; it's a promise. A promise to nurture your health with integrity, to innovate tirelessly, and to empower you on your wellness voyage. Join us as we redefine herbal wellness, one delicious serving at a time.\n\n Welcome to SpiruVedic – where nature's gifts meet modern solutions🌱\n\n@spiruvedic", "Huge sale! 25% off store wide! I’m an up and comer! I need all the support I can get! Thank you! Visit: [techtopaaa.myshopify.com]", "Greetings peeps of r/smallbusiness\n\nI am a licensed", "Backlinks service - Dominate the serps", "Launch your products, get feedback, traction and first customers over a month of rankings\n\nUrl: [microlaunch.net](http://microlaunch.net)", "**Are you looking to take your business to new heights this year?**\n\nDon't let your business miss out on its potential. Let's collaborate to develop a comprehensive **BUSINESS PLAN** that can be used for securing loans, grants, visas, attracting investors, or for personal use. Our team of experts is here to assist you every step of the way.Reach out to me to start the conversation and discuss your needs in more detail. Looking forward to working with you!", "Allow small business to market day to day free of charge with Grafeedi.\n\nAd dollars are not required with Grafeedi. \n\nJust post anonymously & go!\n\nhttps://apps.apple.com/us/app/grafeedi/id1538487626\n\n[Grafeedi](https://apps.apple.com/us/app/grafeedi/id1538487626)", "Bookkeeping services for small businesses using QuickBooks Online.\n\nIf you've got books that need to be cleaned up or you're tired of maintaining it yourself, feel free to reach out!\n\nwww.marginwall.com", "At [AloraLaneCrafts](https://www.etsy.com/ca/shop/AloraLaneCrafts?ref=usf_2020), where my wife and I showcase a diverse array of handcrafted wooden goods perfect for complementing your home and garden aesthetics!\n\nWe're thrilled to unveil our latest additions, including handmade plant propagation tubes, dog bowl holders, plant trellises, and more – all expertly crafted from cedar wood.\n\nThanks for checking us out!", "We create websites and set up custom automations for businesses. \n\nGhostwriting services are also available.   \n[https://entergrity.com/](https://entergrity.com/)", "I own a small service business. I run Finishing Touch Events out of the Midwest. I plan for social and business events and contract event planning with larger firms. I also provide event staffing with a small group of professionals. my website: [www.eventsbychelsea.com](https://www.eventsbychelsea.com) \n\n&#x200B;\n\nI am losing steam trying to find clients y'all. Any suggestions? I don't know how long I can keep going at this pace.", "Nihaojewelry wholesales jewelry, accessories, etc., more than 200,000+ products, 1000+ new items added every day, no minimum order quantity, 10 times profit, helping your business grow rapidly   [www.nihaojewelry.com](http://www.nihaojewelry.com)", "**Automate your Phone Calls with AI**  \n  \nUse AI Calls ([www.aicalls.io](http://www.aicalls.io/)) to create humanlike AI Voice agents to seamlessly interact with your customers on the phone, 24x7.\n\nUse our easy-to-use workflows to automate repetitive, boring yet crucial tasks like getting customer feedback, updating leads, and many more!\n\n**We are running a campaign where in we offer you 2X the minutes for any subscription (valid for our Retail Plan only). This will allow you to test the system well enough and get ready for real campaign.**\n\nListen to one of our fresh voices: [https://veed.io/view/433b7fe2-e425-485d-b2bf-253eaa6d9a78](https://veed.io/view/433b7fe2-e425-485d-b2bf-253eaa6d9a78)\n\n**Talk to one of our cofounders:** [https://calendly.com/paul1506/introduction-to-ai-calls](https://calendly.com/paul1506/introduction-to-ai-calls)", "We help established entrepreneurs and small business owners save time and get more done so they make more money with less effort. We create customised simple and effective well tested solution designed specifically for you entrepreneur and small business owner.\n\nThe package include :\n\n- Structured well tested frameworks to cut time by 50%.\n\n- Tools to actually put those into actually practise within a short 48-72 hour period.\n\n- Health/fitness plan to reduce your stress level. \n\n\n\nAll design to make you more money with your business, less stress. Leaving you to just focusing on what you love to do best.  \n\nToday, we are doing one day promotion. Message me if interested.", "https://modernestateco.etsy.com/\n\nI would love to grow my Instagram follows! If you support, I’ll support you back! \n\n@modernestate.usa on Instagram. Thanks everyone 🥰🥰🥰🥰", "**Name:** Jitbit Helpdesk (support ticketing system)\n\n**URL:** [https://www.jitbit.com/helpdesk/](https://www.jitbit.com/helpdesk/?utm_source=reddit)\n\n**Details:** We are a small self-funded team from the UK, our product is [Jitbit Helpdesk](https://www.jitbit.com/helpdesk/?utm_source=reddit) - is a ticketing system to manage customer support via email and live chat. Targeted at startups and small/medium businesses like us. We offer **both hosted and \"on premise\" versions** at a very reasonable price.\n\n**Features:** mobile apps, support-mailbox monitoring, integrations (Slack, Github, Active Directory, JIRA, etc etc)\n\n**Discounts 4 redditors:** PM me for a special /r/smallbusiness discount ;)", "We make these effective [back massagers](https://www.etsy.com/shop/Tremass).\n\n[How it works, video.](https://www.youtube.com/watch?v=euDVrt4ZYok)\n\nWe make a useful and effective back massager.\n\nBy rolling the back on the rollers, the spine lengthens by half an inch. This immediately relieves pain and infringement of the vertebrae.\n\nThe rollers make a deep massage of the muscles that hold the vertebrae. Muscles train and become stronger. Strong muscles - a healthy spine.", "While you are reading all these self-promotions for services to help your business, I have something you can munch on to make reading these posts a little more sweet....or salty.....or spicy if that's your thing. [POP-Maize-N Gourmet Popcorn](https://www.popmaizen.com/?coupon=reddit-smallbusiness) at **10% off**", "Fat Cat Bookkeeping, bookkeeping for your small business or personal finances.\n\n\nwww.fatcatbookkeeping.com\n\n\nRecently switched to this profile so the username matches my business name. Please feel free to see my main account for years-long post history and additional info: u/themostfluffycat", "Get data from Facebook Marketplace or any other marketplace for your business.  \nhttps://e-scraper.com/useful-articles/how-to-scrape-social-media-shop-and-marketplace-to-csv/  \nOr use our software https://e-scraper.com/software/ for price scraping or price comparing.  \n\\- Try FREE\\* for 14 days  \n\\- No coding skills required  \n\\- No credit card required", "Hello! My name is Sophie and I run [ThreadedFables](https://threadedfables.etsy.com). I make handmade and embroidered book sleeves, kindle sleeves, and other seasonal crafts!\n\nAll products at ThreadedFables are handcrafted in Australia with quality materials, love, care, and good vibes so you can take your books or devices anywhere and know they’ll be protected from any bumps and scrapes along the way :)\n\nI have lots of new products coming in the new year that I am very excited to share with everyone and will be bringing back some of my popular designs from last year also!\n\nI would highly appreciate it if you took the time to check out my store :)\n\nhttps://threadedfables.etsy.com", "[\\*\\*PREMIUM PRODUCT PHOTOS - MAIL ORDER PHOTOGRAPHY\\*\\*](http://premiumproductphotos.com/)\n\n\\*What Are Offering\\*\\* If you are someone who needs [professional product photography](http://premiumproductphotos.com/) then PM for a 10% Reddit discount. Our product photography services are great for entrepreneurs and marketers who need premium photography regularly for e-commerce websites, Amazon products, social media or catalogs. We’ve made our service easy and non\\\\-committal so we only charge for images you want.\n\n\\*\\*Who Are We / What Experience Do We Have?\\*\\* We are professional photographers that have been doing commercial photography for over 7 years. You can take a look at our [product photography portfolio](http://premiumproductphotos.com/product-photography-portfolio/).\n\n\\*\\*Where Are We Located\\*\\* We are a product photography studio based out of Toronto, Canada. We recommend that American clients ship through USPS and to label their package as a \"temporary import use for marketing/photography\" to avoid duties or hold-ups at the border. \\*\\*Pricing\\*\\* See our [product photography price list](http://premiumproductphotos.com/product-photography-pricing/) below for details\n\n|**QUANTITY**|**PRICE**|\n|:-|:-|\n|||\n|||\n|1 photo|Send in your product and have a free test shot!|\n|2-19 photos|$25/photo|\n|20-49 photos|$17/photo|\n|50-99 photos|$12/photo|\n|100+ photos|$8/photo|\n\n**OTHER SERVICES**\n\n|Ghost Apparel|$35/photo|\n|:-|:-|\n|||\n|||\n|360 Degree|$100/product|", "Core Solutions Group (Financial services for Law Firms & Businesses) - [https://www.yourcoresolution.com](https://www.yourcoresolution.com)\n\n  \nMoney Mastery (Financial Services for Business Owners) - [https://moneymastery.mykajabi.com/services](https://moneymastery.mykajabi.com/services) \n\n  \nI started a new podcast, Always and Never About Money, for both personal and business finances. [https://itsalwaysandneveraboutmoney.buzzsprout.com/](https://itsalwaysandneveraboutmoney.buzzsprout.com/)", "This post welcomes and is dedicated to:\n\n* Your business successes\n* Small business anecdotes\n* Lessons learned\n* Unfortunate events\n* Unofficial AMAs\n* Links to outstanding educational materials (with explanations and/or an extract of the content)\n\nIn this post, share your small business experience, successes, failures, AMAs, and lessons learned. Week of December 9, 2019 \n/r/smallbusiness is one of a very few subs where people can ask questions about operating their small business. To let that happen the main sub is dedicated to answering questions about subscriber's own small businesses.\n\nMany people also want to talk about things which are not specific questions about their own business. We don't want to disappoint those subscribers and provide this post as a place to share that content without overwhelming specific and often less popular simple questions.\n\nThis isn't a license to spam the thread. Business promotion and free giveaways are welcome only in the Promote Your Business thread. Thinly-veiled website or video promoting posts will be removed as blogspam.\n\nDiscussion of this policy and the purpose of the sub is welcome at https://www.reddit.com/r/smallbusiness/comments/ana6hg/psa_welcome_to_rsmallbusiness_we_are_dedicated_to/", "This is a friendly reminder that r/smallbusiness is a question and answer subreddit. You ask a question about starting, owning, and growing a small business and the community answers. Posts that violate the rules listed in the sidebar will be removed. A permanent or temporary ban may also be issued if you do not remove the offending post. Seeing this message does not mean your post was automatically removed.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/smallbusiness) if you have any questions or concerns.*", "I run an online clothing store and I recently had this guy on Instagram outreach to me and he asked if I was interested in trying out email sequences (or email marketing), I was handling my email list by myself up until then and I wanted to see how he would handle it. I had about 4291 people on my email list (with only 971 people having bought a product). We aimed for 1000 sales and guess what? we already reached the goal on the 4th day and he only asked for 90$ but I had to give him a raise and pay him 150$. I'm still working with this guy and it's one of the best investments I've made so far. I can give you his contact but im not posting it here cause it would look like im advertising for him.", "Im on the verge of closing. I own a rental service for outdoor recreation. Generally speaking we’ve been good but covid, while great for rentals, it destroyed the retail component because of supply change issues. And after last year, we were greatly affected by the Canada fires. The air quality made me lose 2-3 weeks of a 15 week season.\n\nIt’s stressful because it’s a bit more on the “expensive hobby” territory since I love the actual stuff but not business end and I should have done better planning. Passion only gets you so far.\n\nInsurance, I’m in NYS, so I need WC, PFL on top of Gen liability and car, and all the labor costs. \n\nI’m really on the fence, being realistic? Or follow dreams?", "I'm not sure how to feel or what to do. Last year I was going to leave the business I work at for bigger better things (was getting way under paid and my direct manager is... less than useful we will say). The owner begged me to stay and raised my pay. Told me to \"just hold on, there are big things coming. It's going to mean a lot of money for everyone\".\n\n   I had a little loyalty to the owner so I told him I'd give it some time and discussed what the issues were and what needed to change foe me. A month later he sold the company. \n\n  Enter new owner unaware that the company is crumbling. This companies maintenance department sits on me and my best friend. If one of us leaves we both leave. If we leave now we cripple the company and possibly destroy the new owners life because sadly without the lead techs he bought a name, some rusty vans, and dull screwdrivers. \n\n  I'm in a moral pinch. I didn't sell the guy a broken company, but the value of his purchase balances on my friend and I amd we want to start our own thing.", "This is a friendly reminder that r/smallbusiness is a question and answer subreddit. You ask a question about starting, owning, and growing a small business and the community answers. Posts that violate the rules listed in the sidebar will be removed. A permanent or temporary ban may also be issued if you do not remove the offending post. Seeing this message does not mean your post was automatically removed.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/smallbusiness) if you have any questions or concerns.*", "Doesn't matter, do whats best for you and yourself.\n\nThis new boss should have done more due diligence before his purchase. He should have looked at any dependencies and the internals of the companies before he purchased.", "Well said. Also, what were the “big things coming”? Did OP get a bonus or something when the old owner sold? \n\nOP, you don’t owe anyone anything. Take care of yourself.", "I agree with this 100%. We were really surprised that the day we met the new owner was the day he took over. He is a nice guy, but I've been tired of my labor paying for an entire office.  \n\nThe new boss paid somewhere up to a few million where his prior company is valued at a few hundred thousand. So, I do feel if we leave it will ruin his business life. I know it's not my place to worry about his business decisions, it still leaves a bit of a pit in my stomach.", "Also, it is unlikely it is a cash out deal. If the company collapses the new owner will likely not have to pay the previous owner all that is owed.", "Big things = if you leave I could lose the sale.", "“Big things coming“ for the old owner, not OP.", "Well, it sounds like your new boss bought himself a job as a lead tech. ", "I also think some employees might overestimate how integral and irreplaceable they are. I had an employee quit who was very worried the business wouldn't survive without her. I replaced her in a month and it was actually better for my business overall to have her gone. \n\nIf you feel bad and it won't screw up your own opportunity give him a long notice like one month and spend some time writing out procedures.", "If you go to leave and the new boss recognises your value, he will move heaven and earth to keep you. If not, the fate of his business is on him. But you owe him nothing either way.", "> So, I do feel if we leave it will ruin his business life. \n\nSounds like a reasonable person would be willing to pay you a great deal of money to help them avoid that.", "For all you know, he’s going to move his other company staff over, get them trained up, then give anyone he isn’t in love with a swift boot  \n\nGo do you while you still can", "If you died, he’d replace you as fast as he could.  Neither boss feels ANY loyalty to you.  All you can do is look out for yourself.  And do it quickly.  If the other guy leaves first you’ll feel even worse about leaving.  GO GO GO!", "What makes you think the previous owner is owed anything? Unless there's some owner financing involved, he already got paid.", "Bingo.  Dunno how Hipster missed that the big thing was a fat check for the previous owner.  OP you got royally screwed by the previous owner. Do what you need to do now. You have no loyalty to the new owner and you shouldn’t have had any for the old one as is too often the case nowadays.\n\nAlso let me add if you are key personnel in a business often you might receive retention bonuses with an agreement to stay on for a period of time after the sale. If the new owner hasn’t offered that then fuck em, do what you need to do.", "Exactly. If you ever hear something like that, it's time to leave ASAP.", "“Big money for everyone” was also said, implying that he gave the impression that there would be some type of payoff", "Well she obviously wasn’t a key person. A real keyman WILL cause disruption and every company has one.\n\nOf course to your point most employees think they’re indispensable and don’t realize that there’s probably a live job post for their title right now.", "I said \"likely\" because I've done dozens of these deals and you'd have to be a moron not have a holdback, earnout or partial owner financing... of course, there are a lot of morons out there. Again, that's where the \"likely\" part comes in.", "It's common to have an earn out or other stipulations for this exact scenario.", "Most business sales happen to have an Earn out clause where a portion of the money isn't paid until the business demonstrates consistent cash flow under new ownership.", "Let him know what the previous owner said before you leave.  It sounds like he lied about the company status, and it may be grounds for a lawsuit.\n\nSpill the beans.  This guy may be willing to pay your worth to buy time for a fix.\n\nKeep planning your exit.", "I mean, no I didn’t miss it. The owner just made it sound like there was some benefit for OP as well.", "With a new owner, you may be able to treat this like a new job. Renegotiate your job description, salary, and benefits.  If you show your value (through conversation and documents), you may be able to get the promotion and pay raise you want. \n\nThe guy just spent probably a couple of hundred thousand on the buissness, and exstra 20k a year is probably not the end of the world to keep his investments worthwhile.  Set up a coffee meeting and be prepared to show your worth. As well if you don't have a job description now is the time.", "If you died tomorrow, they'd have you replaced in a fortnight. Your family and yourself are your priority.", "OP is greatly overestimating how important he is.  Also likely overestimating his contributions to the company.", "They have been trying for years just to hire someone who can learn the field. They can't even get a trainee they would be hard pressed to replace us. We are on the more advanced side of commercial appliance repair. This is part of why we plan on casting out on our own. We do some advanced work for general pay. \n\n  I do get what you're saying and I agree.", "Yeah, I think so. I found this out the (somewhat) hard way. Everyone is replaceable. Not taking anything away from OP, but there is always someone that can take your place. Might take a few hires to find a person that was as good and as dedicated as you, but they’ll fill your spot the next day.", "Nailed it. 98% of the time, if a new buyer can buy a business for millions, they can replace a sub $100k employee pretty easy.", "Is going out on your own and offering your services as a contractor an option. Could be a good bridge into starting your own business.", "It sounds like you're in a position to negotiate a big raise and/or benefits for you and your friend.\n\n\nOffer to stick around for a year and train new folks for 4x your current salary. Time limiting the pay increase will make it look more appealing to the numbers people. You could also learn more about hiring and training on their dime before you go out on your own.", "You fixing sewing machines?", "This might be the time to negotiate for some equity.  Rebuilding everything from scratch would be hard.", "\"The cemeteries of the world are full of people who thought the were necessary for our survival, yet we still go on . . .\" Heard family say it many times. Don't \"over value\" your position.", "This is a very good idea OP, may solve both problems if the new boss is willing to work with you.", "I'm not trying to get into contracting. The bidding and licensing gets messy and confusing in my industry at that level. I'd rather just fix machines. From the wall out I like to say.", "Do *you* fix sewing machines?", "I could. I can fix everything. My current job and future business is focused on advanced commercial kitchen appliances. Like ovens that you can just stab a probe in a hunk of meat and it cooks it perfectly with no input from the cooks.", "I don't think that u/tinglish01 means becoming a general contractor. I think that the suggestion is to do some work for the new owner by negotiating a contract between him and your new company. You start a business with a big client. New owner has the ability to service his existing clients. There are some potential issues with the new owner not wanting you to take his clients but those are negotiable.", "How about \"we will do work for you at XYZ per hour, but our work must be paid for at the end of each day/week.\"  \n\nDon't let them go out longer than a week because if they get in a crash crunch they'll screw you first.\n\nMake sure the XYZ rate is at least 3 times per hour what you get paid right now, per man hour (so 3x for you, 3 x for your co-owner).  That accounts for the costs of running the business and the risk that comes with being personally liable (or your newly formed company is liable) for your work.", "Yeah", "Are you writing to us from the future?", "Just invited you to a neeeewwwww sub!!! \n\nSewing machine fixers unite", "The future was yesterday in my field. You wouldnt believe what ovens have become in the past 20 years.", "These ovens are pretty common now in commercial applications, they're just expensive.  It's the first legit use for wifi in an oven I can think of.", "well fuck, now i wanna do a deep dive on oven technology, i had no idea!", "Or could be an opportunity for you and your friend to grab more power and privileges where you're currently at. Sounds like you have all the leverage to shape the company into however you want", "We nearly doubled our pay but now they are claiming they can't afford more. Meanwhile there are 3 techs (2 senior and 1 trainee) and 10 people in the office doing billing and holding down chairs.\n\nWent from 20 an hr to 32 an hr but this is still the low end of pay for my field and my experience.", "That's exactly what I was going to say. I would have an honest conversation with the new owner and bring evidence, then negotiate partial ownership so that you can have the say to correct the issues.\n\nBut, that's just the route that I would personally take. May not be the right one in this instance.", "Be careful of blinders. I would bet money that those people \"holding down chairs\" are more necessary that you realize. It sounds like you don't really know that side of the business, and it could bite you in the butt if you start on your own. Maybe take this opportunity to step into a more managerial role and learn something new.", "Not your problem to keep someone else's business afloat when it only even pays you at the low end of your field. You gotta prioritize your own income", "Then you should have your answer. I'm starting my business now myself in a somewhat similar situation.\n\nIf they can't afford you and you need/want more pay then the answer is clear. Put in your notice. If they really can't replace you, they'll find a way to pay you more.", "Definitely worth a discussion with the new owner. Not thinking more pay rise but profit-share/ownership.\n\n\nIt could be a shortcut to what you're currently considering (starting your own thing/contracting).", "Negotiate partial ownership with someone who just paid millions of dollars for the business? LOL.", "This. Learn why they spend so much for butts in chairs. How does this keep the business going? Do you NEED this or does this just make the business more efficient?", "So previous owner baited and ditched you?", "He did say big things were coming.", "They probably bought it for the name, and the customer list. They don't need you, and can surely afford to hire a grand total of two people.", "I hope you're right. They may be able to afford to hire the people. They simply can't find the people. To do my job you need to be an electrician, plumber, refrigeration tech, mechanic, fabricator, and so on. And have a few thousand dollars in specialized tools.", "You said yourself you’re underpaid. So it’s unsurprising they can’t fill the roles. But none of that is problem nor should be your concern. I don’t work with any friends so the only person I look out for is myself.", "Here are some facts you don’t understand.  No one is irreplaceable.  And anyone who buys a business expects a big turnover in the first year.  Often they not only expect it but they want it.  It’s a way of changing the business to make it more profitable.  You should do what’s best for you - but don’t expect that you leaving will cripple the company.", ">I hope you're right.\n\nWho gives a fuck what will happen to the new business owners? Is your name on the contract? Did they make you a business partner? Would you be shocked you if they terminated you tomorrow and brought in cheap foreign labor? Your former boss tricked you into staying so he could sell a business to benefit him, and you're now ready to protect and defend the new business owners? Holy shit, the workers of the world have been heavily brainwashed to be concerned about someone else's revenue and profits.\n\nYou have been exploited and underpaid and your old boss used you so he could sell an operating company for maximum profit, yet you are still worrying about the poor new business owners who had a few million dollars to throw at this company? OP please, this is the risk people take when buying or starting new businesses. This is something you may experience when you go out on your own too, so stop worrying about someone else's financial situation and go out there and create a business and life that will benefit you and your family.", "Start your own handyman business, specializing in appliance repair. Sounds like you can do a lot more as well. You and your buddy could split into two divisions of service.", "Sounds as if you are in a niche industry, but staying at a failing business one day longer than you have to is crazy\n\nAre you going to poach the company's clients when you leave?\n\n Is about the only concern the new owner should have.", "They probably just can't find the people at the salary/pay they're offering. I'm sure that at the right pay, they could find people.", "You can leave AND not screw over the new owner. Commit to it, then give him a reasonable amount of time to replace someone.\n\nEven ask for some type of bonus (in writing) if you can find the replacement yourself.\n\nOr, start your own business and immediately try and contract out your work with the new owner.\n\nGet creative.", "There are a lot of very skilled people in the work force, but not a lot that are willing to be underpaid for those skills. The problem isn't that OP isn't replaceable, the problem is that they can't find anyone else to do it that cheap. No matter what, you're spot on. Not his problem.", "You didn't put the new owners in this situation, the owner did and acted in bad faith selling the business without disclosing what conversations you've had with him and likely only sold positive stuff to the new owner. \n\nThe old owner is ethically wrong and potentially likely legally wrong in what he did. \n\nYou're not tied to that place so feel free to leave.\n\nMy suggestion is you speak to the new owner, tell them exactly what you said here, emphasis on the part where you brought up all these problems to the owner, especially the bit where you threatened to leave if certain goals weren't met or attained and because that time has expired now, you were ready to leave. Say, I'm sorry to say this, but I already had plans to leave and I'm not sure why this person sold you the company considering that I was already leaving and that he knew it. \n\nWhether the old owner told you this or not, unfortunately, is not my problem. I reported this clearly to my old boss. I was not expecting the sale of the company and only stayed this far to see if something significant would happen but I just don't see it happening.\n\nHowever, I will give you the benefit of the doubt in giving you the change to tell me whether there is anything you would like to offer or say to keep me here? \n\nIf their response is not compelling enough, you have to say \"Look, I'm really sorry it's come to this, but unfortunately that does not satisfy my concerns, I would stay if you paid me (insert insane amount that would make you stay), I would stay knowing that this company will fail and happily continue doing what you want and collect a paycheck, but that you don't believe in the company. Be open about it.", "Funny how people react on someone not being hartless.\n\nTell that exact story to the new owner.\n\nOffer to stay there for X more days/months for a certain raise while you train the next guy.\n\nHave a clear picture of a raise you would be satisfied.\n\nThe rest is on him", "They already said they got their pay doubled and are still unhappy. Sounds like they are too far gone to work things out and need to leave. They also seem to be upset about too many \"butts in chairs\" overhead but likely don't have an understanding of business structure or finances and why that may be necessary.", "I’d be gone. That guys bad business decisions aren’t your problems. \n\n“Sorry about you luck bub!”", "You do what’s best for you. If the new owner didn’t do his due diligence before buying it it’s on him and the old owner is an asshole that convinced you to stay so that he could cash in on the sale. I just bought a small business I’d worked at for 10 years. 1 month after buying it my most senior employee got mad and quit leaving me in a bind but since I know the company that just means longer hours until I hire a replacement. If the owner owner doesn’t have a plan b for employee turnover after he bought it then he shouldn’t be a business owner.", "Why do you care so much care so much about making another guy rich?", "Do what's best for you and your family/future! \n\nNobody and I mean **NOBODY** is even thinking twice about you and dollars to doughnuts the only fucking reason the previous owner begged you to stay on a while longer was to keep everything running smooth so he could sell the company without any \"noise\" so yeah a big fuck you to everyone else and you do what's best for you bro, simple as that.\n\nBest of luck my friend :)", "\"Never set yourself on fire to keep someone else warm.\"", "You sound like a good chap.\n\nYou also sound like someone in r/accounting working 80hrs a week to pay for some disconnected partner’s second beach house \n\nDo what you need to do for yourself and your family. This guy would cut you in a heartbeat if someone else could do your job for less.", "Be careful. I ran a moving company and I can't tell you how many drivers thought they were necessary. Truth was they weren't and the whole company didn't make money off their backs. You mention other people there which I assure you are necessary. Also a lot of people don't know how to run a business (myself included), even though they possess all the technical skills.", ">Also a lot of people don't know how to run a business (myself included),\n\nI can't believe it took this long for someone to say this. I'm a business owner. It took me at least 6 years to figure out wtf I was doing. I just got lucky that I had good friends and a lot of built-in business when I started to keep me afloat.\n\nLuckily, I met a really good business coach who helped me get my shit togehtee. There's a reason 1/3 of new businesses fail within the first year, and only 50% make it past 5 years. It's not as easy as it looks when it's your name on the checks.\n\nThat said, OP shouldn't feel bad about leaving. If they truly are that important to the business, the new owner will fight to keep them.", "I agree he shouldn't feel bad. First, he better put a good 20k in the bank and get a 10k dollar credit card. Give himself some runway. The grass is not always greener. Everyone who quit my company called back later. Every single driver, actually. And I did 6-7 years. Starting another business still learning it's a lifelong process.", "I know it’s tough for regular people to make decisions like that when you know you May negatively affect another persons like. You gotta realize though that this new business owner most likely wouldn’t think twice about screwing you over if it meant helping himself or the company. You just need to think of what your doing as helping yourself and your family and not hurting someone else who wouldn’t think of you at all if tables were reversed", "Why not start your business immediately and offer your current employer a slightly discounted rate on your services (priced at fair market value)? And even offer them a one-time option of mentoring a trainee of their choice; for an additional fee.", "“Just hold on, there’s big things coming” anyone that has every said something like this has always fucked me over, if I ever hear shit like that I leave immediately now.", "You're not responsible for someone else's bad decisions.\n\nStop wasting time and start living your own dreams.  Best wishes to you.", "I’d sit down with the new owner and explain this to him and offer to stay for 6 months to help the company transition and hire / train your replacements. It could potentially help your business that you’re starting too, because the new owner (hopefully) would see that loyalty and maybe toss some business your way in the future", "How's is your relationship with new owners? Could you sir down and discuss what's his vision for the company and your future prospects?\n\nYou are rightly upset with the previous owner. But seems you are a decent guy and trying to get a win-win situation so a talk and feel about your future with the company is something that can work out best for all.", "Leave omg. The owner left and what, your volunteering your CEO status for free? You *must* be kidding me. \n\nIt’s simple. We live in a highly capitalist world. As a result, your ‘family’ (boss/bosses boss) will try to pay you as little as possible. They don’t care about how you afford anything. They care about that sweet sweet $$ they sponge from you. \n\nSounds like you’re young and haven’t learned that loyalty is a joke. Sure, go ahead and pretend, but at the end of the day it’s a dog eat dog world. And it’s time to eat.", "OP, you can leave for an opportunity. When you quit, make an offer to work 10 hours (1day a week) as a 1099 consultant / contractor and your hourly rate will be $xx/hr. \n\nMorally you aren’t leaving the new business owner screwed but guess what, big things just came, you just got a 2.5x an hour pay raise and work once a week, allowing you to start your venture.\n\nIf he doesn’t take you up on it, perfect. Guilt-free exit. Keep the option for him open for a few months, a desperate call will likely come.", "Not your company. Not your problem.", "How is this a moral dilemma? And what does new owner has to do with you? He didn’t buy you, he bought the company: name, vans and screwdrivers…everything else is not given", "I'm  a former business owner (technically still am, as I have a consulting practice on the side). Never have understood why owners have conversations with employees *as if* they were owners. Please hang on for me. My future hangs on you. The true version of this is \"If you work hard and hang in there I'll get a great reward.\"\n\nMeanwhile, even the best, most empathetic business owner will let an employee go if they can't afford them or they stop performing for any reason.\n\nYou didn't cash the check when the business sold; this is not on you. Your plans should not depend on this. If you have the ability and want them as a customer, offer the business  your services as a contractor. If not, let them figure it out.", "In the business world, we have 2 choices when our competitor is, metaphorically drowning. Either 1) pull them up or 2) stick a hose in their mouth.", "Did you get money from the sale of the company?\n\nIf not you got fucked along with the new owner and its not your job to mitigate the impact to everyone else. \n\nThat said, there is another path. \n\nRadical truth...\n\nGo to the new owners, tell the they got duped and so did you. Tell them you and your friend are leaving in 6 months and you want to spend that time onboarding 4 new techs. At the end of that 6 months, the best of the 4 will be made lead tech to run the other guys (small shit like making sure time cards are in, etc)..\n\nYou may gain a lifetime ally AND someone you can call when you get too busy and borrow a tech from. \n\nThis is how I would approach it. Worst case scenario you are fired on the spot which is what you want anyway.", "Did you sign a contract saying you will stay?  If not, spread your wings and fly friend.  I wish you so much luck!", "Just give him one month notice. It's long enough to find a replacement. So it won't hurt his business much and he can get a fresh team. Just work through your notice period though and be willing to train up the replacement, it's the right thing to do.", "In a moral pinch why? The guy bought a company without doing research. That sucks for him but it happens every single day. Start your own business if you want to. If you’re really worried about it then help him train someone but give him a time frame for when you need to be gone. Ultimately, you’ll be training your competition. If you start a competing business you need to look at anything you’ve signed in terms of non compete or company info before contacting any new clients, and keep EVERYTHING in writing to prove you left in the right way and didn’t break any contractual agreements. Especially when it comes to contact info for clients of the company- I’ve seen this come up in a lot of depositions. Do your due diligence and consult an attorney if you expect it’s anything that could cause other party to be litigious.", "We didn't sign anything like that. We wouldn't be direct competition but we would be in the same industry.\n\n It's commercial kitchen work. Where he wants to do just big contracts like mcdonalds I want the local schools and places that do mass cooking using combi-ovens and steamers. I enjoy the more technical work where those corporate brands make everything cookie cutter.", "I keep going back to all the support people in the office making phone calls, ordering parts (at competitive prices), hiring other subcontractors, filtering out troublesome clients,  scheduling, accounting, taxes,  payroll, compliance, insurance, SALES, etc etc. That would be work you'd have to do which limits your time to do what you love,as you say wall out.\n\nNot to discourage you, but on your own, all that work falls on you, and unless you're good at all of them, each one can beg you down. Maybe take a night course in entrepreneurship for a few months with your pal and make sure you're on the same page and if it's worth it to lose your nights and weekends bogged down in paperwork.\n\nGetting sued by the previous company might not be as dangerous as being out gunned and undersold by them as they compete you into the ground and ruin your reputation. \n\nAnd fuck your old boss. That guy is a shitbag", "Brother, you owe nobody but yourself and your immediate family, and sometimes not even them. Start your own thing.\n\nOnly reason old owner wanted you to stay was to sell you lol.", "Yeah, it was admitted that the sale wouldn't have gone through if there wasn't a maintenance department.", "Your worth is right there. My friend started his own thing and basically tripled his income in a similar situation.", "Is the whole business maintenance? Or does he sell them too? Is the maintenance lucrative - like does that bring in a significant portion of the overall business revenue? \n\nHonestly, your boss might actually make more money if maintenence doesn't fix broken ovens and recommends replacing (assuming the business sells new ones).\n\nIf it's only servicing, you're in the driver's seat.", "You are NOT a slave.  New owner did not buy you.  \n\nIf he needs you that bad he will have to offer you an equity stake in the firm.  Otherwise you are free to start your own business and he is free to replace you with someone else.", "Sorry that new owner failed their due diligence. Get out.", "Why not talk to the new owners, be upfront, and offer him a third of the business you start, he may close his, and join you, either way that's how competition is in business, people leave and start businesses up, good luck man, hope it works out for everyone, oh and your last owner is a cunt", "If it was turned around, do you think this owner would spare you? I would vote no. Therefore go ahead.", "It's not your fault. My husband and I own two businesses and one of our moto's is \"their emergency isn't my emergency \". It's not on you to keep the business afloat...your old boss made an empty promise to you so he could get paid bank and retire. Learn from that.", "Leave, take your stuff and start your thing but on your way out tell new boss to call the bar bc old boss withheld info. Leave them proof, if possible. It's the least anyone should do.", "I’m in a similar position. Cousin bought a flooring business from my uncle who was easy to work for. Cousin not so much. Me and stepdad are the main flooring installers. I’m underpayed overworked and everyday there’s about three hours of travel/prep I’m not payed for. If I walk business will tank.", "> I’m not *paid* for. If\n\nFTFY.\n\nAlthough *payed* exists (the reason why autocorrection didn't help you), it is only correct in:\n\n * Nautical context, when it means to paint a surface, or to cover with something like tar or resin in order to make it waterproof or corrosion-resistant. *The deck is yet to be payed.*\n\n * *Payed out* when letting strings, cables or ropes out, by slacking them. *The rope is payed out! You can pull now.*\n\nUnfortunately, I was unable to find nautical or rope-related words in your comment.\n\n*Beep, boop, I'm a bot*", "If the new owner thought you were costing him money, he would force you to leave the business at pain of hunger and homelessness.   \n\n\n Are you some kind of Saint sent from God to bless this rich man, that you shouldn't treat him the same way he or 90 % of employer's would treat you? \n\n\nAlso, like other have said; running a business can be more accounting, marketing, phone work, getting city permits and business licenses, keeping product stocked, daily calling and emailing up to 300 customers a day, scheduling vehicles and equipment for maintenance. \n\n\nI've run 2 health businesses for 15 years and one started doing bad after the interest rate change; I could easily spend 10 hours per day just messaging people who may have called or messaged me before at this point in time in hopes I get my usual $140 an hour. Or pay for ads or make more doing Uber eats for the next 6 months until rates drop but potentially lose out on clients that get me up to $7-$9k per month. It's very difficult to find a long term reliable employees (where I am) who can learn even the most basic stuff and not be lazy or make a catastrophic mistake that ruins your business.", "You see where loyalty got you last time, you were promised big things were coming and then they sold to someone else…", "No moral pinch.  You didn’t sell him anything. It’s business and you get to do what’s a best for you and his job was to know what he was buying. You can’t buy people.", "as a good business owner, he should have a plan to replace you. what if you get hit by a bus", "Fuck someone else's feelings. This is about YOUR FUTURE. make the money while you can.", "Great book was written a while back - top 5 regrets of the dying, written by a palliative care nurse.\n\nOn there is \"I wish I’d had the courage to live a life true to myself, not the life others expected of me.\"\n\nYour answer is right the\n\nLife's too short to think like you are right now\n\nYour loyalty and sense of responsibility are noble, but you've served your time in my books", "That owner would drop you in a heartbeat if it meant profit", "Leave", "Don’t live your life based on someone else", "Yeah I wouldn’t stress this job bro\n\nBoss sold the company and new owner doesn’t care about you\n\nThis is business", "You are under big mis conception, go ahead. There are many tech people around who can quickly pick stuff. The management is just dumb to not have thought of replacement earlier. But any which way, your value is just nothing in large scheme. Don't be so over confident.", "It’s pretty well understood that a company whose success hinges on one person, is a worthless company *to buy.*\n\nThis is not your fault, nor your responsibility. Do what’s right for you. New owner made a HUGE mistake. You gonna carry him the rest of your life?", "Ruin somebody’s life by starting your own? Now you got to do it", "Not your problem", "You could also start your own business and take your former employer as a client", "Either you and your friend find a way to become equal owners in the company or you leave and start your own.  The previous owner did what was right for himself.  This is where the saying comes up: it's not personal; it's just business.", "Not to be glib, but can't he find replacements for you and your friend? Do you have highly specialized skills that are hard to find?", "You are what matters to you. Make sure you have enough cash to start your own thing. Get on Task Rabbit too.", "Who cares? It's not your business. You owe nothing to anyone.", "You don't owe him anything. You could give him a long notice to give him time to bust ass and look for replacements.\n\nYou obviously don't have to give a notice, and most people give 2 weeks. You could give a month or two so he has more time to find 2 replacements and you won't feel guilty. \n\nThat's all up to you though.", "Honestly, unless the new owners are completely inept in the business they just bought, I'm sure they will figure something out. They might have even already decided to hire their own people and replace everyone anyways. If your direct manager is so useless, they will see this quite quickly. You have no responsibility to them, in fact this happens often with new ownership. If you want to start your own thing, than you should focus on that, because at the end of the day, it's about how you want to live your life.\n\nI'm in pretty much the same position (not that someone bought the company I work for). My coworker and I have decided we are going to start our own business. We are the only 2 developers in the company and it will probably cause a lot of problems for the company, they will need to hire another developer and the CTO is pretty much useless as a CTO.", "Your old boss lied to you and made you stay to sell the business for much more. Leave and do what you want, you don’t owe anyone anything.", "Leave asap. You only owe yourself no one else! You have to take care of your self piss on everyone else.", "Unless you have a non-compete clause... it is none of your concern.", "Talk to your new boss, and be honest about things. Have in mind how much longer you are willing to work there and under what conditions. Hopefully this gives time to train a replacement. Then you can leave knowing you gave him a fair shake, but also not tethering yourself to a failing business.", "Start your company and immediately turn around and offer him a service contract where you do his maintenance, write procedures and pm schedules, and train your replacements. And do it for 2.5-3x your current pay. \n\nThat's basically what I did 10 years ago.", "Check your contract of employment for any kind of non-compete clauses before you do anything rash (assuming there will be a cross over of customers between current business and your new business.)", "No one is irreplaceable, do what you need to and the new owner will as well.", "You already showed loyalty to your workplace. Now it's time to show loyalty to yourself.", "Proof an owner doesn't actually give a crap about employees.. you're square every pay day, then it starts over.", "Have a Come to Cthulu meeting with new owner and inform him of the vulnerabilities of the company (avoid mentioning both tech leads will leave at the same time). Write up a plan to transition your knowledge to other employees/documentation to reduce the vulnerability and present it to the owner. \n\nDepending on your feelings/their answer either leave or get your 'something more' out of them. Heck, ask to be made CTO and a big raise/ownership share.", "Leave but give some time for him to find replacement or help hin find your replacement and train your replacement", "This isn't your problem. Do what's best for you. Loyalty will get you no where in the corporate world.", "You’re giving yourself too much credit.  They’ll take a hit but if the owner has any business sense, he’ll be fine.  Everyone is replaceable", "No disrespect, but very rarely do 1 or 2 people make a big enough impact on a business to literally make or break a company. They’ll be fine (or not, not your problem) - go do your thing.", "Your last boss screwed this guy.  Not you.  Not your friend.\n\nGet out BEFORE this ruins you. \n\nYou need to be able to support yourself.  You DONT HAVE TO SUPPORT YOUR NEW BOSS.", "You should be ashamed!!! Your LOYALTY SHOULD BE TO CORP AMERICA NOT TO YOURSELF! You should take a pay cut to help the company out and work extra hours.  Don’t get insurance or 401k because that hurts the company. And but as much company products as you can!!!  /s", "Talk to them and let them know. Have a plan first. \nBUT, it’s possible they axe the manager you don’t like and are willing to throw more money at you.", "> \"just hold on, there are big things coming. It's going to mean a lot of money for everyone\".\n\n>A month later he sold the company.\n\na lot of money for him I guess", "Leave. The buyer took a risk and didn't do due diligence. And it's been several months now, and they still haven't checked. You could tell them about this now, if you want, but they might just fire you on the spot.\n\n>I'm in a moral pinch.\n\nNo you're not. You are not responsible for keeping the company alive, and you are not responsible for the buyer's bad decisions.", "So you have to do what’s best for you and your family at the end of the day. But I do believe you’re over estimating your replacement ability. I’ve been there. But if you feel like you’re correct on how valuable you are then why post about it for other opinions? Go get out on your own and try and run your own business. There’s no such thing as loyalty in the business world. You will learn this", "Do what’s best for you.  I’ve worked at a lot of places with people that think the place will fall apart if they leave, just like OP.  They left, and the place was fine.  \n You might be surprised.", "He would replace you just as faster than you think. \nIf you needed house repairs, would he come over with his tools and make sure your household is still running? \nWhy do that for him?", "It’s pretty simple new owners will do what’s best for them and you do what’s best for you,not complicated.", "if you feel bad about it, give them a months notice.  you dont owe them a thing, and when it comes down to it 99% of business owners will choose to save the business then give an employee a break.", "The guy buying the company will be fine.", "they always say big things are coming\n\nthe big things only ever come to the owners and a possibly a few of the highest level C/S suites.\n\nDo your own thing, prioritize yourself.", "So the new owner made a bad business decision.  He needed to secure key personnel at the time of purchase otherwise his investment is worth nothing.  The old owner said \"there will be a lot of money for everyone\", I interpret that as he knew that you would be in a very strong negotiation position.  If you aren't confident that the company is in a position to pay you a fair rate and stay afloat, you have a duty to your future self to move onto something better.", "The old owners involved you in the classic pump and dump.   \n\n\nYou are acting with real integrity and at the end of the day that means alot. \n\n\nMany of the people who are on these forums have seen some shit.  My only real advice is to hold onto that integrity and you need to realize fast that it is a rare quality.   Do not expect others to act the same as you.  Everyone thinks they are a bro, very few are.", "Just keep in mind that they could fire you if that’s what they think is best for the company. So do what’s best for you.", "Now that you've learned the true meaning of \"big things coming\" the fun and games are over. Start your own company and take that market share.", "I have never paid for Angieslist (now Angie's but who gives a f***). I got an email from them a few days ago that they had listed my small business on their site and they added it to categories x,y,z. I replied to the email and said I want nothing to do with them, remove my business from their site immediately. I got this response:\n\n\"We don't remove companies from Angi, but instead will add certain notices and exclusions to profiles based on the situation. This makes it so your profile is unavailable when our members search for a service.\n \nAs you would like your listing removed, I've submitted a request to have your company excluded from category and keyword searches.\"\n\nDo I really have to go to the trouble of finding a lawyer to draft a cease and desist letter? I've got enough to do than to deal with low-rent pimps.", "This is a friendly reminder that r/smallbusiness is a question and answer subreddit. You ask a question about starting, owning, and growing a small business and the community answers. Posts that violate the rules listed in the sidebar will be removed. A permanent or temporary ban may also be issued if you do not remove the offending post. Seeing this message does not mean your post was automatically removed.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/smallbusiness) if you have any questions or concerns.*", "Angie's list is scum. I am not going to pay for leads that should have been mine in the first place.\n\nI have tried everything to get them to quit calling me. They even leave voicemails acting like they are interested in having a service call from my company. \n\nGood luck with them, sadly it will be an ongoing battle with those leeches.", "I spent 2k with them for a full page ad. They tried to walk it back, but I had it in writing. It led to one job with total revenue (not profit) of 1k and was a job we didn't really even want. They to this day (5 years later) call and ask if I want to buy their services. I told them many times the last time was a total dumpster fire. They bought out home advisor (who I had done business with successfully), but it was getting worse and worse once they purchased it. Anyways I honestly can't believe they try to sell after the first complete failure and me expressing zero interest in business with them.", "What are they?", "Lead ‘generators’.  \n\nThey place ads offering ‘contractor services’, then when they get those leads they send them to every contractor in the area charging each contractor a ‘lead acquisition fee’ to get the phone number or email or whatever was entered.   \n\nYou end up pushed down the results by them (both through legit search visibility and highly optimized paid ads) only to be extorted for low quality, unverified leads that they also sold to 10 of your competitors. It’s pretty common for them to charge tens of dollars per lead they send your way. I’ve also heard accusations of the leads just being flat out fake/bots. They operate for a lot of industries.", "Oh wow, thanks for that. That's pretty crappy. There are so many shady people out there.", "Sorry that’s happening to you. Not sure if you can legally have them remove you. It’s public data (at least in NY). I’m not a lawyer, when I registered in NYS - there’s a public notice requirement of all businesses interested in incorporating in the state and the NY Department of State has a registry of all businesses in the state available to the public.\n\nI could be wrong tho!", "If they are using any of your branding, trademarks, or website copy you can file a DMCA. The name and filing info is public information, everything after that is not.\n\nAlternative is you publicly denounce them and inform them not contact you via any means. Any bookings or references to Angie’s list from potential clients will result in a 400% surcharge added, etc. eventually they’ll get the point.", "Can I just yell it out loud like when Michael Scott declared bankruptcy?", "They keep trying to get me on board.  I keep telling them I don't do residential so they look up commercial and there is never any work for me.  But yet they call at least every other week.", "Terminated them immediately after the Home Advisor merge. Hated to see Home Advisors go.", "**Hey E-commerce Community!**\n\n  \nI'm reaching out with a small request and a **big dream**. I'm a student passionate about understanding the nitty-gritty of e-commerce, diving deep into what makes online stores tick, and finding ways to help store owners like you thrive even more. \n\n  \nI've been working on a project for my **university studies focused** on developing insights and tools for e-commerce success, and I've created a survey to gather your invaluable perspectives. Your expertise could light the way for future innovations in the e-commerce space! \n\n  \n**Why your feedback matters?** Your voice is crucial because real, lived experiences fuel meaningful change. \n\n  \n**Survey link:** https://5rlkergfejw.typeform.com/to/RWsIcpzd\n\n  \nIn gratitude for your time (I promise it's short – about 3 minutes!)  I understand everyone’s incredibly busy, and this might not have been clear in my initial message. This isn't just another survey; it's a step towards understanding our challenges better and finding ways to address them together. ", "This is a friendly reminder that r/smallbusiness is a question and answer subreddit. You ask a question about starting, owning, and growing a small business and the community answers. Posts that violate the rules listed in the sidebar will be removed. A permanent or temporary ban may also be issued if you do not remove the offending post. Seeing this message does not mean your post was automatically removed.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/smallbusiness) if you have any questions or concerns.*", "Sales on our side are down over 50% and it’s been rough AF. Year to year side by side this is the slowest period in at least 6 years. \nLooking to slim up, the economy doesn’t seem to be doing well. We speak to our accounts and they say the same, it’s slow. \n\nHow are sales for you right now? ", "This is a friendly reminder that r/smallbusiness is a question and answer subreddit. You ask a question about starting, owning, and growing a small business and the community answers. Posts that violate the rules listed in the sidebar will be removed. A permanent or temporary ban may also be issued if you do not remove the offending post. Seeing this message does not mean your post was automatically removed.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/smallbusiness) if you have any questions or concerns.*", "Online retail here, I am up over last year. It’s a unique and low price item.", "What are your margins on it? I always assumed it would be better to go for a higher price higher margin item and try to sell that over large volume of lower price items?", "Unique and low priced? You’re selling cheap dildos, when the economy sucks people spend money to fuck themselves", "Well if you have a good website and good marketing efforts, it's usually a good transition. High price and low volume means, you have to spend a lot more money to sell one item instead of spending less money on many. It's the Walmart model vs the mattress store sales method.", "Margins are good. But my items are priced at ~$11 and my volume is high. (Shipping not included). \n\nI’m a believer in volume vs maximizing margin.", "How did you guess?", "Walmart. Amazon. Zara. Let’s see…how many other low margin high volume companies have been successful?", "Well, In slow times if you don’t fuck yourself the government will do it for you. It’s basic economics, I was also hatched out of an Easter egg", "I think you’re trying to prove my point, right? But I would love to help someone sell a product and do their marketing as long as the products keep up and the website is kept up.", "Yes, I am definitely agreeing with you. I prefer to maximize my volume over margin.", "Retail business. Lowest we've ever been. Not by comparisons with previous years because we moved and are bigger now. So it went up because of that and more marketing. But take all that out, and we're down.\n\nConsumers simply aren't spending as much. Considering how much of their disposable incoming is going to housing and interest, they have very little left over.", "That checks out. We are dependent on retail, when they suffer we do too.", "This is what I keep telling my brother when he votes for Pro (Corporate) Business policies, that are also anti-worker at the same time. All of your customers are those workers, when they have less money, you have less buyers. The ultra wealthy that these policies mostly benefit will never grace the doorstep of your business.", "They’re coming into the Yoga Studio. Sales are up, unique visitors are up. I’d say there’s been a shift from goods to services. The stuff people were buying during the pandemic is now the things people are doing.", "Not a zero sum game. \n\n“... in view of the fact that American economic theory was just then in the way of exploding the Old World's iron law of wages. We had taken our economic book from Europe and the law was there. It said that wages were paid out of profits. If that were true, it followed, as Ricardo said, that whatever raised the wages of labor lowered the profits of capital.\n\n“The same law said there was a natural wage; and this natural wage turned out to be that price for labor which was necessary to enable the laborer to reproduce himself-just as the price of an ox might be the cost of reproducing an ox. In that case labor was doomed to receive forever a sustenance wage.\n\n“This pessimistic doctrine did not belong here; it would leave the Americant dream in the ditch, and therefore it could not live in the American air. An American school of optimistic economists, led by Francis Walker and H. C. Carey, challenged it as an illusory dragon, and, lo! it was not there.\n\n“They arrived at the true conclusion that wages were paid not out of profits but out of production. Thus if you increase production wages and profits may rise together.\n\n“There was no such thing as a natural wage. What a liberating thought! It meant that whereas the European capitalist found his profit in low wages and high prices, the American capitalist hereafter would find his in low costs and high production. The lower his cost and the greater his production the higher the wage he could afford to pay.\n\n“This was the revolutionary American contribution to economic thought.“\n- Garet Garrett, The American Story pp. 156, c. 1955", "\"That meant that the federal government took 91 cents of every dollar over $200,000. When you added it all up, someone in 1955 who made $1 million a year paid over $800,000 in taxes. \"\n\nThat helped grow that middle class whenever that person wrote that.", "This is not how things work since neoliberalism took over.", "Correlation is not causation. You’d need to make a separate argument for why you believe extremely high marginal tax rates help grow the middle class.\n\nPresumably, because you think the current iteration of our federal government will make extremely good investments with that money (which is, incidentally, far less money than they’re already printing even as we speak).", "Could you explain what you mean, please?", "Well, I do see one party trying to make solid investments in our country, and the other cutting taxes on the rich and nothing else.\n\nSo I do think it's possible since it's already happened in our past before the GOP turned into an anti-government tax cutting agency after reagan.", "Biden’s big bills are 100% deficit financed. The Feds don’t act as if they are revenue-constrained. What middle-class-boosting policy do you think they specifically need wealthy folks’ money for, which they can’t just print as they’re doing now?\n\nDoes the idea of taxing the wealthy for policy ABC by itself make that policy more effective at boosting the middle class than if it were deficit-financed?", "That's because it takes money to run things, and as we continue to grow it will continue to cost, so you can't just stop spending and expect things to continue to work.\n\nSo when you cut the revenue for that spending, which only one party has done several times since Reagan, then you're forced to use deficit spending in order to keep things running, and the deficit spending wouldn't be as bad if we had more revenue.", "A simple graph of year-to-year revenue vs spending as % of GDP doesn’t support your contention. The deficits are entirely explained by spending growth.\n\nhttps://fred.stlouisfed.org/series/FYFRGDA188S", "Construction. In pace to beat last year by 13%.", "What type if you don’t mind me asking?", "Is it possible to scale/maintain a construction business post-acquisition if the buyer doesn’t have industry experience?", "We are a small niche commercial construction and service company", "This depends on so many factors. To start though, I wouldn’t scale anything until you fully understand the biz, product, service, and industry. Scale is great but it also magnifies mistakes. \n\nIt depends on:\n- cash flow\n- existing employees and the management below owner level\n- existing book or work\n- etc", "You hiring?! 🤣", "Smart and good business acumen", "Not yet. We just did and seeing where that settles out.", "3/4 of the way to our yearly revenue goal and my biggest worry is how much demand is currently placed on my team. Last year was rough but we got by just fine. Blowing it out this year if all goes well.", "What type of business?", "Precision sheet metal fabrication- so far this year is trending similar to 2022 which was our best sales year in the 30+ year history of the company.\n\nThe biggest difference is 2022 orders were mostly ad hoc which caused a lot of issues for lead times and on-time deliveries. This year customers are placing orders months ahead which is awesome from a production standpoint.\n\nSome of my vendors have been saying some shops are dead and other shops are busier than ever. It's wild how much it varies from shop to shop. So it's pretty unpredictable how the year will finish out.\n\nedit: formatting/clarity", "Machine shop here. Last year was choppy but ended off close to a record year and this year has been the craziest year I’ve had yet, all while my biggest customer is slow.", "Do you make products for HVAC companies?", "It's great that you have a balanced customer base like that! \n\nWhen I took over this company in 2019 my #1 priority was to balance the work between customers. Back then we had 1 customer that made up 60% of our revenue. Within the first year I had gotten that number down to \\~20% by raising my workload with other customers which makes me feel WAY better about the ebbs and flows of cash flow by not leaning so heavily on one customer.", "Not really. Occasionally we do HVAC components that are specialized or not commercially available off-the-shelf, but that's <1% of what we do. \n\nWe're mostly custom electrical enclosures, cabinets, covers/doors and sub-panels or other internal components that are made from metal.", "I had the same goal as you. I know too many shops that load up on work from one customer and then scramble when that company slows down. I never want to be in that position.", "I am a fastener distributor, and I supply a number of electrical enclosure manufacturers.", "Im assuming Electrical is getting a huge bump from the Infrastructure Bill passed and the Inflation Reduction Act. I’m on a board for my city’s municipal electric utility and grant money is coming in for upgrades. We haven’t seen this level of investment/upgrades since the 1950s.", "What are you seeing from your customers? Up? Down? Mixed?", "I hadn't thought about that but it makes sense! I have a customer that installs, upgrades, and maintains utility poles. They have placed some *strong* orders this year. I haven't checked the numbers but my gut tells me they are up this year versus last. Now I can't wait to check the numbers! Good insight PORTILLA!", "75% up, and my business in particular is way up, even with prices rapidly decreasing", "Yeah the money for these bills are just starting to roll out.", "Yeah that’s what I’m excited about for this year. 2021/2022 prices were insane so while we had the best sales ever, it was eaten up by costs. This year material prices are down but my business is up, it’ll be interesting to see how the year-end looks.", "Would love it if folks would point out the type of business. I suspect construction is doing good while retail is doing bad for example. Just saying up 19% doesn't really say much.", "OP didn't say either. ", "I'm having a record year also.  I'm in manufacturing.  Even if the rest of the year is dog shit 2024 will still be my best year ever. \n\nThe whole idea of comparing business income is hard to do anyway.  So many variables.  I put a lot of my success to good business practices and putting the in work for ten years to build a solid name for myself. Get my rep to be perfect.   I go out of my way to make my customers happy.   So I like to think that all that effort is paying off.  I be if I ran a bad business with a bad reputation I wouldn't be having a steller year.", "assuming solid margins right?", "What's profit like?", "I'm residential, highest sales I've ever had and isn't slowing down at all.", "Manufacturing here as well (precision machining). I'm seeing record highs so far. I have almost beat sales in my first year open (2021) in the first 3 months of this year.", "What do you do in manufacturing? I’ve been at a W2 manufacturing gig for a while so it’s curious to me where I could possibly head if stars align", "Yes I am a one man band. I run my business top to bottom\nBesides my year end tax stuff. Payroll is done online with quickbooks. I have a small group of clients that use me pretty much exclusively. I do not advertise I only go by word of mouth. I actually turn down work all the time due to being at max capacity. I am very fortunate to be in this position. I have 29 full time painted and only on subcontractor that works for me. I’ve got this business down to the bare bones on overhead. I even have great tiered rebates back per 100,000 I buy from\nMy vendors which helps and is a nice bonus every year. My trick is I’m cheaper than the comp I know I am but by being cheaper and making smaller profit off each job it allows me to keep a small group of clients focus on them and not have to spend all week long bidding jobs or even hiring an estimator. I am 45 and been doing this since I was 18 year old. Exact margins I’m not sure of this year yet as I don’t track every single job. But if I was to look at the total debt I have which is mainly 2 vendors. Paint vendor and my lift company I rent from compared to my receivables I am sitting on a Mountain of profit. But with that being said commercial construction good old 30-120 day terms. Most my profits sit in receivables", "Manufacturing as well. Fabrication. We are seeing record RFQ requests and getting POs from customers we haven't heard from in a while. Struggling to keep up. Close Wednesday on a building 4x our current space. \n\nWe typically work build automation. Good industry right now, but like our customers we can't find employees. 90% of the reason automation is going in right now. Other 10% is safety on dangerous jobs.", "I don't know how you do it; sitting on receivables would give me heart palpitations until due. do you ever have accounts go bad ? do you just write them off ?", "Knock on wood but the customers I have I’ve got a great relationship with for years. I have never not got paid on a job. Slow payed yes it’s  very common but no pay it has not happened yet. That is why I do not\nTake on new clients often if I do they must put a deposit. I’ve got my business finely tuned so I get to office 5am everyday then off by 1:00 go get in line to pick up my youngest kid from school work off my computer. I am very very blessed but it has not came without a lot of sacrifice and hard work to get it to this point.", "It can be stressful but if a customer gets too far out you just have to stand up and threaten to hold off on their projects until they get current or close to current (if they're repeat customers).\n\n It's never a fun conversation, and I usually try to be understanding but at a certain point I am just financing my customers projects and they need to pay up.", "Graphic designer, I’ve had 3 inquiries this quarter 🙃", "Graphic design is going to get brutal.", "That's brutal. Is this your full time revenue?", "I'm in business communications, and I'm down way hard too. I think AI is eating us alive.", "I’m struggling to find good freelance graphic designers, I have a web design agency what kind of graphic design, can you DM me?", "What makes you say that", "Sure is! Im lucky my husband can cover our expenses during this time but it definitely hits your ego.", "What part of your work can ai specifically replace?", "I think you’d see as much from other owners here.\n\nI know I’ve turned to AI already for a lot of those “I should do this, but I don’t have the budget for a human” kind of stuff.  I can’t imagine what companies with better resources are doing.", "Absolutely, I’ll send a PM 😊", "AI", "The spec writing and copywriting. Like 75 to 80% of what I do, basically.", "There’s still a market for good copywriters no?", "There is, yes. But sales are way way down.", "Fantastic. \n\nI’m also an accountant and it’s tax season. \n\nAsk again in 3 months lol", "This is what happens when the price of everything goes up by 40% in 6 years - and all that profit goes straight to the 1%. \n\nRegular people are broke.", "15% higher than last year, premium food and beverage", "How much did you raise your prices?", "That's rare nowadays, good for you!", "How much of of the business is paid for by credit cards??", "what part of premium f&b are you in? we are b2b manufacturers/suppliers in the f&b space. skewed towards the premium side.\n\nwe are trending +5% over last year which was a record.", "About 7% on drinks and 0 on food. Labor costs are way up though", "Good! (Wishing the best for your business though)", "So, overall.....you'll end up with less profit?", "We budgeted a 15% increase over last March. We have hit that and more.", "30-50% lower than last year.\n\nOur industry pricing is set and controlled by the PBMs, pharmacy benefit managers.\n\nOn average they steal from moderate volume pharmacy about 500k in DIR fees (non transparent) and about 1 million in \"price spreading,\" annually.\n\nIt is the only know business in the observable Universe, 150 billion light years across, where you get paid less than your purchase cost.\n\nThe PBMs also reimburse their chain pharmacys better than independents for the exact same drug and quantities. \n\nTaco Bell can't find workers? They raise the wage AND their prices.\n\nPharmacy can't find staff? Can't raise wages or prices, because we're locked into contracts by pbms at negative reimbursements.  You don't like what they're paying? Then we're shit out of luck because it's a take it or leave it. \n\nFor brand drugs,  about -30$ per fill for 30 days supply, can reach -$200 for a 90 days supply. It gets worse on some pbms if you dispense a days supply > 30 days.\n\nI've heard stories of -$1500 reimbursements per 1 month fill. (Nobody is gonna fill that, and pts are just shit out of luck.)", "That sounds brutal and border line illegal. Sounds like they would prefer if independent pharmacies didn't exist.", "This is such fascinating information. To make sure I understand this thievery, say Bob walks into a pharmacy with a script for HBP. To fill that script at No Name pharmacy it costs them 5 bucks from the PBMs. But Bob‘s insurance pays $4.25. So No Name pharmacy gets stuck with LOSING .75 cents? And CVS pay $4 so they make .25 cents off Bob?", "That's the direction it's headed. Almost 1 independent closed every day last year. The worst is the pharmacies that exist in rural areas that are no longer able to provide care to patients, forcing them to drive 20+ miles to get drugs. If they're fortunate to even have a car. \n\nCongress just dropped another ball when pbm reform came up recently. I've lost my faith in politicians long time ago, to do the right thing.", "Price spreading.. \n\nSay we buy a drug for $10. Bill ins for $20. Ins says ok, here's $20. Pbms take $12 and gives pharmacies $8.\n\nSay cvscaremark, as an hypothetical example, would pay their cvs chain pharmacies > $10.\n\nReal life example from a pharmacy that closed last year after serving their community over 50 yrs. Would get paid say $1 for 30 tablets of atorvastatin while the pbms chain would get paid $50. \n\nDIR fees are much harder to explain, but in a nut shell prior to this year, after a claim had been paid, they'd come back retroactively and say hey, you owe us this money during this trimester,  for something we paid you the previous year. So instead of you sending the pbm a check, you'll see that money come out from what they would have normally paid out that week. No transparency.  Over the past 10 years dir fees have gone up 10,000%. If you ask me to explain dir, all i can say is, it's something they take from you without a true explanation to pay you less than what you are owed.\n\nPharmacies get rapped financial on a daily.", "In my world we would liken DIR to insurance claw backs. Insurance pays you 5 bucks in 2023. In 2024 they deduct 3 bucks from your current payout because they overpaid your thieving ass in 2023. No transparency. Your coding sucked, you left out a comma, you didn’t file under the right lunar cycle.\n\nI have never heard of these PBMs, but now I know an important reason why pharmacies are “out” of certain drugs.   \n\n\nThank you for taking the time to reply With such good information.", "We call it claw backs too. Guess the thieves of this world, floating through space, are a like. Pirates. Ever watch the movie pcu? Be wary of them butt pirates.\n\nEdit: very similar situation. \n\nWe have various fields, qty., dr npi, pt dob, etc etc etc... gottw correctly calculate days supply. When we do get audited, every drug is high $ amounts only. They never audit cheap drugs. \n\nWhat a sad world we live in, floating through space.", "Oh fellow Gen X’er of course I have seen PCU. It was at the dollar midnight movies. I thought pc policing was terrible back then. \n\nAudits come straight from the insurance for us. You have to go through the big bouncer that takes your girl and the club’s beer.", "Retail. Closed permanently last month. Not worth the bleeding.", "I'm sorry to hear that mate. I hope your next endeavor is more fruitful. \n\nWe are considering the same at the end of this FY (June 30 in Au) if we can't improve this quarter. We have a couple of new ideas to try and increase sales but in the end for our retail arm it just comes down to getting people in the door and getting those people to open their wallets, which is getting harder and harder as the poor bastards have nothing in those wallets.", "Custom cabinets. Q1 was dead. Now the phones are ringing again, I’m bidding work, but it seems like clients are price shopping and just having more shops bid in general looking for a deal. Still booked through most of this year, but not looking to expand or hire.", "Yes, different industry but I am experiencing price shopping as well. Sending out proposals and just getting ghosted.", "Same", "We own a bar. It's been a great month. Up around 20%", "This is super surprising to me, most restaurants/bars I’ve noticed are way down. Are you in a downtown core?", "Poop across multiple business in various sectors. Economy is a garbage show atm. Hit a brick wall last July and the arrow has been pointing down ever since. Things “should” turn around in the 3rd quarter. ", "I have a client with a long term job selling furniture on credit to the very poor and for cash to the working poor. He's done it as a job for 25 years. In a bad month he'd sell $20k in furniture (4 months), a decent month he'd sell $40k (6 months a year) and in Xmas and April (tax returns) he'd sell $60k. \n\nLast summer he said it was like a faucet turned off. He hasn't sold more than $12k in a month since then, and most were sold at $8k or less. \n\nHe's actively looking at bankruptcy to protect his house...which was literally 15 months from being fully paid off.", "Yeah I think when it started is industry related. Many countries have been in recession or approaching one. I think the US economy is largely dependent on China. They’re slowing now so it makes sense that we slow too.", "He is selling to the worst off in this economy.  No wonder. \n\nThe poorest are hit the hardest.  Their basic needs are higher (rent, smokes, chips, soda).  So they have less money to spend on anything extra.  \n\nI think rent is going to be a killer from now on.  I own a couple houses that I rent out.  I rent to family friends at super low rates.  Half of the going rate.  I get calls/letters constantly from other businesses wanting to buy those houses.  Wall street has figured out that rent is a good way to make money.  The more houses/appartments those people buy, the higher the rent/house prices will go up.  It is the classic case of the rich getting richer.  \n\nFrom 2020 to 2023 the top 1% wealthiest people doubled their net worth.  Wealth is a zero sum game.  For them to get richer, a lot of people got poorer.", "Nah. It’s a nice hypothesis but just not the explanation", "I don't think wealth is strictly 0 sum. I guess currency is 0 sum but the ability to obtain things with currency is not. So maybe it depends on how you define it.  \n\nThe average person is wealthier now than they were 200 years ago. That said it doesn't change anything about your post as in this case it's pretty clear the wealth is coming from a disappearing middle class who is experiencing a lower standard of living.", "Care to give your explanation?", "I can't tell you why your sales are down. I can tell you that the amount of influence that China has on your sales being down is far less than you're saying here. BTW: I think the CCP are a bunch of scumbags.", "It’s been slow for us, PNW retail.\n\nWe are somewhat tourist/summer related, so there’s that. Our locals/regulars are generally mid to lower income and I’ve seen a lot less of them since the new year…", "Portland shop owner here and wholesale to lots of shops in PNW. Seen wholesale slow, especially with PNW shops. Our shop is up, but I think it's because it's our 2nd year open and just more people know about us now. January was brutal with the snowstorm knocking out 2 weekends of sales.", "Up 20%. I run the kitchen at a local social club.", "In February we had our 3rd best month in the 3 years we've been in business, this month we are tracking to have our best month ever. \n\nHigh-end home improvement product. I have some competition, but I'm about 20% more expensive than them and I do not attempt to price match as they are not equivalent products.", "Pet sitter and this is the most money I've made in a month in 13 years of doing this. I am BUSY.", "Wonder if this is partly all the folks that bought pets during covid, and are having to slowly get called back to work.", "I should've clarified, I'm so busy because of people taking vacations. I only saw a slight dip during Covid - most clients had me keep walking their dogs or at least still paid me even if they didn't have me come by during the shut down.", "Slow. My industry is somewhat tied to huge money lenders/funding partners, and they are all VERY nervous. It sort of started early last year, but the last couple months things have gotten absolutely ridiculous. It reminds me a lot of the 07-08 recession as far as lending is concerned. Election years are always a little weird but things on the backside have been slowing for awhile.", "This is exactly what we are feeling.", "There is a lot of folks I follow on YouTube that believe 2024 is a repeat of 2007 and 2025 will effectively be a repeat of 2008.", "I sell power tools\n\nSale are up.", "Real estate services. Keeping very busy. Jan-Feb was incredible. March is just ok so far.", "We're up 57% vs March last year but I think that's more to do with a new strategy than market conditions.", "crazy at the moment need to add staff. I am an estate auctioneer. Nothing really seems to slow us down, people die all day every day, and they got a lotta stuff.", "Can I ask how you got into the business? I’ve always wanted to move into this space but I don’t know how to make the move from my current business (Ecom.)", "Not only are overall sales down, our sales cycle has gone from 12-16 days, to 20-26 days.\n\nPeople seem to be less decisive, and are not very confident about the near term future.\n\nI chalk it up to being an election year.", "That’s what we are seeing too. We rely on return wholesale orders, and they’re just no restocking as much right now.", "I'm holding off on house searching until the election so this tracks\n\n\nalso Smith n Wesson is up 40% since I bought it,betting on election jitters and fears of democrats \"taking er guns!\" ", "Its funny watching conservatives panic year after year.", "Not if you’re holding stock 🫶🏽", "Retail/ brick and mortar, down 10% YTD.", "Software development and marketing\n\nStable, same as last year. Costs down dramatically this year", "What kind of software do you develop? Do you do B2B Saas or just DTC software ?", "We’re an agency, so either. We do it for clientele", "It's really bad, sales are down 30%.  No one is spending money.  The news keeps saying the economy is booming.   I am not seeing it, and frankly it's quite the opposite from my perspective and from EVERYONE I talk to.   Are they setting us up for something to pull the floor out below us?", "I’m in a small construction business and we’re having to turn clients down right now because we’re so busy.", "It's rough, all together just adds up.\n\nI've to work more to keep up with multimillion dollar companies as a guy/family basically coming from nothing.\n\nSo it's all adding up slowly, competition brings out better \"products\". Overall there's just more and more competition. Which naturally leads to potential clients spreading out.\n\nAll of my expenses keep going up each year due to this fkin inflation, while clients expect maybe a 10-15% price increase over the past 10 years. It feels absurd.\n\nFor now I am still fine mainly cuz in the country I am in the wages aren't THAT high yet, but I am not sure how I'm gonna keep up in a couple of years and especially in 10years+ if it's gonna keep going into a direction like this.\n\nI feel like I'm expanding my business for more revenue every 3years investing literally all I have just to play catchup with all the price increases while I can't increase the prices at even 1/4th of the rate everything else is going up.\n\nIt's a very miserable experience to be constantly investing for a fraction of the return it was just a couple of years ago", "Yeah. While everyone experiences the cost of inflation, business owners experience working harder for less money, plus inflation. In all of our years this one has been the toughest. The end of last year was fine with sales but the cost of everything just kept going up. So here we are, less profitable and slow.", "We can't find enough workers to keep up with demand and are turning away work.  Construction consultant industry.", "What is that", "What is that", "What is that", "I have been solid 6 years running my real estate business (veterans home buying program) since October, it has been abysmal. I had to turn off ads and rely on follow up with my old leads to keep alive.", "Online sales are double what they were last year, but it’s a young business so that should be expected. In person sales are down significantly", "7 months in on my business and finally have my marketing in a good place. Hope to be turning profit in the next month or two after being net neutral last few months", "Best of luck mate!", "Construction year over year up 38%.", "Through the roof, had one of the best months ever. (we do website and service packages)", "About 60% revenue down year prior.", "What industry.", "Cleaning and appliance repair", "If your customer are direct consumers, I can see them skipping the cleaning and waiting on repairs. I have a stove that only has 1 burner working. My wife is on my back to get a new one or get it repaired. I argue that its about time we cook less and lose weight. The truth is, like everyone, interest has eaten up all my disposable income and am trying to save wherever i can. \n\nHopefully things pick up for you.", "Some of our longstanding customers lost their jobs and canceled cleaning service. Some moved states or overseas. \nAs for appliance repair, I am not sure, as I joined it as junior partner 4 months ago. The owner is stressing over schedule being empty, even though company is considered being top 10 in Portland, OR. \nI guess we’ll see what happens. I’m glad I moved overseas and it is much easier here without all the bills", "Good.  My commercial customers are still busy, so I'm busy.\n\nI definitely believe it depends on the luck of what industry you're in.\n\nIf you're in price sensitive industries with things that aren't really essential, you're probably having a bad time.", "Metal part/progressive tool&die  manufacturer here across many industries. Automotive, aerospace, hardware, firearms etc. Business is booming. It doesn't seem like any one industry is slowing down for us at least. Christ we're struggling to hire enough people to be on time with orders. It's insane. We're next to multiple other manufacturing facilities and it's the same thing at these places as well. Not sure if companies are preparing for a killer next quarter or next half of the year but we're swamped.", "But the economy is booming according to the news?  Jk I am looking for work after a layoff and it is difficult depending on where you live.", "The news does not represent reality.", "The economy IS booming. Like at some point we have to be willing to admit it", "Tell us about your business. ", "Yup, the news is meant to distract folks from the reality. . .", "It’s hard to convey sarcasm on text.  Totally agree the narrative does not match reality.", "This is great news! You should go let all of these people complaining about \"inflation\" know that they can now afford a house and no longer need to worry. \n\nPointing to a few macro economics indicators and saying \"look everything is working fine\" while ignoring the reality that the majority feels and is poorer than they were is dishonest. The reality is that people are making more money than before, stock market / large corporations are making more money than before, everyone is working, but buying a house or a car? Costs and rates are too high. Groceries and basic goods cost more than the increase in pay. Things aren't great because the economy is booming, but not faster than it's sinking.", "Exactly. There’s only so long you can pound your fists and act like you’re seeing something nobody else is.\n\nSome businesses fail, even in amazing economies. Lots of businesses have their specific performance relatively uncorrelated to macroeconomic trends", "My pet theory is that some people whose businesses aren't doing well don't want to admit the economy is doing well because of what it might mean for them. If the economy overall is fine but you're not doing well, then that means maybe you can't count on things \"coming back\" just naturally, which people understandably don't like to contemplate.\n\nFor this reason (and because, like, economics are complicated), I think people tend to equate \"the economy has changed in a way that has negatively impacted my specific business\" with \"the economy is terrible in general for everyone.\"", "Why base your analysis off of actual numbers when you could take this guy's anecdotal evidence that this is totally the exact same as 2007/2008", "Dead wrong. The news is not your personal experience.", "I understood. Just needed to say it for others who can’t read it. I also can’t help but remember 2008, same situation. Fills me with dread.", "Not just a few, all the macro economic indicators show the economy is booming. You are ignoring the reality based on your own personal anecdotes of “I experience this therefore this is the reality”", "What in here is anything more than anecdotal?  Nothing.", "When something like 90% of the news is controlled by 6 companies which are in bed with many other industries and have the politicians in their pockets how can you say he's wrong?", "62k 140 jobs ordered, I'm a creative.", "I’m in construction and my biggest issue is so many people just coming in so low on bids. I don’t even understand how they are doing it", "Lots of them may go under in couple months/years. \n\nThey may have better finances, meaning house paid off/cheap rent, utilizing illegal labor. All cash deals, \n\nThe way I see it, is guys that are bidding low will always be busy, so there’s a point they can’t take on any more work so we grab that work.", "The cash deal makers are really ticking me off.  I want to follow the rules but others do not", "There’s lots of aspects to it. There are guys around me that pay like $10/hr illegal labor and get cash deals. A job I need to charge $5,000 for to break even they can make money at $1,500.", "I know.  I am jealous of niche markets where people can't pretend to know what and how to do a job.\n\nBut I do love landscape construction \n\nHave had to explain to some employees how a $2.00 raise to go 1099 is a major loss, especially since they go on unemployment for 3.5 months a year", "Is anyone in the telecom space here? Authorized dealers for such? How is that space doing?", "Abysmal all but dried up", "Retail is hit or miss but we’ve been pushing Social Media, TikTok has been great! Instagram and Facebook help. If you’re retail and are not utilizing social media especially TikTok, you’re missing out.", "Brick and mortar retail, up 33% on the month. 14% on the year.", "Congratulations!", "I've been in business for a year and this is my best month, even though it's still slow. I'm hopeful for the future.", "Local and handmade products in Canada, we are up 20-25% over this time last year!", "Bookkeeper. More money this year.", "I just opened a pet supplies store. It's not taking off as nicely as I would have hoped, but it's really just not the right time of year to start, so things will improve.", "Terrible. Small electronics sales and install business here. The largest thing keeping us going are local and federal gov sales. We’d be dead I. The water without them.", "About even, maybe down a tiny bit. Our model is a recurring subscription so we don't have to constantly resell our customers.", "last year was our drop, this year we've stabilized to that same kind of sales as last year.\n\n22 vs 23 was a 30% decrease in sales.\n\nso far in 24 we're doing similar, better Jan and Feb, but almost exact same March but a little less than last year.\n\nOur town tourism(which is our big revenue generator in a tourist small town) was down over 25% last year, which led to our downturn, but haven't looked at this years visitor numbers to know if it's continued.", "Retail, hobby related, wayyyyy up. But we moved to a real retail space, highly visible.", "Am I factoring the massive increase in my SBA Loan? Because we’re surviving but fuck these interest rates. Hoping to refinance outside SBA next year.", "That shits real. Theres a company out there that will help you file for hardship. It’s only 6 months and interest is still accruing so yeah it’s not the best situation. However, in rough times it’s worth it to kick the can a bit.", "sales are shitting. I thought I was the problem. Where are you guys located? I am from Canada", "I’m in Texas", "It's helpful if you share your industry and your country/city as different locations have different economic circumstances.", "Cannot keep up with demand", "We are UP!....1%.", "Better than down!", "Pretty bad.  Q1 last year was the best quarter we’d had in a decade, things went south Q4 and haven’t gotten any better.  B2B sales and services primarily geared toward other small to medium sized businesses.  If our business is slow it’s a bad sign for the small business world in general.  I’ve got friends who work for competitors and they’re all in the same boat.", "Same industry & same shit sales. :(", "In retail, construction industry.\n\nBusiness is slow, sales are down but more importantly so hard to find and keep good employees. \n\nI welcome any tips for hiring in this market and HCOL area.", "This year is a bit slower than last year. I guess I’m not sweating it yet but I’m probably down 20% compared to last year at this time.\n\nThe economy is soft and I think that while a lot of my customers have work right now, more and more worried about six months and a year away than they were last year", "I bid a job expecting to never hear anything.  It was my first real job bid.  I got the job.  I'm so excited and scared as being new to the whole business ownership thing it made me realize this is really happening.", "Running an MSP in the Southeast and we are up 20% compared to this time last year. What does your business do?", "We're down a bit, which I expect will continue for the next couple of weeks through the end of school vacations.  The economy is definitely fucked, and you should be taken actions accordingly.  I'm in the process of acquiring two competitors who are pretty fucked.  This is the time to consolidate, cut waste, and make BIG sales pushes and if you're in a hybrid business, try and lock in some wholesale accounts to help float retail.", "Sales are down, but rental and labor are up for us compared to this time last season (which was a record setter nationwide). The nice part about being able to look at books from 50+ years ago is seeing that there really are always peaks and valleys. Ski stuff is great, while everyone who wanted a bicycle got one during Covid and no one (industry wide) has bought one since. Gonna probably be a slog of a summer for sales, but if labor is up that’s great because it keeps people employed. It’ll be probably be fine since we kinda saw this coming and didn’t order the way we normally do, saved a shit load of money in the bank, and all we gotta do is make it to next ski season.", "Been slowing down for awhile…has been even worse since early January :( hoping things pick up after tax season (usa)", "Just curious! When does the tax season end in the US?", "Mid-April", "Okay! Do you mind me asking the industry you’re in?", "hemp-related industry…not always the most necessary products when folks are broke :(", "Clearly, this person is a cryptographer.", "Bro same! Lmao well now we know.", "You seem to be new on Reddit.", "Yep check my profile just signed up this morning.", "Ah okay, just remember that Reddit suggests the usernames very randomly. Someone may have a username that says ImmaStripper02 but may be a lawyer.\n\nUsernames on reddit are very random, hence we have a subreddit called r/usernamechecksout", "Car detailing. 15% growth from last year.", "My sister owns a bakery. She said revenue is down about 30% this year from last year, but it’s started to pick back up again since Spring Break season started.", "E-commerce, sales are booming. People are buying like crazy cause you know, gotta flex so people don't think you're poor.", "Busiest we’ve ever been. And exhausted!", "Industry?", "Lowest", "20% increase over last year.", "What industry?", "Service industry.", "In at 1/4 of my worst year.", "Manufacturing.  \n\nI'm way way up this year.\n\nI own a cabinet shop and we do a mix of retail and wholesale.   I also have a lot of restaurant clients that order things for their stores.  Like menu holders for the tables.  Or specialty trays for unique items.   All of those places have been expanding so we've been swamped.  They are high volume/low margin items though.  \n\nOur custom furniture has been doing great also, I've had several orders lately.  Usually when things are going bad those people cancel.  \n\nThe economy from my point of view seems amazing.  The people that are suffering are the ones at the lower end of the scale.  Those that live on a check that gets delivered the 1st of the month.  Their basic needs cost more (rent/smokes/food from a convenience store) so they have less money to spend on any extras.   \n\nIt could also depend on location.  I'm in one of the poorest states.  So cost of living is low.  Means someone like me making more than min wage can live pretty well.  \n\nMost of my raw materials have finally started to come down in price.  But the big corporations are still being greedy.  Like Home Depot. They are still charging covid prices for plywood, even though the wholesale price is way down.  They will keep charging those prices until people have gotten fed up and stop buying it.", "Marine service, like double what I did last year.", "I'm in video production, and this year has been much better than last year. Last year was the worst--even worse than 2020, if you can believe it. I came very close to declaring bankruptcy. But then things picked up in the fall and things have been somewhat busy ever since--odd because December through February are always bad months for me. Things have slowed down recently, but I have some good prospects for work in the spring. So I am really hoping that the year as a whole is good. I can't afford another down year.", "Where do you think the mistake is? What is one thing that you think is lacking that can improve your sales? Would love to know more about the problems you face to run this business daily", "I work for a company in building automation. We're working our production employees overtime which is very rare.", "Similar pace to other years (1.2 million sales), but in the past we were booked out a lot longer. 10 week average .  Right now 3 weeks. If we start getting close to being not booked out we will lower production and sales will go down.\nIndustry: Landscape Design and Construction.  12 years in business.", "its been bad since early february. We rely heavily on facebook ads, and since early february the ads have not been perfoming. There was an outage on facebook end during that time that really messed up our facebook ads.", "Started for the first time a Saas, got 220 free sign ups and 1 paying client. Might be able to get an extra 3 I reckon, I am emailing all people 1 by 1. Its not a lot getting the first customer but it was the best day and gave me a huge boost. The Saas is an Ai chatbot that learns from your data and can act as a sales or team support member. 💪", "Up in Toronto, Ontario making chocolate - sales are up both online and in store (we have put more effort into Easter goods this year and is likely why. \n\nWholesale is waking up again, also likely due to me reaching out more over the past 2 weeks", "Tattoo artist. Been up and down this year as a whole but I actually had a great last two months clearing over 10k net both months. I see a lot of my peers struggling right now though and some closing up shops. I’m trying to be very creative with my marketing and running deals to stay busy. I know I can have some really slow months too but trying to stay optimistic that I can stay booked", "Ecommerece business with low value fashion items. \n\nSales are around the same level was this time last year. January was well up on last year but I made a mess of my adverts and have had to restart campaigns with learning process etc so that’s definitely had an impact.", "Online retail here, the lowest I've ever seen and then the add icing on the cake ended up needing to shut down the website for a little while due to a virus causing a crash about to launch back up here soon", "Digital marketing agency owner here, up 13% YoY to date. \n\nSeveral years ago we pivoted to PR to help bolster SEO through backlinks, and got really good at it. I'm grateful, because as clients are pulling back on content and SEO given recent algo updates, we're getting a huge influx of new PR clients. \n\nIt definitely helps that we have case studies and have worked with major brands. I don't know how the newbies are making it these days – things have gotten crazy competitive.", "You are telling me. My small brand competing with these whales is just not getting the visability it should", "Retail here. They've been fine. Mostly flat. Maybe up a little bit.", "Power sports is up YTD, March has been slower for us in the Midwest", "Event production here (triathlons, bike races, etc) and we are up across the board… pretty substantially for some events.", "It’s slowed down some but I still have work scheduled.  Neighborhoods lumberjack.", "YTD, up 8% versus last year which was a banner year with sales up 60% for the year.", "Home service company.  Slow.  Hope w weather hotter business picks up.", "\"Sales\" for me means closing on contracts to be completed in 2025-2026. I can only take on clients 10 per year, and so far this year I've closed on 6. Grant funded work is awarded in June and I expect 4 more contracts singed then. That will fill up 2025.\n\nAs for interest, I set up at an expo last week, handed out hundreds of cards, and have received a couple emails already. I took down the contact information for 45 of the most promising leads, who told me at the expo that they want to schedule a consultation ASAP to get on my books. If even a quarter of those pan out, I will be swamped.\n\nThis is all to say, sales are normal, but leads are ridiculously high for March.", "Luxury handmade home goods here. I sell wholesale to independent brick-and-mortar gift shops. I also have a flagship store for our brand.\n\nWholesale sales are up slightly from 2023, but restocking came later than normal after the holidays.  \nOnline sales are down over 2023  \nIn-person sales in our store are up over 2023, but this is only our second year open, so maybe that's repeat customers/more people knowing about us.\n\nNote: We sell on Faire Wholesale and their high commissions make it impossible to sell many of our products wholesale. Rather than raise our prices by $6-12 to cover commissions, we are focusing on direct-to-consumer and keeping our prices lower. Working out very well for us and our customers appreciate the high-end product that feels like great value.", "I’ve been thinking about faire myself. You can’t make it work?", "I'm up 350% year over year, but I do well when businesses struggle, so I'm not a good metric without that information.  Businesses are struggling out here for sure.", "Transportation, sale's slow the last 4-5 days (most likely due to the weather) over all up 27% vs prior year.", "I'm in a somewhat contrarian business model, or maybe just a good place for the current megatrend.  Either way, I guess I'm in a good spot for the downturn.  I do process optimization and automation, so when people are looking to cut down or cut back, investing in process automation is exactly what they're looking for...\n\nHow can I cut back on staff, but keep my current processes running smoothly?\n\nCombined with an increased marketing investment on my part to capitalize on this trend, this month is blowing up.", "We are up about 50% on last month at all three locations and up in general on the oldest location. The other two locations have been open less than a year.", "Retail - Sales are on par with the early months of last year. Recently won an award in our town so I’m hoping that increases traffic in the next couple of months.", "Up 30%-40% MoM.\n\nPeople can not live without their electronics. 🤷🏻‍♂️", "We do a few things.\n\nEngineering firm is still going strong.  I'm actually trying to slow down after COVID.  That was the exact inverse of 2008. But we're just bumping along at the same pace we usually are.\n\nWe're landlords and rents in our area have increased considerably.  We don't usually raise our rent unless taxes go up or we have a big cost to cover.  Because of this, hardly anyone is moving.  We are having to keep a better eye on each house though. I've found that people don't want to call us for things because they know they are under market and don't want to make waves.  Every time a house comes open we renovate and bring closer to market.  Not market, but closer.\n\nWe've also gotten into the STR game.  The rentals are actually better than last year....which is surprising.  All of the \"experts\" on youtube and twitter are flat out wrong.  At least in our market. \n\nIt's going to be a very good year for us.", "My Q1 sales are up over 100% from this time last year.\n\nI designs and sell novelty t-shirts on Amazon. \n\nUsually there is a significant dip in sales following Christmas, and while there was a slow down it wasn't nearly as much as it had been in years past.", "We average 30-35k a month in sales. As of today we’re at 30,329 already. So on track for 36 and change.", "Bad news - Best sales I've had in 4 years.\n\n^I ^help ^people ^who ^are ^in ^a ^bad ^place ^financially.", "Cosmetics. This year we finally optimised our campaigns and have been able to sell directly to our customers to stay afloat as our retailers slowed down. We've been making about the same.", "Web design, doing better than this time last year but we’d also just started last year so not incredibly hard to beat. Our referral train is finally starting to click! ", "In person art classes. Up 22% over last year.", "Up about 15% YOY. Financial services business though so our clients are not feeling any sort of financial stress", "Up 9.4% over last March. Up 6.75% over last year YTD. \n\nGetting ready to hire more staff. Retail. New and Used books.", "Contract/Private Security, Jan/feb we made 1/2 of our average profit from every month in 2023. Finally March picked up nicely, just had to struggle for a bit, gonna work on actually setting up an office and redoing my website.", "You don’t even know what I do. AI can’t replace me or my employees. Unless it grows arms ha!", "This month is Hot. This year is not. Data brokerage.", "Sales are up. Independent budget opticianry that does finishing work in house.", "We seem to be spending at much higher levels than previous years. Maybe it’s regional.  Here the stores are packed, traffic is horrible, and yet they continue to build plenty of new houses in the neighborhood.\nOur economy may be exceptional, much improved over the past 3 years", "Last month was killer for us, so seeing -42% in March is pretty rough to see. Really though, it's basically the same as January and December", "Q1 down 20 percent over last year.", "March is a slow month for retail. October through December are the best months and the whole rest of the year is slow. January and February were better for me than this month. But I created new products and did rare sales, so that’s kept the sales up this month. Marketing emails are helping me a lot.", "Finally picking up! I made a sale on the 5th, and closing in on a 2nd today (25th) finally!!", "Restaurant/cafe/coffee roaster here\n\nSales are bad. We're up on trends, but only because we moved into a bigger space last year and have increased capacity. The costs of running a larger space far outweigh the revenue increase. It's kind of miserable.", "Small office rental and mail services. Busier than ever", "Double digit growth so far", "Breakfast/lunch restaurant. We’re up 20% YTD.", "Women's fashion brand/manufacturer, up 30% this year so far 🙏", "Brick & Mortar retail. Year 3. USA.\n\n\nI'm estimating 0-1% growth for Q1. Not ideal with a 3% inflation rate, but after a dismal Jan/Feb I'm just happy Mar picked up.", "> US Retail Sales is at a current level of 607.42B, up from 603.82B last month and up from 602.62B one year ago. This is a change of 0.60% from last month and 0.80% from one year ago. US Retail Sales measures the total sales within the US economy excluding food services.\n\n\nhttps://ycharts.com/indicators/us_retail_sales#:~:text=Basic%20Info,US%20economy%20excluding%20food%20services.", "Upscale F&B based business here.....sales in February were off the charts, really, they were at pre-covid levels.  March has been a little bit tougher but still looking to finish above what we forecasted.", "iPhone and Android logic board repairs and data recovery. It’s usually always slow before tax returns but this year does seem a lot slower. Getting enough work to just cover bills for the most part. I suspect with how the economy is people wanting their phones repaired is last thing on the list.", "Recession: a period of temporary economic decline during which trade and industrial activity are reduced", "Business is up significantly compared to this time last year. Last year was brutal", "Well see about march but we were up 8 percent in jan and up 13 percent in feb.", "sales at 125% this month compared to last year march - marketing company\n\njanuary and february were trash -25% in sales and MRR.", "What industry are you in?", "10% down. Wedding photo and video. Looking to have a much better April", "On track for our best ever month. Aiming for our first £1 million month. ", "Boutique Catering. We're up double what we did last year. We're killing it. \n\nThe winter season was mad quiet though. People were concerned. Now that spring is rolling around, I'm feeling pretty good about the future.", "I teach photography and photo editing - business is way up. I do product photography (almost exclusively for a single client) and they are on pace to triple or quadruple last year's sales.", "I’m slammed.", "Awful. But Easter always brings in a bit of a bigger crowd for us. And weather isn’t awesome where I live currently. Wish you and everyone else struggling the best!", "I recently left my last startup with no sales. But I'm starting a new one soon and am confident it will outperform the previous.", "Business is shit…", "Multiple US locations reselling construction and creative software and hardware. Up about 20% yoy", "Landscaping services here and last year our revenue went down 25% I’m concerned about what’s coming this season.", "A lot better than last year last weak was low but not that much only 3% lower than expected. You should check why is 50% lower thats not normal a 10%-15% you could say is inflation but 50% its too much", "Sales Q1 are strong. I just had my best day ever yesterday in revenue.  We've gained new customers and are on track to finish with the best quarter ever.\n\nSales/Marketing company.", "Events. Destination professional conferences. Covid did massive damage of course but we had a big cushion (fortunately) to fall on. Recovery is barely happening. Numbers down 50-75%.", "What business are you in? Location?", "I run a small restaurant chain and it's been rough this year. Prices on our core ingredients are up and sales are down. Compared to this time last year, consumers just aren't spending as much. And one of the first things people cut out of their budget is eating out. People who used to eat out 3 times a month are now eating out just once or not at all. But we're weathering it so far. Had to get creative with our incentives.", "Up 60% YOY.  Same for Jan & Feb.", "Flat on this time last year", "We are up about 28% in sales but margins are dropping down :( toys and board game retail", "Digital Marketing and website Development business here. Helped businesses grow for 14 years now so i get references from clients we work with. So business is very good. \n\nThe important point is to educate the concept of \"Total number of streams from which you are getting leads\".\nThey can be SEO, Social media, Ads, YouTube, blogging etc.", "Used to do 5-7k a day, lucky to hit 3-4 now", "A one company", "Retail business is down a troubling amount. At least 50% year on year\n\nWebsite is down 60-70% from last quarter but that's the Xmas quarter so will see. \n\nLuckily the precision Ag and services side has gone up 100-150% as we have focussed and grown that aspect. \n\nBut retail is rough as anything right now. Normal shoppers just don't have cash to spend.", "I had a record month and 3 weeks but this week has been unusualllllly quiet and no matter how often this happens over the years, I always get a little freaked out and start thinking I have lost all my clients and they're never coming back. LOL! Have to remind myself it is only a quiet week, not the end of the world.", "Online retail sales… definitely down. Started a few years ago the downturn. I remember when Trump or Biden’s first stimulus checks hit, had a record breaking week. It proves when people have extra money they will spend. When they don’t, they won’t.", "what industry are you in and did you guys change your pricing to be sensitive to the current market trend?   \n\n\nwe've closed the most amount of business recently so we're actually doing fine but that's largely due to keeping an ear out and giving our leads something that our competitors aren't  \n\n\nA tactic that works really well for me also when it comes to closing is unselling ( I think that' what they call it?)   \n\n\nAny time a lead shows resistance I remind them that they don't need to sign with me, and that has worked WONDERS for me, I Can see the shift in their eyes when I say that.   \n\n\nGood luck!", "Speak to your marketing and ask them what they plan to change", "We are incredibly blessed. We are on track from a $100k revenue year last year to $500k this year. Janitorial business and it’s booming. We recently acquired another janitorial company and increased our revenue by $156k annual", "What is your business? The sales could be down for any number of reasons, like seasonal? Prices too high or low? Area economic slowdown? You should do some asking around of old clients to figure out why they haven't purchased in a while. I know my usual clients are making less money and have less disposable income so in order to combat that, I offered more products that are slightly lower in quality but much cheaper thus maintain my margins and satisfying the customer, win-win.", "Sales are down 40% YOY for my business.  I sell courses on how to draw and I even see the drop on Youtube ad revenue.  I suspect that because of the overall weak economy and high inflation commodities are doing a bit better and the extras are taking a back seat.", "seeing a lot of people say theirs is down, but surprisingly mine are slightly up from last year so far. on the other hand, my friend owns a furniture manufacturing & selling company and their sales are absolutely terrible, noone buying at all. crossing my fingers every day mine doesn't turn around since there's so much talk about peoples' shops failing.", "I sell private classes not a product per say. Bad", "Better", "It's not too bad, considering. Orders are up 27% over last year but we've invested a lot of time in SEO recently and it seems to be paying dividends.", "Beginning of the year was pretty good. Slightly above last year at this time. The past month has been pretty slow. Hope it picks up", "Meh. Its ok. I didn’t nearly put as much outbound effort as the previous months and doing ok so lets see if I can knock a few out this week before the month ends", "Solid, slightly down over last year but last year was high-water marks nearly 20 years in business, retail", "In two businesses\n\nHospitality beating trajectories post COVID\nChildcare - highest it’s ever been", "Up over 100%, but we also expanded into a non-adjacent business line. Previously only products and now have a service business in the hospitality/real estate space that is doing well.", "Sales are up but I am struggling to get it out the door mainly because I don’t have enough people.", "400% increase ytd. we made as much sales in the 1st quarter than we did all last year.", "Consulting.\n\nJanuary sales > Q1 2023\n\nMarch sales > Q1 2023\n\nQ1 2024 is 2.5x Q1 2023.\n\n2023 was a disaster.\n\n2024 looks better.", "Honestly, not good.   \n\n\nIt seems like other similar companies are doubling down on marketing and increasing their ad budgets.   \n\n\nI'm probably going to hold on for another Q4 but this year may be my last in ecommerce until a platform comes out similar to TaoBao in the U.S.", "You can’t just throw a net over all businesses that simply. Some businesses are doing way better than others and some industries are collapsing in upon themselves.", "Which is obvious to anyone who reads the comments.", "Yep, or anyone experienced actual life right now.", "Medical services up 10% sine january, and about 50% compared to last year. However we are a small fast growing company, it feels se are still on the easy growth phase", "We are up considerably but the weather has been good in our area and thats a major factor in my business. Hopefully it continues and we just didn’t do Aprils business in March.", "Commercial truck parts \n\nTad under goal for the month, but still have a few days.\n\nMy main aim is to beat the quarter over the previous quarter consecutively. We will come in just above Q4 2023 so it's a new record. If all the receivables came in on time, we would smash it by almost double, but I'm not complaining because that will help beat next quarters number.", "The economy is as good as you make it to be. Depends on how good of a business person you are", "Been here 10 years. Couldn’t be that bad.", "Up overall, I sell pets.", "I wonder if PH Swifties attending the Erastour in Singapore could affect local retail sales.", "[www.room4pets.com](https://www.room4pets.com)  \ni need hones reviews and what should i change or do to make it better for the customer  \nappreciate your time guys <3", "This is a friendly reminder that r/smallbusiness is a question and answer subreddit. You ask a question about starting, owning, and growing a small business and the community answers. Posts that violate the rules listed in the sidebar will be removed. A permanent or temporary ban may also be issued if you do not remove the offending post. Seeing this message does not mean your post was automatically removed.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/smallbusiness) if you have any questions or concerns.*", "1. i like the landing page colors and image (that's my first impression)\n2. i like the fonts and placement/layout of products", "thx for your feed bro, we appreciate you", "I make websites for small business for a living and I gotta tell this is really good! Although, I would add animations to make it even more pleasing to look at.", "we did wanted to add animations, but is out of our budget, in future we will improve 4sure,", "your website need seo  \n1.title optimization  \n2.header optimization  \n3.speed optimization  \n3. H1,H2, till H6 tags optimaztion  \n[5.google](http://5.google) analytics setup  \n6. sitmap.xml\n\nor your website needs off-page seo", "I hope this is allowed but this has been my experience consigning for the first time. Basically, I’ve been hand listing all of his cards on eBay (it’s a fairly nice collection) but from the start he has overvalued everything to laughable amounts. When I started selling some and he questioned why they only sold for x amount I told him again that his prices are unrealistic and gave him sold examples of recent sales etc. I explained to him the difference between graded and ungraded prices (which is super important, especially for vintage) and he seemed to accept that part so I thought it was good. Weeks later he’s now complaining that I haven’t sold enough of his cards recently but its more that everything is up and listed and I’m waiting for buyers and that I’d be happy to go back and change all 1100 active listings to auction but that he’d get way less. basically, this dude overvalued everything from the start but I thought I had soothed things over enough.  I’ve been selling/reselling/selling  sports cards etc for 4 years now.  He said he’d gladly take them back off my hands and sell them to an LCS(Local card shop) but then he would get absolutely gutted by a lowball offer but Ik starting to think that that’s the only thing that helps him see what his collection is truly worth (and the not 100k+ he thought) any advice would be super helpful, he’s started to be very condescending and rude over text and I’m being polite as possible while also trying to explain what these are worth 🤣 ( again I didn’t blindly post these things either, I hand  listed them and priced them on the average few sales (with the exception of nicer condition big name players being put to auction to fetch a bit more) any advice is greatly appreciated! (I’ve netted 3000 for him in total so far which is about 1/3rd of the cards) and gotten my own % too. ", "This is a friendly reminder that r/smallbusiness is a question and answer subreddit. You ask a question about starting, owning, and growing a small business and the community answers. Posts that violate the rules listed in the sidebar will be removed. A permanent or temporary ban may also be issued if you do not remove the offending post. Seeing this message does not mean your post was automatically removed.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/smallbusiness) if you have any questions or concerns.*", "You’re not going to make this guy happy. Delist them. Give them back. Tell him good luck.", "Definitely looking like the best thing to do.", "No good deed goes unpunished. Send him a link to this thread so he understands how ridiculous he is.", "Yeah, with eBay, if he's not persuaded by recently sold listings, nothing will ever satisfy him. Not a rational person.", "Make him an offer to buy the lot - you should make 6 to 8 x what you buy for \n\nSo calculate what you can easily sell for and divide by 8. \n\nOne time offer then leave it with him.", "If you have undervalued them so much, it’s very interesting that they haven’t sold…", "The problem here is you guys are at the point where you can't do anything. He needs at least 1, maybe 2 other people to say what you said.", "Why are you helping somebody for free", "I told him  I'd list them for whatever he wants but that if we list them at his crazy asking they will never sell.", "Consigning is literally the first word…", "It’s not for free, I’ve gotten a % of every sale", "Never get into that kind of arrangement. Waste of your time/energy. And, as you've experienced, he's no doubt blaming *you* for the lack of sales.\n\nThat's one reason I don't do business with family and people I want to keep as friends.", "You’re paying taxes on the whole thing…", "Tbh I don’t even know if I consider this guy a “friend” I get a long with him here and there but he can turn very rude very fast", "In that situation, you say, \"I'll list the card at the $100 you want.  I think it's worth $20.  You pay me my 20% on the $20, up front for listing it, and whether the card sells or not, it's not my problem.\"\n\nYou get your cut of what the card would actually sell for, his crap goes unsold and he gets his reality check.  If you need to update listings to lower his prices, charge him again.", "If that's what you think then you just plain don't understand how taxes work.", "How do they work in this case?", "eBay is going to send OP the 1099 for the full amount and given the situation he’s in I doubt he’s got accurate bookkeeping…\n\nBut sure. 👍 ", "Ebay sends a 1099 to the OP, OP sends a 1099 to his client showing what he paid to the client.  The IRS sees that only OP's commission was taxable income.  Even with poor book keeping and failing to send a 1099 properly this is pretty easy to rectify after the fact unless you pay your client in cash and don't create a receipt.", "And OP will send a 1099 to his client...", "i think we have to assume, that after doing it for four years, the OP understands the tax implications of his business model.  for the uninformed such as myself, what would be the \"right\" way to structure this tax-wise?", "OP has made it pretty clear that he's only profiting a percentage.  Super easy for him to show only that percentage was his income and that he paid the rest to his client.\n\nBut sure, your assumptions about a very simple tax situation are absolutely relevant.", ">Ebay sends a 1099 to the OP, OP sends a 1099 to his client showing what he paid to the client.  The IRS sees that only OP's commission was taxable income.  Even with poor book keeping and failing to send a 1099 properly this is pretty easy to rectify after the fact unless you pay your client in cash and don't create a receipt.\n\nCorrect (:", "Should’ve cut him off as soon as his expectations were not met. His opinions will not magically change overnight.", "Cancel all the listings, hand back the unsold stuff, tell him good luck. And when he comes back to you, not your monkeys not your circus.", "Ehh, should have let him get lowballed first, then listed his stuff, lol. People who overvalue their collections are always going to be difficult to work with unless they finally see reason.\n\nLet him take the cards and get shown what a good deal he has on his hands with you. It's not as easy to find someone willing to do what you are. Sucks that you listed 1100 of them, but you can save those postings because he will probably come back.\nAnd if he does come back, then you could potentially buy the collection off of him and reinstate your listings.\n\nThis is why having some sort of contract is important. That work you already put in setting up postings is worth having a cancellation fee for.", "Definitely, the good news is that I’ve been in charge of all of the funds and sending them to him so I’ve already gotten a % out of the sold things so far but yeah he just needs to see what his stuff is actually worth and I guarantee once he sees his collection is worth a couple thousand and not hundreds of thousands he’ll come back 🤣", "I wish you luck.\nWith his expectations like that, I'm thinking this was potentially his retirement plan and it is falling through.", "Lmaooo, thank you for the advice!", "How tf does one overvalue their collection by like 30x 😭", "“I know what I got”", "I have no idea, lack of proper knowledge on it I guess.", "When I was a kid I'd buy the newest Becket monthly magazine and look up all my card prices. Needless to say those prices were extremely inflated. It was kind of a racket so you'd buy a $3 pack of cards, look up the value and see they were worth $20, and gee wiz, I better go buy another pack.", "A lot of people see what people will post them for and think that's the value. You have to look at which ones are being sold for.\n\nAny asshole can post a random card on eBay for 100,000, doesn't mean anyone's buying it. But guys like him see that and go omg, my card is worth 100k?!", "I literally just went through this. A friend wanted me to sell his d&d collection. It was really rough and it was not worth the stress, definitely run", "Thank you for the input, im sure he thinks im offloading his stuff for cheap (when in reality ive spent the last month and a half hand listing all these cards and the more i sell the more i  make for both of us) so of course im gonna get the realistic max value out of them.", "You've gotten lots of good advice, I will add that dealing with \"emotional\" business-ish sales like this basically never works out. Full stop he is going to think you're ripping him off, not listing the cards correctly, whatever reason in his head. \n\nPeople who are emotionally attached to these kinds of items have a lot of trouble internally admitting that they aren't worth nearly what they think. They typically have a need to blame someone/something for not getting what they are 100% sure they're worth. At the end of the day, value is dictated by what someone will pay - period. There is literally nothign you can do to change his mind on this. I would exit this situation immediately.", "No matter what an item is appraised at, it is only worth what someone is willing to pay when you are selling. Cards lost a ton of popularity 4-5 years ago and with that, value drops.", "Definitely, I have genuinely no idea where he got his prices and when I asked him he compared them to what gem mint cards go for", "It's true. Ask anyone under 20 who Babe Ruth is and you'll get mostly blank stares.", "We dealt with money. Paper and coins. At almost every show, someone would walk up with the most holy of holy, kept safe and away from prying eyes and bestow upon us the most magnificent collection of average bills. We would sort through them and create two piles. Pile one is the put it in your pocket and spend it. Not worth more than face. Pile 2 we give then an offer on. Which they will balk at. Then we will direct them to our display that has the same bills in better condition that we would gladly sell for the same price we are willing to pay for theirs.\n\n\nPaper never moved quickly and you sit on it forever. Fastest movers were $500 and $1000 bills. Can turn those around in minutes. \n\n\nHope your margins are worth dealing with that guy. I would have cut bait. Haha\nGood luck! ", "That’s wild, I can’t stand baseball never watched more than 15 min of it in my life and ik who he is, granted I’m 21 so I just made ur cut off lol.", "My margins are averaging to 45+ an hour off of the sales ive done ( which as a college student is great) The only pain has been the communicational inconsistencies ( on his part) but i made it ultra clear multiple time(and again this mornin)and he seems to have had a change of heart. Situation is weird but if he does something like this again i will then direct him to a LCS. His response was \"i appreciate that you are doing good work, keep it up) So you can see why its weird lol", "Worked for a (mostly) used book chain and it was like this too. 80% of what people wanted to sell either got recycled or sent to a wholesaler for like pennies on the dollar.", "He sounds bi-polar. Careful out there, the night is dark and full of terrors. Haha", "Yeah it’s definitely odd, treading lightly!", "Cancel all the auctions and suck up that hit, give him his crap back. This is the same type of guy to buy an NFT and think they can resell it for profit, let him figure it out.", "i really think he is bipolar, after 10 pm he becomes more rude but during the day hes chill so i have no clue. I told him he could take it to a lcs(local card sharp to get another opinion) but he just texted me saying you are doing a good job, thank you for all of the hard work so im beyond confused lol.", ">after 10 pm he becomes more rude but during the day hes chill so i have no clue\n\nsounds like an angry drunk", "How old is this dude? That sounds like sundowning from dementia.", "That’s what I’m thinking too", "Couple of things as I helped my dad do something similar.\n\n1. You should never have listed everything all at once unless you got a retainer fee. That's a lot of time commitment for no guaranteed return.\n2. Your first batch of cards should have been average cards or lower, never lead out with your best. \n3. You should have better managed his expectations by the first batch of sell/no sell.\n\nSelling large collections all at once is a challenge for sure. If you don't have some sort of retainer and want to recoup your time spent on 1100 listings, stand your ground on the cost concerns. If you don't care on time spent, then go ahead and cancel all 1100 auctions, hand him collection back and walk away.", "Thankfully i get a % of everything i sell for him so my time hasnt been completely wasted.", "Dude, you already lost your ass on this deal. If you only spent three minutes each on 1100 listing, that's 55 hours of work. If you're getting a 25% cut, that's less than $14/hr. You might as well work at McDonalds if you're only making $14/hr.", "I'm getting 35, I'm a college student so I don't mind the work as I enjoy doing it (and it boosts my eBay account) but little bumps like this have been a pain to navigate.", "You billed $35/hr for 50+ hours of data entry? And commission for the sales?", "its solely commission-based, but supply costs are covered too. ( i have other work i do as well)", "I'm not talking about the other work you do. I'm talking about this specific instance. You did data entry for 1100+ items. Conservatively that's 55+ hours of work. Realistically, it's a lot more than that. If you didn't get paid for the data entry and only got commission on the $3000 in sales, you got totally screwed. You need to account for that if you're going to make a profit.", "this is a life lesson, you screwd your self on this deal", "Usually, i would sell smaller collections for family friends and also buy in bulk to sell myself, but this was a good opportunity so I took it. (I've made HIM 3k+ in a month and a half and ive made closer to 2.5)  (5500 net) I get where you are coming from again, but also hes giving me a larger chunk of consignment  than most people would and i enjoy doing it as it fits my schedule and this is good money for a college student ( i have other forms of income too)", "I dont necessarily think I screwed myself, the owner is a pain to deal with but its still good money for the situation. I am getting a larger commission chunk than the average person would get.", "Run.", "Give his cards back, you do not want this.", "You're getting paid something for this drama, right? Doing thousands of listings doesn't really seem worth it.", "Honestly you should have walked away when they had unrealistic expectations of price. \n\nLet him sell them for nothing to the LGS and refuse to relist them when he inevitably asks.", "You can always fire a client.", "Every minute you spend on his stuff is something you could be doing to work with others and grow your business. Youre the boss", "Use this as an education moment that as a consignor, you need to have established ground rules in place and a contract that the customer must abide by.  Present this to them upfront and if they balk at it, do not take their business.\n\nOnly you can control you. Don't let others control you.", "He's wants top dollar for minimum effort.\n\n\nHe will always try to wring more out of you if he thinks he can. I'd avoid him.", "Tell him that if he wants to list the items at the prices he insists on then you change the terms of your business deal with him from receiving a percent of what's sold to receiving a fee for renting your neighbor advertising space on whatever the platform is you have carved out.  \n\nAnd in the future consider having a contract (in place before you even fire up your computer to do work for him) that spells out who will price the items based on what method and provide the consequence for either party breaking the contract so that you don't just have to eat it if he decides to take his stuff to sell elsewhere after you've put in all this work researching and listing the cards individually, for example.  \n\nIt's always beneficial to have your bases covered and use clear communication, and have it all in writing, and that's *especially* applicable when you're dealing with someone who *believes* they are trusting you with the sale of $100k assets.  \n\nThat's a full year's gross income for many (lucky) people, or a downpayment on a starter home these days.  \n\nIf someone is expecting you to produce $100k out of air so thin you think you can probably only squeeze another $10k then you need to give this guy a chance to find this mythical buyer, or to adjust his own expectations so that you don't have to do it for him.  \n\nHe'll doubt you, but he won't doubt his own experience trying to sell the cards or getting scammed by someone else.  Not your problem either way.  You're running a solid thing, and that's all you can control.", "thank you for the input! I told him I'd happily list them at the prices he wanted but that they more than likely wouldn't sell. ( he got the insanely high number as if they were all high psa grades (9/10) but 90% of them are ungraded and the ones that are graded arent worth more than 20$.", "I would dump the items and give him back his cards. Worst case, you keep going and sell all of them and he pursues legal action claiming some kind of negligence. Best case he thinks you are an idiot who ripped him off…. Give him his cards back and he can go find out what is up and what is down on his own. Best case without you is he realizes you are right.", "I don’t think bro would have like any legal grounds for a lawsuit here", "Nor do i 😂 but like i said worst case… there are lots of civil suits over matters like this regardless of the validity.", "If he’s not happy with what you’re doing then he can take them back and sell the cards himself or make arrangements with another shop or whatever.  This isn’t complicated.", "You can invite him to go to an LCS. After he gets the offer from them, you can offer him the same or a bit more. \n\nYou will now have the cards, and since you already put in the work to list them, all you should be able to get a relatively quick return on your investment. I would hate to see that go to waste, but you don't want to be dealing with him anymore.  \n\nYou may also want to learn the lesson about setting expectations. \n\nYou may also want to look at your business model. If you set it up, going forward, you just buy the collections in bulk and then sell them. You will not have to deal with the people as much.", "Its a good lesson, now that i have it all posted im just waiting for offers and sales. I've since invested in a machine and software and am buying bulk to sell once I figure this situation out. Ive consigned for a neighbor before but his collection wasn't nearly as big but he was very happy with what i got him!", "Not really much you can do except to say that if he thinks he can do better he's welcome to pick up the cards and do it himself.  Well or ask him to pay for getting them graded and slabbed.", "What era are the cards? Definitely sounds like you are ready to dump this guy, and that is totally realistic. How about selling me cards for me? Do you have a website for what you do?", "I don’t have a website but I have an eBay store as well as a store on mercari. Would love to help you out (: pm me me when you get a chance. The cards range from 70’s to 2020’s", "Step one is always managing expectations. These are worth getting graded, these should be moved together as a collection, these as bulk, and these should be listed individually. Here's the retail value, here's the auction estimate, here's the dealer buy list and here's the timeline for each. You may still be able to do that, but I'd guess he probably just wants to pull the plug, and I'd let him.", "You’d think that, but he goes on these weird rants in the evenings every few weeks and then I’d all good in the am after I explain it. I already asked him about grading but he said he didn’t wanna do it 🤣", "LGS owner here - chances are, after your commission rate and eBay fees, he is probably making the same amount of cash taking them in to a local shop. If not, you are not making enough commission imo. I would delist them and let him take them in and either come back to you or free you up for other things.", "You get the 1099 for your ebay account. \nAlso some people will never be happy.  Its ok to fire a customer.", "I agree, I can’t really think of a more clear cut way to show him what they’re worth, I’ve sent screenshots of multiple sales /comparisons and most of them have hit the average for what they go for (minimum) It’s super odd. With all the information available you’d think he’d find the correct sales himself. It’s stressing me out but I’m very close to cutting him off", "Sit down and agree (or disagree) on a contract. Even if it's a basic one, it'll be useful if he ever bitches about it later, and it sounds like he will.", "Give them back and tell them to sell them himself.\n\nNot a lawyer not legal advice.", "He “acknowledged” all of my reasonings and price guides this morning but the second he mentions anything again I’m just gonna give them back and tell him good luck. No lawsuit is possible as he’s already well off, which is what makes me even more confused 🤣 there’s a reason he didn’t sell them himself and it’s probably because he could get any buyers", "*I was about to edit got caught up in something else *\n\nYou sound like a logical person who expresses themself in a clear and direct fashion. I am too. Your neighbor might not be.\n\nDon't bother with logic or more warnings. Just give them back. It annoys you, for some reason that makes no sense, it annoys him too.\n\nHe may have some emotional attachment to them and is not willing to share his feelings and is second guessing it. Engaging further is likely to damage your personal relationship. The business relationship is unlikely to be profitable. You're doing him a favor, but he no longer sees it as that for whatever irrational reason motivates him. Don't inquire as to why, it will just serve to annoy you.\n\nMy father did this with computer parts one time. I use to re-sell them a lot (along with some other misc mechanical stuff) and asked if he wanted me to get rid of any of his old stuff. He did. Then when I did so, he complained he was getting pennies on the dollar (computer parts depreciate rapidly). I stopped after a few times because I was doing him a favor and he had some bizarre idea I was cheating him. \n\nMy mother, who knew nothing about computers, was aware depreciation was even greater than cars, which is all you really need to know. So it was some emotional reason or pride for him. He claimed he thought he was doing me a favor. Not kidding. I made 0$ on any of his stuff and factoring in labor obviously lost money. I imagine you're in a similar position. It infuriated me. \n\nNot a lawyer not legal advice.", "shocker, another boomer who dumped a fortune into sports cards and the bottom fell out. give them back and run. you'll never please him.", "Consignment is a tricky one, especially if those expectations aren't managed and agreed to upfront. I've been in similar positions a few times and I'm very careful about taking on consignments at all these days. \n\nAs to your situation, I think you need to have a chat with the guy. You haven't mentioned a contract so I'll assume you don't have one. I'd say clear the air with him and be prepared to dissolve your agreement if he's going to be more trouble than he's worth. \n\nAs someone else said, suggesting he take his collection to a card store so he can see how little he'll be offered there can be a good way to find out if he's capable of seeing the light. You have already done a lot of the labour, which sucks, but treat it as a learning experience and take notes for next time. \n\nIf he does go for the card store option, just end the listings so they can be relisted if he comes around. In that case, I'd say get an agreement down on paper so there's no confusion about market value, expected sale range, your commission etc. You don't need a lawyer unless the collection is huge, just something you've both consented to. Verbal agreements suck. \n\nGood luck", "I have the terms via text of the agreement we made but yeah I agree. If he acts up again im gonna delist it all and let him take it so a L S", "Probably not worth your time at this point, sucks that you put all that work in, but atleast you got some money out of it. \n\nI knew a guy who did consignment sales and estate auctions. What kept happening to him is he'd go look at everything, draw up a contract. Between then and the actual auction the owner would sell the most valuable items themselves(vehicles/boats/4 wheelers), which killed the deal because without those bigger ticket items the deal wasn't worth doing.", "You have basically already been given the advice I would give you... give the stuff back and walk away...\n\nOne of my hobbies is MTG, the LCS that survive know what they are doing, they know how to make an offer that is fair, that accounts for all the time and effort involved in selling a collection piece by piece, accounts for the fact that they will likely have to hold onto some parts of the collection for months or years to recoup the investment, as well as how to account for the risk they are taking on, in maybe not finding a buyer, in interest in the hobby shifting, or in mistakenly buying a counterfeit high value card, or even just a high value card that has a flaw in it that went unnoticed until it was sent off for grading...", "Be careful with this guy. He will record telling you that his cards are worth xxxx.xx amount and even though you correct him on value, he will come back when all is said and done and demand more money from you.", "If those are MTG cards that's not the right way to sell them. They need a TCGplayer account and it's going to take years to sell them all off.", "They are all sports cards (which I’ve sold another neighbors collection for and he was totally happy)", "Oh okay.", "If he wants instant liquidity, tell him there’s always the stock marker", "That’s not how taxes work.", "I see it has been talked about before on the subreddit, but I was hoping someone could confirm and clarify \"business write-offs\", for the idiot that I am. \n\nA lot of people in the public, and the business world, seem to talk about buying things as being free because they can simply \"write it off.\" Obviously buying something, especially if it is unnecessary, can't be free. What do people mean when they think \"writing it off\" makes it free? Are people \"writing off\" every single thing they buy for a business?\n\nAlso, hypothetically speaking, if you were buying a pack of pens for the office with a company credit card vs a personal credit card, isn't buying through the company card advantageous since you effectively haven't paid personal income tax on those dollars? And assuming you buy with a company card, are you also suppose to write that expense off?\n\nThanks", "This is a friendly reminder that r/smallbusiness is a question and answer subreddit. You ask a question about starting, owning, and growing a small business and the community answers. Posts that violate the rules listed in the sidebar will be removed. A permanent or temporary ban may also be issued if you do not remove the offending post. Seeing this message does not mean your post was automatically removed.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/smallbusiness) if you have any questions or concerns.*", "Here is an easy way to understand it.\n\nSay for example if you as a business owner or 1099 make 100k. And you are taxed a total of 30% (oversimplification but bear with me), you will be paying 30k in taxes and keeping 70k.\n\nA write off is simply an expense that you can use to bring down your taxable income. So if that business owner paid $5,000 for a herman miller office chair. They would subtract $5k from their $100k income. And then they would be taxed 30% on 95k instead. Which is $28,500 instead of $30k.\n\nEffectively the business owner was able to save $1500 on a $5000 purchase.\n\nIt is not free by any stretch of the imagination, but it can be substantial.\n\nYour question about what if it's unnecessary is valid. There is no obligation set by the IRS to use common sense. As long as you can state your case semi-competently in the event of an audit, you can get a pass. If you truly believe a $5000 pen can close more sales than a 50 cent BIC pen, who is the IRS to question your business acumen.\n\nWhere it becomes more towards the free side is when you are in the highest bracket of taxes. On a federal level for 2024, a single person earning $609,351 or more is taxed at a 37% rate and obviously some states also have state income tax.\n\nSo someone making more than $609,351 would be able to get an effective 37% discount on any \"Business expense\" that they claim.\n\nI hope this helps", " Very good explanation. \n\nI’ll only add that:\n\nYou still need to be able to afford the purchase, buying something to lower your tax if it’s not affordable, is not a smart idea. \n\nSomeone once said to me that I should go on a $20k holiday every year and write it off on tax, I needed that $20k every year for the business. I wouldn’t loved the holiday, but it wouldn’t have been good business.", "A company I used to work for would send everyone to a resort in Florida once a year for a \"company meeting\".  said meeting included assigned margaritas, and then after the company meeting there was a giant rich-person-wedding sized party.", "If they think that writing something off makes it free, they are confused or uneducated. Writing something off doesn't mean the government pays for it. Yes, some people think that's how it works. \n\nIf you buy pens for your business, that's a deductible expense (write off is the slang term) for the business. Even if you use your personal card. Depending on the business structure the process varies, but those pens get paid for with pre tax dollars. That's the\"write off\". That you don't have to pay taxes on the money you spend to run your business.", "As a business owner I do get aggravated at the people who think I should pay for something just because I can \"write it off\".  Like me buying lunch for everyone since I can write it off.  Its not free money. \n\nBut its a great way to pay less taxes.  \n\nI'm in a write off heavy business.  Manufacturing.  My tax burden each year is very tiny.  That is because I have so many write offs.  Its a very great way to build a business.  \n\nI'll give an example.  My business uses lots of machinery and equipment.  Each year I buy a few new pieces.  I just took delivery of a new laser machine that cost $20K.  I can appreciate that machine and take a $5000 write off each year for 4 years.  So instead of having to pay income on that $5000 each year, its like I didn't earn it at all.  I owe no income taxes on the money that was spent buying the equipment.  \n\nIts a valuable tool for businesses like mine because I'm not paying income tax on the money used to buy stuff and I'm building equity in my business by expanding it.  \n\nMy write offs each year include:\n\n1. ultitlies for my business.  power, internet, sewage, garbage\n2. Mileage.  MY biggest one.  I travel often for my business.  \n3. Buying equipment, tools\n4. Accounting software subsription\n5. professional dues \n6. Hotel stays for my business trips\n\nI have a friend who has another type of business and she has hardly any write offs.  But of course that means she doesn't have the expenses that I do.", "well, with business you **pay taxes** on **profit** *(obviously profit is what you have left* ***after*** *you pay* ***expenses***\\*)\\*\n\nin basic terms common business expenses can be deducted from your gross, lowering the amount you pay taxes on\n\ncertain large ticket items like equipment for your busines have to be deducted over time\n\nsidenote:  if you see tik toks or youtube shorts talking about \"free cars\"  you have to put it in context.  consider the biz entity type and amount of income.     so lets say your business is a c-corp or an llc w/ c-corp tax status and you make $1M profit (we using this round number as an example)\n\nfor that $1M... uncle sam would expect you to have paid them  $210k and maybe you sent in \\~$50k quarterly estimated tax payments\n\nbut the goal is not to pay the 21% corp tax to uncle sam for them to waste... so you would chop down your tax burden with as many legit deductions as you can on your gross income.\n\nso back to the car example, if you are Fantasybust Inc. and it looks like you will make big profits like that why not buy you a 6000lb business use vehicle for $100k, if im not mistaken they extended the bonus depreciation for 2 more years where you can write off the entire amount vs doing it over time. also buy stuff like equipment that you can use for business, donate to charity, all this will all lower the amount you will end up paying to uncle sam", "Business expenses can be categorized as cost of goods (COG), operating expenses, and other expenses.\r  \n\r  \nCOG includes expenses that are truly variable such as credit card fees, raw material, utilities, equipment maintenance, and returns/claims.\r  \n\r  \nOperating expenses are fixed cost such as advertising, insurance, rent, wages, salaries, payroll expense, interest expense, and discretionary expenses such as owner’s draw.\r  \n\r  \nOther expenses would include principal payments on loan and depreciation tax shield (non-cash expense).\r  \n\r  \nIn other words, there is no such thing as a write off.  The costs associated with business operation are expensed against income.", "A write off is a tax deduction.  It (indirectly) reduces the amount you owe in taxes by reducing your revenue by the $$ of the deduction.  You're right, a LOT of people think this makes the item free.  In reality, the most it ever does is save 37% if you were paying the maximum tax rate, and most people don't pay the max.  This can add up on a purchase that maintains value as an asset, like a vehicle.   It's definitely not free.\n\nLets say you made 100,000 in revenue.  If you have $60,000 in deductions, your net income is 40,000.  You're taxed on the $40,000.  Every business should keep business and personal finances separate, and deduct every allowable business expense, like pens, or vehicles.\n\nThere are other things, called tax credits.  Tax credits reduce the amount of taxes you owe directly.  Lets take the same example above, where you had 40,000 in taxable income.  You probably owe about $4300.   If you had a tax credit of $1,000 you would only owe $3,300.", "\"Writing it off\" in this sense is reducing the taxable income of your business.\n\nExample: Your taxable income is $100 and your tax rate is 20%, meaning you would pay $20 in taxes. Now let's say you buy a pack of pens for $10. Your new taxable income is $90, meaning you'd pay $18 in taxes. In this example, you spent $10 to save $2 on taxes. This can get more complicated, but this is the gist.\n\n\"Are people writing off every single thing they buy for a business?\" - They should be. There are exclusions as to what can be expensed vs capitalized, so be aware of that.\n\nRe: your question on business CC vs personal CC - No, zero impact on taxes or pre/post taxed dollars. However, don't use your personal funds for business expenses.", "How do you calculate your write-offs and taxable income? I.e. where in your tax documents do you or your accountant do this?", "Hey business owners,\n\nI've been working on a [PDF parser](https://extractninja.org/) that uses artificial intelligence to understand the layout and structure of documents. This is particularly useful for tasks like processing a bunch of resumes that all look different. Instead of manually sorting through them, this tool can parse them in bulk and organize the data into Excel, based on criteria you set.\n\nYou can also perform deep analysis to extract your desired data with the custom instruction feature.\n\nSince it's still in the beta phase, I'm offering it for free to anyone who has OpenAI keys. There's a demo on the site with some credits to get you started, so you can test it out and see how it works for your specific needs.  \nIf you're dealing with a lot of PDFs and looking for a way to automate some of the grunt work, this might be up your alley. Feedback is welcome; I'm looking to improve it.", "This is a friendly reminder that r/smallbusiness is a question and answer subreddit. You ask a question about starting, owning, and growing a small business and the community answers. Posts that violate the rules listed in the sidebar will be removed. A permanent or temporary ban may also be issued if you do not remove the offending post. Seeing this message does not mean your post was automatically removed.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/smallbusiness) if you have any questions or concerns.*", "Hi guys, I’m currently working on this app idea to help service business owners. \n\nI was wondering, how much of a business is done over phone these days. How many calls from customers do you guys usually get? What are the most common queries? Are they calling to book your services or are they calling because they have some question. \n\nCheers!", "This is a friendly reminder that r/smallbusiness is a question and answer subreddit. You ask a question about starting, owning, and growing a small business and the community answers. Posts that violate the rules listed in the sidebar will be removed. A permanent or temporary ban may also be issued if you do not remove the offending post. Seeing this message does not mean your post was automatically removed.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/smallbusiness) if you have any questions or concerns.*", "My dad has been very adamant in wanting me to inherit his company. The company works in logistics and there's around 50 employees.\r  \n\r  \nI wouldn't mind inheriting it but one thing I'm worried about is that the company seems like it wouldn't be able to run properly without him.\r  \n\r  \nI always see him stressed out, making calls to his employees, giving specific orders, and fixing any mistakes that could have happened. Sometimes it even feels like his work-life balance is messed up.\r  \n\r  \nI have been working in the company office as an assistant accountant for a few years and listened in on business meetings, but I could never see myself replacing him with the lack of knowledge I have.\r  \n\r  \nMy dad is still alive, so I know I can just ask him things to learn more about it. But there's so much to learn I don't even know where to start. What do I do? or what questions should I ask him?", "This is a friendly reminder that r/smallbusiness is a question and answer subreddit. You ask a question about starting, owning, and growing a small business and the community answers. Posts that violate the rules listed in the sidebar will be removed. A permanent or temporary ban may also be issued if you do not remove the offending post. Seeing this message does not mean your post was automatically removed.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/smallbusiness) if you have any questions or concerns.*", "I would start with taking out a few days to shadow him, understand a week or month of working in his shoes. Assuming it’s an old school business, it’s best to document the business on your own in case your father does not have that as a strong suit. The numbers, departments, the product/service portfolio, employees, pain points, everything under the sun.\n\nUnderstand the business. Understand the industry. Understand how the upcoming decade looks like. \n\nProbably best to take a calculated call after, as to whether you should pursue it or not. \n\nBest of luck.", "Frankly, with a business that size, I would hire an actual M&A attorney to help mentor and guide the process.\n\nVery generally speaking, it's a complicated and delicate process. You have to do it in a way where existing staff trusts and respect you, which is difficult. You have to avoid the image of nepotism or favoritism, which is difficult. \n\nThe best transition I've seen is that \"publicly\" the child purchased the business from the parent. This instilled a certain level of respect from staff.\n\nHim always being stressed out is a fact of small business life. 50 employees is a difficult size. You have a dedicated marketing person, accounting, but you aren't really large enough for a CFO and CMO. So all of the big decisions fall on you. You're big enough to be a target for lawsuits. Work life balance for companies this size is ... non existent. Vacations don't exist. You literally cannot take a day off work. Yes you can work from the beachhouse, but you literally never fully disconnect. At any given moment there are multiple huge problems you're in the middle of resolving, and on a daily basis there are multiple smaller 911 problems that need resolved on the spot. \n\nBrutally honest, from a statistical perspective, he's probably better off selling the firm and giving you the proceeds via an estate. Just pure numbers, like 95% of inherited companies end up failing. My suggestion to you is, if he has another 5-10 years of work left in him, you go work for someone else for a couple years. Just to get an understanding of what a typical office is like. Then work underneath him as a Director of Operations for whatever years he has left to work.", "Well if you are serious you need to start working for the company and be his shadow for a year or more. Learned everyone inside and out. document everything. You need to learn contacts and employees and become familiar with it and them with you. It isn't something you just step into.\n\nSounds like there is a lot of room to improve processes. If mistakes are happening that often that you need regular stressed out latenight calls you need to improve the process to lessen these however you can. A logistics company that itself can't figure out its own logistics is a bad look.", "Does anyone have recommendations on benefits providers (PEOs?) for small-business LLCs that have only limited numbers of (or none at all) W2 employees? This is for things like health insurance and related things. We're currently using Trinet and they're very, very expensive ($1k/month overhead on top of the cost of the insurance itself, except in December when they made it $2k). We've looked into several others but all of them need a minimum number of W2 employees. Alternatively, if not using a PEO, how else do you obtain health insurance etc.?", "This is a friendly reminder that r/smallbusiness is a question and answer subreddit. You ask a question about starting, owning, and growing a small business and the community answers. Posts that violate the rules listed in the sidebar will be removed. A permanent or temporary ban may also be issued if you do not remove the offending post. Seeing this message does not mean your post was automatically removed.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/smallbusiness) if you have any questions or concerns.*", "Hi everyone I’m new here! I’m getting ready to launch my small business and I know it’s something I have to, and will do. My spouses questions about the business are all about the possible negatives. They’re asking questions about the business with an underlying tone of doubt it seems. They say they’re supportive but all questions about the business lean on the ‘what if - negative scenario’.\n\nI’m aware of the potential risks during this process but I’m full steam ahead. I want the full undying support with necessary criticism and probing questions because it does help in the process. Perhaps I just want their initial reactions to be overwhelmingly positive and supportive with a tone of ‘I ALSO know that this won’t fail.’ I’m rambling a bit here but would love to hear input on this. I’m excited about the launch and I know they’re supportive, however there’s a small part of the situation that feels like they don’t truly believe in me or the business because ‘risks exist’ and I believe we just think differently. Anyone have a similar experience?\n\n", "This is a friendly reminder that r/smallbusiness is a question and answer subreddit. You ask a question about starting, owning, and growing a small business and the community answers. Posts that violate the rules listed in the sidebar will be removed. A permanent or temporary ban may also be issued if you do not remove the offending post. Seeing this message does not mean your post was automatically removed.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/smallbusiness) if you have any questions or concerns.*", "Not so much with my spouse, but similar sentiment from a sibling and a friend 4 years ago.  The friend is no longer my friend, and the sibling....well, the relationship is difficult at times but their attitude toward my self employment endeavor is consistent with their personality.\n\nSometimes people (even people we marry) just aren't capable of giving you what you need (support, excitement, rallying).  Go on and kick ass anyway.", "Blind enthusiasm can look naive, make sure your spouse knows you are listening and taking them seriously.  Ask them if there are things they would like you to do so the risks are managed.  Maybe building up an emergency fund first, or borrowing less money, or starting smaller would make them more comfortable.\n\nAsk them honest clarifying questions, make it clear you are not arguing, but listening and investigating.\n\nMaybe you need to work together to define what success and failure look like.\n\nUnder what conditions would you quit on this new business vs. bankrupting the family by trying a million adjustments?", "I am part of a new company that is currently trying to promote itself on social media (specifically Twitter). We have very few followers (less than 100), and engagement isn’t great. I have been posting very consistently, a variety of original content, retweeting popular things, commenting and replying to relevant posts, using trending hashtags etc. Budget doesn’t currently allow for paid promotion and I’m just not sure where I’m going wrong, as previous social media accounts I have managed have never had this issue.\n\nThank you in advance for your help.", "This is a friendly reminder that r/smallbusiness is a question and answer subreddit. You ask a question about starting, owning, and growing a small business and the community answers. Posts that violate the rules listed in the sidebar will be removed. A permanent or temporary ban may also be issued if you do not remove the offending post. Seeing this message does not mean your post was automatically removed.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/smallbusiness) if you have any questions or concerns.*", "What is your aim? Why do you want engagement? ", "I’m considering taking my side gig and making it a official LLC. I usually do mobile detailing, however would much prefer to have the customer come to me if possible but I’m hesitant todo so as I have a dirt driveway and no garage. I’ve lost out some on big ticket jobs because of not having a garage, some of the more expensive services I offer require a indoor environment. I’m not big enough to have a separate shop/store front and be able to afford it.   ", "This is a friendly reminder that r/smallbusiness is a question and answer subreddit. You ask a question about starting, owning, and growing a small business and the community answers. Posts that violate the rules listed in the sidebar will be removed. A permanent or temporary ban may also be issued if you do not remove the offending post. Seeing this message does not mean your post was automatically removed.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/smallbusiness) if you have any questions or concerns.*", "Do the math.  Then, assume you were off by about 30%.  Because it's always more expensive.  Does the math work?  If it does, then go for it.  What is the ROI? Is there better uses for that money?  How many years until it pays for itself?  Will being immobile hurt your mobile business? Property taxes will increase, and building costs are at an all time high.  \n\nGet mathin'.", "Direct honest answer - business loans for small service businesses RARELY if ever make sense. Ultimately, business loans have to be secured by capital or personal guarantee (if you have enough assets to cover it). If you default, they WILL take your house and kick you and your kids onto the curb. It's not like CC debt where you get some nasty letters, maybe a wage garnishment, declare bankruptcy and it disappears.\n\nI say this in the context of, if you're a 1-5 employee service provider (which you are), if you can't afford it using your revenue then getting a loan is a terrible idea. \n\nYou're a business owner, get creative. Reach out to tint shops, plumbers with warehouses, any smallish warehouses, see if you can rent a \"space\" 2 days a week to do high end details. My high-end detail guy rents warehouse space from a company that stores marble countertops. He spent $10k and had his area walled off. He details my luxury/exotics, and I couldn't care less that he doesn't have a storefront. \n\nHow long is your driveway? You're talking a $10k-20k expense. I would not get a business loan to do this.", "Local storage unit is as low as $129/month  \n\nWith electricity as low as $169/month  \n\nYou can make that work 3-6 month, book those big fancy jobs, save that extra profit, keep looking for the ideal spot to sign a lease", "If I brought my expensive car for an expensive service and they worked out of a storage unit (which is illegal) I am driving away immediately", "I own a small business in selling vintage clothing. I do bi-weekly drops of curated items. There is a high demand and people often ask me to reserve things for them. As I want to keep things fair and want to give everyone the same chance, I almost never do this and just let first come, first serve count. However, I recently did a favor to one of my customers (whom I regularly positively interact with on my brandpage and who gives me a lot of positive feedback) where I let them know in advance that an item I know they'd like was coming up (from previous shopping experience) after they had asked me if I would be able to help them out since they were unlucky a lot of times with getting their hands on items and I really wanted to help them out. Even though I am not a person to care at all about status, this person is a known football player and it puts me in a bit of a difficult spot. Last week I happened to be at one of the matches of their team and I let my customer know that I'd be there. They then let me know that we could do the handover of the item after the match, since this customer lives overseas and their team would play in my city - it would save a lot of shipping and hassle. I knew that this might not be the most ideal as I understand things could get very busy after the match, so 2 days beforehand I asked for reassurance if I should still bring the sweater, yes or no. I then got asked if yes, I could please bring the sweater. It's the day of the match and I didn't hear or see anything and waited for 1,5 hours after the match without any replies to my message or any updates -- and since they are \"famous\", there was no way for me of reaching them. Even though I understand that a lot would be going on after the match, I personally felt a bit disrespected both professionally and personally as I had asked for confirmation 2 days prior and got asked to 'please' bring it. The next morning I still hadn't heard anything. In the afternoon I sent out a text that I felt a bit disrespected as I hadn't heard anything still and that we had an agreement, I then asked if they still wanted to purchase the sweater. At the end of the day I got a reply that yes they still wanted to purchase the sweater and that they didn't have time after the match. It still felt off to me, as it was their idea to do the handover of the sweater after the match even after I asked for reassurance. At that time I said it was all good and asked how they would like to do the payment so I could set the manual order in progress. This was 7 days ago. I haven't heard anything back, but I do see they are online on Instagram. In a few days I have my next drop. The sweater that I have reserved is a sweater with high demand. It would sell out quickly. But I am a bit stuck between what I should do now. I want to offer great customer service, but I am also wondering when it should be enough. Seeing as I want things to be fair for everyone. I also cannot afford any bad reviews from this customer, since they have a large fanbase.\r  \n\r  \nI would like to hear some advice/opinions on when customer service has been offered enough? Do I wait with adding the sweater to the next drop? Or do I add it to the drop as I cannot afford to lose any cashflow. I am just a small business doing it all on my own, I really need the money but I also really want my customers to be happy.", "This is a friendly reminder that r/smallbusiness is a question and answer subreddit. You ask a question about starting, owning, and growing a small business and the community answers. Posts that violate the rules listed in the sidebar will be removed. A permanent or temporary ban may also be issued if you do not remove the offending post. Seeing this message does not mean your post was automatically removed.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/smallbusiness) if you have any questions or concerns.*", "Hey there people,\n\nSo the other day I was scrolling through my Facebook feed, and I saw another brand has a screenshot of my advert and replaced the captions over the top.\n\nWhat can I do? \n\nThey are literally using it as their own advert. I’ve just covered by my brand name was and said it was by the brand name. \n\nI assume this isn’t big enough for legal action on should I just send them an email?", "This is a friendly reminder that r/smallbusiness is a question and answer subreddit. You ask a question about starting, owning, and growing a small business and the community answers. Posts that violate the rules listed in the sidebar will be removed. A permanent or temporary ban may also be issued if you do not remove the offending post. Seeing this message does not mean your post was automatically removed.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/smallbusiness) if you have any questions or concerns.*", "Email them", "I am planning to offer 1-on-1 consulting via Google Meet and am looking for a solution that allows users to book a slot and pay upfront. For example, the Calendly + Stripe integration does this, but Calendly does not support value-added tax (VAT) during payment. It just allows you to collect a lump sum. I am registered for VAT in the EU, so this is important for bookkeeping purposes. \n\nStripe can handle this natively but it doesn't work when using Calendly. \n\nAre there software that can handle this? ", "This is a friendly reminder that r/smallbusiness is a question and answer subreddit. You ask a question about starting, owning, and growing a small business and the community answers. Posts that violate the rules listed in the sidebar will be removed. A permanent or temporary ban may also be issued if you do not remove the offending post. Seeing this message does not mean your post was automatically removed.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/smallbusiness) if you have any questions or concerns.*", "Hello, r/smallbusiness! We’re conducting a survey for a capstone project about the challenges faced by the hardware retail industry in the Philippines regarding supplier sourcing, evaluation, and selection. Our goal is to develop potential solutions that can improve these processes. \n\nThe owners/managers/purchasers of the hardware and construction supplies business are invited to participate in this survey. Kindly click the [link](https://forms.gle/KFNiyzNierBuTNyy8) to access the survey. \n\nYour participation in this survey would be greatly appreciated. Thank you so much!  ", "This is a friendly reminder that r/smallbusiness is a question and answer subreddit. You ask a question about starting, owning, and growing a small business and the community answers. Posts that violate the rules listed in the sidebar will be removed. A permanent or temporary ban may also be issued if you do not remove the offending post. Seeing this message does not mean your post was automatically removed.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/smallbusiness) if you have any questions or concerns.*"]