[{"post_title": "[OT] SatChat: What types of characters do you find most relatable? (New here? Introduce yourself!)", "post_url": "https://www.reddit.com/r/WritingPrompts/comments/1bxfex6/ot_satchat_what_types_of_characters_do_you_find/", "post_main_text": "[**SatChat! SatChat! Party Time! Excellent!**](https://i.imgflip.com/6sreaq.gif)\n\nWelcome to the weekly post for introductions, self-promotions, and general discussion! This is a place to meet other users, share your achievements, and talk about whatever's on your mind.\n\n## Suggested Topic\n\n**What types of characters do you find most relatable?**\n\n(*This is a repeat topic.  Have any suggestions for new ones?  Let me know below!*)\n\n---\n\n## More to Talk About\n\n* New here?  Introduce yourself! See the sticky comment for suggested intro questions\n* Have something to promote? (Books, subreddits, podcasts, etc., just no spam)\n* Suggest topics for future SatChats!\n\n *Avoid outright spam (don't just share, chat) and not for sharing full stories*\n\n---\n\n[**Apply to be a Mod**](https://www.reddit.com/r/WritingPrompts/comments/1av2k6r/modpost_call_for_moderators/) | **r/WPCritique** | [**Discord Server**](https://discord.gg/writingprompts) (Weekly campfires every Wednesday at 6 pm CST!)", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "**Tell us about yourself!**\n\n* Where do you live (State / Country)?\n* Preferred pronouns?\n* How long have you been on Reddit?\n* How long have you been on r/WritingPrompts?\n* Do you use r/WritingPrompts to read or write?\n* Writers:\n * How long have you been writing?\n * What is your writing motivation?\n * What programs do you use to write?\n * How fast can you type? [Try 1 minute on Aesop's fables](https://www.typingtest.com/PromoD/select.html)\n* Readers: \n * How do you find prompt responses to read?\n * Do you also write?\n * if not, why haven't you tried?\n* Want to share a photo? [See our Photo Gallery!](http://www.reddit.com/r/WritingPrompts/wiki/pics)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*"}, {"comment_author": "ZachTheLitchKing", "comment_text": "**What types of characters do you find most relatable?**\n\nThe characters I find most relatable are characters that I feel some strong emotional overlap with.  Qualities like this include:\n\n* **Tired** \\- A character who is just exhausted with *something*.  Whether it's physically tired of the day, tired of dealing with someone or something, tired of the stress, or just *anything* that makes their shoulder's slump and that slight, mouth-agape-frown.  Think Tony Stark from Infinity War dealing with the Guardians of the Galaxy.  Think Kratos from the new God of War games.  People who just want to rest but *can't*.\n* **Confused** \\- A character who has no idea what's going on and can't figure it out.  A fish out of water.  A peasant being paraded around in a royal court, unaware of the political intrigue.\n* **Overwhelmed** \\- A character who *does* know what's going on but can't do anything about it.  There are too many things to deal with, too many lives in the balance, too many sides to negotiate.\n* **Willfully Ignorant** \\- A character who knows there's more than what it seems but is choosing (for various reasons) to overlook it.  Burn down that building that they've been assured is empty and not full of children to save their loved one?  Whelp it's a good thing it's night and they'll be well out of earshot before any screaming may or may not be heard.\n* **Angry** \\- Straight up angry characters.  Not emotionally brooding ones who are silently seething with a smile as their victems chat calmly around them.  Give me Kylo Ren roaring in rage as he slashes up computer consoles impotently with his lightsaber.  Give me Hulk."}, {"comment_author": "MajorParadox", "comment_text": "Good choices!"}, {"comment_author": "xwhy", "comment_text": "If they're relatable, they're good, or there's good in them that can be brought out. Maybe life is good, maybe they're troubled (and there's the conflict). Even my demons have their moments. The rest have an absence of the above, making them less relatable, which is good because I don't need you relating with my evil villains.\n\nAliens are relatable, too, even the ones that aren't humanoid. Most of the ones in our local area are, but as you move farther out, they get stranger, but they all seem to have some human emotion that the reader can grab a hold of. \n\nI have a lot of relatable characters, some more than others, over in r/xwhy. A couple of those stories are appearing my new book, which is being self-published today."}, {"comment_author": "MajorParadox", "comment_text": "That's a good point about villains, but I wonder if relating to villains at least a little help make them feel more real?"}, {"comment_author": "xwhy", "comment_text": "The ones that aren’t meant to be redeemable usually have some variation of a deadly sin attached to them\n\nI generally leave out hobbies that folks might relate to and then be offended \n\nNo problems offending readers but over the “right” things"}, {"comment_author": "ThrowDirtonMe", "comment_text": "Hi I’m new here! I have loved writing since I was a kid. I have a blog now and I was looking for more ideas.  \n\nThe characters I relate to are ones with an arc. We don’t all start out as heroes and I think that’s important to remember. I like to see myself in someone who’s doing their best to learn and grow from a bad situation. And as a writer there’s so much to play with on that journey!"}, {"comment_author": "MajorParadox", "comment_text": "Yeah, the journey of the characters can be so much fun to explore!\n\nAlso, welcome!"}, {"comment_author": "ThatCrazyThreadGuy12", "comment_text": "Characters whose problems take time to solve, and require introspection, reflection, communication, and time. Problems where some BS power, or mcguffin would be absolutely useless."}, {"comment_author": "MajorParadox", "comment_text": "Yeah, that sounds like it'd make them more believable"}, {"comment_author": "ThatCrazyThreadGuy12", "comment_text": "Yeah, and the funny thing is, you can absolutely HAVE a character who has some OP power, or mcguffin but STILL struggles with those things (a key example being Superman, dude's OP as shit, but still has to grapple with the worldly consequences of wielding such power alongside a conscience)."}, {"comment_author": "Tregonial", "comment_text": "Looking back at my writing and the fiction I consume, I seem to relate to and enjoy non-human characters who find humans confusing, yet still are kinda human in their own way. They have so much power, but all the magic in the world and within their grasp can't solve their social awkwardness and struggles to live alongside others, relate to humans and the people they try to care about.\n\nIt probably stems from growing up as a gifted and neurodiverse child who could never fit in with everyone else in school. I could count the number of friends I keep in touch with from my schooling years with one hand. Always felt like some weirdo alien wearing a human skin who never understood all these hidden social rules and facial cues.  And despite how everyone says I'll be able to figure out all these emotional, human things eventually, stop alienating people by strange behaviors and being really weird abt things because \"omg you're so smart why can't you get it?\"...I still don't. Still fucking clueless as hell.\n\nSo, sometimes, I give my non-human characters someone I wish I had. A human foil and friend to bounce off. A nice human to show them the good in the world.\n\nIn retrospect, its a recurring pattern in my responses to writing prompts. And for some reason the non-human is usually male and the nice human is female, I don't know why.\n\n[Elbert](https://www.reddit.com/r/WritingPrompts/comments/1bsts4h/wp_every_time_you_die_you_receive_points_based_on/kxije2i/) has Samantha, Laura is the only one who believes [Mr. Hopper](https://www.reddit.com/r/TregonialWrites/comments/1brmogt/youre_a_dimensionhopper_who_can_walk_through/kx9y9c8/) can save all the worlds, [Lord Elvari](https://www.reddit.com/r/WritingPrompts/comments/1ayhpss/ot_fun_trope_friday_writing_with_tropes_road_trip/ksiiwqh/) has Kat, Sarah is supportive of [Vindalos](https://www.reddit.com/r/WritingPrompts/comments/1ajh22c/piscientists_revive_a_dead_god_through_prayer_and/), and there's definitely others I don't remember right now.\n\nAs for me, having joined WP reddit and discord, it feels like the Fun Trope Friday (FTF) gang is the \"nice human\" to the silly tentacle writer here. So, I'd like to give a shoutout to u/katpoker666 for making me feel welcome and u/Dependent-Engine6882 for being my favourite fangirl. Thanks ladies."}, {"comment_author": "katpoker666", "comment_text": "Thanks for the kind words, Tregonial. We’re lucky to have you at FTF: you’re a great writer and a lot of fun! :)"}, {"comment_author": "MajorParadox", "comment_text": "Oh yeah, it's always fun when a non-human character is confused by humans. It kind of has that \"fish out of water\" thing to it."}, {"comment_author": "Goodlake", "comment_text": "\n\nHi all, been posting/commenting for a while but haven't really engaged in OT discussions! Recently took a writing course where I learned the value of peer feedback / interactivity, and so I'm going to try to be more active here as a reader/commenter and not just a writer.\n\n* **Where do you live (State / Country)?** New York, USA\n* **Preferred pronouns?** He/Him\n* **How long have you been on Reddit?** A little over ten years\n* **How long have you been on** **?** [9 years, it looks like!](https://www.reddit.com/r/WritingPrompts/comments/2ht5op/comment/ckvtfe1/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)\n* **Do you use**  **to read or write?** Mostly to write, but I'll usually read the other top level replies when I write something.\n* **How long have you been writing?** Since elementary school! I've always found little creative writing projects to do. Lately, I've been trying to focus my attention on longer form projects, but short form just seems to hit the sweet spot for me.\n* **What is your writing motivation?** Hmm, it depends on the format. With [](https://www.reddit.com/r/writingprompts/), I like to view the prompts as puzzles to be solved, or a chance to exercise certain muscles (e.g. scene description, dialogue, inner monologue, etc). Overall, I'd say I'm motivated by the desire to shape ideas into coherent, relatable and funny bits in order to court sweet, sweet upvotes.\n* **What programs do you use to write?** For longer form things, Scrivener. For [](https://www.reddit.com/r/writingprompts/), I'll either sketch things out in Word or I'll just type it up in the reply box.\n* **How fast can you type?** [Try 1 minute on Aesop's fables](https://www.typingtest.com/PromoD/select.html) 104 words per minute, according to the link! However, my laptop is elevated, and I'm sure if I put it directly on the desk, I could do it faster.\n\nAs for the OT post: interesting question. There are all sorts of things I find relatable in all manner of characters. That's the goal of good character writing, after all, isn't it? To color them with the sort of characteristics that make them feel real and... relatable. However, the characters I most *enjoy* reading are dry wits (e.g. Wodehouse's Jeeves) or the delusional and grandiose blowhards (e.g. Ignatius J Reilly)."}, {"comment_author": "MajorParadox", "comment_text": "Good answer! As a writer, you're kind of starting by making them related to you. And then that can translate to your readers."}, {"comment_author": "Alternative-Fun-7706", "comment_text": "I know they’re overdone and stereotypical but my number one would have to be the anxious main character who comes into her own. It’s really easy to write in that rambling type of style that’s mainly her inner monologue. I find it an amusing angle to read from as well because I myself am anxious and then compare if I’m like that while laughing at myself. \n\nAnother would be the over-possessive male. Easy to write for and I just enjoy writing out details of body language and facial expressions. Reading for that character gives inspiration. Plus it’s just- everywhere right now on BookTok. \n\nI enjoy overwhelmed characters that sort of ties into anxious. When they finally have their moment and explode it’s always a cathartic read. \n\nI would say that finally I enjoy the quiet guy. He doesn’t say much, but he’s always incredibly kind to the main character and it makes me smile 😊"}, {"comment_author": "MajorParadox", "comment_text": "Yeah, any type of quirk like that makes the character more grounded, instead of seeming perfect."}, {"comment_author": "Nobody9189", "comment_text": "The character i find the most relatable are characters who simply don't care and just want to live  quiet life\n\nA.) These characters are the most realistic, in my opinion. Chances are, should anyone be sent to an alternate world or anything, they won't run around doing edgy stuff or killing demon lords or any of that. They would probably settle down somewhere and live peacefully while following the law and the economy. (fr most of you won't even last in a swordfight because of the weight alone, no matter what anime or movies say)\n\n&#x200B;\n\nB.) I find characters that don't care to be funny, and also, there is some edgy satisfaction in knowing you can fix a problem yet choose not to because it's not your problem, to begin with (ie. not getting involved in a fight because you don't care and not because of some ideological stuff or moral stuff) and its probably not even worth the hassle to get involved (ie. you can get in trouble or have the blame pinned on you if you interfere)\n\nC.) Not only are these types of characters carefree in that no plot device can necessarily compel them to move towards anything, but morality is fairly flexible for these characters, making them easier to write. They don't get boring because I can easily just model the story however I want to without writing myself into a corner because I made them too evil or too good or any of the typical traps authors get trapped in.\n\nD.) Power is not necessary for these characters, and they are probably the most flexible. I can use them for an action story, a wholesome story, a comedy story, etc., without having to change them much, and these characters, beyond being good protagonists, also make good likable side characters due to their reliability.\n\n&#x200B;\n\nE.) Greatest of all, authors bias.\n\nThis type of character is my favorite and reflects how I am in real life more than other characters, so yeah. Human bias does its thing yet again"}, {"comment_author": "MajorParadox", "comment_text": "Well said! That makes a lot of sense such a character would want to avoid the action, but they may get pulled into it anyway!"}]}, {"post_title": "[OT] Writer's Spotlight: brknside", "post_url": "https://www.reddit.com/r/WritingPrompts/comments/1byvl0c/ot_writers_spotlight_brknside/", "post_main_text": "&nbsp;\n\n# Welcome to Writer’s Spotlight\n\nRemember, spotlights rely on your nominations! So if there's anyone around the subreddit whose stories you love and you think deserves a shout-out, please do nominate them by sending us a [ModMail](https://www.reddit.com/message/compose?to=/r/WritingPrompts).\n\n&nbsp;\n\n***\n\n&nbsp;\n\nThis week we are celebrating u/brknside\n\nBrknside is another of those users that I think many of us would have assumed had already been spotlit. Over the years, they’ve graced us with many a beautiful piece in Theme Thursday, showing off their prose and poetry skills. And speaking of poetry, they’ve also recently become a regular in our Poetry Corner feature. As well as being able to pull on our heartstrings and suck us into their stories with wonderfully vivid descriptions, they’re also more than capable of injecting a healthy dose of humour into some of their pieces. Plus, as well as sharing their words with us, they’re also great at sharing advice and feedback with other writers. You can find more of their work on their profile, and I definitely recommend that you go and take a look.\n\nWant to congratulate this week's Spotlight recipient? Have questions you're dying to ask them? Please do so below in the comments!\n\n\n&nbsp;\n\n#Congrats on your spotlight /u/brknside\n\n\n&nbsp;\n\n***\n\n&nbsp;\n\n# Read u/brknside’s most recent piece:\n\n&nbsp;\n\n[[OT] Poetry Corner: Death](https://www.reddit.com/r/WritingPrompts/comments/1bjlz4r/comment/kx4roq1/)\n\n&nbsp;\n\n# Their most upvoted Stories:\n\n[[TT] Theme Thursday - Full Moon](https://www.reddit.com/r/WritingPrompts/comments/17h2mtv/comment/k6lecnt/)\n\n&nbsp;\n\n[[TT] Theme Thursday - Legend](https://www.reddit.com/r/WritingPrompts/comments/1bkdyq2/comment/kwe38oh/)\n\n&nbsp;\n\n[[TT] Theme Thursday - Fickle](https://www.reddit.com/r/WritingPrompts/comments/16cnuct/comment/jzyw9yo/)\n\n\n&nbsp;\n\n***\nTo view previously spotlit writers visit our [Spotlight Archive](https://www.reddit.com/r/WritingPrompts/wiki/showcase). \n\n&nbsp;\n\nTo make a nomination please send us a [ModMail](https://www.reddit.com/message/compose?to=/r/WritingPrompts) telling us which user you are nominating. If you’d like to include a reason for your decision we’d love to hear it!\n\n***\n         \nLike features?\n\n* Try your hand at constrained writing with [SEUS](https://www.reddit.com/r/WritingPrompts/wiki/smash)\n\n* Grow as a writer with [Talking Tuesday](https://www.reddit.com/r/WritingPrompts/wiki/talking)\n\n* Practice poetry at our monthly feature: [Poetry Corner](https://www.reddit.com/r/WritingPrompts/wiki/wildcard/)\n\n* Create a story using the weekly theme for [Theme Thursday](https://www.reddit.com/r/WritingPrompts/wiki/theme_thursdays)\n \n* Check out our newest weekly feature [Fun Trope Friday!](https://www.reddit.com/r/WritingPrompts/comments/11u2hbp/ot_fun_trope_friday_writing_with_tropes_reluctant/?utm_source=share&utm_medium=web2x&context=3)\n\n* Chat with other writers with [SatChat](https://www.reddit.com/r/WritingPrompts/wiki/sps)\n\n* Share stories you’ve written on (or off) the subreddit and receive feedback via our campfire events on our [discord server](https://discord.gg/writingprompts)\n\n***\n\n[Come hang out on our discord](https://discord.gg/writingprompts). Meet other members from around the globe and chat about anything. We are a friendly bunch and love newcomers. We also have regularly scheduled readings over voice chat!\n\nLove the community and want to take on a more active role? [Apply to join the moderation Team!](https://www.reddit.com/r/WritingPrompts/comments/8zifl5/modpost_call_for_moderators/)", "post_comments": [{"comment_author": "rainbow--penguin", "comment_text": "Congrats bork! Definitely a well-deserved spotlight!\n\nNow, as is tradition, time for some fun questions!\n\n1) What do you enjoy most about writing?\n\n2) If you could swap places with a corgi for one day, would you?\n\n3) Do you have a favourite piece you've shared on the subreddit, or one that you think best encapsulates your writing?"}, {"comment_author": "brknside", "comment_text": "Thank you so much!   \nSo...  \n1) Honestly the process of writing is like a puzzle to me. Trying to find the right pieces to work together to evoke what I want from a piece is the fun part. Seeing it come together into something from nothing. Probably why I like to try poetry so much. Getting the right cadence and rhymes is so much fun.  \n  \n2) Are you saying I'm not already a corgi?! Seriously (hah because this is serious), I absolutely would. If nothing else so I can get like 20 hours of sleep. Just sploot on the floor and nap a day away. Sounds like heaven.  \n  \n3) My favorite piece is probably [this](https://www.reddit.com/r/WritingPrompts/comments/dt3xta/tt_theme_thursday_poetry_challenge_mirth/f7djw5a/) one from a long time ago. I won't spoil it but it has a special place in my heart."}, {"comment_author": "rainbow--penguin", "comment_text": "Thanks for the answers! \n\nThat's a great way of describing writing, though perhaps not for poetry for me. The puzzle pieces never seem to fit together very well when I do it.\n\nAnd I often think the same about the life of a cat. Sprawling in the sun being brought food and toys.\n\nAnd that is a wonderfully wholesome, sweet piece. Thanks for sharing!"}, {"comment_author": "katpoker666", "comment_text": "Congrats u/brknside! Aka Bork. Your poetry feels alive at times in its flow: truly beautiful and inspiring. I always look forward to it at TT and you never disappoint!\n\n1) what / who are your poetic inspirations?\n2) how did you get into poetry?\n3) any tips for the rest of us on rhythm and flow? It may be all down to Bork superpowers which is also a fair answer! :)\n\nThanks and congrats again!"}, {"comment_author": "brknside", "comment_text": "Thank you!  \n  \n1) My favorite poet is probably Robert Frost. His stuff on nature is just absolutely beautiful. Though I respect anyone who does poetry. It's such a powerful medium.\n  \n2) Pretty sure it was a Theme Thursday that had some sort of bonus for doing a poem and I thought why not. Was immediately hooked.   \n  \n3) Best tip I got was actually from observing my wife and that is reading your piece out loud. It may look great on paper and sound fine in your head, but something about reading it really finds those mistakes in flow."}, {"comment_author": "ZachTheLitchKing", "comment_text": "Hork! It's Bork!  Congorkulations!\n\nQuestions!\n\n* Coffee or Tea?\n* Cream and/or Sugar?\n* Do you consider yourself a planner or a pantser when you write *and* how much have you tried the other plotting style?"}, {"comment_author": "brknside", "comment_text": "Thanks Zach! Hitting me with the hard questions I see.  \n    \n1) Tea all the way.  \nB) Neither. Lemon please.  \nIII) I am 97.5234% a pantser. I may sometimes make a very basic outline of what my thoughts are but the writing usually decides to ignore that anyway. I should try and plan more but then I wouldn't be surprised by my characters as much."}, {"comment_author": "ZachTheLitchKing", "comment_text": "A: Same!  But this morning I *needed* quick caffiene and my electric kettle broke D:  So I tapped into my partner's coffee supply.\n\nII -  Interesting answer; highly dependent on the tea your choosing, so I'll withhold judgement.\n\n&#x200B;\n\n* &#x200B;\n   * &#x200B;\n      * Great answer!  Overlaps with mine own very closely.  I will say in defense of some light-planning, the feeling of \"Oh this is exciting I can't wait to get to this point\" can sometimes match - and, dare I say, potentially *exceed* \\- the feeling of \"Wow I can't believe my character made this choice!\" surprise.  *Especially* if people reading your story are commenting theories that are close but not quite on the money; then you get to enjoy *their* surprise instead :D"}]}, {"post_title": "[WP] You were just sucked up and abducted by a UFO. The alien inside addresses you, \"Is this translator working? Listen. I need you to pretend to be my boyfriend for three days so my parents will get off my back about it.\"", "post_url": "https://www.reddit.com/r/WritingPrompts/comments/1bymjbb/wp_you_were_just_sucked_up_and_abducted_by_a_ufo/", "post_main_text": "", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n>* [No AI-generated responses &#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n>* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n>* Responses don't have to fulfill every detail\n>* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22&restrict_sr=on&sort=new&t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22&restrict_sr=on&sort=new&t=all) for stricter titles\n>* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n&#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n&#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n&#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n&#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*"}, {"comment_author": "CameoShadowness", "comment_text": "\"Only 3 days? If we *break up* they might get on your butt again\""}, {"comment_author": "Scorppio500", "comment_text": "\"But I'm a girl?\" Emily is my name, but the alien wants me to be her boyfriend? I guess I look the part. Not sure how I feel about that. \n\n\"Doesn't matter. Tie your hair in that ponytail configuration you earthlings use.\" The alien is a weirdly beautiful blue skinned, four armed alien with long silky smooth green hair. She has six amethyst eyes and three rows of razor sharp jagged teeth. Not gonna lie, If I swung that way I'd be completely smitten. She's gorgeous. \n\n\"Are you, uh, sure your parents won't notice their daughter is 'boyfriend girlfriend' with a human female?\"\n\n\"They're not gonna check you. \\[translator error\\]'s honor.\"\n\n\"Okay. But you had better make it worth my while.\"\n\n\"You have my word. I'll do what I can to repay you. Put this on.\"\n\nShe flogs me the same type of clothing she has. A skintight body suit with armor plating and a fur collar. She handed me a scrunchy that had clearly been retrieved from the side of the road somewhere. I quickly disrobe behind some cover and change into the weird alien suit and do my hair up. \n\nThe alien washes my eyeliner and mascara off. Her eyes sparkled after she was done. I know that look. \"*Cute*\" I bet she thought. Never mind, though. I guess it's time to get into a transport and head off to meet the alien's parents. \n\nWe didn't go immediately. Apparently the alien needed evidence to show off to her parents. We'd be making for the whole parental meet'n'greet in a couple days. Over the course of the next day and a half, she took me to an alien theme park, a stargazing tour which was really a bunch of trips to other planets to look at local cultures' constellations, and two very nice dinner dates. All the while she lied via her social media that I was the one that took her to all these things. \n\nThe alien theme park is the most interesting theme park I've probably ever been to. Instead of rollercoasters there were Momentum Runs. You become basically an Oozoid from DND and you slip and slide around a very slick pipe. The feeling is unlike anything I've ever witnessed. Instead of bumper cars you have what the theme park called Zap-Your-Friends, which is just a UFO ride where you pilot your own open cockpit UFO and shoot your friends with nonlethal static shock levels of electricity. Probably 500 volt three nanosecond pulses. They also have food from all over the universe for you to enjoy. You're scanned and food from their stock that you can eat illuminates on a picture menu. Point to it, pay in the equivalent of whatever currency you have and enjoy. There are a few arcade games, some from Earth, most from everywhere in the galaxy, and there are even some conventional Earth carnival rides. \n\nThe stargazing tour took us to so many planets. The local people spoke through more universal translators about the cultural significance of their constellations. I couldn't help but draw on the similarities. We immortalized gods and warriors in the heavens. So too did so many other civilizations. On one of the planets, we were asked if anyone was from Earth. Only I raised my hand. I was greeted in English by the tourguide. A hunched over, saurian, four legged and four armed warrior type creature about twice the height of a grizzly bear on its hind legs beckoned me over and groveled at my feet. It is a Silvalek. This member of a warrior race, as well as the rest of his entire race, apparently worship humans as gods. Beats me as to why. Thankfully I didn't stay around long. \n\nThe dinner dates were honestly some of the best I ever went to. All my food was delicious, even if the alien fare looked absolutely awful. Turns out the alien I'm with is a carnivore. Some of the meat she was eating looked a lot like vegetables, or what I could assume was a vegetable. We went to the home of the Silvalek for one of the dinner dates. At this point, the alien was just trying to mess with me. Even the Silvalek king King Throk came and bid me homage. Literally hundreds lined up outside to fall to their four knees in worship. Silvalek are also carnivores and their staple food is, in Human language, Irik. Irik are chihuahua sized lizard cats that the Silvalek keep as a \"staple crop.\" They taste... Like a weird mix of pork and chicken. Despite the fattiness of some of the cuts, the meat tastes very good. I felt really invigorated after eating it. Must be packed with nutrients and energy. Enough to supply a two-ton silvalek warrior. \n\n\\[1/2\\]"}, {"comment_author": "Scorppio500", "comment_text": "\\[2/2\\]\n\nAfter our dates, and a good night rest, it is finally time to meet the parents of the alien. Throughout all this, she had never given me her name. So while we were en-route to her parents' house, I asked her. \n\nShe looks at me with those beautiful amethyst eyes and says her name. \"Amethyst.\" I smiled in relief. It's not something I can't pronounce. \n\n\"I don't believe I caught your name,\" she says. \n\n\"Oh, right. I'm Emily. But just call me Emile. At least... until we're clear of your parents.\" I smile sheepishly. Really should've introduced myself early on. Awkward. We both end up smiling awkwardly. \n\n\"Okay, Emile, I'm sure my parents will love you!\" Amethyst giggles a bit. God, she's so pretty. \n\nOur little transport docks at a big alien starport. Giant bugfolk check us in for disembarking and come aboard to do a security sweep. Finding a me, a human, they say something to Amethyst in their bugspeak which my translator has a hard time deciphering, but the gist of it was that I need a pressure suit. The bugs exit the airlock and return with a measuring device. They scan me with it, and the space suit they brought in seems to change in size to match my size. I quickly put it on over my clothes. \n\nAmethyst doesn't need a pressure suit. Just a breathing mask. Apparently the reason for all this is because the docking bays area is all depressurized due to a malfunction in the airlocks. Some meddling Lombax accidentally blew the hyperbolic rayshield stabilizers trying to make it function better. At least they tried. I noticed the bugfolk didn't seem to need pressure suits. I guess their exoskeleton and tubes on their tubercles were all they needed. \n\nI was helped along by a bugfok, whose species I learned to be a Hektar, to walk across the low gravity section into the artificial gravity field. It was much easier to walk after that. \n\nThe meeting itself? I had been dreading it for some time. Turns out, it was totally fine. Amethyst's parents are really cool and they knew enough about humans to scare me into thinking the entire ruse would be for naught. But turns out, the ruse did in fact work. Her parents approved of me and we finally got to go back to Earth. \n\nUnfortunately upon departing from the place, Amethyst gets a text message on her comm unit. \"Make sure to bring Emile back with you sometime next week! We want to have him over for dinner! Get to know him a bit better!\" Amethyst looks at me with an \"oh shit\" look in her six beautiful eyes. \n\n\"I guess,\" Amethyst says \"You're going to have to keep doing this for awhile, eh?\"\n\nI look at her and smile. \"If you bring me to places like you've been doing, sure. But why not come spend time on earth? I'd be happy to have the company.\" \n\nAmethyst looked at me joyfully. That smile could light up a city. \"Really? You'd do it? Oh thank you! My parents can be the worst!\"\n\n\"No, really,\" I said, \"I'd enjoy it very much. You're kinder than most humans I've met, and not gonna lie, you're gorgeous. I'm happy just to be around you.\"\n\nWas it impulse? Maybe it was. But as soon as I stopped talking, Amethyst kissed me. On the lips. \"Sorry,\" she said after our lips parted. \"I don't know what I was thinking. I shouldn't have done that just now.\"\n\n\"Why?\" I said. \"It felt nice. You should do that more often.\"\n\nAnd she did. More than a couple times. I stepped foot on earth covered in purple lip marks, and I had the biggest smile on my face. No one will believe me, but that doesn't matter. I guess I've got an alien girlfriend."}, {"comment_author": "brokeanail", "comment_text": "Left me with a smile. This is cute!"}, {"comment_author": "KoolingKatie", "comment_text": "This made me smile as well, it was so cute. Great writing, the imagery and descriptions are on point, and the world building was super cool! I especially enjoyed how you describe the theme park and its attractions, I could picture them easily from your vivid descriptions and they were cool concepts to imagine. Great story!"}, {"comment_author": "Kflynn1337", "comment_text": "Ok, that's cute! Well written world(s) building as well."}, {"comment_author": "mekkanik", "comment_text": "That is so wholesome and sweet"}, {"comment_author": "Stormygeddon", "comment_text": "That meddling Lombax had a robotic accomplice, didn't he?"}, {"comment_author": "Scorppio500", "comment_text": "Glad I could make you smile! :)"}, {"comment_author": "Scorppio500", "comment_text": "Glad I could make you smile! I enjoy trying to be descriptive. Glad you enjoyed it!"}, {"comment_author": "Scorppio500", "comment_text": "Thanks!"}, {"comment_author": "Scorppio500", "comment_text": "❤️ "}, {"comment_author": "Scorppio500", "comment_text": "Wears it like a little backpack too. :)"}, {"comment_author": "Beautiful_Business10", "comment_text": "\"Uh...\"\n\nIt felt like a short in my brain. I was unable to process what I was seeing, much less what had just been asked of me.\n\n\"Satish. It must ve broken,\" the girl said, turning the oblate cylinder over and looking at the base. I blinked, and raised my hands.\n\n\"No, no, not broken, I understood you just fine.\" I put a hand on my hip, raising the other one, palm up, to wave at her...ship? sitting in the middle of my corn field. \"But...really? This is the sort of thing we read in cheap tabloids at the supermarket or on downvoted posts on reddit.\"\n\nShe turned and looked back at her ship, then back at me. Her eyes went from my face, down my bare chest and jeans, to my boots. Then, she looked past me at the small house.\n\n\"I am so sorry for being cliche like this,\" she started apologizing. For a cerulean-skinned, hairless alien, she was surprisingly human in form and mannerisms. \"We've seen some of these stories and how they always involve orifice probes and never people from cities and—\"\n\n\"Well, you didn't make that mistake this time...I moved out here to get away from the constant crowds of the city.\"\n\n\"So you're not a...hick?\"\n\n\"I probably would be now; but I used to be an urban video game player.\"\n\nShe smiled, and her evenly-colored, pupilless jade eyes seemed to sparkle. I noticed her teeth seemed to be unusually smooth and even; but after a few seconds, I realized she had only two \"teeth,\" one above and one below, like an animal trap.\n\n\"Look, Miss..?\"\n\n\"Kyliasha,\" she supplied, \"but call me Ky.\"\n\n\"Ky. Let me get my shirt from the tractor seat, and we can go inside and talk about it for a few minutes over coffee.\"\n\nI turned and pulled the t-shirt—an old G'nR shirt my dad had had—from the seat. As I doffed my straw cowboy hat to pull it on, Ky turned toward her ship and pressed a few entries on a device on her forearm. The four-winged, ovular teardrop share seemed to shimmer before dots on its surface began to disappear, like falling rain drops soaking the surface into invisibility.\n\nAs we walked back to my house, I had to ask the question.\n\n\"So, Miss Ky, you seem very human, aside from a couple of surface differences.\"\n\n\"Oh? Well, that's probably because I am. Or perhaps you're Nirau...that's my base species. It's a common physiological template for carbon-based macrocellular species across the galaxy, with a studied genetic compatibility that hints all Nirau—and possibly your species as well—share a common ancestor species, long since lost to time, with differences being largely the result of adaptation to different environmental circumstances.\"\n\n\"So...you actually *are* a girl?\"\n\n\"Would you like to confirm?\" Her fingers went to her suit collar, and I held up my hands.\n\n\"No! Nono no, I'll take your word for it. Not going to take advantage of the pretty girl with blue skin who asked me on a date.\"\n\n\"You are physically attractive yourself...\"\n\n\"Thomas. Or Tom.\"\n\n\"...Tom.\" She smiled up at me again, and I could feel my heart thumping in my chest. She seemed to look away before saying,\n\n\"It wasn't strictly by chance. I've been scouting you for two days...when you aren't farming, you have a healthy stream of communication in and out, and you are physically quite attractive. Your residence indicated you are unattached. So...I made contact. And I really *am* in quite a bind on this matter, so I do hope you'll say yes.\"\n\n[TBC]"}, {"comment_author": "Kempeth", "comment_text": "It was a weird sensation. A Tingling that gradually spread from my extremities to my very core, accompanied by an eerie huming sound. And to the eyes it felt like the visual equivalent of a shoddy music crossfade on the radio. One moment I was walking from the shower back to my room, the next moment I'm standing on a kind of glass pedestal. A girl, roughly my age, was standing opposite me behind some a podium or console. She excitedly tapped a few buttons before she rushed over to me. *\"Is this translator working?\"*\n\n\"Huh?\" was the first somewhat coherent word that made it past my hangover from last night. \"What happened? Where am I?\"\n\nThe girl spoke some words I couldn't recognize, then the whole room underwent a noticable jolt, like a train that began to move. *\"Listen. I need you to pretend to be my boyfriend for three days so my parents will get off my back about it.\"*\n\n\"Kathrin?\" - *\"Yes! You remember!\"* Even in my groggy state she was impossible not to recognize. Cute as a button, delicate freckles, gorgeous auburn locks, she was even still wearing her pitch black contact lenses. I was kicking myself the whole way home and then some for not asking her number. But wait a minute!\n\n\"Yes! I was hoping to see you again. But I would still like an answer to my questions!\" My synapses were slowly starting to fire. Kathrin had coaxed me off the glass platform and we were now standing on the *softest* carpet of the world, possibly even the universe. The walls were intricate and luxurious, violet and purple patterns with gold trims. Between them metallic frames and to you right a handleless door with strange characters printed on it.\n\n*\"Of course, but lets go to the lounge. Do you want something to drink?\"* - \"Oh yes, please! I slightly overdid it last night!\" We made our way into a narrow corridor past some stairs to another door. As it opened it revealed a massive seamless window front through which I could see stars streak by more impressively than a long exposure of the perseid meteoroid shower. I could not help myself but stagger back from the awe of it.\n\nAfter I had regained my composure, we sat down at a table, breakfast appeared out of thin air and equally long awaited explanations started to come forth as well. Yes, this was a starship. Yes, we were travelling faster than light to her home system. And no, she was not wearing contact lenses. She was an alien from an influential family on her planet and she needed someone to accompany her to a relative's wedding.\n\n\"That... raised at least as many questions as it answered!\" - *\"Like?\"* - \"Your name is Kathrin? Not Klibrit or something more alien sounding?\" - *\"Well... It is a... reasonable rendering in your language and it's adorable that after all these revelations this is your first question about all of it. But please, if they are to believe us, you should call me Imzadi\"*\n\n(I'll try to continue later)"}]}, {"post_title": "[WP] Today there is a solar eclipse set to cover the sun with 100% totality for a duration of 4 minutes, 28 seconds. However as time passes, the eclipse continues for 5 minutes, then 7, then 10. Half an hour passes but the moon has not moved and Earth remains in darkness", "post_url": "https://www.reddit.com/r/WritingPrompts/comments/1byxi1t/wp_today_there_is_a_solar_eclipse_set_to_cover/", "post_main_text": "", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n>* [No AI-generated responses &#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n>* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n>* Responses don't have to fulfill every detail\n>* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22&restrict_sr=on&sort=new&t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22&restrict_sr=on&sort=new&t=all) for stricter titles\n>* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n&#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n&#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n&#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n&#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*"}, {"comment_author": "CookieEaterTheGreat", "comment_text": "What about the people who only get like 50% of solar eclipse in their region"}, {"comment_author": "a15minutestory", "comment_text": "Rubes.\n\nWhat did they expect to happen?\n\nOh, wow, it's dark out. It does that every evening for eight hours.\n\nI wasn't about to be caught in gridlock traffic just to stand in a crowd on a hill staring up at the sky with my mouth open like some slack-jawed moron. Why did the moon's shadow have to pass over my house directly? Door Dash was going to cost me a bajillion dollars because everyone wanted to come see this thing. My dad and sister were all abuzz about it, calling me an old stick in the mud, but if Mom were alive, she'd understand. \n\nI paused my game and looked out the window. It was still dark out. I checked the clock on my PS5 interface. It should have ended by now. I shrugged and loaded in for another game. When the round finished and the results screen detailed everyone's scores, I looked through the window again.\n \nStill dark.\n\nAfter a couple more games, I checked my phone. It looked like every source clocked the eclipse at only about 5 minutes— at the least the total darkness part of it. And my house was about 15 minutes away from an area where you could view the eclipse in its full totality. It wasn't adding up.\n\nAfter an hour of darkness, I decided to call my dad. Then my sister. Then my cousins. \nAll straight to voicemail. \n\nI shut the game off, grabbed my keys, and left the house. I didn't look directly at the eclipse, but it was definitely still hovering there. I hopped in my car and pushed the start button. I knew where my family was. They had secured a reservation at our church's retreat. It was private property, and they were charging $10 a person to try and thin out the big families that had come together from other areas.\n\nThe road was completely clear. I hadn't seen anything like it since the height of Covid. I cruised down the interstate all the way to the retreat and pulled into the packed parking lot. I took a handicapped spot right next to the door and made my way inside. I walked through the quiet empty building and out the other side.\n\nAnd when I passed through the door and stepped out onto the walkway, the sight was chilling.\nHundreds and hundreds of people stood, nearly shoulder to shoulder, staring up at the eclipse through special glasses meant to make the viewing safe. Their mouths were wide open, their faces frozen, twisted up in an expression of surprise and horror. It made the hair on the back of my neck stand up. \n\nAnd it had everything to do with the silence. \n\nNobody was talking. Nobody was moving. It was as though they had been petrified in place. I slowly walked up to one of them and waved my hand in front of their face. No response. I looked to the next. \n\n\"Hello?\"\n\nNothing. \n\nNow I was worried.\n\nI began pushing through the crowd, calling for my dad and my sister. After combing through the masses for several minutes, I began to realize how hopeless the endeavor was. It was playing Where's Waldo from a ground perspective. I quickly checked my phone to see if this phenomenon was worldwide, but there was nothing about it yet. \n\nIn a fit of frustration, I turned to the nearest woman and shook her by the shoulders, yelling in her face, and slapping her cheeks, but there was no response at all. I walked up to the man next to her and plugged his nose, stuck my finger in his mouth, and finally shoved him. He didn't bother to keep his balance. He fell backward into the guy behind him and sort of just leaned there like he was all drugged out.\n\nFinally, I snatched the glasses of the woman and put them on. I turned around and stared up at the eclipse. My body turned instantly cold. My breathing stopped. I heard a snapping a sizzling sound just beneath my skin as I stared up at the monster in the sky.\n\nIt was wholly indescribable no matter how long I beheld it. \n\nIt took up almost the entire sky. Its body was shiny and black. Dark appendages that blew gently like giant streamers in the breeze branched off of its main body, where insectoid legs slowly kicked not unlike a bug grasping for solid earth after being picked up. I heard a terrible noise like a boathorn that shook the earth beneath my feet. I began to hear screaming all around me, but the voices didn't sound like people's. \n\nIt was a high-pitched screech— a noise one might expect from a deep sea creature communicating to others around it. \n\nI felt my stomach tighten. I couldn't look away.\n\nI didn't want to look away.\n\nI liked being cold.\n\nI didn't need to breathe.\n\nAnd the sizzling under my skin was like a spa day for my muscular system.\n\nI felt completely relaxed. And as the creature drew nearer, I began to understand, almost innately, that the screeching noise around me was the planet itself. The grass, the trees, the shrubs... it all wailed in unison for the first time.\n\nFear? Joy?\n\nI was about to find out which.\n\nr/A15MinuteMythos // reyathenswrites.com"}]}, {"post_title": "[WP] You have plucked up the courage to tell your crush how you feel about her, but she has something she wants to confide in you - she is pregnant and the father is a mythical monster.", "post_url": "https://www.reddit.com/r/WritingPrompts/comments/1byxjt3/wp_you_have_plucked_up_the_courage_to_tell_your/", "post_main_text": "", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n>* [No AI-generated responses &#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n>* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n>* Responses don't have to fulfill every detail\n>* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22&restrict_sr=on&sort=new&t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22&restrict_sr=on&sort=new&t=all) for stricter titles\n>* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n&#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n&#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n&#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n&#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*"}, {"comment_author": "reostra", "comment_text": "[SPLIT YOUR LUNGS WITH BLOOD AND THUNDER!](https://www.youtube.com/watch?v=RqqJM4F63dA)"}, {"comment_author": "TheWanderingBook", "comment_text": "\"I love you!\", I said to Liza, the woman whom I have a crush on ever since I saw her.  \n\"I am pregnant...\", she muttered.  \n\"The legends are true!  \nTrue love can create life!\", I joked.  \nShe punched me in the shoulder.  \n\"It's not yours...\", she whispered.  \n\"Obviously...\", I chuckled wryly.  \nWe were good friends, and I always had a crush on her, but it seems it's not to be.  \n\"So, who's the father?\", I asked.  \nShe bit her lip, and teared a bit up.  \n\"Oh boy, there's a story here.\", I said, going after some snacks.\n\nAfter getting a cup of tea, chocolate, and her favorite potato chips, we were ready to talk.  \n\"He's...  \nHe's not human.\", she said.  \n\"Yeah, considering he's not here, and the way you are talking, he's a pretty big jerk.\", I said.  \n\"No, not like that, well, yeah he is a jerk, but really.  \nHe's not human, he's a jinn.\", she said.  \nI looked at her, at a woman who just won a reward for scientific achievements.  \n\"It must be hard...  \nThankfully, it is our last semester, so you can graduate...  \nAnd I will be there for you, and so will be your parents, I am sure.\", I said.  \nThen, a purple flame lit at the tip of her finger, melting the chocolate bar I tried to just take a bite off.\n\nLooking at her hair slowly turning back to its normal color from a purple-bluish combination, I sighed.  \n\"So, actually a jinn. A supernatural spirit...  \nIs it like western genie, or just generally a spirit?\", I sighed.  \n\"A spirit of some kind.  \nJust came into my room, and...\", she started.  \n\"You don't have to.  \nI am sorry.\", I said interrupting her.  \n\"No, he just touched my belly and said that I will bear his heir before leaving.  \nAlso, he said something about a debt being repaid, which is weird...\", she said.  \n\"Not that weird, in stories, spirits often come to the descendants to ask for a debt to be paid.  \nDebt that was incurred by the ancestors.\", I said.  \n\"No...  \nIt was as if he's paying off a debt...\", she muttered.  \nI sighed, then clapped.\n\n\"So, to my confession, what's your answer?\", I asked.  \nShe stared at me like I was a fool. Well, I was a fool for her.  \n\"You are serious right now?\", she asked.  \n\"I am.  \nWould think a thing or two about this whole situation, if you hadn't just made hot chocolate out of my Snickers bar.\", I said.  \nShe hugged me, and started crying.  \n\"I also love you, but this is not fair...Life is not fair.\", she said.  \nI just hugged her gently.  \n\"It will be alright...\", I whispered."}, {"comment_author": "Gemwriter2", "comment_text": "That's so sweet!"}, {"comment_author": "Tori0is0a0bird333", "comment_text": "\\*sniff\\* Beuatiful!!"}, {"comment_author": "TheWanderingBook", "comment_text": "Thanks, and thanks for the prompt!"}]}, {"post_title": "[WP] \"Noble monster hunter! Thank goodness you're here! We've had to sacrifice a villager to this werewolf each month to keep it at bay!\" \"That is quite possibly the worst course of action your village could take.\"", "post_url": "https://www.reddit.com/r/WritingPrompts/comments/1bychjv/wp_noble_monster_hunter_thank_goodness_youre_here/", "post_main_text": "", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n>* [No AI-generated responses &#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n>* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n>* Responses don't have to fulfill every detail\n>* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22&restrict_sr=on&sort=new&t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22&restrict_sr=on&sort=new&t=all) for stricter titles\n>* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n&#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n&#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n&#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n&#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*"}, {"comment_author": "The-Name-is-my-Name", "comment_text": "No, the worst option would’ve been sacrificing *two* villagers to the monster each month.\n\nThat was the original plan."}, {"comment_author": "y_so_sirious", "comment_text": "why not three?"}, {"comment_author": "NeoconCry", "comment_text": "Yes, throw Todd in there too. No one likes him, anyway."}, {"comment_author": "ALonleyCat", "comment_text": "Sir Lang continued, \"I came here with the impression I'd have to handle a single werewolf. Easy enough at that point. Give them options for less disruptive hunting grounds, and have a slivered sword if it gets ugly. But now I have to face at least a pair!\"\n\nThe peasant protested, \"What do you mean a pair? Surely each of those 8 outcasts were satisfactory morsels.\"\n\nThe long traveled knight hung his head low, and said, \"Not morsels, not snacks. You have given this werewolf 8 pack members.\"\n\nThis peasant turned away, frozen by a sudden dread, \"But, it was meant to eat them... so that it would keep it's eyes away from the village...\"\n\nLang turned the boy back to him, and fully explained the predicament. \"That werewolf did not kill a single one of your 'sacrifices'. The werewolf most likely convinced each of them, in their despair from being betrayed by humanity, to be turned. I'll still confront them. But if this pack cannot be convinced to move, I can only order an evacuation of the town.\"\n\nPart 2 later"}, {"comment_author": "ALonleyCat", "comment_text": "Part 2...\n\nA few nights later, the full moon was rising over the trees. Sir Lang looked over and saw this month's sacrifice. A young woman, thin and frail as the queen's glass forks. Clearly another whom the village didn't care for. \n\nLang went back to his armor. Gleaming steel adorned in silver crosses. His longsword was similarly adorned. Sir Lang finished his preparations and declared to the gathering of villagers, \"I will escort this months... sacrifice... to the den of these werewolves (Lang made sure it was abundantly clear that he meant plural). Be ready to evacuate if you see any come.\"\n\nAn older man, seemingly the father of the boy Lang spoke with upon arrival, called out, \"There's only one werewolf! And it will be satiated again with my plan!\"\n\nSir Lang finally snapped, \"Your flash of genius gave us a pack of NINE to deal with! I'm sure when I go off to kill my next vampire, you would wisely advise I hand him the stake to drive through *my* heart. You have clearly spoken enough on this issue.\"\n\nThe old man fell silent, but still glared at Sir Lang, who took the hand of this sacrificial woman and led her into the forest.\n\nThe moment they were out of sight of the village, Sir Lang found a branch of white berries and held it high above his head as they continued. \"So, what got you sacrificed?\" Sir Lang asked.\n\n\"I asked my parents to let me leave. I said I wanted to be free of this village. They hadn't cared for me... no one did. But they took that as me wanting to be fed to a werewolf.\" The woman said as they trudged through the thickening bushes.\n\n\"Well, the good news is that you do have options.\" Sir Land continued, \"you no doubt heard me explain, in less than elegant terms, that this werewolf is likely turning each sacrifice. So you could very well join the pack. I'm not to judge. Alternatively, I could name you a squire. It's decent pay, and you don't need any family titles when you have sponsorship. My father was a sponsored squire after he helped save the first session of parliament from an insurrection. I could also drop you off at any number of towns with my gold purse to do as you wish.\"\n\nThe moon reflected in the woman's eyes as she replied, \"Thank you. I'm still in disbelief that werewolves are so...\" She looked outwards into the forest, meeting the gaze of two yellow eyes in the brush, which moved forward and revealed their owner. A large werewolf with fur like the ash of a campfire.\n\nThe werewolf spoke in a (clearly rehersed) viscous growl, \"Ah! Another tasty sacrifice. On a silver platter too!\" The woman gasped, but Sir Lang stood still.\n\n\"The jig is up. I know your pack of outcasts is nearby. I only want to talk. And perhaps you can make your number ten tonight.\"\n\nThey werewolf made a brief howl, and seven more pairs of piercing yellow eyes emerged from the forest. He replied in a softer tone, \"Eight. Two didn't make it in the cold before we could find them. And I don't want to raid the village.\"\n\nSir Land replied, \"I know that. But it's still advisable if you and your pack came with me. The current parliament is very generous to many manner of cryptids. If you cooperate, you are guaranteed a generous domain of protected wilderness.\"\n\n\"Tempting,\" The werewolf admitted, \"But I like this area. The village kicks out all the people with the best traits to be in a werewolf pack. It's a good place to grow this family.\"\n\n\"How about one more and you move south?\" The woman spoke up, \"I'll let you turn me. The southern valley was over-grazed after the last of the regular wolves were hunted down. The village kinda needs you now.\"\n\n\"Careful, that's a hard demand I'd have to make of the local lord. And he is known to but heads with the new parliament.\" Sir Lang warned, \"But I suppose the parliament can reassign the county to a different family.\"\n\n\"I'll agree to this. Welcome.\" The werewolf sits down, \"I hope we can be a better family than those humans in the village.\""}, {"comment_author": "Mr-Pugglesworth", "comment_text": "Oh, this. I LIKE this. Well done"}, {"comment_author": "fluffykerfuffle3", "comment_text": "very much fun to read.. thanks!!"}, {"comment_author": "NeoconCry", "comment_text": "I loved how reasonable everyone is. Well, the knight and the werewolves at least, not the village head."}, {"comment_author": "SamuelVimesTrained", "comment_text": "Very good.  \nNow this looks like the start - and a promising one - of a very nice novel.."}, {"comment_author": "MrRedoot55", "comment_text": "I’m glad it didn’t end with needless bloodshed.\n\nGood work."}, {"comment_author": "ALonleyCat", "comment_text": "Thank you!"}, {"comment_author": "Sir-Planks-Alot", "comment_text": "yeah I like stories that remind us the real monsters are usually the mob."}, {"comment_author": "ALonleyCat", "comment_text": "Thanks. I tried to imply the change in legal attitudes with the parliament."}, {"comment_author": "Runecaster91", "comment_text": "\"Werewolves, when not human, are just like any other beast. Records in my order have even shown some can train their wolf self for work, usually as guards.\"\n\n\"What YOU have done is teach a WILD ANIMAL where the easy food is! It will keep coming back, and if food isn't there when it is hungry it will come to the village directly! You haven't been sacrificing anyone, you've been murdering them and trying to blame the werewolf.\" The monster hunter started for a moment, then grabbed the mayor by their throat. \n\n\"Guess you get to be the bait now, Mayor. Better hope I can catch it before it catches you...\""}, {"comment_author": "Realistic_Badger_708", "comment_text": "Mayor Wood stood from his desk and shook Nicole’s hand. His office, like his suit, was a mess. “Noble monster hunter! Thank goodness you’re here! We’ve had to sacrifice a villager to this werewolf each month to keep it at bay!” \r  \n\r  \nThat explained everything. Pulling her hand back, Nicole held the bridge of her nose. “That is quite possibly the worst course of action your village could take.”\r  \n\r  \nMayor Wood tilted his head. “I don’t see how. The werewolf hasn’t been attacking my village in months.” He lowered his voice. “Though, we are running out of volunteers.”\r  \n\r  \nNicole snorted. “Volunteers? They’re the least of your concerns. Your area has a pack of four or five werewolves.”\r  \n\r  \n“Five?” Mayor Wood shook his head. “Impossible, there should be only one.”\r  \n\r  \nThis was worse than she thought. “There’s definitely a pack, Mayor. And these sacrifices… they’re not appeasing them, they’re attracting them. Werewolves are territorial creatures. The stronger the pack gets, the bigger game they’ll hunt.” She leaned closer. “Soon, one sacrifice ain’t going to cut it.”\r  \n\r  \nThe Mayor’s face paled. “So what do we do? We can’t fight five werewolves!”\r  \n\r  \nNicole leaned back in her chair, a steely look in her eye. “We don’t have to. We’ll fight smarter, not harder. First, stop the sacrifices immediately. It will take time for the new scent to wear off, but starving them will weaken them.”\r  \n\r  \nHowever, Mayor Wood shook his head. “We can’t do that. The werewolf must know where we live. And with a potential pack…” His eyes widened at the thought. “Surely, we can continue the sacrifices. I mean, it’s been six months since a werewolf was in town.”\r  \n\r  \nHer patience was running thin. This Mayor was proving more trouble than the werewolves themselves.\r  \n\r  \nNicole slammed her hand on the desk, scattering papers across the cluttered surface. “Six months because they’ve been feasting on your offerings! Don’t you understand? The larger the pack, the boulder they’ll become! If you continue, the next sacrifice won’t be a volunteer, it’ll be your own daughter walking home from school!”\r  \n\r  \nThe Mayor’s hand trembled as he picked up the discarded papers. “But what else can we do? You say we can’t fight them, and we can’t do offerings…”\r  \n\r  \n“Oh, we’ll do one \\*last\\* offering, Mayor, while we still have the element of surprise.” Nicole gave a knowing smile. She'll have to develop a team quickly in order for this plan to work. “You’re going to tell the big bad wolves that dinner has been permanently canceled.”"}, {"comment_author": "Realistic_Badger_708", "comment_text": "Later that night...\r  \n\r  \nMayor Wood stood nervously next to the offering. The “offering” was a heavily sedated boar dripping with wolfsbane. It laid on a stump in the usual clearing. “You can do this,” the Mayor whispered to himself. “They’re just hungry, ravenous monsters that would tear me to pieces in seconds.”\r  \n\r  \nA twig snapped ahead of him. \r  \n\r  \nMayor Wood froze, every muscle tense. He squeezed his eyes shut, picturing himself being anywhere but here. A low growl rumbled through the dark woods, sending a shiver down his spine. He dared to peek open one eye.\r  \n\r  \nTwo sets of glowing eyes, emerald green and piercing, materialized from the shadows, followed by another three pairs. A pack. Just like Nicole said. Fear threatened to paralyze him, but the image of his daughter, Sarah, flashed in his mind. This was for her, for the village.\r  \n\r  \nThe lead werewolf, a hulking creature with fur the color of midnight, sniffed the air. Its attention was drawn to the boar, then to the Mayor. It was not happy. The lead let out a low growl, beckoning the others to follow. \r  \n\r  \nMayor Wood chuckled. “Hey, I’m sure one of you remembers me. I’m the Mayor who had the wonderful idea to give you offerings to leave my village alone.” He gulped as they drew near. “I didn’t think you would get yourself a pack.”\r  \n\r  \nThe lead werewolf, its enormous head lowered, regarded the Mayor with an icy stare. “You dare to insult us with this ‘offering’?” it whispered. “This is not what we agreed to.”\r  \n\r  \nSuddenly, a loud CRACK shattered through the air.\r  \n\r  \nOne of the werewolves fell to the ground as it reverted back into its human form. Before the other werewolves could react, Nicole and several of her monster hunter friends emerged from the woods with guns.\r  \n\r  \n“Oh thank heavens!” Mayor Wood cried out. He tried to run toward Nicole but the lead werewolf cut his path, its mouth salivating.\r  \n\r  \n“Don’t thank me yet, Mayor.” Nicole pointed her gun at the lead werewolf. She and her group needed to be careful. These werewolves can move faster than their trigger fingers. Her eyes stared at the lead werewolf. “Hey, mutt!”\r  \n\r  \nThe lead glared at Nicole before relaxing. “A deal is a deal.”\r  \n\r  \nMayor Wood’s head tilted. “What deal?”\r  \n\r  \nNicole scoffed. “Funny, almost everyone in the village said the same thing.” She motioned the other hunters to lower their weapons. “Only a select few knew about your disgusting arrangement with the werewolves.”\r  \n\r  \nAny color that was on Wood’s face drained away as the other werewolves circled him. As the werewolves took the screaming mayor deep into the woods, the lead looked back at Nicole. “We’ll leave the village alone… for now.”\r  \n\r  \nShe nodded. “We’ll be waiting.”"}, {"comment_author": "Beautiful_Business10", "comment_text": "I'm transcribing he events of the day into my journal and finally getting to...*\"enjoy\"*...my meal of slightly warmed beef flank with cut but unseasoned potatoes and carrots in a broth that barely amounts to water with some minor fat runoff, when the Ealdorman finally deigns to show up in the tavern.\n\n\nHe doesn't have to look hard to find me: the tall, pale woman with a dark silken cascade of hair and aristocratic features, wearing a long, deep red coat closed in the front with a high collar and pauldrons reminiscent of skull effigies.\n\n\n\"My humble apologies, my lady,\" he announces obsequious from under a wide, brushlike beard. \"I was delayed indefinitely in the courthouse this morning, attending to matters of governance.\"\n\n\n\"That is demonstrably untrue, Ealdorman,\" I reply with a long stroke of my quill pen on the page. I still haven't looked up at the man. \"Had it actually been an 'indefinite' delay, you would not be here now.\"\n\n\nI place the quill down beside the tome and reach to stopper my inkwell before beckoning the frazzled and now-slightly-offput official to sit next to me.\n\n\n\"Tell me of your wolf problem.\"\n\n\n\"We had left a sacrifice for the wolf each full moon; but rather than decreasing, attacks have increased!\"\n\n[TBC b/c it's bedtime for bb10 here...)"}, {"comment_author": "zacausa", "comment_text": "The Village Elder looked at me shocked, along with his entourage of once elated assistants. \"I-I beg your pardon?\"\n\n\"The sacrifice thing. How long have you guys been sacrificing villagers to the beast?\" I gave the Elder a deadpan stare. It was always the same thing when it came to cases like this.\n\n\"A-about t-two years?\" One of the villagers spoke up after a moment, a look of confusion on their face as they pondered the meaning of my words. \"But if we didn't, the beast would have rampaged through the streets, killing as many as it wished.\"\n\n\"It's one beast.\" I reply shortly as I pinched the bridge of my nose. \"Likely one of your own to boot. Though now It could be as many as two dozen or so.\"\n\n\"T-TWO DOZEN?\" The Elder seemed close to feinting, their old heart straining to handle the news.\n\n\"Yeah. Likely less if they actually decided to feed on your sacrificial lambs. Humans already bond with each other and our canine companions as it is, imagine that instinct growing tenfold. I imagine they've got at least a companion or two at this point, maybe even a mate if you weren't picky when you drew straws.\" I explain, doing some mental math in the back of my head as I spoke. \"That makes things more complicated. The threat of death just got a lot higher, and that means two things.\"\n\nThe villager who answered earlier speaks up again, leading me to wonder if he was just there for show, \"What does it mean?\"\n\n\"First, I'm going to need as many silver coins, platters, or other baubles as you can gather, some good leather strips, and don't expect much if any of that back. Secondly, if I do find more than just the one werewolf, you owe me the same bounty for each head I bring back, the silver not included.\" The villagers all paled when they considered the cost and before they could object I explained my thoughts. \"If it were simply one beast, I could take it down without much worry for my life. I've dealt with their kind before. However now that there's a good potential that there's a whole pack of them, i have to worry about being attacked from all angles even when engaged with the original. Silver armor isn't exactly cheap, or practical to fight much other than a few select monsters, so I'll have to improvise with whatever you have. Likely to get torn off of me in the fight to come.\" I shrug. \"Once I deal with them you could go looking to recover it, but digging through the dirt for coins isn't the job, especially since I'm coming out of this with a few scars.\" \n\n\"We don't have that much money to just give up as a reward, let alone giving up the silver! Please kind hunter, could you see it in your heart to do us a charity?\" Asked one of the fairer of the villagers in their leader's stead, who seemed to be having a rather rough time coming to grips with my terms. She clasped her hands together and offered the a desperate smile. \n\n\"I don't work for charity Miss. I kill monster's for a living, I'll need another form of payment. Good will doesn't fill my belly, mend my gear, or replace my supplies.\" I shake my head. This isn't the first time someone has tried to haggle with me, and it won't be the last. But at least they haven't promised the world and then tried to kill me to get out of paying their due. \"I may kill monsters, but I'm not a monster myself. How about this, I'll do the deed, and my original price still stands, but we can spread out the payments. One on return, and then let's say another payment every month for as many months as I bring back heads. Unless you have something else of value in town to trade.\"\n\nThe whole room began to murmur amongst themselves, some contemplating if it was worth the cost, others wondering if they had an heirloom that could suffice as payment. After the crowd murmured for a decent amount of time, I thought now would be a good time to mention. \"By the way, did you guys know that Monster Hunter services are a major deductible on your taxes as a village? All the money that you're paying me is coming from the crown's pocket if there's more than one werewolf.\"\n\nThe tension suddenly disappeared in the room, and they were much more amenable after that, and a month later I was recovering well from my injuries, a proper suit of silver mail hung in my armory, and I still had enough gold to last me a couple more summers."}, {"comment_author": "Still_Going34", "comment_text": "The chief, grey-haired, dark-eyed, and sporting a salt and pepper beard that curls at his waist, stares at you blankly, mouth open, as if you said something surprising.\n\n*Perhaps to the members of this provincial town, it is.*\n\nKaal, bless his black heart, very obviously trying to keep his morbid amusement at bay, and failing as dark chuckles spill through his fingers. There is some commotion from the crowd of villagers at his reaction but that too was quickly quelled once they met his mismatched eyes. Your motley group dominates the tiny public square, and you travel with four other hunters; Kaal, the career necromancer, the demon twins Avi and Rain, and the berserker Cassandra.\n\nThe village isn't a large one, just a few wooden houses that might have made better kindling than shelter, and a singular merchant's guild with a red painted 'CLOSED' plaque on its door. It was no surprise that any monster hunter worth a bit of salt hadn't come to address the issue, but still, you couldn't bring yourself to denigrate the old man further for his decisions. The chief continued to splutter uselessly, red-faced and perhaps a bit tearful, a sore sight for anyone with a bit of heart. You hold up a placating hand and stare pointedly at the slightly larger hovel he'd emerged from, \"We'd like to learn a bit more about the monsters that plague you--and the...victims, may we?\"\n\n\\--\n\n\"Truly, my friend, you are fucked,\" Cassandra says to the resident baker. The man is downtrodden, having gone through the high of his daughter, Lily, (possibly) being alive quickly followed by the crash of discovering that Lily was very likely a werewolf now and he would more than likely be her very first target.\n\nThe surrounding group of residents were in low spirits, all having learned the consequences of their decisions. Their sacrificial habits hadn't placated the infected werewolf hoard, it had grown it.\n\nThe bonfires they'd been instructed to burn at each corner of the village cast a warm light in contrast to the conflicting emotions that permeate the atmosphere. The trees cast long shadows and faintly, Cassandra hears a howl in the distance and opts to keep that information to herself...for now.\n\nKaal chants quietly under his breath, tying talismans made of sage and slivers of pure silver to the trembling necks of the victims' family members. Others shuffle about uncomfortably.\n\n\"Six months, they've been brewing for so long--\" said Avi, her voice low and calm. \"--longer than usual. How has this entire town not been infected?\" Finishes Rain, he drums his fingers against the shack they are leaning against.\n\nYou settle next to the two, you just finished talking to some farmers who've futilely armed themselves with hoes and scythes. You let the shadows of the building wash over you as you contemplate the strange circumstances you found yourselves in.\n\n*The town was on the map.*\n\nNo matter how inefficient the empire is, it took special care and gave extra funding to the officials in charge of cartography, the census, and especially to the Heralds. It was crucial to keep track of the population to keep track of those infected (The robust Department of Taxation simply ended up being a convenient byproduct for the imperial family).\n\n*There was a merchant guild.*\n\nAlbeit closed, and didn’t that ring alarm bells?\n\n*It has been at least six months since a Herald had come through*.\n\nThe records provided by the fief lord indicated regular visitation by one. The last recorded only a month and a half ago. A Herald should be running through a town every month to keep the public up to date on the latest protocols regarding Infection.\n\n*So where was the Herald?*\n\nGeoff Adler was the last Herald recorded, and according to his route, should be in the Corin Duchy to relay any findings by now. But the Chief had said none had come through matching his description.\n\n“Oh, Shit!” Your reverie is broken by a loud curse, the dying light of the setting sun illuminates the now convulsing bodies of those who’d sacrificed their family members to the wolves. You sprint towards Kaal and pull him away from the villagers beginning to claw at his tattooed arms. With a dagger in hand, you back toward the bonfire as without Kaal to cling to, they begin to contort and claw at one another. The scent of blood fills the air, it coats your throat.\n\n*Your fangs threaten to emerge.*\n\n“By the Jewels.” You hear Cassandra curse, she’s plowed through the lurching villagers to stand by the two of you near the towering flames. The flickering shadow beneath your feet curls and the twins sprout from them, their eyes red and their claws sharpened.\n\nKaal gasps, he leans forward, supporting himself with a hand on your shoulder. He shakes his head at your concerned glance, instead, he looks toward the mayhem taking place. You follow his line of sight and notice…*not a single villager has been spared.*\n\nThe old chief lies bloodied in a fetal position nearby.\n\nThese creatures shy away from the bonfires Kaal enchanted. Some tear at their faces, others gnaw on the severed limbs of the fallen. From here, you can see smatterings of bloodied bone litter the ground. In a few moments, the village transformed into a hell on earth.\n\n“This isn’t normal infection--“ whispers Rain, he’s in a defensive position, crouched low to the ground, Avi curls next to him, she's trembling ever so slightly.\n\n“No…it’s worse,” Kaal says through heavy breaths.\n\nAnd then...you hear the howls."}, {"comment_author": "Lycan_Jedi", "comment_text": "The Village elder sat smugly. \"Hmfh Than why hasn't it attacked?\" \n\n\"Because it has no reason to. You're giving it what it wants. More Pack members. And the second you stop, they are ALL going to raid this place. And not even *I* can stop them. The elders smile faltered \"Well DO SOMETHING!\" \n\n\"Easier said than done.... where do you leave the tributes?\" \n\nA half hour later Tormund stepped into the clearing. Two posts sat in the center, piles of broken and frayed rope sitting around them. \"Dumbasses...\" He glanced up at the rising full moon. \"HEAR ME! I KNOW YOURE OUT THERE! I COME TO SPEAK WITH THE ALPHA. I SEEK TO DISCUSS THE FUTURE OF HIS PACK!\" \n\nAround him he heard a rustling of leaves on all sides. He silently layed a hand on his sword, knowing he couldn't take them all, but he'd go swinging if need be. 20 large bipedal Wolves silently entered the clearing. A few stood well over 8 feet in height. Silently one approached he bore multiple scars, including scars from what appeared to be a whipping. \"Speak.\" The voice was more of a growl than that of man. \"I have come to discuss the terms of your relocation. Please. The people below are terrified. I... I desire to find you proper land in the hopes you'll leave.\" The Werewolves seemed to growl at each other in turn before the Scarred snarled silencing all of them. \"You.. hunter?\"\n\nTormund nodded. \"I am. But I mean no harm to you, or your kind this night.\" \n\n\"Foolish... brave... very foolish.\" \n\nTormund stood unwavering. \"I know I can't kill all of you. So I seek a peaceful option.\" The Alpha walked silently around him. \"You.. want pack leave?\" \n\n\"Yes. We desire peace.\"\n\n\"Yet.. you kill own.\"\n\nTormund raised an eyebrow. \"No. We dont.\" \n\n\"Give.. your own. Meant die. I keep. I turn. My pack.\" \n\nThe other Werewolves growled. In some he saw tears. \"It was wrong what they did. They thought they were keeping all of their own safe.\"\n\n \"CHILDREN!\" The Werewolf snarled. \"MOST CHILDREN. That keep safe?! That right? No... cruel... forced give gift. Forced save them. Not right. Curse all. No choice. Curse. Not gift. Fallacy.\" Tormund stood silent. \"It was wrong. Neither of us should be in this position but we can end this now. Together.\" \n\nThe Alpha stood still a moment. \"Never wanted cruel. Never wanted this. Wanted hunt. Wanted home. They did all. Made this.\" He gestured at the pack of Werewolves. \"Years. Many die from bite. Many scream. Many cry. Many beg. Most die. Every month. We bury. We mourn. Send more. We bury, we mourn. They hear howls. They keep send. No more. No more.\" Tears formed in the Werewolf's eyes. \"Cruel. Inhuman. But we monsters. We animals. Not humans. Killing own. Want peace. They deserve *none*!\"\n\n\n\"Fear makes others dumb. Please...let me help. If you leave, this ends.\" \n\n\"Should not have leave. They should. They monsters. We peace. We kind.\" \n\nTormund stood silent. The Alpha was right. The village had made this happen. \"If I can't convince them to leave, will you? To end this?\" \n\n\"Terms. Accepted. Take.\" At this the Alpha handed a necklace made of bone and leather cord. \"Friend of pack. Marks you. No harm.\" Tormund draped the necklace around his neck. \"I'll return later with their answer.\"\n\n\"Hunt well. Moon Mother guide human.\"\n\nTormund bowed as he turned. Uncertain of how to make the humans leave."}, {"comment_author": "Still_Price_9676", "comment_text": "My blood ran cold upon hearing this statement. I asked him how long he’s been doing this, he responded with “oh it’s been a couple years.” I froze, that much food and it could’ve raised a family, maybe even inside the village. I looked around and to my dismay everyone was staring at me expectantly. I asked him how often he fed them and he said “once a month.” That’s horrible, absolutely horrible, for all I know I could be talking to one rn, this entire village could be comprised of werewolves. This made worse because everyone in this village is a farmer and they all have cattle. The one thing I know about werewolves is they love pattern so I asked the chief where he meets the wolf, I was told the entrance of the village. I decided that my best course of action was to stay at their overnight inn, I put my sword right by my bedside and I shut off the lamp. *Crack* I woke up in a startle and turned on my lamp. There it was, 7 foot, black fur, large claws, piercing gaze, large ears, and a very muscular build. Weird thing was it had a familiar smell, the smell of the village. I drew my sword and I assumed my stance, I got a few scratches but it’s dead. I decided to look outside the inn to make sure the village was alright and I was met with a grim sight. A group of 7 werewolves were a half mile out from my position, standing right at the entrance. The chief offered up multiple people for the wolves to take. I thought it would be better to deal with this in the morning, I was too tired for this. I awoke to pure silence, there wasn’t the usual breakfast commotion of a place like this, just pin drop silence. I grabbed my sword and stepped out of my room. I couldn’t believe my eyes, the innkeeper was gone and the inn was empty, I went behind his desk to search for signs and it smelled exactly like the wolf I just killed, I was right. It’s in the village. I had to tell the chief so I went out of the building to tell him but before I could say anything he came up to me smiling “I know where they are, I found them” he said, skeptical of this because of last night, I asked him to lead me there. Wrong choice of words, we set out towards a nearby forest and while on the way I told him about the innkeeper. He looked deeply saddened by the news, I should’ve seen the red flags. We started to approach a cave but suddenly I heard a whistle behind me. I drew my sword and turned around out of fear, seven of them. I look at the chief to make sure he’ll be alright, eight of them. Kill or be killed."}]}, {"post_title": "[WP] You are the sole superhero without powers to have lived longer than ten years. An old friend with powers asks how.", "post_url": "https://www.reddit.com/r/WritingPrompts/comments/1bynzd6/wp_you_are_the_sole_superhero_without_powers_to/", "post_main_text": "", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n>* [No AI-generated responses &#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n>* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n>* Responses don't have to fulfill every detail\n>* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22&restrict_sr=on&sort=new&t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22&restrict_sr=on&sort=new&t=all) for stricter titles\n>* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n&#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n&#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n&#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n&#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*"}, {"comment_author": "musicalharmonica", "comment_text": "Metallica was having a bad day.\n\nWiping a trickle of blood from her mouth, she staggered to her feet, shielding her eyes against the iron behemoth currently crashing its way through First National Bank. Powerman and Revengetress were tiny figures circling far above, punching dents into robot's titanium shell.\n\nMetallica watched as a flip was switched, and the robot's body flared with electricity. \n\nPowerman and Revengetress fell twenty stories to the ground.\n\nShe froze. Those had been their heavy hitters -- the best Heroes of America had been able to offer. Compared to them, her powers were less than useless. She had metal skin. That was all, and she was *still* bleeding from the times the robot had been able to catch her.\n\nSweat dripped down the back of her supersuit. Cursing under her breath, she radioed for back up, using the *smash glass in case of emergency* frequency and ran.\n\nOr tried to, anyway. That's how it should've happened, but the second she shifted her weight to the ball of her foot, something huge and shiny and gray slammed into her.\n\nThe next thirty seconds were a haze of darkness and panic. Screams overhead. She tried not to think about how many people were dying around her, how much money the guy controlling this thing was probably going to get from killing innocents.\n\n*Jackass. Fucking...* Pain whited out her thoughts.\n\nMore blackness, and then --\n\nStunning light. Silence.\n\nShe blinked. \n\nBeetle, the only un-powered member of the Heroes of America, was extending to her an outstretched hand. She took it, wincing as he hoisted her to her feet.\n\n\"Are you...\" She was going to ask *Are you okay*, but there wasn't a scratch on him.\n\n\"Fine.\" He shrugged. \"Wasn't too hard of a fight.\"\n\nHe gestured over towards the smoking remains of what had once been a world-ending, hero-killing robot. Metallica gaped. \"But... but... *how*?\"\n\n\"Couple of heat-seeking missiles, courtesy of BeetleTech. Easy peasy.\"\n\n\"Easy-peasy,\" she repeated, weak. \"Right.\"\n\nShe bent over and threw up over a spot of cracked pavement. Beetle patted her back awkwardly until she was done.\n\nReeling -- the world spun -- she couldn't help but mumble, \"But you're powerless. How... How could you...\"\n\n\"How do you think I've survived all these years?\" He flashed her a sly grin. \"Money, man. Fuckin' money.\"\n\n----\n\n(obligatory Batman \"money is my superpower reference here)"}, {"comment_author": "Skyshock-Imperative", "comment_text": "YES. EVERYTHING ABOUT THIS. YES."}, {"comment_author": "freakytapir", "comment_text": "The smell of eggs fills your nostrils, your jean jacket tattered, your pants evenly so, the red diner seats slightly sticky, the morning sun peeking over the horizon.\n\nAcross from you sits a man wearing a cape, spandex digging into every crevace.\n\n\"So, how do you do it? I mean, ... As far as I know ...\"\n\n\"That's the problem with you supers, you think you know. It's easy really. By minding my own damned bussiness. I can't fly, shoot lasers or hulk out. I delegate. Look.\"\n\nYou slide over your phone.\n\n\"Is that just the number of every super in metroplis?\"\n\n\"Just about, yeah. You guys wouldn't know your elbow from your asshole without me. Now, I am packing.\" You slap a Magnum .45 on the table. \"But that's just self defence. Now, you want in?\"\n\n\"Want in?\" The man tugs at his cheap cape, stuck beneath his buttocks.\n\n\"Hey, if you're good at something never do it for free. I send the saved person a bill, hack the insurance company to make up some bullshit claim so they pay out, and you get your cut for doing the legwork. I get my cut for facilitating.\"\n\n\"Isn't that ... unethical?\"\n\n\"Getting a lead salad to the face tends to be a lot more expensive than a super stopping by for 5 seconds and kicking some ganster's ass. Now, as you're an old friend, you're getting a premium rate, but don't go telling the others, all right?\"\n\n\"Can I think about it?\"\n\nSirens sound outside, a gang dressed as clowns running down the streets.\n\n\"Looks like a job for ...\" The caped man starts to rise.\n\n\"Don't bother. Already texted someone to come fix this. Now, breakfast's on me, all right. Let me know if you want in\"\n\nYou leasurely stroll outside to get a good view of the situation, the gang soon standing frozen in their tracks, shivering."}, {"comment_author": "AntiqueAlien2112", "comment_text": "How'd I do it? How'd I stay alive, you ask. Well. It's simple. Know your limits. Most supers, hey have limits that are sky high. What limits are there on a man made of metal? What limits are there on a woman who can run faster than light. Not very many. \n\nBut me? I've got a whole host of limits. Sure, I'm good. I train, and study, and prepare, but I'm only human. I can't catch missiles with one hand. I can't punch god. All I can do is look out for the innocent, and try and keep my little part of town safe. \n\nI don't go picking fights with super villains, capable of ripping out my heart by looking at me, or able to crush my bones with their bare hands. What I do is I reduce casualties, minimize damage, and save people until the heavy hitters arrive. There's more than enough big hitters out there to take care of every super-powered freak. I don't need to do that. I *can't* do that. \n\nAll I can do is reduce damage, and stay alive to fight another day. It's not heroic. Its not special. Its just doing the best I can."}, {"comment_author": "Beautiful_Business10", "comment_text": "Jimmy came over to my place to pick me up for lunch. On the way, he shifted into Caotain Stallion mode. It wasn't a physical change or anything, just a bit of a tonal shift from James Ballinger, forensic scientist, to Caotain Stallion, worldwide superhero. The \"other job,\" as it were.\n\n\"Herb, I've been meaning to ask how you do it.\"\n\n\"Do what?\" I respond.\n\n\"What we do, day in and day out, without superpowers.\"\n\nI shrug. \"We've both talked suicides down from the ledge and vils into turning over. Our power isn't that we have powers, it's that we give a shit.\" I glance out the window at a flash of red, notice the pretty lady in the thick red sweater that shrouds her neck, arms, and torso. \"About everyone.\"\n\nMy \"working name\" is The Corpsman. Veteran United States Marine—oo-rah—and platoon medic; and those are the two specialties I bring with me as a hero.\n\nMost cops just call me a vigilante.\n\n\"I'm guessing that isn't satisfactory,\" I say after a moment.\n\n\"It's not wrong; but yeah.\"\n\n\"So how do I compete with supervils? Comprehensive research and judicious application of force to their weak points.\" I look sideways at Jimmy. \"Strategy and tactics, basically. Unless they're invulnerable, they have a weak point. Research shows ne what that is; and then it's a matter if either applying sufficient direct force, or obtaining and using the material weakness.\""}]}, {"post_title": "[WP]Your are your normal, boring self. Today, however, you've been abducted by the government to interrogate a super villain from another dimension - Yourself!", "post_url": "https://www.reddit.com/r/WritingPrompts/comments/1bypvtp/wpyour_are_your_normal_boring_self_today_however/", "post_main_text": "", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n>* [No AI-generated responses &#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n>* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n>* Responses don't have to fulfill every detail\n>* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22&restrict_sr=on&sort=new&t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22&restrict_sr=on&sort=new&t=all) for stricter titles\n>* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n&#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n&#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n&#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n&#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*"}, {"comment_author": "Fenix_Glo", "comment_text": "Agent Marks had given me the information on the long plane ride to the compound. Bullshit, bullshit, bullshit. I wasn’t even listening. My nose was broken. My ears were ringing. My body was aching.       \n\nThey had been waiting for me after work. They approached me like goons. When they asked me to get in their van things got messy. I popped one of them. And … that’s the last thing I remember until I woke up zip-tied on the plane.     \n\nSomething, something, something identity theft mumbo jumbo. Who the fvck cared? I wanted to go home like I did every night to have a couple of beers, watch some TV, jerk off and go to sleep.      \n\nI was sick of listening to Agent Mulder or whomever the fvck and I did like I did back in high school. I just tuned out.     \n\nWhen we arrived at the compound Roscoe P. Coltrane and Boss Hog took me to some medical place. They took my fingerprints. They got blood samples. They made me piss. They did a dental X-ray. They did a retinal scan.        \n\nI was holed up in some kind of solitary pod for two days while they ran my medical tests. The food was good but the damn lunch lady refused to give me a couple pints.       \n\nSome more goons came in the room and they shackled me. They took me to an interrogation room. It was like in the cop movies except there was a plexiglass barrier which cut the room in half.      \n\nI sat there sullenly when a door opened on the other side of the transparent wall. Some more goons walked in and to my surprise they were escorting a person who could have been my twin.      \n\nHe grinned at me. They put him in a seat which faced me. They cuffed his hands behind his back. They cuffed his ankle to the legs of the chair. Then they left us both alone in the partitioned room.      \n\nHe was better looking than I was. No belly and he had a full head of hair. Aside from the bandage on my face and other minor details I could have been looking in a mirror.         \n\nAgent whoever the fvck came in my section of the chamber. He closed the door behind him.     \n\nI asked, “What is this? I didn’t do anything.”     \n\nAgent Marks spoke seriously. “We have an anomaly. This other person is … you. Medical records have confirmed it.”      \n\n“That doesn’t make a lick of sense!” I exclaimed. “What about the finger prints?”      \n\n“Everything,” replied the agent. “We need you to ask … yourself questions to which only you know the answers. Can you do that?”       \n\nI was upset. “I’m going to lose my job to play a game of twenty questions with this phony? This doesn’t make any sense.”      \n\nAgent Marks said, “Your employment is secure. Your rent is secure. Your compliance would be much appreciated.”       \n\n“He … that dude … is obviously not me, numb nuts. I am me. Dude over there is not me. That’s just common sense!”        \n\nAgent Marks said, “Well, forensics have said that he is you. Given the various crimes which INTERPOL has detained him for it would be in your best interest to co-operate with us.”       \n\nI shook my head angrily. “Yeah whatever. What do I need to do?”       \n\n“Ask him something only you know.”       \n\nI scoffed. “Then I can go home? This will be easy.”      \n\nI asked the phony, “What’s the kissy thing?”        \n\nThe imposter grinned again. “It’s the mole underneath Faye’s left tit.”      \n\nMy heart surged with adrenaline. Agent Marks was reading my reaction.        \n\nI asked the phony, “Who is the voice?”        \n\n“I don’t know,” he admitted. “Sometimes I think it’s grandpa. Sometimes I think it’s the devil himself. It changes.”      \n\nI looked at Agent Marks with pure terror on my face."}, {"comment_author": "Scorppio500", "comment_text": "I went to sleep in my bed. Then I awaken... in a very nicely furnished jail cell? What is this, the SCP foundation? \n\nTurns out I'd be closer to the correct answer than I thought. This is a cell in the USP Florence ADMAX facility. Says so on the wall. The supermax prison not too far from the city I live in. I feel like garbage. I must've been chloroformed or something. \n\nI don't remember coming here at all. I was still in my sexy lingerie my boyfriend got me and my kitty ears and tie-on tail. I'll bet carrying me while I was unconscious wearing this was awkward. I sent up a silent prayer the agents that took me here weren't weirded out. I might've also got really drunk last night, so on top of the chloroforming or other sedation method, the ick feeling was compounded by my clearly hungover state. I saw some mismatched clothing with the tags still on them sitting in the bunk across from the sofa I was laying on. I put those on. \n\nThere is a button on the wall with a note that says \"When you're up and dressed, press this. We'll bring you a coffee and some warm breakfast.\" The wire ran through the window to the veritable blast door which was removed so it could be run. I laced on the standard prison shoes and pressed the button. \n\nTwo armed security guards appeared at my door. One has a coffee in his hand, the other has a quite nice looking breakfast under a clear cloche carefully positioned under her arm. She asks me to unhook the button, shove it through the window, and pull the door to my left. I do as instructed and exit the cell. \n\nI'm led to an interrogation room and the guards let me eat my breakfast. \"Here,\" says the female guard. \"I've got some splenda for ya too.\" I take it gratefully and wash my breakfast down with the coffee. I feel better already. I finish and the guards take my tray and mug and dispose of them for me. It's only then that a suited man comes in. \n\n\"Miss Clearwater, I suppose you're wondering why you're here.\"\n\nI sit up straighter. This man sounds authoritative. \"Yes sir. I'd complain but you DID just feed me.\"\n\nThe man cracks what might be a rare smile on his frown lined face. \"Indeed. The circumstances are strange. But the person we aim to interrogate requested you and only you. Now I know that face. Why? I'll tell you. She looks exactly the same as you do and is allegedly you from another dimension.\"\n\nI'm dumbfounded. I don't know what to really respond with. The suited man continues. \"Just be warned, Miss Clearwater. She is very clever.\"\n\n\"Fantastic,\" I said. I'm in no way clever at all. \"I guess bring her in.\"\n\nThe man nods and walks outside. He taps a button on an intercom and goes into the observation room. The door opposite the one I came in and the man left out of opens. Out walks my doppelganger. Her eyes are aglow with a purple light and her hair shimmers with purple energy. \n\n\"Hello... Rhea Clearwater,\" the doppelganger says. \"Ask me who I am.\"\n\n\"Okay, uh... who are you?\"\n\n\"My name is also Rhea Clearwater. But where I'm from, I'm called The Night Witch.\" Her aura sparkled sickly purple sparks. \"I rule my dimension. And I shall rule here as well.\"\n\n\"Why?\" You'd think I'd be scared, but I'm not. \"What reason is there for that? Why not just go back?\"\n\n\"Oh, my dear doppelganger. *I'm* not going to do it. *You* are.\" My doppelganger grins evilly as she says this. \n\n\"What do you mean by that?\"\n\n\"Oh, it's simple. I give you access to my abilities, you send me back to my home dimension, then the power corrupts you by its very nature, and you repeat the cycle. Soon the world will be yours!\"\n\n\"And if I aim to not take over the world?\"\n\n\"You will want to. With the power I shall give you, there is no righteous thought you can have that will sway you.\"\n\n\"You might be wrong, you know.\" I said this with confidence but my mind was a little fearful. I didn't show it. \n\nBut she sends a bolt of energy from her eyes at me. Energy courses through my body and... absorbs. My hair begins to glow like hers and my eyes begin to glow like hers as well. I feel like a god. I do what she asks, and send her back to her dimension.\n\nBut now I'm scared. Do I become what she said? No. I won't. This world has super heroes! I'll have them help me hone this. If I'm going to be the one to break the cycle, I had better learn to use my power before they corrupt me, if they corrupt me at all."}, {"comment_author": "Deansdiatribes", "comment_text": " only thing too short and too few  the power as a viral vector kewl"}]}, {"post_title": "[PM] Prompt me some wholesome princess prompts", "post_url": "https://www.reddit.com/r/WritingPrompts/comments/1byuyo2/pm_prompt_me_some_wholesome_princess_prompts/", "post_main_text": "", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "**Welcome to the Post!** This is a [\\[PM\\] Prompt Me](https://www.reddit.com/r/WritingPrompts/wiki/how_to_tag_prompts#wiki_pm.3A_prompt_me).\n\n**Reminders:**\n\n>* All top-level comments should be prompts for the submitter to answer\n>* [Prompt submission](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_submitting_posts), [prompt responses, and comment](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_commenting) rules still apply\n>* Prompts must be responded within six hours or this post will be removed\n>* [No AI-generated responses &#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n>* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback.\n\n&#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n&#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n&#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n&#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*"}, {"comment_author": "stoopme", "comment_text": "The princess and the knight having a sleepover."}, {"comment_author": "Apprehensive_Age3663", "comment_text": "I see where this is going…"}, {"comment_author": "CarthagePlate_210", "comment_text": "\"A princess bakes something for her parents with guidance from the castle chefs.\""}, {"comment_author": "Commander_Night_17", "comment_text": "Let's try yours first \n\nHopefully I'll do everyone elses on time"}, {"comment_author": "ZachTheLitchKing", "comment_text": "The princess practicing fencing with a kitchen servant who dreams of being a knight."}, {"comment_author": "eccentric-Orange", "comment_text": "Coming from a famously ostentatious dynasty, the princess goes undercover for a month to work and live with her castle's staff"}, {"comment_author": "ny00t", "comment_text": "Princess being besties with a servant's child and getting into various childish shenanigans together in the castle."}, {"comment_author": "Ilmarinen999", "comment_text": "The king and queen are in a panic. A dragon has whisked away their daughter. Little do they know she's just late for the \"magical beings support group\" she runs, and needed a lift."}, {"comment_author": "Agreeable_Sweet6535", "comment_text": "The backstory of a kind princess remembering when her mother helped her overcome her first skinned knee."}, {"comment_author": "Realistic_Badger_708", "comment_text": "The princess and prince set their differences aside and rescue each other."}, {"comment_author": "UnderlordZ", "comment_text": "The Princess in the Dragon's Keep is actually a runaway; the dragon is her best friend."}, {"comment_author": "Witty_Commentator", "comment_text": "Grandma telling Princess about the dragons and knights \"in her day.\""}, {"comment_author": "Twotailedpikachu", "comment_text": "A princess decides to pay the group of adventurers a visit. They’ve been sad lately, and need some cheering up."}, {"comment_author": "Tanibus_Mushroom", "comment_text": "A princess and her dragon companion, going on an adventure and constantly having to explain that they’re friends, and the princess is not being kidnapped."}, {"comment_author": "Sharp_Emergency4570", "comment_text": "A lonely princess disguises herself as a commoner to make friends. Bonus idea: her new friend starts working in the castle (i.e. a knight or a cook etc) so they get to have a reunion"}]}, {"post_title": "[WP] You originally started this restaurant as merely a front for a drug smuggling ring. However, as your restaurant has become inexplicably popular, you come to realize that you may truly have a passion for the culinary arts.", "post_url": "https://www.reddit.com/r/WritingPrompts/comments/1bymr70/wp_you_originally_started_this_restaurant_as/", "post_main_text": "", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n>* [No AI-generated responses &#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n>* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n>* Responses don't have to fulfill every detail\n>* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22&restrict_sr=on&sort=new&t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22&restrict_sr=on&sort=new&t=all) for stricter titles\n>* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n&#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n&#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n&#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n&#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*"}, {"comment_author": "SocalSteveOnReddit", "comment_text": "The idea of money laundering is straightforward.  You report income from a business that had nothing to do with the business, and can then turn that money into expenses, wages, or even an owner salary.  Like any act of fraud, numbers need to be kept reasonable, or else the G-men will come knocking.\n\nClown Burger had been profitable for five years; not an invented income, but people liked bright flavorful deserts, Funny and Very Funny cheeseburgers, and the Onion Rings were red hot.  New items were coming, \"Bozo Chili Sauce\" was good enough to eat with a spoon, but sold with an order of fries it was pure bliss.  And while 'Fearless Chicken' had long been a dad joke, it brought comparisons to a Kentucky Colonel.\n\nTaxes were due.  I had to to report my finances, but I had cleared a 10% operating profit on its own.\n\n///\n\nTen years ago, I was desperate.\n\nThe government still didn't understand marijuana, but they understood it even less than they did today.  You could smoke it, but the talent I had was 'edibles'.  It didn't take long for money to start to pile up, and the Bank would report anything over $10,000.\n\nClown Burger began as a paper fiction, before due diligence demanded I created a store front.  I had to dispose of dyes, so I turned Vanilla Ice Cream into a flavorful and colorful experiment.  I expected to run a loss for a long time, but I had something different, something unique, and in a world where giant chains sell very consistent things, Clown Burger was a bizarre novelty.\n\nI'd fenced off edibles to people, dumped the money into Clown Burger, and narrowed the losses, before reaching break even.  But there was something else to all of this--I'd gotten away with it all.  No one does that forever, not unless there is nothing to reveal.\n\n///\n\nI made my decision.\n\nI would exit the edibles business; I didn't need the money, and I certainly didn't need the risk.  I'd make a couple calls to sell off the old product, and close out that operation.\n\nClown Burger had begun in a bizarre way, but hadn't Pizza Hut been born out of a falling out between brothers?  Wasn't McDonalds a family restaurant that got bought out by the ice cream machine vendor?  Clown Burger didn't need an illegal off book activity, and neither did I.  It was time to set an old way of life aside.\n\nIndeed, it was time to head to the kitchen:  What if Potato wedges could be mixed with Bozo Chili? The costs would be lower than fries, and people would undoubtedly enjoy getting more for less."}, {"comment_author": "thehungriestnarwhal", "comment_text": "I looked up from the popcorn and oil and bags in the brief moment right after new kernels went into the freshly oiled popper. 1...2...4..12. Twelve people were lined up, on their phones and unphased by the wait, just eagerly anticipating my freshly popped popcorn. \n\nIt was a beautiful sunny yet cold day in late March, and the smell of bonfires filled the lakeside air. Elvis lazily drifted out the radio, and good vibes wafted down the street along with the popcorn. My popcorn, from the popcorn business I'd started to be a front for my cocaine business.\n\nA \"White\" bag of plain popcorn meant a bag with coke, if you winked twice with your left eye when you ordered. But coke wasn't even my best seller at this joint I'd somehow created. The Cashew Caramel popcorn started selling like wildfire the second it hit the streets. A little bit salty, perfectly encased in crispy caramel, and delicious as ever, as soon as June started raving about it at church,  practically the whole tone was coming over to get some popcorn..."}, {"comment_author": "EliteArc", "comment_text": "Something tells me there abit of cross contamination."}]}, {"post_title": "[WP] You have been destined to go on a life changing quest since your birth. Thing is, you don't want to go on the quest.", "post_url": "https://www.reddit.com/r/WritingPrompts/comments/1byherp/wp_you_have_been_destined_to_go_on_a_life/", "post_main_text": "", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n>* [No AI-generated responses &#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n>* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n>* Responses don't have to fulfill every detail\n>* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22&restrict_sr=on&sort=new&t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22&restrict_sr=on&sort=new&t=all) for stricter titles\n>* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n&#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n&#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n&#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n&#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*"}, {"comment_author": "Ceris5", "comment_text": "Plot twist, the main character is forcefully enlisted in the space marine corps because of a contract their parents signed"}, {"comment_author": "mintleaftea", "comment_text": "|PART 1|\n\n\"MARCUS!\" \nJess grabbed my arm, yanking me out my thoughts and stopping me in my tracks, just as a truck rumbled by, honking its horn. I stepped back from the curb and exhaled. \n\n\"Marc, look, I'm sorry. I know these things keep you on edge but I thought it would be a bit of fun. I'm sorry.\" \n\nJess peeked up at me through her heavy fringe, as her face became bright with embarassment, still cradling the plastic battery powered gnome she pranked me with. \n\nI exhaled again and relaxed my shoulders.\n\n\"It's ok. I'm just- I'm just really tense.\"\n\n\"I know. You always get like this before your birthday.\" \n\nWe started slowly strolling with a few crispy leaves dancing along side us, in the breeze. Jess pulled her scarf up around her neck and ears.\n\n\"I wish I didn't. But it's always like this. Quiet the week or two before my birthday, and then on the day some grand, glittery, glowing, human adjacent... thing, decides to popup and monologue at me like... I don't care!!!!\"\n\n I threw my hands up to the sky.\n\n \"I never cared!!!!!! And I'm just worried 'cos I'm gonna be 21, it's a big year and they're gonna do something stupid! I can just feel it! It's giving me anxiety! I have anxiety over this shit. Do you remember my 16th birthday??\"\n\nJess tried to hide her laugh but glaring at her didn't help and she eventually started giggling. I huffed in annoyance and picked up the pace. \n\n\"Oh, Marc, don't be like that. I know it wasn't funny at the time but you have to laugh about it now. Even the Q.G.A sent an apology letter.\"\n\nI was trying to be mad but Jess' giggle always makes me laugh.\n\n\"You're right,\" I chuckled \" I was very traumatised by a half fish, half woman slimey thing climbing out the toilet WHILE I was using it\" We burst out laughing.\n\n\"Who knew opposite mermaids were a thing!!!!!\" Jess exclaimed, making us laugh harder.\n\n\"Did I tell you she had pubes?!\" Jess was leaning against a postbox laughing so hard she could barely breath and her laugh was keeping me laughing.\n\n \"Glittery, and scaley pubic hair, Jess!! I wish I was making this up!\" Jess nearly collapsed with laughter, I helped her off the postbox. \n\n\"C'mon, I wanna get this lecture over with!\" Jess's laugh subsided into a giggle and she leaned into me gently saying \"You got this Big Marc! I know you can handle them.\" \n\nJess was grinning up at me with so much confidence, but I could not mirror her smile. I had a horrible feeling about turning 21."}, {"comment_author": "mintleaftea", "comment_text": "|PART 2|\n\nBzzzzz\nBzzzzz\nBzzzzz\n\nI closed my eyes tighter, turned over and pulled my sheet up over my head.\n\nBzzzzz\nBzzzzz\nBzzzzz\n\nMy damn phone... it's probably Jess wanting to wish me Happy Birthday... I opened my eyes and reached back to feel for my phone. \n\nWhy was Jess calling me so early? It's still dark...\nInstinctively, I sat up.\nThe pit in my stomach deepening as the darkness around me became darker, heavier and colder. \n\nMy phone stopped vibrating.\n\n\"Hello?\" I called out and heard my voice echo back... I tucked my knees up to my chest, scared to look out into the blackness but also anxious to see.\n\nSuddenly, the deafening sound of voices, so many of them. \n\nI immediately covered my ears but the voices didn't stop talking. I slowly lowered my hands and as I listened closely I could make out words and- \n\nWait....\n\nThis was my voice?...These were my words!!!\n\n\"I'm not leaving my life for a quest?\"\n\n\"Find somebody else!\"\n\n\"It's not my responsibility!\"\n\nI could make out small strings of sentences I had said over the years and years, of being asked to do some quest.\n\n\"Oh, great.\" I rolled my eyes and relaxed. \"Nothing else worked so, you decided to creepy guilt trip me ony 21st birthday??\" I shouted at the voices, and as soon as I did, it stopped.\n\nThe sudden silence made my ears ring.\n\n\"Guilt trip?\" Many voices asked in unison. I felt a cold breath at my neck and I curled myself up again, it was still just as dark. \n\n\"You feel guilty now, Marcus?\" The voices said, like they were teasing me.\n\n\"Who are you?\" I asked shakily.\n\n\"I am not a who, Marcus, but you would know that if you listened.\" the cold breath traced along my arm leaving a trail of goosebumps. I pulled away.\n\n\"This isn't funny anymore. You want to talk to me about my \"quest\", then talk! I'm listening!\" My lips were starting to feel numb and the end of my nose was so cold it had started running. I pulled my sheets around me and felt for the edge to wipe my nose.\n\nThe voices laughed. An unsettling, relaxed laugh.\n\n\"There is no quest, Marcus The Great.\"\n\nI frowned in confusing \"But they kept telling me-\"\n\n\"There is no quest, now.\" The voices interrupted me, and the hairs on the back of my neck stood up.\n\"Wh- what do you mean?\" I called out into the darkness.\n\"The quest has expired, Marcus The Invincible, or did you think yourself so important, that it was only about you and your wants?\"\n\nI was so cold that I was uncontrollably shaking but I was also terrified.\n\n\"There wasn't even a thought,\" the voices continued. \"That this quest was more important than you? More important than this world, even?\"\n\n\"I'm not sure what's happening. I'm cold, dangerously cold, I think. And, if you're wanting anything from me, keeping me in the literal dark and cold won't help.\" \n\nI was starting to lose feeling in my toes and it was becoming hard to breath.\n\"Wanting anything from you?\" The voices playfully asked. \"I already have everything.\" \nthe voices boomed so loud I had to cover my ears again.\n\n \"I have everything. EVERYTHING. Because you, Marcus The Saviour,\" the voices taunted. \"Did not stop me.\"\n\nI felt my heart beating slow and hard in my chest as the voices began to laugh.\n I tried to take a deep breath but there was no air, I was getting dizzy and scrambled to get out of bed but suddenly there was nothing beneath me.\n\nJust ice cold, endless darkness and voices laughing. \n\nLaughing at me."}, {"comment_author": "efd-", "comment_text": "Part 3 please?"}, {"comment_author": "mintleaftea", "comment_text": "Oh wow!! I'm flattered you enjoyed my short story! It's my first ever post here!! ☺️ ✨️ However, there's no longer anything existing in that Universe to write about 🙁"}, {"comment_author": "santa_obis", "comment_text": "Oof, another old man.\n\n\"You, my friend, have been chosen-\"\n\n\"Let me stop you right there.\"\n\nI grabbed my tonic water and took a sip as his bewildered eyes fell behind what I could only describe as liquor bleached hair. I eyed him down as he did me, and no doubt he thought he has me pegged me as I did him.   He carried an authority, something reminiscent of an age gone by, but that didn't fool me. He started to eye the chip I was palming a little too obviously.\n\n\"My so called chosen days are over, old timer.\" He looked down at his feet, as if clicking them together would have taken him out of Kansas for a change. I almost felt sorry for him, if not for the reason I was here.\n\n\"Very well, you will not do!\"\n\nAs he stumbled to the next patron, I couldn't help but think that it'd be a matter of time before we'd be meeting again. I've been around, and I don't need another one."}, {"comment_author": "Saint_Of_Silicon", "comment_text": "They say that fate never asks easy things of us. How one is chosen for a task is almost entirely opaque, even to the best minds of our time. I've known since I can remember, my parents have known since I was born. Something great would be demanded of me. Something that would change the course of my life, force me to become something utterly unlike the person I had been up to that point. I can see that I must, that failure to set out will lead to a dark future. But I strongly desire to stay home. To defy fate.\n\nI was twelve when my parents sat me down, told me about it. I knew I was destined for something, but they told me other things. That I was special for being marked for such a purpose, and that there would be danger. I told them, \"I just want to stay here, learn a trade and live a normal life.\" There was pain in their eyes as they said, \"You will have to go, son. People have tried to defy this sort of destiny before, and terrible things resulted. You still have years before the ordeal, but when it arrives, you must accept it. The call will come, and you will have to answer.\"\n\nI would stare into the dark at night and consider my future. I would meet new people, do interesting things. But the life of an adventurer did not interest me. I would be transformed, but what if the person I was now did not like the person I would become? I would be hollowed out and supplanted by something else. It was a sort of death, and there was also a risk of actual death, too.\n\nI was seventeen when the call came. I woke up in the night, warmth on my palm. The mark was glowing. I woke my parents, showed them. Tears formed in my mother's eyes, sadness played across my father's face. \"We'll give you money to pay for food and expenses on your way to Cerulean, those chosen always gather there before they embark.\"\n\nCerulean was the largest city for hundreds of miles and the seat of government. It had changed and grown over a long time, parts of it were built over seven hundred years ago. I was traveling with a modestly sized merchant caravan. It would be a five day long journey. Plenty of time to think things over, maybe find a way to escape. I wrapped my hand with a cloth, hoping to avoid the attention the mark might attract. When we stopped for the night, I sat on the periphery, looking up at the stars. I could vanish here, and no one would be the wiser.\n\nThe campfire is winding down when there is a cry in the dark. I am the closest. Without thinking, I go towards the scream. My eyes are well adjusted to the dark. I find a boy, no older than seven, being menaced by a feral dog. I look for a weapon, and find a stone. I throw it at the creature's head as hard as I can. It yelps, then runs off. \"You alright lad?\" \"I... I think so. I was emptying a chamber pot and that thing came out of the dark.\" There is a brief pause, then he looks at my hand. The cloth had fallen off, revealing the mark. \"You're one of the chosen? Here you are saving people, and the quest hasn't even begun!\"\n\nWe ran into others who had come to help, and explained to them what happened. The boy tells everyone about my mark. I am the center of attention, there will be no slipping away into the shadows tonight.\n\nThe next day, we make it to a village called Blisterwort. I try to hide the mark again. I hope to find another caravan heading away from my home and from Cerulean. I ask around, trying to avoid drawing attention to myself. I am about to fall in with another group, when I am tapped on the shoulder, \"Are you Tomas? You are, aren't you. They said they had one of the marked here, and you fit the description. I am Sally.\" She raises her right hand, and shows the glowing mark. Not knowing what else to do, I unwrap my hand. The marks are identical. \"It seems we are both heading to the same journey. It is good not be alone with the responsibility!\"\n\nWe depart, still heading towards Cerulean. I have lost all hope of escaping with another caravan. My last hope is that I can fade away into the crowd once we reach Cerulean. I understand there is a huge number of people there, disappearing into the multitude should be easy enough. Sally seeks me out, trying to start conversations. I reply tersely, I don't want to give an indication that I am still planning to defy destiny.\n\nThe next days pass without incident. We reach Cerulean early in the afternoon. To my horror, there is an official waiting in the market district, specifically looking for those intended for the quest. Sally pulls me towards them. The man looks at our marks, then tasks one of his underlings with taking us to a place called The Hall. The Hall is where all the marked are gathering. I can find no way to escape. It would seem that I am going on a quest after all."}, {"comment_author": "TheFlyingRavenBird", "comment_text": "John, the lost crown prince of the fantasy world Nahba, considers just turning around and going back to bed when he sees the old man sitting on his  kitchen table. But, alas, he has work in two hours.\n\n“You do know this is breaking and entering, right?” He eyes the broom propped up against the wall.\n\n“My prince, it is imperative that you listen to me,” Says the wizard for the sixteenth time in a month.\n\n“I did listen. I decided it's bullshit,” says John as he opens the freezer and pulls out a box of waffles. “Can you, like, go? I have work in a few hours.”\n\n\n“Work? Work?! The work of this realm is inconsequential! Your uncle's dark power grows every day! You must-”\n\n“Actually, I don't.” John bites directly into a frozen waffle while popping two more into the toaster.\n\n“The prophecy is clear! You must return to Nahba, retrieve the Sword of Glory, defeat your uncle, and reclaim-”\n\n“Rather not. I like my life, you know?” John takes another bite out of the frozen waffle.\n\n“You like it? A life of servitude, a life of mediocrity, for a prince? Have you been spelled?” \n\n“Hey, I get good benefits! I have a good dentist! And who'd watch Mr. Bitey and Princess if I was off killing skeleton lords, hmm? Hmm, Mr. Wizard?!” \n\n“I-”\n\n“Hmm?”\n\n“You would rather cats-” \n\n“Yep.” John sets his frozen waffle down (on a paper towel, he's not a heathen!) and reaches for the broom.\n\n“Cats?!” \n\n“Cats,” John says, and violently smacks the wizard in the head with his broom. The old man lets out a hiss and vanishes.\n\n“Works every time,” John says."}, {"comment_author": "HuntsmanRoym", "comment_text": "Part I - Eclipse\n\nTomorrow's the day. The fated eclipse will occur, I will set off through nations and skies, oceans and mountains, great cities and quaint towns. My limits will be more than just tested.\n\n\"In your 26th year, there will be a solar eclipse. After that day, your life will change forever; you will lose a part of yourself, becoming something new. And the world will be better for it.\"\n\nThese words have been ricocheting through my head ever since I heard the eclipse was happening. I had forgotten all about them for the past decade or so. Many things have happened: my family being torn a part, unwanted invaders tormenting me for years, the struggles of living every day waking up each morning just to slog through it all yet again. I'm surprised I even remembered the stupid fortune.\n\nWell, tomorrow's it…I guess there isn't much use in worrying and dreading what's to come. I should probably use tonight to prepare, but I can't kid myself - I'll just continue to sit here, reflecting and letting these anxious feelings eat away at my insides into the early morning hours.\n\n \n\nPart II - Journey\n\nThroughout my journey so far, I haven't noticed a part of me change. My anxieties are still tearing me up, and I still suffer each day, waiting for the current one to end and the next one to begin. Perhaps the fortune wasn't meant to happen immediately, I suppose it's only been a few days since the eclipse. If anything though, that worries me even more. I'd just like to get it over with as quickly as possible.\n\nAs I travel through the sky toward a distant nation, I can't help but think of the potential issues I'll face. Firstly, the language barrier. I don't speak their language, they won't speak mine. How will we communicate? What if I spark animosity or offend the wrong people? There's also the issue of me not knowing where to go or how to get anywhere once I arrive. Coupling with the first issue, I won't even be able to ask for directions. Are these people going to think ill of me? Will they berate me? Laugh at me? Hate me? It's not like they are asking my to embark on this quest - it's something that was asked of me.\n\nI'll be arriving soon. I best try to stop thinking about this as much as possible - my stomach will be tossing and turning regardless, so l should just focus on trying to enjoy it.\n\n \n\nPart III - Growth\n\nI'm not sure when it happened. As these two weeks have passed, I've found myself able to do things I couldn't before. Not only is the language barrier not an issue, I can talk to people with little issue. Before hand, an invisible force inside me wouldn't let me. Any social interaction was incredibly difficult to perform. But now…now I've been conversing (well, as much as one can with a language barrier) with this nation's people and taking part in their culture.\n\nI'm no longer focusing on the negatives as much - I still have every now and then, I'll grant that. However, what's it matter that I got lost multiple times? I didn't inconvenience anyone…plus it was even kind of fun trying to interpret the different train lines and when I got off at the incorrect spots, there were people who would help me out of the goodness of their hearts.\n\nThe eclipse, this journey, and even the unfortunate events I lived through prior - they all lead to this. I've overcome these feelings that have held me back in life. That invisible force no longer binds me. I did lose a part of me. I lost a weakness. These experiences I went through, I've become a new me. I'm excited for tomorrow; I'm excited for what life will bring."}, {"comment_author": "Relative_Warthog_421", "comment_text": "**\"And that about sums it up.\"** the old wise man slammed the book shut, small bits of dust came fluttering out of the ancient book. \n\n\"Wait hold on. I have to do what?\" The boy said. They both sat across from each-other, the old man's wooden desk placed in between them. \n\n\"Boy! were you not listening?\" The old man raised his brow. \"I was, it's just I need to make sure of what you said.\"        \"it's not hard to understand! look let me break it down for you; For your first part of the quest you'l need **THE BLADE OF A THOUSAND SOULS!**\" the old man's voice practically echoed as he said it's name. \"The blade of a thousand souls?\" The boy swallowed a ball of fear down his throat.  \"YES, the blade of a thousand souls. And you don't say it like that, you say it like this- **THE BLADE OF A THOUSAND SOULS!**\" the old man's voice echoed again this time even louder, where it made the room seem like the depts of a deep cave \"Okay, THE BLADE OF A THOUSAND SOULS.\"      \"Like I said before to get it you must climb to the top of **MOUNT DEATHSKULL**. It is the mountain with the highest peak within the whole realm.\" the old man smiled with the same childlike glee he wish the boy with would have. \"Then you must find the **TEMPLE OF THE FORGOTTEN!** Once in the temple you most solve some of the most complex puzzles that even the most knowledgeable of minds struggle on. Before then slaying the keeper of **THE BLADE OF A THOUSAND SOULS**- A giant troll.\n\n(EDIT: I'll probably finish this later, but right now its way too late to keep writing, I hope i don't forget about this, feel free to leave constructive criticism)"}]}, {"post_title": "[WP] They were taught to become immune to your magical fear, but they only learned to ignore the fear of death and harm. But as you ran through the trapped halls, they almost screamed while pursuing you, a fear of losing their titles, their positions and their honour.", "post_url": "https://www.reddit.com/r/WritingPrompts/comments/1bytnwm/wp_they_were_taught_to_become_immune_to_your/", "post_main_text": "", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n>* [No AI-generated responses &#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n>* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n>* Responses don't have to fulfill every detail\n>* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22&restrict_sr=on&sort=new&t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22&restrict_sr=on&sort=new&t=all) for stricter titles\n>* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n&#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n&#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n&#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n&#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*"}]}, {"post_title": "[WP] You are forced to inherent the throne as the next king/chief/alpha but you have no idea what you are doing", "post_url": "https://www.reddit.com/r/WritingPrompts/comments/1bywl6j/wp_you_are_forced_to_inherent_the_throne_as_the/", "post_main_text": "", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n>* [No AI-generated responses &#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n>* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n>* Responses don't have to fulfill every detail\n>* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22&restrict_sr=on&sort=new&t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22&restrict_sr=on&sort=new&t=all) for stricter titles\n>* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n&#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n&#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n&#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n&#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*"}]}, {"post_title": "[WP] You are a siren, one of the last of your kind. One day you were swimming and felt nothing but a pinch... and then woke up in some big water box surrounded by your most vicious natural predators: mermaids. ", "post_url": "https://www.reddit.com/r/WritingPrompts/comments/1bywzdp/wp_you_are_a_siren_one_of_the_last_of_your_kind/", "post_main_text": "", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n>* [No AI-generated responses &#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n>* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n>* Responses don't have to fulfill every detail\n>* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22&restrict_sr=on&sort=new&t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22&restrict_sr=on&sort=new&t=all) for stricter titles\n>* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n&#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n&#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n&#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n&#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*"}]}, {"post_title": "[WP] \"Remember as soon as we enter do not trust anyone. No matter who is it is or how they look. Don't even trust me, only your own instict and intuition can help you leave alive.\"", "post_url": "https://www.reddit.com/r/WritingPrompts/comments/1byvirb/wp_remember_as_soon_as_we_enter_do_not_trust/", "post_main_text": "", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n>* [No AI-generated responses &#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n>* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n>* Responses don't have to fulfill every detail\n>* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22&restrict_sr=on&sort=new&t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22&restrict_sr=on&sort=new&t=all) for stricter titles\n>* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n&#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n&#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n&#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n&#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*"}]}, {"post_title": "[WP] After fighting cancer for 2 years you eventually die and reach the gates of heaven, but all of a sudden St. Peter appears and hands you a rejection letter", "post_url": "https://www.reddit.com/r/WritingPrompts/comments/1byyzp7/wp_after_fighting_cancer_for_2_years_you/", "post_main_text": "", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n>* [No AI-generated responses &#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n>* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n>* Responses don't have to fulfill every detail\n>* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22&restrict_sr=on&sort=new&t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22&restrict_sr=on&sort=new&t=all) for stricter titles\n>* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n&#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n&#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n&#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n&#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*"}]}, {"post_title": "[WP] Somebody from the 1800s gets plopped into now.", "post_url": "https://www.reddit.com/r/WritingPrompts/comments/1bywd7g/wp_somebody_from_the_1800s_gets_plopped_into_now/", "post_main_text": "", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n>* [No AI-generated responses &#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n>* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n>* Responses don't have to fulfill every detail\n>* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22&restrict_sr=on&sort=new&t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22&restrict_sr=on&sort=new&t=all) for stricter titles\n>* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n&#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n&#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n&#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n&#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*"}]}, {"post_title": "[RF] Tired of poorly made tea, you finally decide to sit your housemates down and teach them how to make a proper cuppa.", "post_url": "https://www.reddit.com/r/WritingPrompts/comments/1bz0hza/rf_tired_of_poorly_made_tea_you_finally_decide_to/", "post_main_text": "", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n>* [No AI-generated responses &#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n>* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n>* Responses don't have to fulfill every detail\n>* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22&restrict_sr=on&sort=new&t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22&restrict_sr=on&sort=new&t=all) for stricter titles\n>* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n&#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n&#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n&#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n&#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*"}]}, {"post_title": "[WP] \".....Is this real?\" You question as the girl of your dreams is talking and taking interest in you.", "post_url": "https://www.reddit.com/r/WritingPrompts/comments/1bz0e0g/wp_is_this_real_you_question_as_the_girl_of_your/", "post_main_text": "", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n>* [No AI-generated responses &#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n>* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n>* Responses don't have to fulfill every detail\n>* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22&restrict_sr=on&sort=new&t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22&restrict_sr=on&sort=new&t=all) for stricter titles\n>* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n&#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n&#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n&#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n&#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*"}]}, {"post_title": "[WP] It is happening again…", "post_url": "https://www.reddit.com/r/WritingPrompts/comments/1byvcwq/wp_it_is_happening_again/", "post_main_text": "", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n>* [No AI-generated responses &#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n>* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n>* Responses don't have to fulfill every detail\n>* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22&restrict_sr=on&sort=new&t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22&restrict_sr=on&sort=new&t=all) for stricter titles\n>* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n&#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n&#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n&#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n&#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*"}]}]