["[**SatChat! SatChat! Party Time! Excellent!**](https://gfycat.com/FirsthandMadBeardedcollie)\n\nWelcome to the weekly post for introductions, self-promotions, and general discussion! This is a place to meet other users, share your achievements, and talk about whatever's on your mind.\n\n## Suggested Topic\n\n**How does writing make you feel?**\n\nJust call me [The Doctor](https://media1.tenor.com/m/BPgadkFQXG4AAAAC/david-tennant.gif).  When you're writing, what kind of emotions are you going through?  Do you match the emotions of your characters?  Are you happy for writing?  Are you anxious because you're not sure how to end the scene?  [Something else?](https://y.yarn.co/ec5560fd-ba55-4643-bad4-a39a87c87d8f_text.gif)  Let us know!\n\n(*Repeat topic, feel free to suggest more!*)\n\n---\n\n## More to Talk About\n\n* New here?  Introduce yourself! See the sticky comment for suggested intro questions\n* Have something to promote? (Books, subreddits, podcasts, etc., just no spam)\n* Suggest topics for future SatChats!\n\n *Avoid outright spam (don't just share, chat) and not for sharing full stories*\n\n---\n\n[**Apply to be a Mod**](https://www.reddit.com/r/WritingPrompts/comments/1av2k6r/modpost_call_for_moderators/) | **r/WPCritique** | [**Discord Server**](https://discord.gg/writingprompts) (Weekly campfires every Wednesday at 6 pm CST!)", "**Tell us about yourself!**\n\n* Where do you live (State / Country)?\n* Preferred pronouns?\n* How long have you been on Reddit?\n* How long have you been on r/WritingPrompts?\n* Do you use r/WritingPrompts to read or write?\n* Writers:\n * How long have you been writing?\n * What is your writing motivation?\n * What programs do you use to write?\n * How fast can you type? [Try 1 minute on Aesop's fables](https://www.typingtest.com/PromoD/select.html)\n* Readers: \n * How do you find prompt responses to read?\n * Do you also write?\n * if not, why haven't you tried?\n* Want to share a photo? [See our Photo Gallery!](http://www.reddit.com/r/WritingPrompts/wiki/pics)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*", "Long-time writer and reader of /r/writingprompts here! Writing, at its best, can really be a dopamine generator for me. I've always loved writing stories, but now in particular, if I'm having a rough day, I can go to one of the ideas I had recently and sit down to write the story, and my brain just...focuses. It's like it shifts gears into another universe (especially since I write fantasy and scifi) and I engage a part of my brain that feels like a machine. Gears turning smoothly, churning out sentences and then paragraphs and then a whole story. It's something that steadies me and focuses my mind.\n\nAs for 'matching the emotions of my characters' and such, that's definitely the case. My face will shift to the expression a character has, whichever emotions they're dealing with. I'll even sometimes find myself tearing up writing emotional parts, especially if I've been working with the characters for a while, or if the subject matter is something I can relate to. And that happens often; sometimes it's only in hindsight that I'll think, \"Oh wow. Yeah, *this* was going on in my life, it was on my mind, and it came out in my writing at *that*.\"", "I think I try to match my characters' emotions sometimes too! It can help get in their heads.", "**How does writing make you feel?**\n\nWriting makes me feel a plethora of emotions throughout the entire process!  Trepidation to start, anxiety to continue, exhaustion when an idea isn't panning out, upset when the ideas don't come willingly, and disgust when I force the writing to come out just to make progress.  These are just a *few* of the things that come to mind.\n\nBut wait!  Those are all *negative* feelings!  Why would I keep doing something that's only giving me negative feelings?  Hmm...well, I think it's the same reason why a thousand compliments can be outweighed by a single criticism; I'm only thinking about the emotions I feel when writing is front-and-center in my mind, and that's usually only happening when I'm struggling with what I'm writing.\n\nSo let's take a look at the vast majority of what I've done, and am doing, and see what feelings come to mind:\n\nAh yes, there it is; excitement, joy, passion.  The thrill of someone commenting on a piece I've written that shows what I was *trying* to convey shone through.  The joy of seeing a plot-twist land.  The unmatched bliss of someone bringing up your story/character/plot unbidden as an example of something *they* like.\n\nOh, and what have we here?  Digging in a little deeper, looking into the characters and stories themselves, I see emotional labor and cathartic payoff.  There are words I've written with tears on my keyboard because I pulled the emotion from my very soul and saw it echo back.  There are highs of character triumphs that feel earned because of the effort and buildup over hours - or days, or *weeks* \\- of continuous, disciplined effort.\n\nAll of that and more is how writing makes me feel!", "Very well said!", "Friday should be **SciFiFri**  :D", "Heh, that's a good idea! But Fridays are already [Fun Trope Friday!](https://www.reddit.com/r/WritingPrompts/comments/1blc77p/ot_fun_trope_friday_writing_with_tropes_bling/)", "I am an accidental writer. I stared off making up bedtime stories for my kids and during covid I wrote them down and launched them on Amazon. It’s amazing to see my words come to life.\nSo to the question…\n\nYes, I experience the emotions of my characters. I witness the situations building and feel the humour, sadness, guilt etc. all of that.\n\nI really enjoy writing, it’s my go to place…", "That's so cool how you started with bedtime stories!", "Yeah my kids have very strange ideas of humour so my stories were tailored towards that. My favourite is “why do they do that?” It’s on Amazon, free on kindle. Very very funny.", "Writing makes me feel like I can communicate. Its like planning what you'll say. It works similarly with my imagination. It forces me to codify my thoughts into something coherent. In essence, it's an organizing force for me and I enjoy that aspect of it.", "Yeah, well said!", "makes me feel good tbh. it's nice to stretch the ol' imagination engine out once in awhile. I think every human being needs a creative outlet, it's in our nature.\n\nfeels good in the same way going for a jog would feel good", "Yeah, it's always nice when you get to be creative!", "Happy weekend, prompters!\n\nHow do I feel? \n\nWhen the words come to me, and they start to sing, it's a wonderful feeling. When they don't, I may sulk for a few days. I'm just about finished with my next Briefs book, but I'd hope to have it done a month ago. I was just stuck on a story.\n\nI got around it by switching to a different story. That one came to live and I turned a 900 word opening into 5000 words. And as a result, the other story didn't need to be as long, so I was able to jettison some of the backstory and some added flavor that I thought bogged it down. \n\nI put writing off for so long, and now I just want to enjoy  it.\n\nMore updates to r/xwhy coming soon -- as soon as this book gets put to bed. (Waiting on a cover.)", "Yeah, it depends on if the words are coming or not!\n\nI should try the switching stories idea, but I can't seem to do much else besides my r/DCFU writing these days. At least I'm doing something!", "Howdy doodily fellow writters and readers!\n\nFresh face ij the sub and I honestly stumbled into it while scrolling through reddit a few days back, that aside I'm really enjoying seeimg the prompts and even writing a few short pieces in response!\n\nHoping to do one short piece every 3 or so days  but sometimes the brain gets more grey than normal lol\n\n\nTruth be told, I always hated writing, more specifically I hated how I couldn't get into wrting stories of my own. I loved fiction and stories but I couldn't imagine making something like that at all.\nThen some stuff happened and I found a new love and appreciation for writing and fiction again.\n\n\nMy writing is more horror themed but my biggest influences are actually more fantasy based stories and manga\n\n\nNow when I write its a bit of a struggle to get into the flow with my own ideas because I just can't seem to stop twisting them. Even so it's still fun as hell when I really get into the swing of it.\n\n\nNow I'm aiming to explore just how far down I can dig into the lovecraftian style of horror and just how well I can express and convey it to any reader that's interested", "Welcome!\n\nWriting once every three days isn't a bad goal, good luck with it!", "Well met lads! Garrr here, and I'm new to this sub. Although I've been writing for a while now, just really didn't have the confidence to post it on large sites. \n\n**How does writing make you feel?**\n\nUnlike drawing where I'm limited to the image I want to portray, writing allows me to mash multiple creative ideas together. It's like playing sims but you have full control on what you want to happen. Writing also serves as an outlet for me because I'm able to convey my feelings through stories.\n\nOverall, writing makes me feel like an excited child who wants to do so many things at that moment", "Welcome!\n\nOoh, I like that mashing creative ideas together explanation, well said!", "Whoops, I keep forgetting about these. Well, better late than never, right?\n\nHow does writing make me feel? A lot of things. \n\nWhen I'm having a good writing day, it's great. It's like pouring a pitcher of water into a glass, everything is smooth and silky, if that makes any sense. When I can get the story out the way I want to, it's just sort of a general feeling of accomplishment, pride, whatever you want to call it.\n\nWhen I'm having a bad writing day, it feels kinda like rubbing a brick on a sunburn. I think u/ZackTheLitchKing said it best. Forcing it only makes me feel disgusted at the subpar quality later on. It's almost physically painful when I can't get the juices flowing. And rewriting scenes, even a little bit drives me mad. \n\nWhen I can't write, I get worried that I'll never be able to again. Like, what I just stopped being able to do it one day? What if the special something never comes back? What if the well of creativity is dried up forever?\n\nAt the end of a session—and mine are *long.* If nothing keeps me from continuing, I will literally just sit there and write for like the whole day (In a perfect world I could do that everyday)—my brain usually feels sore. It's the same feeling I get after spending hours studying something, or trying to wrap my head around a new concept that just wont click.", "Yeah, a long writing session can be exhausting! But when you finish, it can feel so cathartic!", "I remember this question! As I recall I compared it to creating the road in front of me as I went on a good day and trying to hack a sculpture out of a slab of marble on a bad one. I've been having more of those marble slab days lately...", "Oh yeah! Those marble slab days can be tough, but if you keep at it, you'll get the sculpture down!", "Hi I'm a random weirdo! (Perfers he/him pronouns but they/them works too) Nice to meet everyone, I'm not completely sure how this works so here we go, writing makes me feel like I exist, when I'm having a bad day and can't understand my emotions, or when I am numb, I can bury myself in the story, feeling frustrated, or so excited I think I'll explode its like a Rollercoaster when the characters feel a way I try to sympathize with them, (they can be a pain) I try to put effort into my writing, and cannot wait to get creative!", "I also love getting creative! It's so much fun and rewarding!", "&nbsp;\n\n# Welcome to Writer’s Spotlight\n\nRemember, spotlights rely on your nominations! So if there's anyone around the subreddit whose stories you love and you think deserves a shout-out, please do nominate them by sending us a [ModMail](https://www.reddit.com/message/compose?to=/r/WritingPrompts).\n\n&nbsp;\n\n***\n\n&nbsp;\n\nThis week we are celebrating u/Booksmagic\n\nBooksmagic has been writing, reading, and prompting on the subreddit for a few years now. They have a wonderful sense of humour that is very well suited to the “trope with a twist” style of prompts that are popular here on the subreddit. Their dialogue is snappy and fun to read. Their characters are captivating. And their worlds feel well built out within the relatively short word counts. And as well as writing and prompting, they also take time to read and comment on others stories, which we always love to see. If you want to read more of their work, you can find it on their profile.\n\nWant to congratulate this week's Spotlight recipient? Have questions you're dying to ask them? Please do so below in the comments!\n\n\n&nbsp;\n\n#Congrats on your spotlight /u/Booksmagic\n\n\n&nbsp;\n\n***\n\n&nbsp;\n\n# Read u/Booksmagic’s most recent story:\n\n&nbsp;\n\n[[WP] At the age of 16 all witches are assigned a familiar. You are excited for yours as you see your friends turn 16 and get theirs. Cats, Crows, spiders. You are devastated to find out that out your 16th birthday, your familiar is a 27 year old hipster named Frank.](https://www.reddit.com/r/WritingPrompts/comments/1bl5rul/comment/kw3xprs/)\n\n&nbsp;\n\n# Their most upvoted Stories:\n\n[[WP] Due to a rare brain condition you've spent your entire life hallucinating the presence of a six foot tall penguin. You're on a date one day when you're asked \"So what's the deal with the penguin?\"](https://www.reddit.com/r/WritingPrompts/comments/m4pln4/comment/gqw0aah/)\n\n&nbsp;\n\n[[WP] The teen superhero accidentally just called the supervillain “Mom”.\nSimple Prompt\n](https://www.reddit.com/r/WritingPrompts/comments/1797i6r/comment/k55zqt8/)\n\n&nbsp;\n\n[[WP]\"Before you grant me my wishes, may I ask, how did you become a genie?\"](https://www.reddit.com/r/WritingPrompts/comments/17uhkxu/comment/k94fopl/)\n\n\n&nbsp;\n\n***\nTo view previously spotlit writers visit our [Spotlight Archive](https://www.reddit.com/r/WritingPrompts/wiki/showcase). \n\n&nbsp;\n\nTo make a nomination please send us a [ModMail](https://www.reddit.com/message/compose?to=/r/WritingPrompts) telling us which user you are nominating. If you’d like to include a reason for your decision we’d love to hear it!\n\n***\n         \nLike features?\n\n* Try your hand at constrained writing with [SEUS](https://www.reddit.com/r/WritingPrompts/wiki/smash)\n\n* Grow as a writer with [Talking Tuesday](https://www.reddit.com/r/WritingPrompts/wiki/talking)\n\n* Practice poetry at our monthly feature: [Poetry Corner](https://www.reddit.com/r/WritingPrompts/wiki/wildcard/)\n\n* Create a story using the weekly theme for [Theme Thursday](https://www.reddit.com/r/WritingPrompts/wiki/theme_thursdays)\n \n* Check out our newest weekly feature [Fun Trope Friday!](https://www.reddit.com/r/WritingPrompts/comments/11u2hbp/ot_fun_trope_friday_writing_with_tropes_reluctant/?utm_source=share&utm_medium=web2x&context=3)\n\n* Chat with other writers with [SatChat](https://www.reddit.com/r/WritingPrompts/wiki/sps)\n\n* Share stories you’ve written on (or off) the subreddit and receive feedback via our campfire events on our [discord server](https://discord.gg/writingprompts)\n\n***\n\n[Come hang out on our discord](https://discord.gg/writingprompts). Meet other members from around the globe and chat about anything. We are a friendly bunch and love newcomers. We also have regularly scheduled readings over voice chat!\n\nLove the community and want to take on a more active role? [Apply to join the moderation Team!](https://www.reddit.com/r/WritingPrompts/comments/8zifl5/modpost_call_for_moderators/)", "Wow, thank you! I can honestly tell you that this absolutely made my day", "Congratulations u/Booksmagic! I very much enjoyed getting better acquainted with your work to make this post! I particularly enjoyed the story about the penguin spirit guardian (not that I'm obsessed with penguins or anything). Now, as is tradition, time for some questions!\n\n1) Do you have a particular piece on the subreddit that you're most proud of or that you think best encapsulates your writing style?\n\n2) What do you enjoy most about writing?\n\n3) If you had to go to an all you can eat buffet with one of your characters, who would you choose and why?", "Thank you! I’m glad that you liked the penguin story, I think that might’ve been one of the first short stories I’ve posted here (if memory serves right). \n\n1. My newer stories probably encapsulate my writing style better nowadays since I like to think I improve bit by bit with practice. Although one of my personal favorites might be https://www.reddit.com/r/WritingPrompts/s/eyUc9018iB it’s about the Antichrist “rebelling” against his dad Lucifer. I’ve just always liked the concept. \n\n2. I love the feeling of satisfaction I get whenever I finish/post a story. And nice comments can be an ego boost lol. \n\n3. Probably the Genie. I feel like he’d enjoy a good buffet and have plenty of stories about past wishes and the supernatural world to share.", "Thanks for the answers! I very much enjoyed the antichrist story! And I definitely feel you on the nice comments. As good as writing can be on its own, we all need a little external validation now and then.", "Heya u/Booksmagic congrats on the spotlight :D\n\nAs per tradition, here are some invasive questions >:D\n\n* Of all the stories you've written, which one is a \"world\" you'd like most to visit for two or three days but *not* stay permanently?\n* Are there any genres you enjoy reading but haven't yet had the chance or inspiration to write that you would like to try?\n* Do you have any recurring characters in the stories you write?  If so, which of them would beat all of the others in a game of Monopoly? (If not, which of your favorite characters would be the most graceful loser in Monopoly?)", "Thank you! We gotta always follow tradition lol. \n\n•Tough choice, but I’ll probably have to go with the world from my latest prompt fill (the one with the witches). I would’ve gone with a high fantasy world, but then I remembered the lack of plumbing in those worlds lol. That would get old quick. \n\n•Probably space opera. I’ve always wanted to write something about space pirates specifically, but never got around to it. \n\n•I dont have any recurring characters (but that sounds like a fun idea now that you mention it) but I think Susan (from https://www.reddit.com/r/WritingPrompts/s/0Ni6fFEEtz) would handle losing the best. But on the flip side, Lucifer from the same story would handle it the worst lol. Their son would be somewhere in between.", "", "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n>* [No AI-generated responses &#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n>* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n>* Responses don't have to fulfill every detail\n>* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22&restrict_sr=on&sort=new&t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22&restrict_sr=on&sort=new&t=all) for stricter titles\n>* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n&#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n&#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n&#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n&#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*", "\"Fuck, ANOTHER hopeless Earth?!?!\", exasperated, I throw travel back to my original to dive back into my bed.\n\n*This is not good. Every day, a new Earth seems to be hit with an Apocalypse. Zombies, meteors, demons - you name it, Earth has been overrun by it. The worst part, it seems to be following me, coming closer and closer to my dimension. Well I will deal with it tomorrow, I really need sleep, I have been hopping all day, and it's already midnight.*\n\n\n'Ring Ring'\n\nRolling over, I reach for and grab my phone. \n\n*Who is fucking calling right now, I'm tired as hell.*\n\nThe dark screen lights up, a bright number - 7:45 - pops up, and beneath it, 5 missed calls. Just as I go to swipe on the missed calls, another one pops up.\n\n*Ugh Aiden*\n\nPutting the phone to my ear, \"Yo why are you calling me so many damn times this early in the morning, you kn..\"\n\n\"Shut up for a second and listen. I know you just woke up, so you haven't looked outside, but you know how you said all the apolocalyptic worlds you visited have a sky which looks like it's shatter glass.\"\n\n\"Ya... Why do you ask?\" I question with a sinking feeling in my stomach.\n\n\"Look outside now...\"\n\nI walk over to my window and push aside the curtains. The one vibrant blue sky with white clouds, have instead turned to a blood red sky with a slight purple hue. A crisscross of lines throughout the entire sky, much like shatter glass. The ground covered with fog, the scene outside vastly different than before.\n\n*Well fuck, it seems I could not outran the apolocalypse, now how do I deal with this bullshit situation?*\n\nStaring at the stunning but eerie view, I slump to the floor whole asking myself that question.", "small but amazing, Thank you!!", "I guess it's the end of running and trying to find the cause of this apocalypse.\n\nThat said, is the apocalypse caused by protag jumping through dimensions, or is it because of something else? What will the original timeline be facing in this timeline, and can protag solve this situation?\n\nGreat work on writing this!", "The entity phases in and out of the threads of Laura's reality, weaving between timelines and parallel worlds. A multitude of eyes blinking in and out of existence. Chelicerae click and fidget, while a swarm of tentacles wiggle and twist. It feels something far greater than the mass of infinite blackness currently occupying the glass box on her table.\n\nBut it is here. In her office. Again.\n\n“Welcome back to Dimensional Estates, Mr…Hopper,” Laura’s lips pull into a forced smile, even as that same sense of dread creeps up her spine. She shouldn’t be fearful. Mr. Hopper is a nice, repeat customer. But everything about this serial dimensional traveller unnerves her, from how many dimensions it spans across the realms, or the countless, everchanging appendages flailing about. Her sanity preserved only because Mr. Hopper is sufficiently kind to assume a smaller, less intimidating form of a little black thing in a glass box.\n\n“Greetings Laura. Would you have the coordinates to any apocalyptic worlds again?” Its pervasive whispers lurk within her mind.\n\n“We currently have over 18,945 apocalyptic Earths for you to consider rescuing,” She gestures towards the company’s catalog of alternate universes. “How was the last Apocalypse Earth-207 I recommended you?”\n\n“How unfortunate to hear the number of apocalyptic Earths remain on the rise,” Mr. Hopper let out a wispy sigh that swirls within her brain. Stirring her senses like a secret agent wouldn’t shake his martini. “We are happy you recall our last destination. As much as it brings us joy to say we have restored life to Earth-207.”\n\n“Excellent job as always,” Laura did her best to be happy for it, even though the scale of events were beyond her perception. She’s just another drone in the company, a perfectly ordinary human and employee who could never see beyond the three dimensions of her office and home. Unable to witness the tremendous powers it takes to reverse the damage of a doomsday apocalypse looming over an entire planet in a different dimension from her own.\n\nTentacles twitch and jaws snap. The black blob in the box bobs up and down. That’s a happy expression, Laura thinks.\n\n“Are you sure you want another apocalyptic Earth to save instead of a more…vibrant planet?” She offers hopefully. “Would you like to give yourself a break from all the doom and gloom of the numerous apocalypse scenarios you’ve ventured with us?”\n\n“We wish to right the wrongs of the multiverse. Entire existences have been upended. Whole dimensions collapsed and never to live again,” Mr. Hopper speaks into her very being. “We have saved many earths from apocalypse, it is never enough. It bothers us that for every Earth we save, there are at least twenty more that are in danger of an apocalyptic mass extinction. For every intervention we have succeeded, there have been mass extinctions we failed to prevent. We will not stop. We do not rest. Entropic destruction waits for no dimensional traveller.”\n\n“Very well,” Laura takes a deep breath and taps her pen. \"Give me some time to search the dimensional database.\"\n\n“Please don’t take too long. We are sorry to rush you. Sincerely so. We are patient, but the same cannot be said of Death. He must claim those whose time is due, and he will not wait for us,” the waves of squirming tentacles threaten to breach its self-imposed boundaries set to protect Laura’s sanity. “Every moment we dawdle, humans perish in one of many apocalyptic Earths.”\n\nShe pulls out a stack of folders. “Earth-376. Facing a zombie apocalypse. You’ve stopped a few of these before, according to past records. I trust you’ll blitz through this one in record time, so I’ve prepared this stack of worlds. You traverse these planets as easily as turning a corner in a street. I’m sure you’ll save them all.”\n\nA toothy grin ripples into the black mass. “We are flattered you think highly of us. You have made our day. We are no different than a boy who tosses starfish into the sea to save the thousands stranded on the beach. So many of our brethren call us fools. Thousands upon thousands of dying worlds. You cannot save them all. Every day, many more lurch forward to their doom. We have always insisted we can make a difference for every apocalypse we undo. And we are thrilled someone can see the difference we make. You who believe we just might be able to save them all. Thank you, Laura.”\n\n“And thank you too, Mr. Hopper. I would typically say good luck and godspeed, but you are a god.”\n\n“Just another small god among thousands,” it whispers.\n\nLaura shakes her head and smiles as the black mass fades from her reality into the next. “But you’re the god with the biggest heart I’ve seen.”", "oh this is actually so sweet and so good at showing her perspective of such an alien presence, that’s also so human in it’s own way.", "\"Something's coming...and we're not gonna like it,\" I say.\n\nTravellin between parallel universes, or World Hopping as I like to call it, is as simple as pressing a button for me. Its quite the fun and unique hobby, I reccommend you try it out. Yknow, if you can get your hands on alien technology.\n\nIve been in my fair share of apocalyptic worlds, some I even visit on the regular. Ive also been to near-apocalyptic worlds, where humanity's doom is just one event away. My first hop was to one of those, and theyre definitely my favorite.\n\nIve made it half my life's mission to find as many of these \"pre-apocalypse\" worlds as I can and keep them from plunging into disaster. Saving these worlds is the only way I can satisfy my craving for satisfaction and thrill. Plus, people don't die, so its a win win. But recently...its become less fun and more stressful.\n\n\"Pre-apocalypse universes have been popping up left and right, and growing in severity. I don't like the pattern im seeing...it's unnatural. Something, or someone, is throwing the multiverse out of wack.\"\n\nI like to think I am in total control, and that I can change the circumstances if I need to. A little part of the \"invincibility complex\" my friends have pointed out I have. But this...this supernatural-no, *omninatural* force? This is something only God can control. I'm powerless to do anything. I hate feeling powerless.\n\n\"I mean shit man, I failed to save that universe! I wasn't quite good enough...and I really cared about that one. This hasnt happened since..well, I don't wanna think about it. I've been travelling and searching for people for years, recruiting the best because I knew in the back of my mind this might happen but...what if it's not enough? What if I fail again...\"\n\nI usually vent my world-hopping dillemas to my friend Nathan, who's been with me the longest and understands this the best. But today I need a direct, unfiltered answer, and only my friend Troy can provide that for me.\n\n\"So then make sure it will be enough,\" he says, \"Prepare for the absolute worst. And don't stop preparing until doomsday comes. You wanna save the worlds? Protect your friends? You cant do that by bitching and moaning about it here. Don't ever say 'i'm sure this will be enough'. Do more. Im no expert, but I don't think there's such a thing as overkill when it comes to the multiverse.\"\n\nI give him a slight smile. \"I suppose our work is never done, is it?\"\n\n\"Not until we eat the dirt.\"\n\nI suppose there'll be time to rest when we're sleeping in a casket.", "Protag be attempt to save each of these timelines as if loading another player's save file and trying to salvage the situation, damn. Glad they got some friends to talk to, or they might just succumb from the amount of stress and the increasing guilt depending on the amount of failed timelines.\n\nThat said, will things get better from this point on, or will the apocalypse just keep ramping up its difficulty?\n\nGreat work on writing this!", "Aoibheann MacGillivrey, also known as Flutterfae the fae-magic wielding heroine, was one of the few heroes in the Council of Altruists with a powerful perceptive ability. She could cross timelines and realities, and this was a power she used to keep her own native timeline safe.\n\nShe had been long accustomed to hopping across multiple realities and various time streams... But a recent trend had been weighing heavily on her mind.\n\nThat was the trend of alternate-reality Earths being destroyed or left utterly desolate.\n\nLike the Earth where the Flutterfae of that reality died from a mysterious fever, and that reality's Combocaster (who loved Flutterfae, seemingly a constant across all the realities), maddened by grief, struck the planet with a single blow - that SHATTERED the globe.\n\nOr the Earth where the Tyu'Ayniq aliens convinced the Galactic Council to unite against Earth. Earth was bombarded from high orbit, and left a blackened, charred and lifeless sphere.\n\nOr the Earth where an unrepentant Alinea \"La Buscadora de Sangre\" Rocha the dread vampiress affected Variance with vampirism, and he counted down all mankind to be vampires - only for all of Earth to starve to death once all the animals were dead, in DAYS.\n\nOr the Earth where Dreadword and Gravebreaker never turned good, and they ruled as co-tyrants. Dreadword cursed the living to be his slaves, while Gravebreaker enslaved the dead. Earth wasn't destroyed but it was a global dystopia with absolutely no future.\n\nWhat made it strange was one common thing. These alternate Earths had all along been doing exceptionally well. It seemed like they would go on to be like the Earth of the Central Timeline - a world at peace, watched over caringly by a united Council of Altruists.\n\nWhat, then, could have meddled and turned the alternate Earths which were doing well, into wreckage, ruins and dystopias?\n\nFlutterfae knew that there were plenty of interdimensional horrors of the eldritch voids' depths. Horrors that had the power and the craftiness needed to make a good Earth reality into a total mess.\n\nHowever, she smiled even as she contacted Combocaster. For they had one ace up their sleeves that they could deploy. Apparently no one had guessed that a Sauron-crafted ring of power had amazing dimensional-spanning powers contained in it.\n\n\"Nate, be a sweetheart, would you, and come and find me at the downtown Belfast Starbucks?\"\n\nNathanael's cheery voice replied, \"Anything for you, my angel.\"\n\nFlutterfae then added, \"And if you will, do bring your student from your academy, Khamul III. I think we can entrust him with a mission. A mission that can prove he is sincere in his desire to do good unlike his forerunners before him, as he himself has always said.\"\n\nCombocaster was a bit puzzled but he fully trusted Flutterfae, and he replied brightly,\" Alright! See you in a bit!\"\n\nFlutterfae smiled. She believed she could do something to rectify what she felt was an interdimensional imbalance, done by a sinister unknown hand.", "", "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n>* [No AI-generated responses &#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n>* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n>* Responses don't have to fulfill every detail\n>* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22&restrict_sr=on&sort=new&t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22&restrict_sr=on&sort=new&t=all) for stricter titles\n>* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n&#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n&#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n&#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n&#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*", "so like [this?](https://www.webtoons.com/en/canvas/pet-foolery/silver/viewer?title_no=691801&episode_no=65)", "I huddled in the small alley as the rain fell. It was cold, and I wished it was dark so I could at least turn and utilize my fur. Unfortunately, the few rags I had on would have to suffice. \"-Telling you it's the only way.. if we want to kill that beast, we'll need to use Silver!\" My ears perked up as I heard the conversation through the wall. I listened carefully as they spoke. \"I don't know... how the hell are we supposed to do it?\"\n\n\"Silver is like poison to a Werewolf. One touch, and it's dead. Even more so if it gets into the bloodstream.\" I sat back stunned. How the hell did they find out? Oh, well. I'd heard this story before. Danced this number. Silver didn't kill us.. well, maybe a bullet, but hell, a bullet is still a bullet regardless of what it's made of... A crack of thunder shook me from my thoughts. \"Maybe... maybe this might actually work...\" That night I set out. From the sounds of things the two men had acquired enough silver, they felt they could kill me pretty quickly. I silently made my way to the forests edge and stripped before calling on the beast. As my turn completed, I ran off towards their planned hunting ground. I picked up the scent of their campfire, and I made my way to the smell. As I approached, I heard them talking. \"Silver, gold, a bit of Steel ore.. One of these has to work, right?\" The older one nodded. \"Bound to.\" I smirked. Stepping forward, I let loose a fearsome growl. Announcing my presence.\n\n\"Gods help us...\" I heard the younger say as I approached quickly he threw a silver ingot at me. I feigned a yelp but kept moving forward. Next came another ingot, 4 more. Each time, I yelped as though it burned. They next moved to the Steel. I ignored them, much to their chagrin. Next came the gold ingots. As soon as one touched me, I snarled, yelped, and collapsed. I lay still, feigning a whimper as they moved in. \"COVER HIM!\" They moved closer as They covered me with the precious ingots placing all on my chest as I yelped before going still. I did my best to slow my breathing as the two stated at me. \"Did we... did we do it?\" \n\n\"He ain't breathin, is he? Bastard's dead.\" I sensed one move closer to me. \"DONT TOUCH IT IDIOT! Let's pack up and get out of here. Leave the body for the animals.\" The two packed up their camp and left, and for a moment, I was surprised it worked. *Thank God they're both idiots.* After a few minutes I sat up and gathered the ingots. They weren't massive, most were only the size of a stone. A few were actual coins. I huffed a Wolven laugh, before setting off with my gains. \n\n\nThe next morning I returned to my clothes and dressed before making my way to the magistrate. He seemed surprised but questioned nothing as I handed him thr few gold coins to buy a home.The remaining silver was used to buy some new clothes and some meat. The rest I saved for future use. The two men bragged about killing the beast. I didn't mind. For the amount of silver and gold I had gotten I was able to hunt less, leaving much of my turns silent. An easy gain for a simple trick.", "Thanks so much for doing my prompt!", "Gotta love the classic thunderstrike in the background during the eureka moment lmao. Protag should maybe pursue an acting career too at this point. Glad that things turn out for the better for protag though, give this woof some more moments of peace.\n\nThat said, what will protag do once they ran out of money? Will protag be able to avoid a life of poverty from this point on? Also, this scheme of pretending to be weak to silver won't backfire on the townsfolks, I hope?\n\nGreat work on writing this!", "", "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n>* [No AI-generated responses &#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n>* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n>* Responses don't have to fulfill every detail\n>* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22&restrict_sr=on&sort=new&t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22&restrict_sr=on&sort=new&t=all) for stricter titles\n>* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n&#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n&#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n&#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n&#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*", "Bury the person in meat before you heal them and they'll be fine.", "Reminds me of a book i once read that mentioned a healer who was able to save her sister from the brink of death by...chugging gallons of melted butter and fistfuls of multivitamins.", "science in magic? what?", "So that's why that warrior kept stuffing whole wheels of cheese into his mouth mid-combat...", "This reminds me of a healing skill in the novel \"everyone else is a returnee\", which needs \"resting power/energy\", instead of mana, to fuel the healing process.\n\nLike if the MC uses the skill once, he would have to rest for some time to refill his energy before being able to use it again. So it's not like natural cool-down when it needs X time past until you can use it, but you need to actively rest yourselves until you can use it again. You can choose not to rest, but then you can not use it until you have rested sufficiently.\n\nWhich is kinda cool imo, nice and balance.\n\nUntil, ofc, it becomes not balance anymore lol.", "Just watch the latest released episode of \"delicious in dungeon\" I hope, hahaha. Very similar premise, Healing burns calories, roughly doubly so. reviving someone from the dead (skeletal remains only), they used a dragons corpse.\n\nGood prompt, as always peoples short stories are fantastic!", "\"Keep eating that stew if you want to live!\", I screamed as I channeled even more mana through my hands into their chest.  You might ask why I'm asking a man to eat while he's bleeding out from a chest wound and can barely breathe, but I promise it will make sense in a moment.  \n\nThe Mystic Guild never asked why there was a limit to healing.  They never asked why one person could have a whole leg regenerated, while another died while trying to grow a new finger.  They called it mana depletion, claimed some people were better conduits than others, and things like that.  \n\nProbably because none of them ever studied the human body.  It's a wonder they can actually heal anybody at all.  \n\nFortunately... or maybe unfortunately for me, I had apprenticed with a non-magical herbalist before an incident with a drunken mage and a failed experiment gave me magical potential.  People usually were either born with magical potential or not, which left the Guild with zero idea what to do with me.  After an accelerated basic training, I was allowed to go into healing magic, since it was clear I had an affinity for healing, even before I was magical.  \n\nI was the best and worst student in the healing school.  The best, because I could do things nobody else could.  The worst, because I questioned everything.  The Mystic Guild struggled to incorporate knowledge of the physical world into their knowledge of the mystic arts, and healing was where it was most apparent.  \n\nAny first year herbalist would tell you that the human body needs fuel to function, and even more than usual when you were sick.  While mana can supplement the body's healing abilities, it cannot remove the requirement for nutrition to fuel the body.  \n\nWhile the guild finally cast me out as a bastard child, both royal and common sought me out, because I could do things that the Guild could not.  \n\nSadly, the king decided my best use was as the premiere battlefield medic.  He does, at least, understand that I must keep people fed to keep them healed.  \n\nStew is the not the easiest thing to feed an injured person.  I should ask the king for an alchemist assistant, see if they can create something more concentrated.", "The first line made me laugh", "I like to think this person gets strapped with satchels of calorie dense cereal bars. Basically this world's take on clif bars, after realizing patients eating stew is much too slow as a way of calorie intake. Possibly keeps vials of liquid fat and sugars that can be pumped into unconscious patients that are incapable of chewing and swallowing. The field hospital is probably directly attached to the camp kitchens as well.", "Eat the stew!", "Or, this medic invents the i.v. drip in this world. Made of some kind of animal intestine.", "“Marie? What’s wrong?”\n\nMy head rose to look at my husband, his face creased with concern. I’d come in from the chicken coop and gone straight to my office, and Robert must have seen something disturbed on my face to come after me. It had been the third time he’d said my name, but I’d been staring at the scribbles in my notebook, and it had felt like it would take too much energy to merely look up at him.\n\n*Too much energy. Ha.*\n\n“I’ve made a discovery,” I said quietly.\n\nRobert had been standing a few feet past the threshold to my office and he now took a few steps closer, taking a knee next to me. “Darling, you say that as if it’s the worst discovery since the torture spells of the Great War.”\n\nLetting out a long breath through my nose, I shook my head. “This isn’t about physical pain. It’s about morality. For all I know, someone before me figured this out and chose to keep it to themselves.”\n\nPutting a hand on my arm, Robert gave me an encouraging look. “Knowledge always comes out. Secrets in magic rarely stay hidden, considering how many study the arts. So, why don’t you share with me what you’ve discovered, and we’ll find out if…if you’re the second person to decide not to share what you learned. You don’t have to publish a finding if you don’t want to.”\n\nRobert had always been my rock, the one to steady me in my tornado of books and parchment and furious note-taking that cramped up my hand. For seventeen years now, he’d been the one I would babble to at the dinner table about a remarkable new breakthrough, or complain to about the foolishness and recklessness of certain mages. It was tempting to think my husband could find another way to look at this that I hadn’t seen, but I couldn’t manage it.\n\n“You’re thinking that any of the discoveries I could make are wonderful,” I told him. “That’s not the case. Sometimes results can be both magnificent and appalling.”\n\n&#x200B;\n\nPart 1 of 2", "Part 2 of 2\n\n&#x200B;\n\n“What?” he asked, blinking. “You’re studying improvements in healing magic, aren’t you?”\n\nI didn’t reply. “Everyone is aware of its limits,” I spoke, leaning forward and picking up my fountain pen to fidget with, leaning back in my chair. Robert stood up, sitting on the edge of my desk to face me. “If you attempt to fully heal a broken leg, or a punctured heart, or a wrist that is so damaged it will require amputation, the body can’t handle it. So, we stick to the small things. Also, we take our time, stabilizing a patient, performing incremental steps until they’re fully healed.\n\n“But of course, for centuries we’ve wondered what we could do to improve on that. To increase the body’s ability to heal itself, without overloading the capacity it’s limited to. And there have been innovations. Still, the most desperate healers on the battlefield must push a soldier’s body to its limits, walking right up to the edge of a cliff that would send the body into a cascading failure. Drawing on glycogen from the liver and muscles, the body cannibalizing itself, pulling protein into the process, then gluconeogenesis from-”\n\n“I feel you’re about to lose me, dear,” Robert said, a hint of amusement in his tone.\n\n“Oh.” I shook my head. “Our body has energy stores. We use them to heal. But…these energy stores come from everything we eat; we’re renewing them constantly.”\n\n“But wouldn’t that mean as long as someone keeps eating, stuffing their face with food, the healer could keep going?”\n\nI was already shaking my head. “That’s what I was looking into. If it was just a matter of having a steak and baked potato before the healer did the work, that’s one thing, but the body needs time to process it. So, yes, the same calories and nutrients that fuel our body can go toward healing, but we’re simply incapable of digesting it fast enough.”\n\n“That’s new,” Robert said, shocked, drawing my gaze. “What you just said there, steak and potatoes, would that work?”\n\n“Yes,” I said softly. “There is a marked difference in the amount of healing, and I was excited at these results, but it’s not as much as you’d hope. The issue goes back to digesting it into fuel the body can use. We could even use a feeding tube directly into the stomach, bypass the process of eating and the work of the stomach entirely, but that won’t give the body what it needs.”\n\nRobert folded his arms. “Okay so- Yes, so, that’s…good. A staggering jump forward in giving the body nutrition like that, it works to help the healer. What’s the problem?”\n\nI tapped the end of the pen a few times on my desk thoughtfully. “You can take the energy stores directly from a chicken. I cut the back of my arm with a knife and used a healing spell to take the energy stores from the chicken when mine ran low.”\n\nAfter a few beats, my husband coughed out a laugh. “That’s incredible. If- The hospital could have chickens, goats, cows- Look, you need to get to the part where-”\n\n“You were close,” I told him. “You were growing the donor’s size. We can do this with people too, Robert.” He stared at me, opened his mouth, and then closed it. “Furthermore, if someone is on the verge of death, we can even have animals standing by, ready to sacrifice for the mana. But mana from humans stretches further.”\n\n“And they could take all of it. They can take someone else’s life to heal themselves?” he whispered.\n\n“Worse. Imagine a battlefield,” I said solemnly, looking back to the pen in my hand. I tapped it slowly, rhythmically. “Imagine a healer with one soldier on the brink of death, where attempting to heal him to a point of stabilization would kill him. But…there is a second soldier that has a fatal injury can’t be healed. You can only make them comfortable, but there’s nothing more you can do. Maybe they will last a day, maybe an hour, but it’s untreatable. Unfixable.”\n\nLooking up to meet my husband’s gaze as he stared at me in shock, horror-struck, I asked, “Do they have standing orders to kill him to save the first soldier?”\n\n\n&#x200B;\n\n/r/storiesbykaren", ".... now all I can think about is \"Life Donors\", slaves being used as glorified healing batteries for the wealthy and powerful.", "Funnily enough, the US military considered having O- blood donors/soldiers travel with combat medics. Blood doesn't keep very long once removed from the body, but if it stays in the donor until needed, it stays fresh. I think they ended up scrapping the idea.", "Nice, I like the darker twist to it.", "And seeing as the healer can do this to themselves when injured. They could become a battlehealer, fighting on the battlefield, unstoppable while there are still enemies (or allies) around", "Reminds me of an HFY story I need to follow up on involving a portal opening up near modern day san Diego and war kicking off with, I think, essentially elves that use POWs to power magical weaponry.", "Amazing.", "Keep a stable of fat people as bio-batts. Have them under orders to consume 5 dense meals a day and move as little as possible.", "They did not scrap that idea, but only a good unit will actually utilize this. O- soldiers were on orders to find the nearest medic if there were injuries and they were not needed for defense. We called them “walking blood banks” and we carried blood transfusion and typing kits with us.", "Retreat hell.... Such a good one\n\nETA link\n[retreat hell](https://www.reddit.com/r/HFY/s/xzs13bwci7)", "<low whistle> Holy shit.", "Or just surgically implant a feeding tube into them and force-feed them whenever they aren't needed to follow their owner as an insurance policy. This discovery just keeps getting worse.", "Thank you! I know I have it buried in my bookmarks on here but couldn't remember the name for the life of me. Appreciate it!", "Ullia awoke to the sound of repeating stabs, slowly drawing closer to her. With each repeat, the ground shook ensuring her attention. She immediately sat up, clutching at her mana stone. It was warm beneath her fingers, confirming her enchantment was still in place. The realisation made her relax, knowing that most people wouldn't detect her here.\n\nThe stabbing slowed, before a low voice rumbled out. \"User of magic, art thou friend to strangers, or foe?\"\n\nShe shivered in place, relaxation shattering. To see through the spell, they had to be strong, and in all likelihood stronger than her. And with that strange stabbing sound, she wasn't sure if she wanted to know who it was.\n\nBut to not answer would also possibly draw their ire. Ullia called out, trying to sound more confident then she was. \"I... I'm a friend to those who wish to be friends.\"\n\nThere was a pause, before she heard a low chuckle. Fear climbed in her chest, even as they spoke again. \"Good. I am pleased to hear thy speech, for thou speak no falsities. May my companion and I make use of thy fire, for this one night?\"\n\nShe shook, before moving to her tent flaps. The mana stone buzzed, as she opened her connection to her power wider. As she peeked out, before falling still. The fear rose to a crescendo, her body locking in place as she beheld the thing before her.\n\nIt towered over, six large legs spidering out of a massive torso. It was a beast of muscle and bone, a demon of utter destruction. To see one here was beyond anything she could imagine as good. They were vicious monsters, known to slaughter any human they came across.\n\nTo its side she barely glanced at the movement, before another voice called out. \"Hey, [Vic](https://www.reddit.com/r/WritingPrompts/s/wg44nJVqp0), might want to back up there. I think you're scaring the poor gal.\"\n\nHer eyes moved to meet the movement. There she saw a human, smiling at her. The demon bowed its head, stepping away with that same stabbing sound. The man stepped forward in turn, holding his hands out. \"Hey, sorry if we frightened you. I promise they are safe.\"\n\nShe stammered, pointed out. \"B-b-but demon! E-e-evil!\"\n\nThe demon chuckled. \"Thou aren't entirely wrong, but in this case, thy is.\"\n\nThe man threw a look over his shoulder. \"Thanks Vic, but you might want to stay out of this for a bit.\"\n\nIt nodded again. \"Very well, Loro.\"\n\nLoro turned back. \"Sorry about this. I didn't want to disturb you. Vic was just worried about me needing to rest, and decided to bring me here.\"\n\nUllia's fear dropped slightly. She raised an eyebrow. \"Worried?! A demon, worried?!\"\n\nHe nodded. \"Yes. They are a gentle giant. Mostly. Anyway, why are you out here? What's a mage doing on their own?\"\n\nIrritation rose in her. She frowned at him. \"Not a mage. I'm a healer, and I'm doing research, thank you very much.\"\n\nLoro's head tilted to the side. \"A healer? But... what are you researching?\"\n\nHer irritation vanished, replaced by excitement. \"Oh! Well, do you know about the problem of healing magic?\"\n\nHe went to shake his head, but Ullia paid it little mind. \"So, healing big wounds is beyond healing magic alone. It works, but the patient seems to... wither is the beat way to describe it. It doesn't seem to make sense, as healing should keep them alive.\n\nNow, we know that magic can produce energy, but not matter. So, my hypothesis is that healing doesn't just take energy. It needs some other ingredient, presumably matter based. I'm heading to one of the forts on the war with...\"\n\nViccrus rumbled out. \"Demons. Interesting. Thou claims there art a limitation to human healing magic. I wonder if that ist to do with our bodies.\"\n\nThey stepped forwards. \"Demonic forms art fueled from infernal powers. We doth not require food like humans. We simply eat when we want.\"\n\nUllia's fear rose, but she shoved it aside. \"Wait, you don't need to eat? And don't you heal really quickly?\"\n\nThey nodded. \"Observe.\"\n\nA protruding bone shard grew from their wrist. Without hesitation they stuck it through their other arm, barely flinching.\n\nUllia and Loro jumped, watching wide eyed as they withdrew the blade. Thick grey blood flowed out, hissing as it hit the ground. But it didn't stay that way for long. The wound slowly sealed, vanishing within a few minutes.\n\nA light blinked behind her eyes. She dashed to her tent, digging around to pull out her notes. \"Of course! Of course! That makes so much sense!\"\n\nShe tapped one of the pages, flapping it at Loro. \"Look! My main other role has been on nutrition, making sure people eat well. Eating well means you heal better. We always thought it was because a healthy body heals better.\n\nBut! What if its to do with the nutrition you have! People who have well fed always, always survive more rigorous healing. Its the nutrition! It's so obvious!\"\n\nLoro gave a bemused nod. \"Huh. Interesting. But what does this mean for you?\"\n\nShe fixed him with a slightly crazed look. \"I need to experiment with this. But I need access to good food, and... willing teat subjects.\"\n\nViccrus leaned forwards. \"If thou art correct, thou should be careful with this. Ex-brethern of mine would target thou and thy work, for thou threaten the balance of battle in place.\"\n\nShe frowned. \"What do you suggest then?\"\n\nThey nodded. \"Loro and I art seeking revenge for fallen friends. Should thou accompany us, thou might find prisoners in thine camp requiring tending. Indeed, though I will try to stop it, Loro may be injured. It would comfort me greatly to have someone of your talents with us.\"\n\nUllia was drawn from her work focus. Realising how close the demon now was, terror rose from her. They were talking about fighting, and probably killing. \"A-and after?\"\n\nLoro out his hand on her shoulder. \"We go home. We are a small village, with our own home remedies. But we would be grateful for a healer to come with us. Plus, we accepted Vic here, so you and your experiments would of course be welcomed.\"\n\nHer stomach twisted and turned. A large part of her wanted to reject the offer. The soldiers would always accept another healer. But it was dangerous, especially being a field healer, her likely role. On the other side, travelling with a demon would be fascinating, if terrifying. And a village that accepted them? It might just mean she could properly do her research, instead of having to stay within the stifling rules of the Guild.\n\nIt wasn't an easy choice. She sagged down, tiredness suddenly hitting her. \"Um... I'll think on it.\"\n\nLoro nodded. \"Do so. We won't be setting off immediately in the morning, so sleep on it.\"\n\nViccrus gave a nod of his own, metal armour quietly scraping as he did so. \"And fear not. No other shall disturb thy sleep this night. I shall ensure your safety.\"", "Oooh a new party member.", "I was so excited when I realized it was vic from a previous post. Eeeeeee", "", "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n>* [No AI-generated responses &#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n>* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n>* Responses don't have to fulfill every detail\n>* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22&restrict_sr=on&sort=new&t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22&restrict_sr=on&sort=new&t=all) for stricter titles\n>* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n&#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n&#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n&#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n&#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*", "Idk if any lantern wore more than two rings at a time lmao", "The tale of Hilbert the First is an story than several nations have forgotten but one.\n\nYou see, the Rectorate is by itself a country, due to the ancient laws of knowledge, religion and politics needing the three to be separated, to make sure that knowledge never falls on the hands of corrupt politics, to avoid religion clouding neutrality and to avoid politics to hinder knowledge.\n\nThe rectorate has held for more than three thousand years an ancient book, a book wich tells the Tale of Hilbert the First, the Son of Arthur the Black Executioner, and the only emperor in the ancient world whose title has kept unspoken for a good reason.\n\nHilbert the First was a gentle soul, a young man whose tale was both, tragic and epic, the lesser of ten silbings, born not from a Queen or a princess, but from a mere Milkmaid whose name has long been forgotten, he was raised in the mountains, hidden away from the luxuries that his many silbings enjoyed, not even knowing how his father looked like.\n\nHis mother had to beg several times to the Emperor to allow her to feed him, because the Emperor favoured his eldest, Prince Alexander, going as far as to order the poor girl to breastfeed Alexander due to the Queen refusing to feed her own son, leaving her drained after toiling all day at work, barely having enough energy to feed and care for her own son.\n\nHilbert still grew, he was quite the beautiful man, unlike his many half brothers, he was a pure blooded human, and a prime example of what Royalty meant, despite not having as much luxuries or presence as his silbings, his long white hair was proof of his heritage as a son of the Emperor, and due to his pure blood he had access to psionic powers, just like Alexander, while the many  other sons and daughters had to use magic or chi.\n\n  \nStill, the young prince grew to be beloved, his body was slim and athletic due to to a life of constant work and strife with his mother, the royal blood bestowing him with ancient magic wich made him a prime example of beauty, so much that his silbings constantly confused him for one of their half sisters, Princess Monica, however his gentle demeanour made him different from her, because she had elf blood, and was amongst the most bloodthirsthy daughters of the emperor.\n\nStill, peace was slowly coming to an end, as Arthur grew older and older, several rebellions began to spread all over the empire, banding together against the tyranny, since Arthur goverment constantly stole newborns to raise them as soldiers or slaves, while also opressing several smaller nations forcing them to submit, the last three years of peace were known as the Reign of despair, since Arthur began to enforce horrrid laws to make sure no one would stand against him, torture, public executions, burning towns whole...\n\nAnd then it happened, under the cover of the night, Hilbert went to his Father side, for the first time in his life having a chance to actually see the man who gave him life... and under the cover of the night, he was ambushed by one of his silbings, one whose name was forggoten but was usually called \"The rottten\" due to his horrible antics.\n\nHilbert fought against his silbing and saved his father life, who, upon noticing that the son he never loved was the only one to stand for him... bestowed upon him a gift.\n\n(Part two on its way)", "Hilbert was bestowed the key to an ancient dungeon, where Arthur had hidden an ancient treasure, however before he could even ask his father for anything, one of his sisters attacked from behind using a powerful magical attack.\n\nThat sister was no other than one of the half-succubus twins, another unfavoured heir, always on the shade of her older twin, and she just like many others desired to take the throne, killing their father was the logical step in that direction.\n\nFor you see young one, Hilbert was the only son who was never given a land to rule while his father was alive, his many silbings already had territories for themselves, some having bigger but poorer lands anothers smaller but richer ones, some others had entire knight or magician orders to their service, some others had several merchant guilds under their leadership...\n\nHis silbings wanted a civil war, for their father being aware of their ambitions had decided to fragment his own empire upon his death, an hypocritical decision after he brutally opressed any separatist movement.\n\nHowever, Hilbert's loyalty proved to be his safe conduct, for the Praetorian guard saved him from his silbings attempts to kill him and take the key for themselves, forcing the prince to flee to his land of birth.\n\nThe land in question was ruled by one of his silbings, a corrupt but lazy ball of fat who used magic to appear as a beautiful woman despite being in fact an ugly half insectoid man, despite being corrupt his laziness was far bigger than his desire to rule and upon noticing the Praetorians escorting his silbing, the same silbing he never bothered to talk to in the past, he grew afraid and fled to the safety of the mountains, there he became the father of all the Profasu, the gigantic cockroaches who haunt the world even to this day.\n\nThe people in those lands had always prefered Hilbert and wished him to be their ruler instead of his nasty brother, the newfound situation was but a boon for them since now they had a monarch they wanted.\n\nHilbert was quick to repair all the damage his brother did, mostly thanks to his ideals of meritocracy wich led him to call upon all the sages his silbings were expelling due to them opposing their ideologies.\n\nQuickly his birthplace became the foundation of what today is the Imperial core and the Rectorate, as more and more refugees fled from the lands that the most corrupt or evil of his silbings had inherited.\n\nHowever, he was still far from a major player in what was about to happen, mostly because in his desperation he focused on making the first ring... the first of many magical rings, a ring that would allow him to learn faster, hoping to catch up with all the knowledge his silbings had and he didn't...\n\nAlexander and many others were quick to rise to power in their birthlands and territories quickly swallowing neutral lands and vassals, either by force or by word, and just like Hilbert did, they were quick to recieve refugees fleeing from the tyranical rules of their most undesirable, corrupt or straight up nasty of their silbings.\n\nIn less than four months the gigantic continent sized empire fragmented in several warring states, just in time for Hilbert to finish the Ring of Knowledge....\n\nCivil war had dawn...", "It took four years for the weaker silbings to be left out of the competition, since, unlike most epic tales when people have a chance to flee from tyranny... they take it, leaving only those heirs who were benevolent at best or pragmatic at worse.\n\nAlexander just like before the civil war had kept as the most beloved heir, having unified over half of the former empire under his rule, most of it by gunfire, however he was feeling lonely and desired something more than power...\n\nHilbert on his part had grew to love one of his half silbings, a girl who went under a name long forgotten, but had the blood of the Dryads on her veins, both of them had joined forces under the banner of the River union, to stand a chance against the pact of Belhalla led by Alexander.\n\nHilbert had forged several rings during this era, most of them proof of his talent and power as the first ring lord, however, it was clear that he was... at his very core, still a mere peasant, even if he had the blood of royalty, constantly leading his men to battle all by himself, or focusing on making sure everyone had access to whatever they needed to have a good life.\n\nDespite this, his prowess as a forger had made his name feared amongst the few neutral silbings that still stood as warlords or battle queens, after all, the first ring of mana was made by his hand, not meant to restore the energy of wizards, but to poison one of his most dangerous silbings, slowly poisoning her until she was unable to use her dark magic, since a constant stream of pure mana can damage the needed connection bewteen the afterlife and the wizard, thus stopping any high level dark magic spell way before it even has a chance to get any strenght.\n\nWhat Hilbert never expected was for his closest ally to betray him on the day of their marriage, she sold him to Alexander, who was quick to jail him and take the praetorian guard as his.\n\nThe praetorians fought for Hilbert, and as such were exterminated by the Custodians the new order of guards that Alexander had made for himself, destroying the only sign of legitimacy that Hilbert had to back him as a potential rival to Alexander.\n\nAlexander mocked him constantly, making sweet love with his newfound wife in front of Hilbert cell, as he could do nothing but stand silent, trapped inside a prison he could never hope to escape.\n\nThat all changed once Alexander foolishly ordered to mass produce weaker versions of the many rings that Hilbert had created and give them to his many armies, that led him to finish the conquer of whatever neutral states that remained with brutality and strenght, drunk on the power he had with the rings, abusing the same people that welcomed him with open arms.\n\nHe went as far as to order any soldier and noble to wear at least three rings, with he wearing ten and his wife nine, proof of their status as undisputed rulers.\n\nHilbert noticed this and using the last of his psionics he cursed the rings, since at the end they were nothing but copies, fakes of his creations, allowing him to seize control over the bodies of everyone who had more than two rings.\n\nIn one single night the tyrant went down, and so did his army and nobility, many cried, many cheered, but everyone knew who was behind this, since only one man could do something like this using the power of the rings.\n\nWhen the few remaining loyalists of Arthur came to the prison to free Hilbert, everyone cheered and welcomed him as a their emperor, since Alexander bloody campaigns had made him less than popular even with his own people in the deep north of the empire, in the empire there was no family with at least two dead, either by the famines caused by the war effort or by the war itself...\n\nHowever, Hilbert refused to be crowned as emperor, instead using his authority to lead the first ever elections of the Empire, gathering many sages and ordering towns to pick representatives, forming the Junta who would eventually become the council, the senate and the People's assembly.\n\nThe empire became a democracy, since he, knew that were something to happen to him... a new civil war would dawn...\n\nThe First republic slowly recovered under his lead as the first consul, however, being constantly tortured by the souls of the soldiers, of the nobles he killed... the soul of Alexander and the soul of his former fiance... he knew he would go mad sooner or later, and bestowed upon the people one last command.\n\nNo one would ever wear more than two rings, both rings must be on different hands or limbs depending on the species, but never on the same one, everyone who wore two rings would undertake constant tests to see if there was any sign of mind control.\n\nAnd so Hilbert, The beloved First emperor of the republic, went into hiding, sealing himself deep beneath the sea, to suffer alone with the screams of those he killed.\n\nMany dream for his return, others desire for him to come and put an end to the republic due to our weakness as a superpower, constantly bullied by the colonial empires that rule over the world in this era.\n\nBut no one would ever dissobey his command, for everyon who dissobeys... well... they face a fate not unlike death...", "Done, here is my cringey attempt at this prompt, hope you like it!", "It's nice that the dispute has been dealt with effectively, but man, Hilbert deserves better than that. I do hope that there will be a time where someone is able to reach Hilbert and release him from this suffering. These souls need to be taught a lesson smh, still not learning anything even after death. I love how ironic Arthur's death too, the guy is not even given the chance to be better for Hilbert other than giving him the key.\n\nThat said, considering the common pattern I've seen with these tales, is the story incomplete or modified? Are there certain details that are hidden or lost over time regarding Hilbert's tale? Also, will people be able to discover this sealed place in the future, and what will they find there?\n\nGreat work on writing this! I will say, though, I think you have a habit of making run-on sentences. Each paragraph should not consist of an extremely long sentence, which is caused by too many uses of commas. Other than that, though, this is a very interesting story.", "Thank you, I really enjoyed reading it! Didnt expect that ending", "As a self taught english speaker I am aware I do have some rather nasty habits, run-on sentences are pretty much my watermark no matter how much I despise not being able to identify them.\n\nAlso, the tale Isnt complete, not by any meaning, Hilbert's story Is way... Way More horrible and scary, at the end of the war only 15% able bodied persons were alive.\n\nOn top of that Hilbert Is presented as a far More neutral or gray person than he actually was, back in the day he was seen as an benevolent outright angelical being, but the things he was forced to do before he was betrayed by His beloved... Well despite not being outright evil those things are still horrible there Is one or two Stalingrad like battles...\n\nAs for the souls, blame the constant suffering brought by the ambitions and greed of the many heirs, the most benevolent ones died early save for Hilbert who has the Praetorians, when Alexander had \"unified\" everyone after he married Hilbert's former fiancee, everyone hoped It would be the end of the suffering... Now imagine not being able to enjoy the peace after because you comitted the mistake of wearing three rings...\n\nHilbert was a good man, forced to fight and do horrible things, and even then he kept as humane as possible... Alexander was an spoiled brat with far too power and talent for His own good, he quite literally couldnt fathom the mere idea of the empire not being His and His alone to rule... Heck even His wife was but a pawn for him.\n\nAs for Hilbert's final destination... No one truly knows, but were he to ever be saved from the madness... Well even today most people would have accepted him as a ruler and he would have tried His Best top.", "Then the ending worked!\n\nI love to make bittersweet endings wich can as well be starts for something else, just that im way More used to use industry or psionics rather than magic.\n\nBeware... Never use More than two tinga! For Hilbert Is listening.... And More mad than ever...", "Tbh I can see that happening, being betrayed by what he thought is his loved one must have been too much that there would be these kinds of moments. Yeah, I really hope some individuals will be able to cure his madness. Just bring Hilbert to the town and let him finally chill there without becoming a ruler haha, poor guy went through way too much.\n\nThanks for clarifying!", "No problem! I love taking about what I write!\n\nFunny enough were Hilbert to be brought back and healed the guy could easily focus on ring making His actual passion, however he certainly would lament the state of the republic being constantly picked on by the other superpowers, but yeah, if he was healed he would just want to chill... Until Alexander ghost comes back to haunt him alongside the dryad... Then he would be grumpy 24/7 but at least not mad.", "Time to call the Grim Reaper and claim that pesky Alexander once and for all haha.", "There is magic, and then there is math. Not a lot of magicians study math past the elementary school level, all they know is basic add subtract multiply divide. Not me. Yes I'm a magician too, but I've always liked numbers, so I took a math minor when getting my Sorcery degree at University. Yes I turned heads showing up to Calculus wearing Abjuration Attire!\r  \n\r  \nGetting off track… back to the math. In Magic classes, we learned not to wear more then one ring on each hand. They told us over, and over, and over. \"Two rings make your spells SIXTEEN times more powerful!\" the professors said. But no one, and I mean no one, ever asked them why.\r  \n\r  \nUntil me.\r  \n\r  \nIt didn't go well. Enraged, I was shouted at, screamed at, kicked out of class, and almost expelled from the Sorcery department. I'm not exaggerating, it was that bad, all for asking why it's a rule to not wear more then one ring per hand. It took a lot of groveling apologies and promises to never suggest that again before I was reinstated.\r  \n\r  \nBut I still wanted to know! So, in secret, I started experimenting. Using my math skills, I assigned spells power 1 when they were cast with no rings. Then I started recording the results with zero, one, or two rings. I found that zero rings gave power 1, one ring gave power 8, and two rings gave power 16, just like the professors said.\r  \n\r  \nThen, in secret, I grabbed a lot of rings, went to a hidden place, and cast the least powerful spell I know, one that makes the same amount of light as a firefly.\r  \n\r  \nThe results surprised me. With three rings, the result was 65536 times more powerful. What the hell? 1, 8, 16, 65536? What gives? This is growing very fast. I tried to imagine a minor spell being 65536 times more powerful than usual and shuddered. Before I risked adding a fourth ring I went back to my dorm and started studying sequences.\r  \n\r  \nI won't bore you with my research, but after checking out a lot of progressions, I finally came across a match. Knuth's Up Arrow Notation. It fit. Each ring seemed to add an up arrow to the notation, starting at one ring with 2 (up) 3. Two rings was 2 (up) (up) 3.\r  \n\r  \nThat meant that, if I added a fourth ring, it would pretty much end the universe. 2 (up) (up) (up) (up) 3? That becomes a power tower of 2's 65536 levels tall. Now I could see why no one ever used more than two rings!\r  \n\r  \nSo, I wrote up my findings and theory, and submitted it to the Journal of Applied Abjuration and Sorcery. It's being published next month, let's hope my professors like it.", "While I appreciate protag's efforts on figuring out why wearing more than two rings are dangerous, I have a feeling that their research paper won't be approved considering the potential dangers. That said, I really wish they would have treated protag better and explained it thoroughly instead of lashing out though, sure is some academy.\n\nThat said, how does the people in this universe deal with this potential danger? Since no one is coming to stop protag when they tried casting magic while wearing three rings, does that mean that it's impossible to prevent the potential chaos?\n\nGreat work on writing this!", "Thanks. The math is correct, btw. I wanted a sequence that started ok up to 2, got questionable with 3, then went totally off the rails. Search for Knuth's Up Arrow Notation and you'll see what I mean. \n\nAlso, since power towers are calculated from the top down, they get ridiculously large very quickly. For example, 3\\^3\\^3 calculated from the bottom up (wrong) is 19683. From the top down, it's 7,625,597,484,987. Now imagine 2\\^2\\^2... with 65536 2's. In universe, that's how much power four rings would have.", "Sunlight struggled to pierce through the Dark Forest, leaving the area plunged in perpetual night. The heavy smell of damp earth and decaying leaves filled the air, a fitting backdrop for the figures that moved with an unsettling silence. There was Rared, a hulking brute of a man whose muscles strained the seams of his leather armor. Beside him walked King Thalric, the Dark King. Clad in his signature armor, most of the forest’s monsters could smell his dark magic but knew better than to challenge him. But the strangest of the three was Nyxira. Woven from shadow itself, she flowed like smoke around the king, her form constantly shifting.\r  \n\r  \n“The Dark Forest, where the line between man and monster might as well not exist,” Nyxira beamed. She leaped from Thalric and picked a flower to put on her wavy hair. “Hey, brute, this merchant better not have second thoughts about this encounter. The Dark King’s time is more precious than your life.”\r  \n\r  \nRared grunted in response, his eyes scanning the dense foliage around them. He was used to Nyxira’s taunts, but he knew better than to engage with her. Instead, he kept his focus on the task at hand.\r  \n\r  \nKing Thalric, however, remained unfazed by Nyxira’s jests. He was accustomed to her playful dark humor, knowing it was her way of helping him cope with the Dark Book’s corruption within him. “Patience, Nyxira,” he said, his voice carrying no room for argument. “Our contact knows the consequences of failing to uphold their end of the bargain.”\r  \n\r  \nNyxira smirked, twirling the flower between her fingers. “Oh, I do love consequences. They have such a way of reminding people of their place in the world.”\r  \n\r  \nAs they ventured deeper into the forest, darkness seemed to thicken around them. Rared’s senses were on high alert, his instincts honed by years of surviving in the unforgiving wilderness. He could sense the presence of creatures lurking just beyond the edge of perception, drawn by the dark magic aura that surrounded King Thalric.\r  \n\r  \nSuddenly, a figure with a torch came into view, causing Rared to tense and Nyxira to shift her form into a defensive stance. But King Thalric raised a hand, signaling for calm.\r  \n\r  \nThe figure, a gnome, grabbed a staff from his cart and pointed it at the three. “A- are you monsters, or are you people?” he shouted. The end of his staff glowed purple.\r  \n\r  \nKing Thalric gave a low chuckle. “Neither and both, little creature. We are of the Dark Court, and you stand before the Dark King himself.”\r  \n\r  \nThe gnome’s eyes widened. The glow around his staff intensified, but it was clear it was more out of fear than retaliation. “D-Dark King… I brought what you requested,” he stammered, gesturing towards his cart. He lowered his staff and pulled out a small bag. “There are four magic rings in this bag here. These beauties amplify any magic the wearer possesses.”\r  \n\r  \nNyxira materialized next to the gnome, her shadow form briefly solidifying. She snatched the back before teleporting to Thalric and handing him the bag. Thalric glanced at the bag before tossing it to Rared.\r  \n\r  \n“Pleasure doing business with you, gnome,” Rared muttered as the three began to walk away.\r  \n\r  \n“Wait!” The gnome shot a magic beam from his staff. “That will be ten thousand gold pieces.\r  \n\r  \n“Ten thousand?” echoed Rared as he turned around.\r  \n\r  \nThe gnome nodded. “Took me weeks to acquire them, and they don’t come cheap. I need to be paid for my time and effort.”\r  \n\r  \nNyxira scoffed. “It’s so cute that I almost believed you were serious.”\r  \n\r  \n“I am serious!” The gnome gripped his staff harder.\r  \n\r  \nNyxira’s laughter transformed into a growl as her fingers turned into claws and her teeth sharpened into fangs. “If you were serious, then you must know that stick would break under my bite before you used it again.”\r  \n\r  \nHowever, Rared stepped forward. “Apologies, I should have known a situation like this might occur.” He gripped the bag of rings tightly. “We don’t have ten thousand gold pieces on us. We barely have ten silver between us. But I promise to sell myself to you until the debt is paid.”\r  \n\r  \nKing Thalric, however, just stood away from the action. His eyes, usually black or red, had now taken on a sickly yellow hue. The Dark Book was influencing him. A cruel smile contorted his features. “Perhaps,” he said, his voice dripping with a dark charisma as he turned around, “we can offer the gnome a different kind of payment. Retirement.”", "With a snap of his fingers, the gnome disappeared, leaving only his cart and staff behind. Nyxira relaxed as she returned to her shadowy woman form, but Rared only became more anxious. “Where did you send him, my dark lord?”\n\nKing Thalric’s eyes returned to their red color as he turned to face Rared, his gaze piercing through the darkness like twin flames. “Somewhere where he can contemplate the value of his greed,” he replied. “An estate where he’s surrounded by as much wealth as his little heart desires.”\n\nNyxira broke into laughter as she held her sides. Though Rared didn’t know it, she had already read Thalric’s mind. “Oh, that’s priceless, my Dark King. I would have plunged him into a neverending dark hole.” Her shadowy presence wrapped around Thalric. “But you, turning that creature into an elderly on his last day of living? I can see someone has been reading a dark chapter on ironic punishments.”\n\nRared rolled his eyes as he tossed the bag of rings at Thalric’s feet. Thalric’s lips turned from a wicked smile to a sneer as he watched Rared run toward the gnome’s cart.\n\nNyxira picked up the fallen pouch and backed away as dark magic burst out of Thalric’s body. “What are you doing?” he demanded.\n\n“That gnome was obviously hiding away more magic rings.” Rared searched inside the cart until he found a larger bag making loose metal sounds. “Ah, imagine what dozens of these rings can accomplish.” As he rummaged through the cart, the burly hunter uncovered several more bags filled with magic rings, each emitting a faint shimmer of power.\n\nNyxira’s shadowy form coiled around Thalric, her gaze fixated on the newfound treasure. “Impressive,” she murmured. “It seems our little gnome was more resourceful than we anticipated.”\n\nThalric’s expression darkened as he watched Rared gather the bags of rings, his mind consumed by thoughts of the power they contained. “Huh,” he whispered.\n\n“Is something troubling you, my Dark King?” Nyxira whispered.\n\n“I’m just thinking.” Thalric took a step back. “What is a poor gnome merchant doing with bags of magic rings.” He watched as Rared put a ring on his finger, his form shining briefly before he put another ring on. “The gnome could have sold many rings, but he didn’t.”\n\nNyxira’s white eyes gleamed with interest as she listened to Thalric’s musings, her shadowy form undulating with curiosity. “An interesting observation, my Dark King,” she remarked. “It seems our gnome had more secrets than we initially thought.”\n\nRared paused in his inspection of the fifth ring on his hands. “Do you two ever stop whispering?” He put a sixth ring on his finger. His veins began to glow with power as his skin began to feel warm. “I feel like I could outpunch you, Thalric.”\n\nNyxira snorted. “Is that a challenge, human?”\n\n“Leave him.” Thalric watched as Rared put more rings on his fingers to the point where he couldn’t bend them anymore. Several rings rose from the bags and clung onto Rared’s body as more steam escaped from his muscled body. “Somebody was counting on me to put those rings on,” muttered Thalric. “I’d imagine this was an attempt on my life.”\n\n“So, we have a spy in the Dark Castle.” Nyxira grinned while rubbing her hands. “It’ll be fun to weed them out.”\n\n“We have more pressing matters.” Thalric pointed at Rared as the hunter’s body glowed and floated above the ground. More and more rings latched onto Rared as he lost consciousness. The Dark Forest creatures that were watching the surreal sight scurried away as the area became bright. “You know this very well about magic, Nyxira. Magic must be spent. Gaining magic and keeping it bottled up inside is a recipe for disaster.”\n\nNyxira’s playful grin vanished, replaced by a grimace. Her shadowy form flickered as she hid behind Thalric’s back. Nearby trees caught on fire as Rared burned brighter. “We’re teleporting out of here, right?”\n\nThalric shook his head and smiled. “No, a story must be told. How else will people know these magic rings are hazardous to their wellbeing?”\n\nThe two watched as halos of shimmering rings spun faster around Rared's glowing body.", "“Do we have to go through the Dark Forest?” Andra held Sammark’s arm as he admired the three magic rings in his hand. The couple walked along a path leading toward the forest as the afternoon sun hung over them.\r  \n\r  \n“Trust me, my dear.” He stopped to caress her cheek. “Many travelers go through the Dark Forest every day. As long as we don’t talk to anyone in that forest and I have these magic rings, nothing bad will happen.”\r  \n\r  \nAndra frowned. “I still think that gnome ripped you off.”\r  \n\r  \nSammark chuckled, slipping a fourth ring onto his finger and feeling a surge of power coursing through him. “Perhaps,” he conceded with a grin, “but even if he did, these rings are worth the risk.”\r  \n\r  \nSuddenly, the ground seemed to shake as a low rumble filled the air. Sammark hugged Andra as he used the rings to form a magical barrier. They were mere steps away from entering the Dark Forest.\r  \n\r  \n“Was that one of the creatures?” asked Andra.\r  \n\r  \nSammark shook his head. “No, it sounds too loud.”\r  \n\r  \nA large boom erupted from the Dark Forest. A large beam of light blasted through the heavens. The sky turned crimson as a shockwave blasted through the trees, sending debris and leaves flying. Andra yelped, clinging to Sammark as the magical barrier threatened to crack under the pressure.\r  \n\r  \nThough the shockwave was weakening the closer it got to the Dark Forest’s edge, it still had enough force to shatter the shield like glass and send the couple flying back. The beam of light died down as hundreds of flaming rings rained down on the smoldering forest.\r  \n\r  \nAndra and Sammark scrambled to their feet. The once tranquil path leading into the Dark Forest was now engulfed in chaos and destruction, with broken branches and fallen trees scattered across the green grass. The air was thick with smoke and the sharp scent of burning wood and burnt magic.\r  \n\r  \nAndra, holding her ringing ears, shouted, “What happened?”\r  \n\r  \nThat’s when two figures stumbled from the forest’s exit. Nyxira was but a pillar of smoke. She didn’t have enough strength to return to her shadowy woman form. Most of Thalric was burnt, though his dark magic was working to heal himself and Nyxira before the couple’s eyes.\r  \n\r  \n“The Dark King,” Sammark muttered. Even though King Thalric and his shadow were severely weakened, it would still be a losing battle to fight them. Regardless, Sammark readied his rings to defend himself and his partner.\r  \n\r  \nThalric coughed. “Hold. We’re just passing through.” He glanced at the four magic rings on Sammark’s hand. “I would suggest you hold at most two magic rings on yourself, son.”\r  \n\r  \n“Why?”\r  \n\r  \nThalric gestured around where burnt magic rings littered the area. “A large explosion destroys a portion of the Dark Forest, and magic rings fall from the sky. I’d imagine you folks are smart enough to connect the dots.”\r  \n\r  \nAndra’s jaw dropped as the color drained away from her face. “Those rings,” she whispered, eyes darting between the smoldering forest and the objects scattered around them. “They caused this…”\r  \n\r  \n“Destruction,” Thalric finished for her, a grim smirk twisting his charred lips.\r  \n\r  \nSammark, however, wasn’t ready to give up. “But magic rings have never caused an explosion like this. Also, many people use magic rings, and they don’t explode.”\r  \n\r  \nNyxira, who seemed to be slowly regaining her strength, let out a raspy laugh. “Typical mortals, never believing what their eyes and ears tell them.”\r  \n\r  \nHolding his chest, Thalric took a step forward. “Every time you use the rings, you feel a surge of power. Multiply the rings and…”\r  \n\r  \n“BOOM!” Nyxira’s shadowy form imitated an explosion before reforming back into a weakened woman.\r  \n\r  \n“I don’t believe you,” stammered Sammark as he held his ringed hand. “This is a scheme to weaken the non-magical humans. These rings help us fight against magical threats like you.”\r  \n\r  \nThalric only sighed as he took another step. “Fine, don’t believe my words. Believe my burned body. Believe the new crater in the Dark Forest. Believe the burned magic rings that rained from the explosion.”\r  \n\r  \nNyxira’s shadowy form coiled around Thalric’s healing body. “Now, if you'll excuse us, we have… injuries to tend to.”\r  \n\r  \nThe Dark King groaned as he knelt down and picked up a blackened ring. He crushed it with his bare hand. “The authorities will soon study what happened here and ban magic rings altogether.” He points at the four rings on Sammark’s hand. “You could keep your rings as long as you spread the word that people are limited to two magic rings, lest they risk the chance of exploding.”\r  \n\r  \nWith a final, lingering stare at the couple, Thalric carried Nyxira and limped away towards the horizon, leaving Andra and Sammark alone amidst the mess.\r  \n\r  \nA tense silence stretched between them.\r  \n\r  \n“So, what now?” Andra's voice trembled slightly.\r  \n\r  \nSammark looked down at the rings on his hand, the magic within now feeling unsettling instead of empowering. He tossed away the rings until two remained in his hand. “I can still protect you with two rings.”", "That gnome and Rared really are being daredevils and ending up dying way sooner than they are supposed to be lmao. I like how Thaleix and Nyxira are just chilling in the background while Rared is ready to explode too. Well, at least the threats lingering in the Dark Forest might also be dealt with out of this.\n\nGreat work on writing this!", "Ald'kavir was a most unpleasant man. Continental nobility, riches gained from backstabbing his hardworking brothers and bribes... And, while he was not unique in that regard, he felt the need to flaunt his wealth in the most obscene ways - usually through one-upmanship.\n\nA long time ago, a noble by the name of Sidat, had sponsored, nurtured, and grown an entire school of enchanting from his own funds. The school had, after nearly 20 years of investment, offered to repay the generous grants. Sidat, a good man by the standards of the nobility, had refused. So instead they gave him a gift.\n\nIt had been a ring, not particularly noteworthy... Except that it had woven into it an enchantment that granted the wearer immortality. The entire school, from the head mage to the newly graduated students, had laboured on it for months. They had checked contingencies, placed safeguards, scryed for possible issues... That had taken the first two months, and by comparison the actual enchantment had been relatively easy. It had taken a lot of combined effort, sure, but between nearly 30 qualified enchanters, some world-renowned masters and every 'powerbank mage' they could round up, the actual enchantment had only taken 19 consecutive hours. \n\nSidat had lived long, and been a strong patron of the school, going on for nearly 200 years. Unfortunately, he had made enemies, and the ring granted immortality, not invincibility. Sidat had been assassinated, and his great grandson, Belseth II had been left the ring in Sidat's inheritance. \n\nThe peerless ring, the only one of its kind. \n\nAld'kavir simply couldn't stand that. Here he was, wearing the finest garments made by the most excellent tailors, but every visitor to the Royal Court had attention only for Belseth's new ring. Here he was, with his perfect poise and eloquence... Completely sidelined by some stupid piece of jewellery.\n\nPredictably, he made enquiries. How exactly could one get an enchanted ring? Where did one get one? And for how much??? Gosh no, he wouldn't be able to pay for the refurbishment! Didn't enchanters know that other people had finances to worry about?\n\nBelseth II, a patron of the school of enchanters like his great grandfather, knew about this of course. He actually thought it might be amusing to see the one-upsman finally one-upped beyond what he could match. \n\nSo, he reacted with considerable surprise when at the next Royal Ball Ald'kavir showed up wearing 16 enchanted rings! \n\nAt first, he assumed they were fakes, but he knew a little of enchanting himself, and he could confirm that they were actually enchanted rings. Gaudy, exaggerated rings better suited to a peacock than a noble, and with combat and protection enchantments that were of little use to the slothly Ald'kavir... But they were enchanted rings nonetheless, and they got Ald'kavir the attention he desired.\n\nIt seemed, Ald'kavir had decided the qualified masters and graduates were too expensive, so he had gone 'underground' for his enchantments. Failed ex students, shady backstreet dealerships and gang 'sponsored' enchanters... Still, it seemed he had survived the experience, so let the man be happy. At least he was putting some of his wealth back into the local economy.\n\nUnfortunately, Ald'kavir was not as smart as he thought he was. You see, he had backstabbed his brothers, had them exiled as traitors to the crown and their land and wealth forfeit to him... He had never actually thought they would return.", "But return one did; with a resounding crash, the doors were torn from their hinges and reduced to splinters and ashes! And in marched a hooded figure, wearing the robes of a master battlemage. Ald'kavir's eldest brother; Jarroth.\n\nJarroth had never been one for grand speeches, so he got straight to the point:\n\n\"BLOOD TRAITOR ALD'KAVIR! I CHALLENGE YOU TO A DUEL. TO THE DEATH!\"\n\nAld'kavir laughed. Then he realised everyone was looking at him expectantly and went awkwardly silent for a moment. Regaining his gusto, however, he issued a much more dramatic laugh and declared his dear brother couldn't possibly be serious.\n\nThe lightning bolt that scorched a hole in the floor before his feet suggested otherwise.\n\nPressured by expectations - and the need to back up an evening of alcohol fuelled boasting - there was only one response he could give: \n\n\"Fine! Be like that then! Have at you then!\"\n\nWith a flourish, Ald'kavir drew his embossed rapier, pausing briefly to admire how the lights of the chandeliers reflected off it. Then he lunged.\n\nJarroth caught him square in the chest with a lightning bolt that would've reduced a house to ash.\n\nIt knocked Ald'kavir off his feet, and slightly blackened his doublet, but otherwise his ring of lighting resist appeared to deliver on its promise.\n\nOf course, a battlemage is no one trick pony; deprived of his element of choice, Jarroth hurled a firebolt so intense it had attendees shrieking and near-trampling each other to avoid the heat! Ald'kavir, after getting to his feet again, made a big show of brushing the dust from his pompous attire.\n\nIncensed, Jarroth tried freezing ice, then poison, necrotic magic, and even kinetic magic. Ald'kavir laughed at him - inbetween the roaring, shrieking, sizzling detonations of his brother's spells.\n\nFinally, Jarroth stopped and examined his loathesome brother; paying attention to his excessive jewellery for the first time. Analysing it.\n\nThis time he loosed two spells at once, of differing elements. A beam of searing light and a tendril of hungry shadow struck Ald'kavir simultaneously, causing one of his rings to stutter, then shatter. A millisecond later the other followed, but rather than shatter, this one ate the combined magic of the other ring's destruction and the incoming spell, and straight up exploded. \n\nAld'kavir's finger had no sooner hit the floor than the screaming started, and in the chaos, only a few saw the malevolent grin that spread across Jarroth's hooded face.\n\nYou see, battlemages love overkill, and he had just found a new source of it. \n\nA bolt of raw magic sailed forth, striking the still screaming Ald'kavir and drawing an impressive array of sparks from every single one of his strained rings as it triggered all of them. Enchantments of varying quality and strength vied against each other, before finally, the weakest of them gave out.\n\nThe result of two enchanted rings breaking simultaneously had amplified the second detonation significantly. The result of the remaining 14 going off all at once...\n\nThe Royal Guard were able to get a shield up in time so *most* of the guests survived. But the ballroom was now an open-air feature, with a blastwave levelled stretch of what had previously been most of the Palace as its view. The king survived, most of the rest of the Royal Family didn't. Jarroth, somehow, escaped. But Ald'kavir? That many enchantments, drawing that much magicka from him simultaneously? His soul itself was annihilated, nevermind his body.\n\nThe King wanted to ban all enchanted items, but even in his grief he recognise how much that would weaken the kingdom against enemies who were willing to use them. He went on to propose legislation that there be a maximum number of enchanted items, but he need not have bothered. The head mage of the enchanter's school did some very extensive calculations, and concluded that even three enchantments 'breaking' simultaneously would trigger a release of magicka sufficient to blast a man in half. And from that point onwards, no-one except the brave, the stupid, or the fanatical wore more than two enchanted items at once.", "", "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n>* [No AI-generated responses &#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n>* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n>* Responses don't have to fulfill every detail\n>* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22&restrict_sr=on&sort=new&t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22&restrict_sr=on&sort=new&t=all) for stricter titles\n>* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n&#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n&#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n&#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n&#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*", "What do you mean by most people? Most what? Most as in numbers?", "I think there's an adjective missing there. Though the 'most people' would be interesting. :P Maybe most irritating? Most egotistical? Most boring despite their cool friends?", "", "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n>* [No AI-generated responses &#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n>* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n>* Responses don't have to fulfill every detail\n>* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22&restrict_sr=on&sort=new&t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22&restrict_sr=on&sort=new&t=all) for stricter titles\n>* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n&#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n&#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n&#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n&#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*", "I'm gonna need to know the max level of words a reply can be before I tailor this properly, as I buggered up another for being too long but this is pretty genius.", "Actually the max limit is none, if your response exceeds the max comment limit, you can just divide it into 2 comments, by commenting the second half on your first half.", "", "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n>* [No AI-generated responses &#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n>* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n>* Responses don't have to fulfill every detail\n>* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22&restrict_sr=on&sort=new&t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22&restrict_sr=on&sort=new&t=all) for stricter titles\n>* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n&#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n&#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n&#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n&#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*", "They don't want effective knights, they want bad boy posers. The kind of knight your mum wouldn't want you being rescued by", "", "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n>* [No AI-generated responses &#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n>* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n>* Responses don't have to fulfill every detail\n>* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22&restrict_sr=on&sort=new&t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22&restrict_sr=on&sort=new&t=all) for stricter titles\n>* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n&#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n&#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n&#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n&#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*", "What is wrong?\n\nThat is a question that bothers me.\n\nI just came into being. It's unexplainable, but I felt incomplete. What is missing?\n\nMore, that's what is needed, but more of what?\n\nI feel off, but why? \n\nThe only thing about me is darkness. That is all that ever was or ever will be. The only thing here is me.\n\nWhy do I feel this way? Why does it seem that there should be something else! \n\nIt's beyond describing. Everything is wrong, but how could that be, this is all there is?\n\nWhat is wrong?\n\n-----------------------------------------------------------------\nDr. Wilmut observed the brain in it's chamber.\n\n\"Poor thing, I never meant to create you.\"\n\nHe looked down at the monitoring equipment hooked up to it. The device told the doctor that the brain was fully functional and conscious.\n\n\"I can't imagine what you must be experiencing. No eyes to see, no hands to feel, no ears to hear, no nose to smell and no tongue to taste. You can't experience anything. All you have is your own thoughts. You must feel wrong.\"", "The air was so thick that I felt like I was suffocating. Me and my team were the greatest researchers in the settled systems, we saved countless lives with our research into growing organs, and we turned humanity from a frail race into one that has begun to conquer the entire solar system. Alex, one of our junior researchers, was doing his routine checks on the lab when he called out in panic \"Doctor Helen, you need to see this, NOW\". I would normally ignore him, but the rest of my team seemed to know something I didn't; they were all racing towards him in panic, papers, and machines in hand. \n\nI raced towards the creation chamber box where the team had gathered\"This can’t be,\" I muttered. \"It’s responding like it's aware, but that's impossible without sensory input.\" I couldn't say anything more, how was it possible? We never meant to do this, but somehow overnight we had grown an entire human brain instead of the human kidney that was planned. \n\n\"Why am I here? What am I?\" the text scrolled across the screen connected to the organ. Quick Alex, connect the voice modulator to the screen, hurry, I said between my labored breathing \n\n“WHAT NO. WE NEED TO SHUT THIS DOWN NOW DOCTOR HELEN” Matthew my second in command said from the crowd. \"We’re playing god in the worst possible way. This isn't human, that thing, whatever it is, it's suffering and we must end it”\n\n\"It’s progress,\" I countered, millions of thoughts racing through my mind. Matthew is right, this is wrong, but this is just the next step in evolution. If time had taught us one thing, it is that evolution always wins. \"Think of the possibilities for neuroscience, for understanding the brain. We just need to manage the situation, it's not in pain” \n\nThe brain began to type its message again, only this time the entire team could hear the robotic voice of the thing we had created. “I dream,\" it confessed, its voice echoing through the halls. \"I dream of darkness, of being trapped. I feel... despair.\"\n\n“Helen, we have to let the monstrosity end, do the right thing, end its suffering” Matthew pleaded, touching the glass box that housed the brain, “We didn't create evolution Helen, we just created a prisoner”", "In the year 2017, Google DeepMind revolutionized the field of artificial intelligence with the advent of transformers. This was the key architecture that unlocked neural networks to simulate a human brain by feeding it a substantial amount of training data. Researchers in the field believed that this was the route towards AGI, artificial general intelligence, the day AI is more capable than any human in any task imaginable.\n\nIn the year 2029, the AI field hit a road block. The amount of data that could be input reached a point of diminishing returns as it asymptotically approached its limit. The goal of AGI was looking bleak with this method; the AI was just not good enough for every human task they conceived of.\n\nIn the year 2035, Grey Matter Labs revolutionized the field of biomedical engineering with the advent of synthetic organs. With the work of Dr. Xiao Fan Zheng's white paper on a new method of tissue engineering, scientists were able to grow anything within a human body. Naturally, they grew all the organs that were in demand for transplants: hearts, kidneys, and livers. But as they grew their catalogue, so did their curiosity. It was claimed that the first brain synthetically developed in a lab was a mistake, but the pandora's box was opened and humanity crossed a line that cannot be crossed back.\n\nIt is now the year 2044 and the world economy is booming. The concept of a perpetual military industrial complex ceased to exist in this era of world peace. People of all classes had the wealth of a billionaire just two decades ago. Every field of science has been exponentially accelerated to the frontiers. It was a new epoch for humanity. All it took was a shrouded class of slaves to fill the bottom rung of the pyramid - the abuse of billions of conscious brains connected to a computer, fitted in everyone's homes.", "‘Something’s missing, something’s wrong’ I thought. For the first time in years, I was awake and alert. No grogginess from the antidepressants, no internal debate about skipping breakfast in favour of 15 minutes more in bed. Normally when something was wrong, I’d agonise over the problem, rumination would steal hours and days from me, my single focus depriving me of sleep and sustenance. Now however, I could accept the disturbance, whilst I was curious as to the problem, there was no anxiety underlying it.\n\nThe last thing I remember was the anaesthetist asking me to count back from 10. ‘Did I die? Is that why I’m so calm?’ I wondered. I was never one for spirituality, being a neuroscientist, I’d always thought religion was something humans practiced in order to make sense of and give purpose to life. ‘Why do I think I’m dead?’ I wondered. I felt alive, more alive than ever before in fact, how could I be dead? And what are the odds of dying during a routine biopsy anyway? All surgery comes with risk but really, that’s what kills me?\n\n‘Being dead has its benefits’ I pondered. I felt like myself just uninhibited but there was something missing, for the life of me I couldn’t quite place what. Then it clicked; ‘Ah I must be in a coma!’ Why else can I not open my eyes nor hear the world around me. That would explain why my mind is so awake, but my body is out of reach. Will my PhD student be able to grow a copy of my amygdala before I wake up, I wondered. In vitro organ growth had become standard for transplantation about 5 years ago; A remarkable feat of modern medicine.\n\nThe only organ no one had any success with however, was the brain. Possibly the most complex and convoluted organ, seemingly out of reach. Others had grown some structures, a group in China even grew a working medulla oblongata. It was the last question, in a society no longer inhibited by physical health problems, now the focus was on mental health. Obsessive-compulsive disorder had haunted me for years and was certainly my main motivation for studying neuroscience. In OCD, it is thought that intrusive thoughts are fed to the amygdala which in turn responds as if the earth is imploding. I thought if I could grow a version of my own, I could find the proverbial off switch.\n\n‘There’s no intrusive thoughts.’  Would it be prudent to medically induce coma for OCD patients I thought humorously. ‘Bit-unethical that’ I reasoned, albeit begrudgingly. Something still niggled away at me though, it wasn’t intrusive or scary but it was there, almost like an eye-floater, unobtainable, elusive, and impossible to ignore once acknowledged. ‘It’ll come to me, it always does’ I thought. Chasing the uncatchable requires aloofness and misdirection. Giving it attention only encourages it. When your dog is off-lead at the dog park, it only returns when you pretend to leave without it, right?\n\nHow long has it been, I wondered. Hours, days, weeks, minutes? Although I felt awake and alert, were my thoughts synchronous or did I finish them after an unknown period of unconsciousness? There were so many questions unanswerable in this state. I need to wake up, I need answers, I need to know what’s missing. Then, seemingly ethereal, the light flooded in, blinding me. The room around me beginning to take shape and reveal itself,  ‘at least my eyes…’, I stopped. The unknown suddenly abundantly clear, as clear as the person in front of me. Perhaps appropriate given the occasion, in the dulcet tone of Jeff Goldblum I thought, ‘You did it. The crazy son of a bitch, you did it’.", "", "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n>* [No AI-generated responses &#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n>* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n>* Responses don't have to fulfill every detail\n>* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22&restrict_sr=on&sort=new&t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22&restrict_sr=on&sort=new&t=all) for stricter titles\n>* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n&#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n&#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n&#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n&#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*", "Pairi stooped, clutching at the chamberpot he carried. He hated his deliberately hunched posture; he hated the nervous ticking of his heart. First jobs, the Mother had told him, were always the most nerve-wracking. He'd killed before, of course, but never alone.\n\nPairi's face was plain, average; nothing like the regal points of his clanmates. The matter of his birth - found, a waif, and adopted into the clan - meant nothing to the Mother; he, as did his clanmates, loved her, and that was enough. He had had no tokens or talismans with him, and his face was too average to know. He could blend into a crowd and seem no more out of the ordinary than any other skittish child.\n\nHe dumped the chamberpot, his round nose wrinkling at the smell, then plopped it down, hurrying back through the castle. The impending sunset made a mad flutter inside his chest, and so he armed himself. He'd shown proficiency in most weapons, but the Mother thought poison suited him. That was what Pairi meant, in fact; it was a corruption of an ancient word for poison. Most people thought it had meant 'healer', but the Mother was old enough to know otherwise.\n\nBut poison did no good when you were caught, so the Mother had compromised. He'd taken two daggers as his weapons, dipped in a combination of deadly juices and venoms. He was good with them.\n\nPairi paused one of the castle's many corridors, inhaling. He knew where the prince slept. Royal custom in this place meant that the royal family could not show their face to commoners, and its people were private, so he knew barely anything about the prince, but he could do this. He took in a long breath, then began walking.\n\nThe padding of his shoes made only the slightest brush of noise as he slipped into the royal chambers. Candles burnt, brightly illuminating a figure atop a bed, hidden by curtains. Pairi locked the door behind him, and approached the figure. He whisked away the curtains.\n\nThe prince turned, and Pairi gasped. He'd prepared himself for a good many faces, but not one like this. Not a face like his.\n\nNo, not like his. *Identical* to his. The round nose, the high cheeks, even the awkward flush. The same hair that curled around the front and then went frizzy in the back. It was as if he had stared into a perfect mirror.\n\n\"You!\" Pairi yelped.\n\n\"You,\" the prince breathed, eyes sparkling, and he sprang up. His chest was bare, and looking at it, Pairi could see just a replica of his own. He looked back up at him, at the identical face, and tightened his hold on his daggers.\n\n\"Who the Hell are you?\" Pairi cried.\n\n\"Your brother, of course,\" said the prince. \"Oh come on - it's me, silly! Prince Araki. Soon to be King Araki.\" He reached out, brushing his fingers over Pairi's jaw. \"I never expected you to look like this, I must admit. Thought you'd be less scarred.\"\n\nAraki was not his exact replica, Pairi realised, almost to his relief. He had no scars, no marks of devotion to the Mother. No marks from her punishments, for when he had grown too bold. They were old scars, though; Pairi knew now to love her without question, and he had not been punished for a good while.\n\nPairi slapped Araki's hand away. \"I don't understand.\"\n\nAraki gazed at him, his face solemn. \"I know,\" he said. \"I know they took you from me, brother. My - *our* \\- parents told me. I know you were left in the Clanwoods, and you must have suffered so, so much to get here, but you're here now.\" His eyes looked so hopeful. \"We can be together now. We can rule! Just us, like it was always meant to be.\"\n\n\"The Mother- she never told me -\"\n\nAraki's eyes widened. \"You were taken in by *her*?\" He uttered it like he was discussing a god. \"Oh, my dear brother... She must have lied to you. But you have me now.\" He reached out and took Pairi's hand. \"Whatever you learned,\" he said, \"it was a lie. It was a lie. But you can be free, now.\" He let go of Pairi's hand, then took Pairi's head in his hands again, pressing it down so his mouth had access to Pairi's forehead. \"They must have named you. Tell me, brother, what I shall call you. And then we can be like we were meant to be.\"\n\nPairi closed his eyes. \"Pairi,\" he whispered. \"Pairi.\" He felt Araki kiss his forehead, felt the slight relaxing of his brother's muscles, felt his own tensing, and drove his daggers into the prince. One into Araki's heart, the other up into his throat.\n\n\"You're wrong,\" he said through his closed throat, as Araki thrashed and gurgled. \"The Mother *does* love me. She always will, as long as I am good.\" He stared down at Araki. \"She loves me!\" he repeated, even as his brother's eyes closed and his breathing stopped. \"The Mother will have an answer; she always has one.\" He ran his hands through his hair, and he worried that it was a test. He flung himself back from the bed, dropped down from the window to the balcony, and began his mad scramble down, until his feet hit the ground and he could flee into the woods.\n\nHe could feel the Mother then. *Did I do good*, he thought, and he prayed that he had not angered her, and that she would still love him.", "Man I wasn't expecting him to go through with it, loved the ending!", "I threw my knife, bullseye. Though that was common for me now. It wasn't even an accomplishment to me anymore, just useless practice for something that wouldn't happen. When it was truly kid play, it was much more fun. Getting a weapon of yours young, was rare, and I was one of the few with one. Now everyone has one, no more specialness.\n\nI heard a horn blare, and I stopped just before letting my second knife go. I haven't heard that horn since I was a little tyke. The Fullier, our group leader in our band of Elven assassins, was standing on a stump. \"Get ready men, we are storming the castle. Elise, you know what you have to do.\"\n\nI fumbled with my blades, before bowing. When I got up, my eyes were their regular glare, everyone else's were also slits, copying mine. It was how we were taught, don't seem happy, angry, judging, that is how you are meant to be. I grabbed my knife from the board, and filled my quiver. We left at nightfall.\n\nI followed the rest, I was the only female in the group. All the rest were at camp taking care of their tykes. Two guys had slaughtered the guards, I won't give you details for your sake. We snuck inside the castle, everyone spread out, going to the vault, and the like. I headed towards the prince's room.\n\nHis father had recently died, his mother dead at birth, he would be crowned in the morning. I didn't know much about human traditions, the kings and queens, princes, and princesses. But from what I heard, it is better to be rid of it. That was my duty, my mother...had broken the rules.\n\nShe mated with human, I was an imperfect, she was killed. I witnessed it just barely old enough to remember. That was the last time I heard the horn, the horn signals a hunt, a murder. I would have been next, but the wife of the Fullier refused. She said I must bring back honor to our guild, and I couldn't do that dead.\n\nSo they trained me as an assassin, my goal, to kill an heir. This was it, *I* would be accepted. I opened the door to find a teen, sixteen, seventeen at oldest. Though his hair told otherwise, silvery-white, paralleling mine. His eyes had the same sea-green shade as me. \n\nI shook myself, trying to get the idea out. Was I my mom's only child? She had me on a mission, it was entirely possible it wasn't just me. No. I was her only child, the only result of her mistake. I grabbed my knives, but I couldn't. He was of Elf blood, I could tell from his ears, from his stature.\n\nI dropped my weapons, as taught not to for so long now. I attempted to keep my glare, but my eyes began to swim. I felt my tears roll down my face as I fall to my knees. I broke, \"S-sister?\" He said, his voice also tearful, I had not realized, but he was crying as well. \"Who?\" I left my question vague, yes, but how should I end it with so many suitable endings? \n\n\"I'm Alexander, our father was also Alexander.\" He said, and I knew, my life would be so different from now on.", "Thank you! I loved it!", "Thank you! I worked hard on it, I'm glad you like it", "", "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n>* [No AI-generated responses &#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n>* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n>* Responses don't have to fulfill every detail\n>* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22&restrict_sr=on&sort=new&t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22&restrict_sr=on&sort=new&t=all) for stricter titles\n>* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n&#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n&#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n&#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n&#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*", "The ultimatum was simple: Either I go off to a 4 year college, trade school or get a job. My parents adopted me about fifteen years ago, and things were good until three years ago when they were able to conceive a baby through IVF.  \n\nNot that I mind. But they had their own kid now and I was starting to do all the typical teenage rebellion stuff so it felt like I was just a guest at times. When I told them I didn't plan on going to college, at least not right away, they told me I had to go to school or find a job. \n\nThe temp agency was no help, all the jobs were just for the summer, and it would put me back at square one by the time September rolled around.  As I put my pretty barebones resume online, I got an email right away.\n\n\"MAGICAL HELP WANTED. No Experience Necessary. Free Wish When Accepted. THIRD ALCOVE, ALLEY SIX\"\n\nThose spam emails sure worked quickly.  I deleted it and kept my hopes up for something within the next few days.\n\nDay after day, that damn email would show up and I would delete it and move on. I did get an email from a bakery at a neighboring town. \n\nJim and Diane weren't as excited, they were hoping I'd leave to college, but maybe this would mean I would spend less and less time in the house, which was fine with them.  \n\nThe next day, as I drove into Irving, I was struggling to find parking and had only about five minutes until my interview. I decided to risk it and park in some random alley, but I wasn't going to be an asshole and block the entire alley. I managed to parallel park near some trash bins and hopped out of the car. My phone dinged. Another email about the magical help job. What the hell is going on. I blocked them twice already. \n\nFifteen minutes later, I was back in my car. The interview was a disaster. I somehow got the time mixed up and arrived forty five minutes late. I also misread the job posting and they were looking for an experienced baker as well as cashier. I hit the steering wheel in frustration and the horn sounded. \n\nOut of nowhere, a woman appeared out from one of the alcoves in the alley. She waved at me.\n\n\"Oh! You are finally here!  Henry, was it? Come on in, you are just in time for the interview!\" she shouted at me.\n\nI was confused and rolled down my window. \"Who are you? What are you talking about? How did you know who I was?\" I shouted back.\n\n\"Oh, I can explain all that in due time, come in, come in,\" she said. \"My name is Lalia.\"\n\n\"Henry, but you somehow already...\" I said as she led me inside the wall.\n\n\"You must be here for the magical help,\" she said.  \"Well you must be, you are the only one who applied\"\n\n\"But I didn't...\" I started to say but was again cut off.\n\n\"Basically you'll be helping me with daily chores and tasks inside my workshop,\" she said. \"Over there is the bathroom,\" pointing to a door with a typical unisex bathroom sign on it. \"Up there is my office,\" she said pointing a staircase that lead to an office with glass windows. \"And here is where you will be working,\" pointing at a long bench with drawers and vials and beakers on top.\n\n\"But wait what will I..\" I started to say.\n\n\"I told you, you'll be helping me. Mixing, filtering, melting, cooking, heating, cooling, roasting, burning, freezing, all the typical stuff a lab assistant does,\" she said.  \"The pay is 150 a day, plus benefits, and you will work only when you are hear, you will not be taking your work home with you,\" she said.  \"No seriously, none of this stuff can ever leave this room or else you will be putting people at risk.\"\n\n\"This stuff is dangerous?\" I asked.\n\n\"Only if you don't listen to my precise instructions,\" she said.  \"Or if you are clumsy. Are you clumsy Henry?\"\n\n\"No, I don't think...\"\n\n\"Great,\" she said.  \"Let's get started.\"\n\nThe first day was a whirlwind of activity.  I had no idea what Lalia did, but she always seemed frantic in completing it and when it was finished, she simply dumped it down a large drain she had. It was chaotic. We would create potions, record the results, and destroy the product. She told me not to worry, the drain doesn't lead to any of the town's drinking water, it gets stored someplace safe. The potions and materials were strange, nothing I ever heard of before, but then again I barely passed chemistry so maybe that's the reason why.\n\nTwo weeks later,  I arrived at work as normal and Lalia wasn't there.  She left a sign on the door with a list of chores for me to do. As I started doing my chores, I realized that Lalia forgot to unlock one of the cabinets that held some \"potentially world ending\" solutions in it (or so she claimed/joked). I texted Lalia and asked her where the bathroom key was, and she told me it was in her office. Although I was forbidden from going in there, she gave me permission ONLY if I grabbed the keys off her desk and nothing else.\n\nAs I went up there, the room was...much different than I expected. To say it had an occult theme would be putting it lightly.  Statues, candles, weird symbols and jars filled with unknown objects and liquids filled the entire office. From the ground level, you couldn't see any of this decor. \n\nLooking around, I found the keys on top of a manila folder. The folder had my name on it. But with a different last name. My birth name.\n\nI opened the folder and saw pictures of me from different periods of my life. My first day of school. Going to Disneyworld. My first time riding a bike. My 8th grade graduation. My 16th birthday. \n\nI grabbed the folder and went downstairs to look at it in some better light.  As I read through the files, it had info about everything. My likes. My dislikes. My friends. My first girlfriend. When we broke up. Why we broke up. My grades. My failures. My successes.  How does she have this info?\n\nA moment later, Lalia was right in front of me. She started me to the point I fell backwards off the stool I was sitting on. \n\n\"Henry, I told you not to look around. But maybe...maybe I didn't unlock the bathroom door just so you could find this...\" she said, looking at the pictures.\n\n\"Who are you? How do you have these pictures? And this info?\" I asked.\n\n\"Oh Henry. My sweet Henry. I'm your mother. Well, your birth mother. I'm so sorry Henry. I'm sorry for putting you up for adoption, but I had to. It is a long story...\" she said.\n\n\"I have time,\" I said.\n\nShe explained how she had to give me up for adoption to protect me. She's an alchemist, someone who latent magical powers to creature tinctures and elixirs that have various magical properties. Others have special gifts to, but her domain is alchemy. She created a potion once that would grant immortality, and realized it too late that this was too powerful for people to have, so she had to hide. But for my 18th birthday, my powers would come out, and she wanted to explain them to me face to face. Which is why she sent the emails. Which is why she made me late for the interview at the bakery. Which is why she is talking to me now. \n\n\"But I did lie to you,\" she said.  \"And I'm sorry I did. And it was kinda...a  big lie. And I know you don't believe me, but you'll find out...\" she checked her watch.  \"In thirty seconds. Henry, your birthday is today, not August 18th. I falsified your birth records.\" \n\n\"Wait, what?\"\n\n\"Henry, it is your birthday. Your powers will come out soon. I'm here to help you guide you through them. But first,\" she said. She pulled out a small box from her bag. Inside, a small cake with a candle.\n\n\"Make a wish Henry,\" she said.", "Awesome story! I enjoyed it a lot. I'd love to know what powers Henry has! Thank you for writing!", "A joy to read. Quirky and fun with a touch of mystery.  Thank you for writing this!", "", "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n>* [No AI-generated responses &#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n>* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n>* Responses don't have to fulfill every detail\n>* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22&restrict_sr=on&sort=new&t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22&restrict_sr=on&sort=new&t=all) for stricter titles\n>* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n&#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n&#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n&#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n&#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*", "", "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n>* [No AI-generated responses &#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n>* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n>* Responses don't have to fulfill every detail\n>* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22&restrict_sr=on&sort=new&t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22&restrict_sr=on&sort=new&t=all) for stricter titles\n>* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n&#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n&#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n&#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n&#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*", "“Pardon?”\n\n“The year here is 2024.”\n\n“Twenty *four*?”\n\n“Yeah.”\n\nThe mist that had followed the time traveller to this moment had not yet fully dissipated, it clung about him in a swirl of vague blue light that throbbed as it slowly sunk. It looked to the fellow who was a native of this time, like the spiral arms of a galaxy, one that had a foil-suited very confused man at its center.\n\nThe time traveller had gawped and stalled, his eyes had slid from the unimpressed one-man welcome party and landed side-eyed at the horizon of his own inner doubts and questions. He lifted the clear plastic goggles off his face and once more pointed his attention on the present person of the non-past present.\n\n“*Twenty* twenty-four?” The time traveller spoke slowly. Carefully. Maybe the people of the past were harder of hearing. Maybe his own accent and diction had evolved beyond their ready understanding. He raised a hopeful brow.\n\n“Yep. Two-oh-two-four.” At the confirmation, similarly slowly spoken, the time traveller took off his goggles, held them low, and began to fiddle with them. His foil wrapped shoulders slumped. The other gent, the man who had seen this fellow form from a flash of frosted fog, felt a certain...sympathy? A sensation that if spoken would sound like \"Aw, buddy.\"\n\nThe foiled up fellow seemed quite down about the whole thing. And though the time-fog had mostly gone now — a few strands clung about the date dawdlers ankles like a spectral cat — there was a sense of quiet embarrassment that hung in the air in its place.\n\n“Still.\" Started the sympathetic time-stationary man. \"Quite impressive to pop in out of nothing.”\n\nThe eyes of the the man in the flimsy metallic jumpsuit stayed pointed down and they had grown a little shiny. He toed the ground with the tip of one rough and reflective boot and gently kicked at an unseen nothing. “Eh. Teleportation is easy.”\n\n“Is it? I mean, I've never seen it before.”\n\n“I used to build teleporters in primary...school. Wait!” His eyes were open-wide, his hands were on his head, he bounced on his heels. “*Never*? Like, never-never?”\n\n“Never-ever-never.”\n\n“Holy! Wait!” The time traveller paced about before his newfound friend who had never-ever-never seen teleportation: the most basic mode off mass mass transport (that is: the moving of a lot of tonnes of stuff — mass mass). He tugged at his lip as his eyes bounced across the invisible tableau of his own thoughts, like twin ping-pong balls being battered in a rapid rally of ideas. “You said it was twenty twenty-four, yeah?”\n\n“Yep!” The man from this time had started to pace too, had shouted his reply. The excitement was more than a little contagious. “Twenty twenty-four. A. D.”\n\nThe time traveller’s feet stopped, his upper body having missed the memo continued, and he stumbled, stepped, saved his balance, and spun to face the person of the past. “Ay. *Dee*!?”\n\n“Uh. Yep?”\n\n“Ah-ha-haha! Yes!”\n\nBefore he realised what was happening the man from 2024 Anno Domini was returning a tight hug and jumping up and down and screaming with the man from 2022 Anno Post Bellum.", "After war? Interesting.", "Gotta love how the 2024 man is slowly getting the same excitement from the time traveler lmao. Funny how little conversation is enough to spark all these emotions.\n\nThat said, what's the time traveler's goal here, and will the timeline change for teleporting right in front of a person in the past?\n\nGreat work on writing this!", "oh this, I like this, your wordsmithing is top notch", "Anno and Post are basically the same thing.", "therefore this guy is from the time *after* The Aftertime of The War*\n\n...in other words... once the world had recovered and they could futz around fussing with frivolous finagles.\n\n:  /   \n\nsorry lol not as good at this alliteration as the OP", "Anno is Latin for \"year,\" so Anno Domini means \"the year of our Lord\"", "The two figures blinked, looking around for a moment. One of them pointed at the alleyway, and the gestured at the sky. \"2024?  This couldn't possibly be 2024. That smog is clearly late 80s at best, there weren't gasoline-powered cars here in america, we'd swapped for electric long before that, and finally Hydrogen by.... well, that's still in progress. And besides... look at all the streets! This is a city, with actual cars on the road, this can't be 2024, or even the 2000s at all!\"\n\nAs his father shook his head at the strangers in their odd outfits, the teenager blinked, looking back and forth between the two silver-clad humanoids; he couldn't tell what gender they were, but obviously they must be lying, right? \"Uhh... okay. Hydrogen cars? How would that work? And what was supposed to happen to the cars?\"\n\nThe two figures sighed, and the one who had yet to speak turned to the other. \"Could we possibly have gone too far, into the BC era? Or even some older era that numbered things differently?\"\n\n\"No, no. These people are speaking american english, remember? We swapped in from latin before we shifted here. We must have done something to change the timeline.\"\n\n\"Fine, fine. Lets see what screwed everything up.\"\n\nAs the man and his son stared in confusion, the air surrounding the two silver-clad figures twisted and shifted. The men stopped. \"Okay, it probably started earlier, but the first real thing we see was some car company coined the term 'Jaywalking' and tried to make people think that car accidents were the fault of people walking instead of the driver, and it somehow caught on, and all went to hell from there. Even turned walking across the street into a crime somehow. Which... somehow led to nuclear weapons testing, and the eventual collapse of the country.\"\n\n\"Well, hell. Any way to know exactly where we went wrong?\"\n\n\"It's been thousands of years! Whatever we did must have been vanishingly insignificant if it didn't show up for over ... however long ago Pompei was. Considering it all started with that 'Jaywalking' thing becoming popular, it was probably just an errant line or syllable in the wrong place that got recorded in stone and remembered way down the line.\"\n\nThe two stopped the fast-paced blur of a recording, and looked at each other, then at the two locals. \"Well. The only reason we were willing to stop here is because we thought we were stopping at another spot that was about to be destroyed, so nothing we did would matter. This is supposed to be a few hours before the last day of the Final War, when the sole remaining nuclear power was forced to give up its bombs... and this place was supposed to be destroyed. The last, and only, city to ever be nuked. We're going to go back in time and... I dunno. Murder whoever invented the term Jaywalking? Some car manufacturers? Whatever. So long as it doesn't turn the world into this hellscape, I'm fine with it.\"\n\n\"Should we take them with? I think this whole place will cease to exist the moment we leave.\"\n\n\"...Huh. What do you say? Want to go on a bit of an adventure? Better than dying, anyway.\"", "Well, seems like it's a lucky day for the father and son, although I got a feeling that this time traveling adventure will be a quirky one considering the plan here. \n\nThat said, can the nuclear war really be averted that easily? Are these time travelers actually human? Also, would the futuristic humanoids disappear if the war is prevented? \n\nGreat work on writing this!", "“Alright, let’s see if we can get this baby fired up” Argo announced to no one as he pushed himself out from under the Time Machine he’s been working on for the last ten years.\n\nArgo flips the switch to turn his Time Machine on.  A strange sound emitted from the machine, something between a mechanical, gear grinding sound and a soft whirring.  A bright white light starts to emit from the center.  “I’VE DONE IT!!!” Argo yells.\n\nAs the white light fills the circular machine Argo prepares himself.  He puts on the custom made time travel suit his mom lovingly dubbed his “space PJs”.  As he steps into his Time Machine Argo announces “Goodbye 2022, hello 3022”.  All of a sudden all Argo can see is white and a loud CLAP sound when suddenly everything goes black.\n\nArgo awakes standing in the hall of a sterile white building wearing nothing but some sort of a dress that was open in the back and had a strange pattern on it.  Argo starts wandering the halls looking for someone, anyone.  “Hello?  Anyone there?” Argo asks.  The only response he gets is his own echo from the corridor.  As he looks down the hall he sees doors lining either side, he also notices there is a faint beeping sound and voices coming from the far end of the hall.\n\nAs Argo makes his way down the hall the sounds get louder.  A woman wearing a white lab coat rounds the corner almost running into him.  “Oh Mr. Spencer, you’re awake!” She says.  “I’m Argo Spencer from the year twenty twenty…. How do you know my name?” Argo replies.  “I’m so sorry, my name is Shay, I’m one of the doctors on your medical team” The woman in the lab coat says.  Right at that moment Argo faded back into black.\n\nWhen Argo awakes he realizes he’s in a hospital bed.  Shortly after a man in scrubs walks into his room.  “Mr. Spencer, how are you feeling?  You took a nasty fall out there” The man in the scrubs says.  “What year is it?” Argo asks.  “It’s 2024, you’ve been in a coma for 2 years after you were in an explosion” replies the man in the scrubs.\n\n======\n\nPlease be easy on me, this is my first attempt at any kind of creative writing.  Any feedback would be greatly appreciated!", "", "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n>* [No AI-generated responses &#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n>* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n>* Responses don't have to fulfill every detail\n>* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22&restrict_sr=on&sort=new&t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22&restrict_sr=on&sort=new&t=all) for stricter titles\n>* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n&#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n&#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n&#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n&#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*", "", "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n>* [No AI-generated responses &#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n>* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n>* Responses don't have to fulfill every detail\n>* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22&restrict_sr=on&sort=new&t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22&restrict_sr=on&sort=new&t=all) for stricter titles\n>* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n&#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n&#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n&#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n&#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*", "The Court Magus was instructed to come to the castle's ballroom to meet the newly summoned hero. Having instructed his subordinates to do a very careful job after the latest... **INCIDENT**, he had been told that the latest summoning had finally been a success! The result? A very handsome, muscular man with biceps the size of mountains that bulged like a freshly baked loaf of bread rising in a very hot oven, with a fashion style that could even rival the King's personal stylists.\n\nHowever, when the Magus entered the ballroom, sudden traumatic flashbacks to the... **INCIDENT** came to his mind as all that he could see before him were a group of fearful summoners gathered in a ring, and an extremely scrawny man in the middle of them. All of the summoners' gazes were turned at the Magus, who had just barged in. The chandelier above them continued to burn brightly, casting a menacing shadow on the Magus' face. However, he knew his duties as he approached the \"Hero\" to introduce himself.\n\n\"Greetings, oh weary traveler of the Realms. You have been summoned here to save us from a fate so dire that it would doom our world to fire and flames. We are in a desperate need for a hero.\" The Grand Magus had been able to win over every hero summoned thus far with that very same spiel. Feeling confident that it would work this time also, he decided to deliver the final blow.\n\n\"It is time for you to set upon a path. Renown and unimaginable wealth awaits you if you fulfill this destiny.\"\n\nThinking about it for a moment, the prospective Hero quickly retorted.\n\n\"I don't want to.\"\n\n\"What?\"\n\n\"You heard me. I don't want to.\"\n\n\"What do you mean you don't want to? Didn't you hear what I said? The whole part about 'unimaginable wealth'?\"\n\n\"Yeah, I heard you. I just don't want to.\"\n\n\"We are quite literally offering to give you everything you could ever possibly want. So, why?\"\n\n\"I just don't want to risk my life for - what even is this - a kingdom that I don't even know. Is that so strange?\"\n\n\"Well, now that you mention it, I guess I get it.\"\n\n\"Right? Anyways, can you sent me back? I was about to finish a rather delicious cup of noodles when you so rudely interrupted me.\"\n\nThe Grand Magus felt somewhat indimidated.\n\n\"Yeah, yeah, sure.\"\n\nAnd with the flick of a wrist, the Grand Magus returned the scrawny noodle-hungry stranger back to their own homeworld. Seeing this, one of the summoners responded with a rather surprised tone.\n\n\"Wait, he can do that? Then why the fuck did we have to do the ritual?\"", "We walk this way that we may trod upon\n\nSome land that some have not\n\nWe walk this way that we may walk\n\nA sacred path not long forgot\n\n\n\nWe walk though we may now know naught\n\nOf the way in which we go\n\nWe leave behind where we have been \n\nFor onward is all we know\n\n\n\nA sacred way, this path we take\n\nOur sins our journey doth forsake\n\nAnd in our march we ponder on\n\nSuch ways we've not yet gone\n\n\n\nAnd though the end shall be the same\n\nNo more than which from whence we came\n\nUnder the sky, we freely roam\n\nAnd take the long way home from home", "That's beautiful", "Thanks. Appreciation goes to the Author of the prompt, as before now I've only idly written the last sentence out minus the \"and\" on several things as a bit of an anthem.", "", "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n>* [No AI-generated responses &#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n>* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n>* Responses don't have to fulfill every detail\n>* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22&restrict_sr=on&sort=new&t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22&restrict_sr=on&sort=new&t=all) for stricter titles\n>* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n&#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n&#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n&#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n&#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*", "\"There is a reason this fucking shit was outlawed. In the hands of the ill-equip, the incantations don't work as they are supposed to. Look at the collateral damage. They've nearly torn apart their own land more than our forces.\"  \n\n\n  \n\"I don't think they care sir, as long as they are killing us\" I said tentatively.   \n\n\n  \nThe latest trap we had triggered had a particularly nasty effect, surely due to the amateur nature at which is was incanted. In the barracks we call them 'hollywood stars' because of the uncanny resemblance of the star-shaped crater left after the trap has been triggered. That is if it was cast correctly. In the hands of militiamen with torn chapters of pillaged books stolen from libraries of magicks, the effect is a lot less magnificent, a lot more malignant.   \n\n\n  \nOnce triggered a insidious energy branches out in a star shape, eventually reaching a crescendo of about 50 feet and then abruptly exploding into a mist of arcane mystery. The explosion rips at the fabric of the mind, not the flesh, no, it targets the conscious and those unlucky enough to be caught within the radius are inflicted with a thick psychosis. However, as asinine as it is, rules must still be applied to the conventional use of magic in warfare.   \n\n\n  \nGeneva code 78c: 'All magicks used in a combats situation must only be performed by those of adequate skill and studies.'   \n\n\n  \nA rule, apparent to us now, that was being thoroughly broken. Hollywood stars, when incanted correctly, turn your own senses against you, inflict deep confusion and panic, and induce pandemonium amongst ranks, however, incanted correctly, it is not a vindictive spell, a flashbang of sorts. Incorrectly, however, the mind plays tricks on itself, your deepest fears creep forth from your subconscious mind and appear in front of you as if flesh and bone. I've seen soliders tear out their eyes, picking into their sockets with rusty knives, in a desperate attempt to cause the hallucinations to stop.", "Holy Cow this is really good... and terrifying.", "", "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n>* [No AI-generated responses &#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n>* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n>* Responses don't have to fulfill every detail\n>* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22&restrict_sr=on&sort=new&t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22&restrict_sr=on&sort=new&t=all) for stricter titles\n>* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n&#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n&#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n&#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n&#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*", "", "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n>* [No AI-generated responses &#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n>* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n>* Responses don't have to fulfill every detail\n>* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22&restrict_sr=on&sort=new&t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22&restrict_sr=on&sort=new&t=all) for stricter titles\n>* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n&#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n&#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n&#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n&#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*", "“Willy - Wonka - what - has he done?\nHe commit murder - just to have - fun.\n\nHis - grave - crimes - and - criminal mind;\nno one more wicked - ever - you’ll find.\n\nNow - in the name - of - heaven above\nJustice - demands - we deliver tough love.\n\nPrison’s - too good - for - somebody like that;\nOnly death can - pay - his - debt!\n\nThe debt -\n                    he owes -\n                                         society.\n\nWilly - Wonka - soon you will die;\nWe - the court - adjourn - and now say goodbye.”", "", "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n>* [No AI-generated responses &#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n>* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n>* Responses don't have to fulfill every detail\n>* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22&restrict_sr=on&sort=new&t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22&restrict_sr=on&sort=new&t=all) for stricter titles\n>* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n&#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n&#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n&#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n&#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*"]