[{"post_title": "[OT] Fun Trope Friday, Writing with Tropes: Wise Beyond Their Years & Adventure!", "post_url": "https://www.reddit.com/r/WritingPrompts/comments/1bx01zj/ot_fun_trope_friday_writing_with_tropes_wise/", "post_main_text": "\n#Hello r/WritingPrompts!\n\n###Welcome to **Fun Trope Friday, our feature that mashes up tropes and genres!**\n\nHow’s it work? Glad you asked. :)\n\n&nbsp;\n\n\n-\t**Every week we will have a new spotlight trope.**\n\n-\t**Each week, there will be a new genre assigned to write a story about the trope.**\n\n-\t**You can then either use or subvert the trope in a 750-word max (vs 600) story or poem (unless otherwise specified).**\n\n-\t**To qualify for ranking, you will need to provide ONE actionable feedback. More are welcome of course!**\n\n&nbsp;\n\nThree winners will be selected each week based on votes, so remember to read your fellow authors’ works and **DM me your votes** for the top three.\n\n&nbsp;\n***\n\nNext up…\n\n&nbsp;\n\nMax Word Count: **750 words**\n\n&nbsp;\n\nTrope: **[Wise Beyond Their Years]( https://tvtropes.org/pmwiki/pmwiki.php/Main/WiseBeyondTheirYears)**\n\n\n&nbsp;\n\nGenre: **[Adventure](https://en.wikipedia.org/wiki/Adventure_fiction)** \n\n&nbsp;\n\nSkill: **Show a believable friendship or other relationship between two characters** (optional)\n\n&nbsp;\n\nConstraint: **Include a surprisingly wholesome detail or [MacGuffin](https://en.wikipedia.org/wiki/MacGuffin)** (optional)\n\n&nbsp;\n\nIt’s lonely being special. Different. Misunderstood. Constantly looked to for guidance. Positively exhausting! \n\n&nbsp;\n\nThe classic wise beyond their years trope is about a kid who understands the world as an adult would. But really this could apply more broadly, so use your imagination. E.g., the twenty-something who understands how their firm works better than management. Or the new parent who is practically savant-like in knowing how to raise kids. \n\n&nbsp;\n\nBut one thing these sagacious characters have in common is seeing the world in a way that is different than the norm for their age. This can lead to respect, jealousy, love, hate. Anything really. So consider exploring how strange this othering can be and how the wise character may feel about it. Arrogant? Unworthy? Lonely? \n\n&nbsp;\n\nOr spin the trope on its head and explore an immature (hu)manchild or the like. \n\n&nbsp;\n\nSo, have at it. Lean into the trope heavily or spin it on its head. The choice is yours!\n\n&nbsp;\n\nHave a great idea for a future topic to discuss or just want to give feedback? FTF is a fun feature, so it’s all about what you want—so please let me know! Please share in the comments or DM me on Discord or Reddit!\n\n&nbsp;\n***\n\n**Last Week’s Winners**\n\nPLEASE remember to give feedback—this affects your ranking. PLEASE also remember to DM me your votes for the top three stories via Discord or Reddit—both katpoker666. If you have any questions, please DM me as well.\n\nSome fabulous stories this week and great crit in campfire and on the post! Congrats to:\n\n&nbsp;\n\n-\t**[oliverjsn8](https://www.reddit.com/r/WritingPrompts/s/vTGbVTbD7f)**\n\n-\t**[AGuyLikeThat](https://www.reddit.com/r/WritingPrompts/s/U4WVfMffQE)**\n\n-\t**[john-wooding](https://www.reddit.com/r/WritingPrompts/s/XelgL2nys8)**\n\n\n&nbsp;\n\n***\n\n\n###**Want to read your words aloud? Join the upcoming FTF Campfire**\n\nThe next FTF campfire will be **Thursday, April 11th from 6-8pm EST**. It will be in the Discord Main Voice Lounge. Click on the events tab and mark ‘Interested’ to be kept up to date. No signup or prep needed and don’t have to have written anything! So join in the fun—and shenanigans! 😊\n\n&nbsp;\n***\n\n###Ground rules:\n\n- Stories must incorporate both the trope and the genre\n- Leave one story or poem between 100 and 600 words as a top-level comment unless otherwise specified. Use wordcounter.net to check your word count.\n-  Deadline: 11:59 PM EST next Thursday\n-  No stories that have been written for another prompt or feature here on WP—please note after consultation with some of our delightful writers, new serials are now welcomed here \n-  No previously written content\n-  Any stories not meeting these rules will be disqualified from rankings\n-  Does your story not fit the Fun Trope Friday rules? You can post your story as a [PI] with your work when the FTF post is 3 days old!\n-  Vote to help your favorites rise to the top of the ranks (DM me at katpoker666 on Discord or Reddit)!\n\n&nbsp;\n***\n\nThanks for joining in the fun!\n\n***", "post_comments": [{"comment_author": "Lothungr", "comment_text": "Björn sighed when he reached the clearing. It had been a long and treacherous way to get here, but he had finally made it. The small hut of the herbalist was crooked with a roof that almost reached the ground where a wild flowers and herbs gave off a sweet smell. A calico cat slept in the warm sun.\n\nThe door of the hut consisted of a million tiny beads on strings that gave off a clear tingle when he pushed them aside. \n\nInside he was greeted by the smell of fresh herbs and honey. It was cooler here, but not unpleasant. Light from green glass windows fell on shelves brimming with jars full of various plants and liquids. The herbalist was working behind a burly wooden table teeming with all kinds of instruments that were unfamiliar to Björn. When he entered she stopped her work and greeted him warmly.\n\n\"Welcome, dear traveller. You must have travelled far, for your feet are heavy and your shoulders weary. Your lover must be lucky to have someone like you to look after them.\"\n\n\"How did you know I was here to find a cure for my lover's illness?\"\n\n\"A lucky guess. What is their name, if I may ask? What ill nature has befallen them?\"\n\n\"Alex, is their name. They have caught a strange illness and no herbalist has found a cure or known help.  It is a black fever that makes one cough up blood at night and turns your very flesh grey. You are the last hope I have, if you can't help no one can.\"\n\n\"A black fever you say? That is bad luck, but I will try my best to mix up a potion that may help you.\" \n\nThe herbalist turned and pulled jars from the shelves. With a quick motion she swept the strange instruments aside and set up a new workplace. While she was working Björn realised how young she was. She must have seen less than eighteen winters. He had heard of a magical herbalist at the edge of civilization but never that she was only a child. Suddenly a question formed in his mind.\n\n\"Why here?\"\n\nThe herbalist cocked her head. \"What do you mean?\"\n\n\"Why are you here in the middle of nowhere instead of the city? So many people have heard of you and so many could use your help, so why are you not closer to them? For the quiet of the forest?\"\n\nAt once the girl grew quiet and a sudden weight seemed to lay on her shoulders.\n\n\"I am not here because I hate people, if that's what you mean. Nor for the quietness of the forest, although I do enjoy it. If I could, I would not be this secluded, but if I could I would do a lot of things.\"\n\nShe turned aside, but not before Björn could see tears forming in her eyes. He moved to console her, but stopped himself when he realized he was a big man. Instead he quietly stood there, waiting for her to break the silence.\n\n\"They called me a witch. The devils daughter. You can help people, but that won't stop them from hating you. In the end it is better that I am out here, alone, and that they are back there in their cities. Still there are people who hate you for everything.\"\n\nHe could hear the hurt in her voice.\n\n\"I'm sorry\", he whispered. It didn't seem enough\n\nThe silence between them was broken when the cat strolled inside and rubbed her legs. She picked it up and stroked its soft fur.\n\n\"It's ok. I'm not completely alone and I have my hut and my garden. But you have come for a different reason. Your heart is heavy with sorrows and will only hang heavier with mine.\"\n\nSetting down the cat she picked up work on her potion. Soon she had prepared a flask of dark purple liquid. \n\n\"Give this to them. Their recovery will take time and hard work. They may not pay it back. Will you commit?\"\n\n\"I will. I love him with all my heart. Thank you. I will forever be in your debt.\"\n\nThe herbalist nodded and handed him the flask. On the doorstep he turned back.\n\n\"I am sorry about what I said. I'm happy you have found your place and everyone who says otherwise should learn about compassion first.\"\n\nA small smile crept on the herbalists face.\n\n\"Thank you. I wish you a fond farewell, may your journey be safe and his recovery quick!\"\n\nBjörn smiled, waved and escaped to find his lover."}, {"comment_author": "Lothungr", "comment_text": "Hi there, author here. Couldn't fit this comment in the reddit word count. This was a very fun challenge. Sadly I had to cut a lot of details to make the word count. But that's what personal files are for, I guess. If you can find some time I'd love some feedback, so I can improve my craft"}, {"comment_author": "ZachTheLitchKing", "comment_text": "Howdy Lothungr!\n\nJust so you know, you're allowed to put your comment in the main post, just have a little line or something to indicate it's not part of the story :)\n\nAlso per r/WritingPrompts standard, [wordcounter.net](https://wordcounter.net) is what's used to check the word counts and it looks like yours is coming in at 772, so gotta shave off about twenty-two words.\n\nLet's see if I can help with that :D\n\nLove the first paragraph, it does a great job not only describing the scene but also setting the vibe.  Bjorn was on a journey, a long one, and he was finally at his destination.  He's after a healer, and given he was able to make a long journey it implies that there's a loved one at stake.  This gives a great amount of tension to an otherwise serene location.  I love it <3\n\nThe line describing the door is nice but unnecessary.  It's also twenty-four words.  If you cut it, you'll come in under the word count :D\n\nThe introduction of the herbalist is wonderfully mundane and mystical at the same time.  She's just working away with herbs and spices - I'm imagining her with a mortar and pestle - and greets him when he arrives.  But there's something *knowing* about her.  How much magic is infused in her concoctions?  They know Bjorn is there for another but don't know exactly who.  It's easy to assume it's someone important - I did so in the first paragraph - but she seems to have some extra details like they are lovers.\n\nSus.  Lucky guess indeed :squint:\n\nAhh, so she's a witch.  You did a good job building up her emotional reveal, and the professional aspect of her wanting to turn things back quickly to Bjorn's worries is deftly handled.  \n\nWhile this may not be your intent at all, I feel like there's a *subtle* sinister undertone; the fact that she *looks* so young (trope excluded), the way she was able to just know the relationship Bjorn was there for, and the way a smile *crept* onto her face at the end.\n\nMe thinks people fear the witch for good reason?\n\nAnyway that's just speculation :)  Great piece!  I got a little hooked towards the end which is why my critical eye seems to have fallen off xD But that's a good thing, it means you really pulled me into the story.  I hope to see more from you here in future weeks :D\n\nGood words!"}, {"comment_author": "T_Lawliet", "comment_text": "**A Link In The Chain.**\n\nWC: 750 \n\nDamn you, princess, I thought, riding miserably through the forest. Even the darned horse seemed to pick up on my mood. \n\nHeir to the throne, now. She was probably going to marry some frog-faced duke. I’d promised her the world, but what could I give her now that she didn’t already have?  I slashed at the surrounding branches, then got my blade stuck in a tree. And me? I’d probably mope around the palace till I perished of old age, provided I wasn’t murdered first.\n\nI tugged on my sword, cursing. Hunting had always been fun, had always been..freeing. But now it just felt like a wider cage.  \n\nI wanted… damn, I didn’t know what. Just something other than this.\n\nWith one final cry, I ripped my blade out of the tree, just in time to hear the beat of a dragon’s wing. *Good morning, breakfast!* I heard a voice squeal. I threw myself off the horse as the dragon’s jaws closed around it. I heard the horse give one frenzied cry, then a loud crunch. \n\nThe thorns of the bushes I had landed in were\n\nmaking ribbons out of my tunic, but somehow that didn’t seem too urgent a concern. I raised my sword, but I couldn’t stop my arm from trembling. \n\nThe dragon looked at me, its eyes golden saucers. *Ah, I needed a snack to take with me.* \n\n“Wait!” I yelped. “Wait, no -”\n\nThe dragon pounced. "}, {"comment_author": "T_Lawliet", "comment_text": "I had plenty of time to think about my life choices, being carried along in the air. For instance, choosing to give my guards the slip. What had I been thinking? \n\nIt felt like the wind was my stepmother, slapping me in the face. Bone white talons drug into my shoulders, and I clutched them for dear life. Neither of these things made it easy to think. \n\n“Greetings, O Great Wyrm!” I called into the wind. “May I request  the name of a being of such unimaginable majesty?”\n\n \n\nThe dragon huffed. *You talk strangely for such a small manling. Very well, snack, you may address me as the Dragon Caramir, the Red Scourge of the Skies.* \n\nIt seemed like a mouthful. I was about to try and butter him up again when the dragon chose to dive. Tell the ballad singers I faced the fall with a stiff lip and a fire in my eye. I clutched my knees together as the dragon dropped me on the ground. My breeches were wetter than usual. I took a deep breath, feeling it rattle in my chest. \n\nMy father would be calling a search, surely. And my Delia? She would…\n\nFor a moment, I felt those green eyes stare into me. Stare through me. Unknowable. \n\nI felt the dragon’s claw grip me again, and toss me into the cave. It was cold, dark, and nearly completely empty. \n\nWhat had I been expecting? I don’t know. I guess it was too much to expect me to be kidnapped by a famous dragon. But this was just ridiculous. I was tempted to say it out loud, just to see the dragon’s expression. Instead:\n\n“O Great Wyrm, what misfortune has befallen thee? Some horrid thief must have taken your hoard!” \n\n*A thief, yes.* The dragon seemed to shift uncomfortably. *Yes, that’s exactly what happened.* \n\n“Dear heavens!” I cried, stepping forward and patting the dragon’s snout.”This injustice must be ended! Such a wonderful creature should not have to live in squalor!” \n\n*Hmm.* The dragon rubbed his nose against my hand. *I know, Mr. snack. You can’t believe what horrors I’ve gone through.* \n\n“Forgive me if this sounds presumptuous for a mere manling, but I can right this wrong.” \n\nThe dragon blinked, red scales suddenly enlit by inward fire. *Really? I mean…* He snarled. I\\*’ve heard empty words before.\\* \n\nI shook my head. “I always keep my promises, good Wyrm.” But there was more than one way to keep this one. \n\nMy father would pay a ransom. He loved me just enough for that. It was the safe option.. And maybe, just maybe, the stress of losing me would raise my princess’s regard…\n\nIt might not.\n\nI always envied the ballads for that. I hated how every time, the hero and his love seemed so sure, so certain. And I…\n\nI looked the dragon eye to eye. “Make me your servant, and i’ll give you all the gold you desire.” Then I bowed my head, and made sure he couldn’t see my smile. \n\n-\n\n-\n\n-\n\n**Want to know the rest of the story?** \n\n[A Hint of Suspicion Part One](https://www.reddit.com/r/WritingPrompts/comments/1ac9x7m/ot_fun_trope_friday_writing_with_tropes_crime/)\n\n[A Hint of Suspicion Part Two](https://www.reddit.com/r/WritingPrompts/comments/1ai4i7q/comment/kouur0p/?context=3)"}]}, {"post_title": "[OT] SatChat: What types of characters do you find most relatable? (New here? Introduce yourself!)", "post_url": "https://www.reddit.com/r/WritingPrompts/comments/1bxfex6/ot_satchat_what_types_of_characters_do_you_find/", "post_main_text": "[**SatChat! SatChat! Party Time! Excellent!**](https://i.imgflip.com/6sreaq.gif)\n\nWelcome to the weekly post for introductions, self-promotions, and general discussion! This is a place to meet other users, share your achievements, and talk about whatever's on your mind.\n\n## Suggested Topic\n\n**What types of characters do you find most relatable?**\n\n(*This is a repeat topic.  Have any suggestions for new ones?  Let me know below!*)\n\n---\n\n## More to Talk About\n\n* New here?  Introduce yourself! See the sticky comment for suggested intro questions\n* Have something to promote? (Books, subreddits, podcasts, etc., just no spam)\n* Suggest topics for future SatChats!\n\n *Avoid outright spam (don't just share, chat) and not for sharing full stories*\n\n---\n\n[**Apply to be a Mod**](https://www.reddit.com/r/WritingPrompts/comments/1av2k6r/modpost_call_for_moderators/) | **r/WPCritique** | [**Discord Server**](https://discord.gg/writingprompts) (Weekly campfires every Wednesday at 6 pm CST!)", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "**Tell us about yourself!**\n\n* Where do you live (State / Country)?\n* Preferred pronouns?\n* How long have you been on Reddit?\n* How long have you been on r/WritingPrompts?\n* Do you use r/WritingPrompts to read or write?\n* Writers:\n * How long have you been writing?\n * What is your writing motivation?\n * What programs do you use to write?\n * How fast can you type? [Try 1 minute on Aesop's fables](https://www.typingtest.com/PromoD/select.html)\n* Readers: \n * How do you find prompt responses to read?\n * Do you also write?\n * if not, why haven't you tried?\n* Want to share a photo? [See our Photo Gallery!](http://www.reddit.com/r/WritingPrompts/wiki/pics)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*"}, {"comment_author": "ZachTheLitchKing", "comment_text": "**What types of characters do you find most relatable?**\n\nThe characters I find most relatable are characters that I feel some strong emotional overlap with.  Qualities like this include:\n\n* **Tired** \\- A character who is just exhausted with *something*.  Whether it's physically tired of the day, tired of dealing with someone or something, tired of the stress, or just *anything* that makes their shoulder's slump and that slight, mouth-agape-frown.  Think Tony Stark from Infinity War dealing with the Guardians of the Galaxy.  Think Kratos from the new God of War games.  People who just want to rest but *can't*.\n* **Confused** \\- A character who has no idea what's going on and can't figure it out.  A fish out of water.  A peasant being paraded around in a royal court, unaware of the political intrigue.\n* **Overwhelmed** \\- A character who *does* know what's going on but can't do anything about it.  There are too many things to deal with, too many lives in the balance, too many sides to negotiate.\n* **Willfully Ignorant** \\- A character who knows there's more than what it seems but is choosing (for various reasons) to overlook it.  Burn down that building that they've been assured is empty and not full of children to save their loved one?  Whelp it's a good thing it's night and they'll be well out of earshot before any screaming may or may not be heard.\n* **Angry** \\- Straight up angry characters.  Not emotionally brooding ones who are silently seething with a smile as their victems chat calmly around them.  Give me Kylo Ren roaring in rage as he slashes up computer consoles impotently with his lightsaber.  Give me Hulk."}, {"comment_author": "MajorParadox", "comment_text": "Good choices!"}, {"comment_author": "xwhy", "comment_text": "If they're relatable, they're good, or there's good in them that can be brought out. Maybe life is good, maybe they're troubled (and there's the conflict). Even my demons have their moments. The rest have an absence of the above, making them less relatable, which is good because I don't need you relating with my evil villains.\n\nAliens are relatable, too, even the ones that aren't humanoid. Most of the ones in our local area are, but as you move farther out, they get stranger, but they all seem to have some human emotion that the reader can grab a hold of. \n\nI have a lot of relatable characters, some more than others, over in r/xwhy. A couple of those stories are appearing my new book, which is being self-published today."}, {"comment_author": "MajorParadox", "comment_text": "That's a good point about villains, but I wonder if relating to villains at least a little help make them feel more real?"}, {"comment_author": "xwhy", "comment_text": "The ones that aren’t meant to be redeemable usually have some variation of a deadly sin attached to them\n\nI generally leave out hobbies that folks might relate to and then be offended \n\nNo problems offending readers but over the “right” things"}, {"comment_author": "ThrowDirtonMe", "comment_text": "Hi I’m new here! I have loved writing since I was a kid. I have a blog now and I was looking for more ideas.  \n\nThe characters I relate to are ones with an arc. We don’t all start out as heroes and I think that’s important to remember. I like to see myself in someone who’s doing their best to learn and grow from a bad situation. And as a writer there’s so much to play with on that journey!"}, {"comment_author": "MajorParadox", "comment_text": "Yeah, the journey of the characters can be so much fun to explore!\n\nAlso, welcome!"}, {"comment_author": "ThatCrazyThreadGuy12", "comment_text": "Characters whose problems take time to solve, and require introspection, reflection, communication, and time. Problems where some BS power, or mcguffin would be absolutely useless."}, {"comment_author": "MajorParadox", "comment_text": "Yeah, that sounds like it'd make them more believable"}, {"comment_author": "ThatCrazyThreadGuy12", "comment_text": "Yeah, and the funny thing is, you can absolutely HAVE a character who has some OP power, or mcguffin but STILL struggles with those things (a key example being Superman, dude's OP as shit, but still has to grapple with the worldly consequences of wielding such power alongside a conscience)."}, {"comment_author": "Tregonial", "comment_text": "Looking back at my writing and the fiction I consume, I seem to relate to and enjoy non-human characters who find humans confusing, yet still are kinda human in their own way. They have so much power, but all the magic in the world and within their grasp can't solve their social awkwardness and struggles to live alongside others, relate to humans and the people they try to care about.\n\nIt probably stems from growing up as a gifted and neurodiverse child who could never fit in with everyone else in school. I could count the number of friends I keep in touch with from my schooling years with one hand. Always felt like some weirdo alien wearing a human skin who never understood all these hidden social rules and facial cues.  And despite how everyone says I'll be able to figure out all these emotional, human things eventually, stop alienating people by strange behaviors and being really weird abt things because \"omg you're so smart why can't you get it?\"...I still don't. Still fucking clueless as hell.\n\nSo, sometimes, I give my non-human characters someone I wish I had. A human foil and friend to bounce off. A nice human to show them the good in the world.\n\nIn retrospect, its a recurring pattern in my responses to writing prompts. And for some reason the non-human is usually male and the nice human is female, I don't know why.\n\n[Elbert](https://www.reddit.com/r/WritingPrompts/comments/1bsts4h/wp_every_time_you_die_you_receive_points_based_on/kxije2i/) has Samantha, Laura is the only one who believes [Mr. Hopper](https://www.reddit.com/r/TregonialWrites/comments/1brmogt/youre_a_dimensionhopper_who_can_walk_through/kx9y9c8/) can save all the worlds, [Lord Elvari](https://www.reddit.com/r/WritingPrompts/comments/1ayhpss/ot_fun_trope_friday_writing_with_tropes_road_trip/ksiiwqh/) has Kat, Sarah is supportive of [Vindalos](https://www.reddit.com/r/WritingPrompts/comments/1ajh22c/piscientists_revive_a_dead_god_through_prayer_and/), and there's definitely others I don't remember right now.\n\nAs for me, having joined WP reddit and discord, it feels like the Fun Trope Friday (FTF) gang is the \"nice human\" to the silly tentacle writer here. So, I'd like to give a shoutout to u/katpoker666 for making me feel welcome and u/Dependent-Engine6882 for being my favourite fangirl. Thanks ladies."}, {"comment_author": "katpoker666", "comment_text": "Thanks for the kind words, Tregonial. We’re lucky to have you at FTF: you’re a great writer and a lot of fun! :)"}, {"comment_author": "Goodlake", "comment_text": "\n\nHi all, been posting/commenting for a while but haven't really engaged in OT discussions! Recently took a writing course where I learned the value of peer feedback / interactivity, and so I'm going to try to be more active here as a reader/commenter and not just a writer.\n\n* **Where do you live (State / Country)?** New York, USA\n* **Preferred pronouns?** He/Him\n* **How long have you been on Reddit?** A little over ten years\n* **How long have you been on** **?** [9 years, it looks like!](https://www.reddit.com/r/WritingPrompts/comments/2ht5op/comment/ckvtfe1/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)\n* **Do you use**  **to read or write?** Mostly to write, but I'll usually read the other top level replies when I write something.\n* **How long have you been writing?** Since elementary school! I've always found little creative writing projects to do. Lately, I've been trying to focus my attention on longer form projects, but short form just seems to hit the sweet spot for me.\n* **What is your writing motivation?** Hmm, it depends on the format. With [](https://www.reddit.com/r/writingprompts/), I like to view the prompts as puzzles to be solved, or a chance to exercise certain muscles (e.g. scene description, dialogue, inner monologue, etc). Overall, I'd say I'm motivated by the desire to shape ideas into coherent, relatable and funny bits in order to court sweet, sweet upvotes.\n* **What programs do you use to write?** For longer form things, Scrivener. For [](https://www.reddit.com/r/writingprompts/), I'll either sketch things out in Word or I'll just type it up in the reply box.\n* **How fast can you type?** [Try 1 minute on Aesop's fables](https://www.typingtest.com/PromoD/select.html) 104 words per minute, according to the link! However, my laptop is elevated, and I'm sure if I put it directly on the desk, I could do it faster.\n\nAs for the OT post: interesting question. There are all sorts of things I find relatable in all manner of characters. That's the goal of good character writing, after all, isn't it? To color them with the sort of characteristics that make them feel real and... relatable. However, the characters I most *enjoy* reading are dry wits (e.g. Wodehouse's Jeeves) or the delusional and grandiose blowhards (e.g. Ignatius J Reilly)."}, {"comment_author": "MajorParadox", "comment_text": "Good answer! As a writer, you're kind of starting by making them related to you. And then that can translate to your readers."}, {"comment_author": "Alternative-Fun-7706", "comment_text": "I know they’re overdone and stereotypical but my number one would have to be the anxious main character who comes into her own. It’s really easy to write in that rambling type of style that’s mainly her inner monologue. I find it an amusing angle to read from as well because I myself am anxious and then compare if I’m like that while laughing at myself. \n\nAnother would be the over-possessive male. Easy to write for and I just enjoy writing out details of body language and facial expressions. Reading for that character gives inspiration. Plus it’s just- everywhere right now on BookTok. \n\nI enjoy overwhelmed characters that sort of ties into anxious. When they finally have their moment and explode it’s always a cathartic read. \n\nI would say that finally I enjoy the quiet guy. He doesn’t say much, but he’s always incredibly kind to the main character and it makes me smile 😊"}, {"comment_author": "Nobody9189", "comment_text": "The character i find the most relatable are characters who simply don't care and just want to live  quiet life\n\nA.) These characters are the most realistic, in my opinion. Chances are, should anyone be sent to an alternate world or anything, they won't run around doing edgy stuff or killing demon lords or any of that. They would probably settle down somewhere and live peacefully while following the law and the economy. (fr most of you won't even last in a swordfight because of the weight alone, no matter what anime or movies say)\n\n&#x200B;\n\nB.) I find characters that don't care to be funny, and also, there is some edgy satisfaction in knowing you can fix a problem yet choose not to because it's not your problem, to begin with (ie. not getting involved in a fight because you don't care and not because of some ideological stuff or moral stuff) and its probably not even worth the hassle to get involved (ie. you can get in trouble or have the blame pinned on you if you interfere)\n\nC.) Not only are these types of characters carefree in that no plot device can necessarily compel them to move towards anything, but morality is fairly flexible for these characters, making them easier to write. They don't get boring because I can easily just model the story however I want to without writing myself into a corner because I made them too evil or too good or any of the typical traps authors get trapped in.\n\nD.) Power is not necessary for these characters, and they are probably the most flexible. I can use them for an action story, a wholesome story, a comedy story, etc., without having to change them much, and these characters, beyond being good protagonists, also make good likable side characters due to their reliability.\n\n&#x200B;\n\nE.) Greatest of all, authors bias.\n\nThis type of character is my favorite and reflects how I am in real life more than other characters, so yeah. Human bias does its thing yet again"}]}, {"post_title": "[WP] You were just sucked up and abducted by a UFO. The alien inside addresses you, \"Is this translator working? Listen. I need you to pretend to be my boyfriend for three days so my parents will get off my back about it.\"", "post_url": "https://www.reddit.com/r/WritingPrompts/comments/1bymjbb/wp_you_were_just_sucked_up_and_abducted_by_a_ufo/", "post_main_text": "", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n>* [No AI-generated responses &#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n>* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n>* Responses don't have to fulfill every detail\n>* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22&restrict_sr=on&sort=new&t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22&restrict_sr=on&sort=new&t=all) for stricter titles\n>* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n&#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n&#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n&#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n&#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*"}, {"comment_author": "CameoShadowness", "comment_text": "\"Only 3 days? If we *break up* they might get on your butt again\""}, {"comment_author": "Scorppio500", "comment_text": "\"But I'm a girl?\" Emily is my name, but the alien wants me to be her boyfriend? I guess I look the part. Not sure how I feel about that. \n\n\"Doesn't matter. Tie your hair in that ponytail configuration you earthlings use.\" The alien is a weirdly beautiful blue skinned, four armed alien with long silky smooth green hair. She has six amethyst eyes and three rows of razor sharp jagged teeth. Not gonna lie, If I swung that way I'd be completely smitten. She's gorgeous. \n\n\"Are you, uh, sure your parents won't notice their daughter is 'boyfriend girlfriend' with a human female?\"\n\n\"They're not gonna check you. \\[translator error\\]'s honor.\"\n\n\"Okay. But you had better make it worth my while.\"\n\n\"You have my word. I'll do what I can to repay you. Put this on.\"\n\nShe flogs me the same type of clothing she has. A skintight body suit with armor plating and a fur collar. She handed me a scrunchy that had clearly been retrieved from the side of the road somewhere. I quickly disrobe behind some cover and change into the weird alien suit and do my hair up. \n\nThe alien washes my eyeliner and mascara off. Her eyes sparkled after she was done. I know that look. \"*Cute*\" I bet she thought. Never mind, though. I guess it's time to get into a transport and head off to meet the alien's parents. \n\nWe didn't go immediately. Apparently the alien needed evidence to show off to her parents. We'd be making for the whole parental meet'n'greet in a couple days. Over the course of the next day and a half, she took me to an alien theme park, a stargazing tour which was really a bunch of trips to other planets to look at local cultures' constellations, and two very nice dinner dates. All the while she lied via her social media that I was the one that took her to all these things. \n\nThe alien theme park is the most interesting theme park I've probably ever been to. Instead of rollercoasters there were Momentum Runs. You become basically an Oozoid from DND and you slip and slide around a very slick pipe. The feeling is unlike anything I've ever witnessed. Instead of bumper cars you have what the theme park called Zap-Your-Friends, which is just a UFO ride where you pilot your own open cockpit UFO and shoot your friends with nonlethal static shock levels of electricity. Probably 500 volt three nanosecond pulses. They also have food from all over the universe for you to enjoy. You're scanned and food from their stock that you can eat illuminates on a picture menu. Point to it, pay in the equivalent of whatever currency you have and enjoy. There are a few arcade games, some from Earth, most from everywhere in the galaxy, and there are even some conventional Earth carnival rides. \n\nThe stargazing tour took us to so many planets. The local people spoke through more universal translators about the cultural significance of their constellations. I couldn't help but draw on the similarities. We immortalized gods and warriors in the heavens. So too did so many other civilizations. On one of the planets, we were asked if anyone was from Earth. Only I raised my hand. I was greeted in English by the tourguide. A hunched over, saurian, four legged and four armed warrior type creature about twice the height of a grizzly bear on its hind legs beckoned me over and groveled at my feet. It is a Silvalek. This member of a warrior race, as well as the rest of his entire race, apparently worship humans as gods. Beats me as to why. Thankfully I didn't stay around long. \n\nThe dinner dates were honestly some of the best I ever went to. All my food was delicious, even if the alien fare looked absolutely awful. Turns out the alien I'm with is a carnivore. Some of the meat she was eating looked a lot like vegetables, or what I could assume was a vegetable. We went to the home of the Silvalek for one of the dinner dates. At this point, the alien was just trying to mess with me. Even the Silvalek king King Throk came and bid me homage. Literally hundreds lined up outside to fall to their four knees in worship. Silvalek are also carnivores and their staple food is, in Human language, Irik. Irik are chihuahua sized lizard cats that the Silvalek keep as a \"staple crop.\" They taste... Like a weird mix of pork and chicken. Despite the fattiness of some of the cuts, the meat tastes very good. I felt really invigorated after eating it. Must be packed with nutrients and energy. Enough to supply a two-ton silvalek warrior. \n\n\\[1/2\\]"}, {"comment_author": "Scorppio500", "comment_text": "\\[2/2\\]\n\nAfter our dates, and a good night rest, it is finally time to meet the parents of the alien. Throughout all this, she had never given me her name. So while we were en-route to her parents' house, I asked her. \n\nShe looks at me with those beautiful amethyst eyes and says her name. \"Amethyst.\" I smiled in relief. It's not something I can't pronounce. \n\n\"I don't believe I caught your name,\" she says. \n\n\"Oh, right. I'm Emily. But just call me Emile. At least... until we're clear of your parents.\" I smile sheepishly. Really should've introduced myself early on. Awkward. We both end up smiling awkwardly. \n\n\"Okay, Emile, I'm sure my parents will love you!\" Amethyst giggles a bit. God, she's so pretty. \n\nOur little transport docks at a big alien starport. Giant bugfolk check us in for disembarking and come aboard to do a security sweep. Finding a me, a human, they say something to Amethyst in their bugspeak which my translator has a hard time deciphering, but the gist of it was that I need a pressure suit. The bugs exit the airlock and return with a measuring device. They scan me with it, and the space suit they brought in seems to change in size to match my size. I quickly put it on over my clothes. \n\nAmethyst doesn't need a pressure suit. Just a breathing mask. Apparently the reason for all this is because the docking bays area is all depressurized due to a malfunction in the airlocks. Some meddling Lombax accidentally blew the hyperbolic rayshield stabilizers trying to make it function better. At least they tried. I noticed the bugfolk didn't seem to need pressure suits. I guess their exoskeleton and tubes on their tubercles were all they needed. \n\nI was helped along by a bugfok, whose species I learned to be a Hektar, to walk across the low gravity section into the artificial gravity field. It was much easier to walk after that. \n\nThe meeting itself? I had been dreading it for some time. Turns out, it was totally fine. Amethyst's parents are really cool and they knew enough about humans to scare me into thinking the entire ruse would be for naught. But turns out, the ruse did in fact work. Her parents approved of me and we finally got to go back to Earth. \n\nUnfortunately upon departing from the place, Amethyst gets a text message on her comm unit. \"Make sure to bring Emile back with you sometime next week! We want to have him over for dinner! Get to know him a bit better!\" Amethyst looks at me with an \"oh shit\" look in her six beautiful eyes. \n\n\"I guess,\" Amethyst says \"You're going to have to keep doing this for awhile, eh?\"\n\nI look at her and smile. \"If you bring me to places like you've been doing, sure. But why not come spend time on earth? I'd be happy to have the company.\" \n\nAmethyst looked at me joyfully. That smile could light up a city. \"Really? You'd do it? Oh thank you! My parents can be the worst!\"\n\n\"No, really,\" I said, \"I'd enjoy it very much. You're kinder than most humans I've met, and not gonna lie, you're gorgeous. I'm happy just to be around you.\"\n\nWas it impulse? Maybe it was. But as soon as I stopped talking, Amethyst kissed me. On the lips. \"Sorry,\" she said after our lips parted. \"I don't know what I was thinking. I shouldn't have done that just now.\"\n\n\"Why?\" I said. \"It felt nice. You should do that more often.\"\n\nAnd she did. More than a couple times. I stepped foot on earth covered in purple lip marks, and I had the biggest smile on my face. No one will believe me, but that doesn't matter. I guess I've got an alien girlfriend."}, {"comment_author": "brokeanail", "comment_text": "Left me with a smile. This is cute!"}, {"comment_author": "KoolingKatie", "comment_text": "This made me smile as well, it was so cute. Great writing, the imagery and descriptions are on point, and the world building was super cool! I especially enjoyed how you describe the theme park and its attractions, I could picture them easily from your vivid descriptions and they were cool concepts to imagine. Great story!"}, {"comment_author": "Kflynn1337", "comment_text": "Ok, that's cute! Well written world(s) building as well."}, {"comment_author": "Scorppio500", "comment_text": "Glad I could make you smile! :)"}, {"comment_author": "Scorppio500", "comment_text": "Glad I could make you smile! I enjoy trying to be descriptive. Glad you enjoyed it!"}]}, {"post_title": "[WP] \"Noble monster hunter! Thank goodness you're here! We've had to sacrifice a villager to this werewolf each month to keep it at bay!\" \"That is quite possibly the worst course of action your village could take.\"", "post_url": "https://www.reddit.com/r/WritingPrompts/comments/1bychjv/wp_noble_monster_hunter_thank_goodness_youre_here/", "post_main_text": "", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n>* [No AI-generated responses &#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n>* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n>* Responses don't have to fulfill every detail\n>* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22&restrict_sr=on&sort=new&t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22&restrict_sr=on&sort=new&t=all) for stricter titles\n>* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n&#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n&#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n&#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n&#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*"}, {"comment_author": "The-Name-is-my-Name", "comment_text": "No, the worst option would’ve been sacrificing *two* villagers to the monster each month.\n\nThat was the original plan."}, {"comment_author": "y_so_sirious", "comment_text": "why not three?"}, {"comment_author": "NeoconCry", "comment_text": "Yes, throw Todd in there too. No one likes him, anyway."}, {"comment_author": "ALonleyCat", "comment_text": "Sir Lang continued, \"I came here with the impression I'd have to handle a single werewolf. Easy enough at that point. Give them options for less disruptive hunting grounds, and have a slivered sword if it gets ugly. But now I have to face at least a pair!\"\n\nThe peasant protested, \"What do you mean a pair? Surely each of those 8 outcasts were satisfactory morsels.\"\n\nThe long traveled knight hung his head low, and said, \"Not morsels, not snacks. You have given this werewolf 8 pack members.\"\n\nThis peasant turned away, frozen by a sudden dread, \"But, it was meant to eat them... so that it would keep it's eyes away from the village...\"\n\nLang turned the boy back to him, and fully explained the predicament. \"That werewolf did not kill a single one of your 'sacrifices'. The werewolf most likely convinced each of them, in their despair from being betrayed by humanity, to be turned. I'll still confront them. But if this pack cannot be convinced to move, I can only order an evacuation of the town.\"\n\nPart 2 later"}, {"comment_author": "ALonleyCat", "comment_text": "Part 2...\n\nA few nights later, the full moon was rising over the trees. Sir Lang looked over and saw this month's sacrifice. A young woman, thin and frail as the queen's glass forks. Clearly another whom the village didn't care for. \n\nLang went back to his armor. Gleaming steel adorned in silver crosses. His longsword was similarly adorned. Sir Lang finished his preparations and declared to the gathering of villagers, \"I will escort this months... sacrifice... to the den of these werewolves (Lang made sure it was abundantly clear that he meant plural). Be ready to evacuate if you see any come.\"\n\nAn older man, seemingly the father of the boy Lang spoke with upon arrival, called out, \"There's only one werewolf! And it will be satiated again with my plan!\"\n\nSir Lang finally snapped, \"Your flash of genius gave us a pack of NINE to deal with! I'm sure when I go off to kill my next vampire, you would wisely advise I hand him the stake to drive through *my* heart. You have clearly spoken enough on this issue.\"\n\nThe old man fell silent, but still glared at Sir Lang, who took the hand of this sacrificial woman and led her into the forest.\n\nThe moment they were out of sight of the village, Sir Lang found a branch of white berries and held it high above his head as they continued. \"So, what got you sacrificed?\" Sir Lang asked.\n\n\"I asked my parents to let me leave. I said I wanted to be free of this village. They hadn't cared for me... no one did. But they took that as me wanting to be fed to a werewolf.\" The woman said as they trudged through the thickening bushes.\n\n\"Well, the good news is that you do have options.\" Sir Land continued, \"you no doubt heard me explain, in less than elegant terms, that this werewolf is likely turning each sacrifice. So you could very well join the pack. I'm not to judge. Alternatively, I could name you a squire. It's decent pay, and you don't need any family titles when you have sponsorship. My father was a sponsored squire after he helped save the first session of parliament from an insurrection. I could also drop you off at any number of towns with my gold purse to do as you wish.\"\n\nThe moon reflected in the woman's eyes as she replied, \"Thank you. I'm still in disbelief that werewolves are so...\" She looked outwards into the forest, meeting the gaze of two yellow eyes in the brush, which moved forward and revealed their owner. A large werewolf with fur like the ash of a campfire.\n\nThe werewolf spoke, \"Ah! Another tasty sacrifice. On a silver platter too!\" The woman gasped, but Sir Lang stood still.\n\n\"The jig is up. I know your pack of outcasts is nearby. I only want to talk. And perhaps you can make your number ten tonight.\"\n\nThey werewolf made a brief howl, and seven more pairs of piercing yellow eyes emerged from the forest. \"Eight. Two didn't make it in the cold before we could find them. And I don't want to raid the village.\"\n\nSir Land replied, \"I know that. But it's still advisable if you and your pack came with me. The current parliament is very generous to many manner of cryptids. If you cooperate, you are guaranteed a generous domain of protected wilderness.\"\n\n\"Tempting,\" The werewolf admitted, \"But I like this area. The village kicks out all the people with the best traits to be in a werewolf pack. It's a good place to grow this family.\"\n\n\"How about one more and you move south?\" The woman spoke up, \"I'll let you turn me. The southern valley was over-grazed after the last of the regular wolves were hunted down. The village kinda needs you now.\"\n\n\"Careful, that's a hard demand I'd have to make of the local lord. And he is known to but heads with the new parliament.\" Sir Lang warned, \"But I suppose the parliament can reassign the county to a different family.\"\n\n\"I'll agree to this. Welcome.\" The werewolf sits down, \"I hope we can be a better family than those humans in the village.\""}, {"comment_author": "Mr-Pugglesworth", "comment_text": "Oh, this. I LIKE this. Well done"}, {"comment_author": "fluffykerfuffle3", "comment_text": "very much fun to read.. thanks!!"}, {"comment_author": "SamuelVimesTrained", "comment_text": "Very good.  \nNow this looks like the start - and a promising one - of a very nice novel.."}, {"comment_author": "NeoconCry", "comment_text": "I loved how reasonable everyone is. Well, the knight and the werewolves at least, not the village head."}, {"comment_author": "ALonleyCat", "comment_text": "Thank you!"}, {"comment_author": "Runecaster91", "comment_text": "\"Werewolves, when not human, are just like any other beast. Records in my order have even shown some can train their wolf self for work, usually as guards.\"\n\n\"What YOU have done is teach a WILD ANIMAL where the easy food is! It will keep coming back, and if food isn't there when it is hungry it will come to the village directly! You haven't been sacrificing anyone, you've been murdering them and trying to blame the werewolf.\" The monster hunter started for a moment, then grabbed the mayor by their throat. \n\n\"Guess you get to be the bait now, Mayor. Better hope I can catch it before it catches you...\""}, {"comment_author": "Realistic_Badger_708", "comment_text": "Mayor Wood stood from his desk and shook Nicole’s hand. His office, like his suit, was a mess. “Noble monster hunter! Thank goodness you’re here! We’ve had to sacrifice a villager to this werewolf each month to keep it at bay!” \r  \n\r  \nThat explained everything. Pulling her hand back, Nicole held the bridge of her nose. “That is quite possibly the worst course of action your village could take.”\r  \n\r  \nMayor Wood tilted his head. “I don’t see how. The werewolf hasn’t been attacking my village in months.” He lowered his voice. “Though, we are running out of volunteers.”\r  \n\r  \nNicole snorted. “Volunteers? They’re the least of your concerns. Your area has a pack of four or five werewolves.”\r  \n\r  \n“Five?” Mayor Wood shook his head. “Impossible, there should be only one.”\r  \n\r  \nThis was worse than she thought. “There’s definitely a pack, Mayor. And these sacrifices… they’re not appeasing them, they’re attracting them. Werewolves are territorial creatures. The stronger the pack gets, the bigger game they’ll hunt.” She leaned closer. “Soon, one sacrifice ain’t going to cut it.”\r  \n\r  \nThe Mayor’s face paled. “So what do we do? We can’t fight five werewolves!”\r  \n\r  \nNicole leaned back in her chair, a steely look in her eye. “We don’t have to. We’ll fight smarter, not harder. First, stop the sacrifices immediately. It will take time for the new scent to wear off, but starving them will weaken them.”\r  \n\r  \nHowever, Mayor Wood shook his head. “We can’t do that. The werewolf must know where we live. And with a potential pack…” His eyes widened at the thought. “Surely, we can continue the sacrifices. I mean, it’s been six months since a werewolf was in town.”\r  \n\r  \nHer patience was running thin. This Mayor was proving more trouble than the werewolves themselves.\r  \n\r  \nNicole slammed her hand on the desk, scattering papers across the cluttered surface. “Six months because they’ve been feasting on your offerings! Don’t you understand? The larger the pack, the boulder they’ll become! If you continue, the next sacrifice won’t be a volunteer, it’ll be your own daughter walking home from school!”\r  \n\r  \nThe Mayor’s hand trembled as he picked up the discarded papers. “But what else can we do? You say we can’t fight them, and we can’t do offerings…”\r  \n\r  \n“Oh, we’ll do one \\*last\\* offering, Mayor, while we still have the element of surprise.” Nicole gave a knowing smile. She'll have to develop a team quickly in order for this plan to work. “You’re going to tell the big bad wolves that dinner has been permanently canceled.”"}, {"comment_author": "Realistic_Badger_708", "comment_text": "Later that night...\r  \n\r  \nMayor Wood stood nervously next to the offering. The “offering” was a heavily sedated boar dripping with wolfsbane. It laid on a stump in the usual clearing. “You can do this,” the Mayor whispered to himself. “They’re just hungry, ravenous monsters that would tear me to pieces in seconds.”\r  \n\r  \nA twig snapped ahead of him. \r  \n\r  \nMayor Wood froze, every muscle tense. He squeezed his eyes shut, picturing himself being anywhere but here. A low growl rumbled through the dark woods, sending a shiver down his spine. He dared to peek open one eye.\r  \n\r  \nTwo sets of glowing eyes, emerald green and piercing, materialized from the shadows, followed by another three pairs. A pack. Just like Nicole said. Fear threatened to paralyze him, but the image of his daughter, Sarah, flashed in his mind. This was for her, for the village.\r  \n\r  \nThe lead werewolf, a hulking creature with fur the color of midnight, sniffed the air. Its attention was drawn to the boar, then to the Mayor. It was not happy. The lead let out a low growl, beckoning the others to follow. \r  \n\r  \nMayor Wood chuckled. “Hey, I’m sure one of you remembers me. I’m the Mayor who had the wonderful idea to give you offerings to leave my village alone.” He gulped as they drew near. “I didn’t think you would get yourself a pack.”\r  \n\r  \nThe lead werewolf, its enormous head lowered, regarded the Mayor with an icy stare. “You dare to insult us with this ‘offering’?” it whispered. “This is not what we agreed to.”\r  \n\r  \nSuddenly, a loud CRACK shattered through the air.\r  \n\r  \nOne of the werewolves fell to the ground as it reverted back into its human form. Before the other werewolves could react, Nicole and several of her monster hunter friends emerged from the woods with guns.\r  \n\r  \n“Oh thank heavens!” Mayor Wood cried out. He tried to run toward Nicole but the lead werewolf cut his path, its mouth salivating.\r  \n\r  \n“Don’t thank me yet, Mayor.” Nicole pointed her gun at the lead werewolf. She and her group needed to be careful. These werewolves can move faster than their trigger fingers. Her eyes stared at the lead werewolf. “Hey, mutt!”\r  \n\r  \nThe lead glared at Nicole before relaxing. “A deal is a deal.”\r  \n\r  \nMayor Wood’s head tilted. “What deal?”\r  \n\r  \nNicole scoffed. “Funny, almost everyone in the village said the same thing.” She motioned the other hunters to lower their weapons. “Only a select few knew about your disgusting arrangement with the werewolves.”\r  \n\r  \nAny color that was on Wood’s face drained away as the other werewolves circled him. As the werewolves took the screaming mayor deep into the woods, the lead looked back at Nicole. “We’ll leave the village alone… for now.”\r  \n\r  \nShe nodded. “We’ll be waiting.”"}, {"comment_author": "Beautiful_Business10", "comment_text": "I'm transcribing he events of the day into my journal and finally getting to...*\"enjoy\"*...my meal of slightly warmed beef flank with cut but unseasoned potatoes and carrots in a broth that barely amounts to water with some minor fat runoff, when the Ealdorman finally deigns to show up in the tavern.\n\n\nHe doesn't have to look hard to find me: the tall, pale woman with a dark silken cascade of hair and aristocratic features, wearing a long, deep red coat closed in the front with a high collar and pauldrons reminiscent of skull effigies.\n\n\n\"My humble apologies, my lady,\" he announces obsequious from under a wide, brushlike beard. \"I was delayed indefinitely in the courthouse this morning, attending to matters of governance.\"\n\n\n\"That is demonstrably untrue, Ealdorman,\" I reply with a long stroke of my quill pen on the page. I still haven't looked up at the man. \"Had it actually been an 'indefinite' delay, you would not be here now.\"\n\n\nI place the quill down beside the tome and reach to stopper my inkwell before beckoning the frazzled and now-slightly-offput official to sit next to me.\n\n\n\"Tell me of your wolf problem.\"\n\n\n\"We had left a sacrifice for the wolf each full moon; but rather than decreasing, attacks have increased!\"\n\n[TBC b/c it's bedtime for bb10 here...)"}, {"comment_author": "zacausa", "comment_text": "The Village Elder looked at me shocked, along with his entourage of once elated assistants. \"I-I beg your pardon?\"\n\n\"The sacrifice thing. How long have you guys been sacrificing villagers to the beast?\" I gave the Elder a deadpan stare. It was always the same thing when it came to cases like this.\n\n\"A-about t-two years?\" One of the villagers spoke up after a moment, a look of confusion on their face as they pondered the meaning of my words. \"But if we didn't, the beast would have rampaged through the streets, killing as many as it wished.\"\n\n\"It's one beast.\" I reply shortly as I pinched the bridge of my nose. \"Likely one of your own to boot. Though now It could be as many as two dozen or so.\"\n\n\"T-TWO DOZEN?\" The Elder seemed close to feinting, their old heart straining to handle the news.\n\n\"Yeah. Likely less if they actually decided to feed on your sacrificial lambs. Humans already bond with each other and our canine companions as it is, imagine that instinct growing tenfold. I imagine they've got at least a companion or two at this point, maybe even a mate if you weren't picky when you drew straws.\" I explain, doing some mental math in the back of my head as I spoke. \"That makes things more complicated. The threat of death just got a lot higher, and that means two things.\"\n\nThe villager who answered earlier speaks up again, leading me to wonder if he was just there for show, \"What does it mean?\"\n\n\"First, I'm going to need as many silver coins, platters, or other baubles as you can gather, some good leather strips, and don't expect much if any of that back. Secondly, if I do find more than just the one werewolf, you owe me the same bounty for each head I bring back, the silver not included.\" The villagers all paled when they considered the cost and before they could object I explained my thoughts. \"If it were simply one beast, I could take it down without much worry for my life. I've dealt with their kind before. However now that there's a good potential that there's a whole pack of them, i have to worry about being attacked from all angles even when engaged with the original. Silver armor isn't exactly cheap, or practical to fight much other than a few select monsters, so I'll have to improvise with whatever you have. Likely to get torn off of me in the fight to come.\" I shrug. \"Once I deal with them you could go looking to recover it, but digging through the dirt for coins isn't the job, especially since I'm coming out of this with a few scars.\" \n\n\"We don't have that much money to just give up as a reward, let alone giving up the silver! Please kind hunter, could you see it in your heart to do us a charity?\" Asked one of the fairer of the villagers in their leader's stead, who seemed to be having a rather rough time coming to grips with my terms. She clasped her hands together and offered the a desperate smile. \n\n\"I don't work for charity Miss. I kill monster's for a living, I'll need another form of payment. Good will doesn't fill my belly, mend my gear, or replace my supplies.\" I shake my head. This isn't the first time someone has tried to haggle with me, and it won't be the last. But at least they haven't promised the world and then tried to kill me to get out of paying their due. \"I may kill monsters, but I'm not a monster myself. How about this, I'll do the deed, and my original price still stands, but we can spread out the payments. One on return, and then let's say another payment every month for as many months as I bring back heads. Unless you have something else of value in town to trade.\"\n\nThe whole room began to murmur amongst themselves, some contemplating if it was worth the cost, others wondering if they had an heirloom that could suffice as payment. After the crowd murmured for a decent amount of time, I thought now would be a good time to mention. \"By the way, did you guys know that Monster Hunter services are a major deductible on your taxes as a village? All the money that you're paying me is coming from the crown's pocket if there's more than one werewolf.\"\n\nThe tension suddenly disappeared in the room, and they were much more amenable after that, and a month later I was recovering well from my injuries, a proper suit of silver mail hung in my armory, and I still had enough gold to last me a couple more summers."}, {"comment_author": "Still_Price_9676", "comment_text": "My blood ran cold upon hearing this statement. I asked him how long he’s been doing this, he responded with “oh it’s been a couple years.” I froze, that much food and it could’ve raised a family, maybe even inside the village. I looked around and to my dismay everyone was staring at me expectantly. I asked him how often he fed them and he said “once a month.” That’s horrible, absolutely horrible, for all I know I could be talking to one rn, this entire village could be comprised of werewolves. This made worse because everyone in this village is a farmer and they all have cattle. The one thing I know about werewolves is they love pattern so I asked the chief where he meets the wolf, I was told the entrance of the village. I decided that my best course of action was to stay at their overnight inn, I put my sword right by my bedside and I shut off the lamp. *Crack* I woke up in a startle and turned on my lamp. There it was, 7 foot, black fur, large claws, piercing gaze, large ears, and a very muscular build. Weird thing was it had a familiar smell, the smell of the village. I drew my sword and I assumed my stance, I got a few scratches but it’s dead. I decided to look outside the inn to make sure the village was alright and I was met with a grim sight. A group of 7 werewolves were a half mile out from my position, standing right at the entrance. The chief offered up multiple people for the wolves to take. I thought it would be better to deal with this in the morning, I was too tired for this. I awoke to pure silence, there wasn’t the usual breakfast commotion of a place like this, just pin drop silence. I grabbed my sword and stepped out of my room. I couldn’t believe my eyes, the innkeeper was gone and the inn was empty, I went behind his desk to search for signs and it smelled exactly like the wolf I just killed, I was right. It’s in the village. I had to tell the chief so I went out of the building to tell him but before I could say anything he came up to me smiling “I know where they are, I found them” he said, skeptical of this because of last night, I asked him to lead me there. Wrong choice of words, we set out towards a nearby forest and while on the way I told him about the innkeeper. He looked deeply saddened by the news, I should’ve seen the red flags. We started to approach a cave but suddenly I heard a whistle behind me. I drew my sword and turned around out of fear, seven of them. I look at the chief to make sure he’ll be alright, eight of them. Kill or be killed."}, {"comment_author": "Still_Going34", "comment_text": "The chief, grey-haired, dark-eyed, and sporting a salt and pepper beard that curls at his waist, stares at you blankly, mouth open, as if you said something surprising.\n\n*Perhaps to the members of this provincial town, it is.*\n\nKaal, bless his black heart, very obviously trying to keep his morbid amusement at bay, and failing as dark chuckles spill through his fingers. There is some commotion from the crowd of villagers at his reaction but that too was quickly quelled once they met his mismatched eyes. Your motley group dominates the tiny public square, and you travel with four other hunters; Kaal, the career necromancer, the demon twins Avi and Rain, and the berserker Cassandra.\n\nThe village isn't a large one, just a few wooden houses that might have made better kindling than shelter, and a singular merchant's guild with a red painted 'CLOSED' plaque on its door. It was no surprise that any monster hunter worth a bit of salt hadn't come to address the issue, but still, you couldn't bring yourself to denigrate the old man further for his decisions. The chief continued to splutter uselessly, red-faced and perhaps a bit tearful, a sore sight for anyone with a bit of heart. You hold up a placating hand and stare pointedly at the slightly larger hovel he'd emerged from, \"We'd like to learn a bit more about the monsters that plague you--and the...victims, may we?\"\n\n\\--\n\n\"Truly, my friend, you are fucked,\" Cassandra says to the resident baker. The man is downtrodden, having gone through the high of his daughter, Lily, (possibly) being alive quickly followed by the crash of discovering that Lily was very likely a werewolf now and he would more than likely be her very first target.\n\nThe surrounding group of residents were in low spirits, all having learned the consequences of their decisions. Their sacrificial habits hadn't placated the infected werewolf hoard, it had grown it.\n\nThe bonfires they'd been instructed to burn at each corner of the village cast a warm light in contrast to the conflicting emotions that permeate the atmosphere. The trees cast long shadows and faintly, Cassandra hears a howl in the distance and opts to keep that information to herself...for now.\n\nKaal chants quietly under his breath, tying talismans made of sage and slivers of pure silver to the trembling necks of the victims' family members. Others shuffle about uncomfortably.\n\n\"Six months, they've been brewing for so long--\" said Avi, her voice low and calm. \"--longer than usual. How has this entire town not been infected?\" Finishes Rain, he drums his fingers against the shack they are leaning against.\n\nYou settle next to the two, you just finished talking to some farmers who've futilely armed themselves with hoes and scythes. You let the shadows of the building wash over you as you contemplate the strange circumstances you found yourselves in.\n\n*The town was on the map.*\n\nNo matter how inefficient the empire is, it took special care and gave extra funding to the officials in charge of cartography, the census, and especially to the Heralds. It was crucial to keep track of the population to keep track of those infected (The robust Department of Taxation simply ended up being a convenient byproduct for the imperial family).\n\n*There was a merchant guild.*\n\nAlbeit closed, and didn’t that ring alarm bells?\n\n*It has been at least six months since a Herald had come through*.\n\nThe records provided by the fief lord indicated regular visitation by one. The last recorded only a month and a half ago. A Herald should be running through a town every month to keep the public up to date on the latest protocols regarding Infection.\n\n*So where was the Herald?*\n\nGeoff Adler was the last Herald recorded, and according to his route, should be in the Corin Duchy to relay any findings by now. But the Chief had said none had come through matching his description.\n\n“Oh, Shit!” Your reverie is broken by a loud curse, the dying light of the setting sun illuminates the now convulsing bodies of those who’d sacrificed their family members to the wolves. You sprint towards Kaal and pull him away from the villagers beginning to claw at his tattooed arms. With a dagger in hand, you back toward the bonfire as without Kaal to cling to, they begin to contort and claw at one another. The scent of blood fills the air, it coats your throat.\n\n*Your fangs threaten to emerge.*\n\n“By the Jewels.” You hear Cassandra curse, she’s plowed through the lurching villagers to stand by the two of you near the towering flames. The flickering shadow beneath your feet curls and the twins sprout from them, their eyes red and their claws sharpened.\n\nKaal gasps, he leans forward, supporting himself with a hand on your shoulder. He shakes his head at your concerned glance, instead, he looks toward the mayhem taking place. You follow his line of sight and notice…*not a single villager has been spared.*\n\nThe old chief lies bloodied in a fetal position nearby.\n\nThese creatures shy away from the bonfires Kaal enchanted. Some tear at their faces, others gnaw on the severed limbs of the fallen. From here, you can see smatterings of bloodied bone litter the ground. In a few moments, the village transformed into a hell on earth.\n\n“This isn’t normal infection--“ whispers Rain, he’s in a defensive position, crouched low to the ground, Avi curls next to him, she's trembling ever so slightly.\n\n“No…it’s worse,” Kaal says through heavy breaths.\n\nAnd then...you hear the howls."}]}, {"post_title": "[WP]Your are your normal, boring self. Today, however, you've been abducted by the government to interrogate a super villain from another dimension - Yourself!", "post_url": "https://www.reddit.com/r/WritingPrompts/comments/1bypvtp/wpyour_are_your_normal_boring_self_today_however/", "post_main_text": "", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n>* [No AI-generated responses &#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n>* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n>* Responses don't have to fulfill every detail\n>* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22&restrict_sr=on&sort=new&t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22&restrict_sr=on&sort=new&t=all) for stricter titles\n>* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n&#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n&#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n&#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n&#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*"}, {"comment_author": "Fenix_Glo", "comment_text": "Agent Marks had given me the information on the long plane ride to the compound. Bullshit, bullshit, bullshit. I wasn’t even listening. My nose was broken. My ears were ringing. My body was aching.       \n\nThey had been waiting for me after work. They approached me like goons. When they asked me to get in their van things got messy. I popped one of them. And … that’s the last thing I remember until I woke up zip-tied on the plane.     \n\nSomething, something, something identity theft mumbo jumbo. Who the fvck cared? I wanted to go home like I did every night to have a couple of beers, watch some TV, jerk off and go to sleep.      \n\nI was sick of listening to Agent Mulder or whomever the fvck and I did like I did back in high school. I just tuned out.     \n\nWhen we arrived at the compound Roscoe P. Coltrane and Boss Hog took me to some medical place. They took my fingerprints. They got blood samples. They made me piss. They did a dental X-ray. They did a retinal scan.        \n\nI was holed up in some kind of solitary pod for two days while they ran my medical tests. The food was good but the damn lunch lady refused to give me a couple pints.       \n\nSome more goons came in the room and they shackled me. They took me to an interrogation room. It was like in the cop movies except there was a plexiglass barrier which cut the room in half.      \n\nI sat there sullenly when a door opened on the other side of the transparent wall. Some more goons walked in and to my surprise they were escorting a person who could have been my twin.      \n\nHe grinned at me. They put him in a seat which faced me. They cuffed his hands behind his back. They cuffed his ankle to the legs of the chair. Then they left us both alone in the partitioned room.      \n\nHe was better looking than I was. No belly and he had a full head of hair. Aside from the bandage on my face and other minor details I could have been looking in a mirror.         \n\nAgent whoever the fvck came in my section of the chamber. He closed the door behind him.     \n\nI asked, “What is this? I didn’t do anything.”     \n\nAgent Marks spoke seriously. “We have an anomaly. This other person is … you. Medical records have confirmed it.”      \n\n“That doesn’t make a lick of sense!” I exclaimed. “What about the finger prints?”      \n\n“Everything,” replied the agent. “We need you to ask … yourself questions to which only you know the answers. Can you do that?”       \n\nI was upset. “I’m going to lose my job to play a game of twenty questions with this phony? This doesn’t make any sense.”      \n\nAgent Marks said, “Your employment is secure. Your rent is secure. Your compliance would be much appreciated.”       \n\n“He … that dude … is obviously not me, numb nuts. I am me. Dude over there is not me. That’s just common sense!”        \n\nAgent Marks said, “Well, forensics have said that he is you. Given the various crimes which INTERPOL has detained him for it would be in your best interest to co-operate with us.”       \n\nI shook my head angrily. “Yeah whatever. What do I need to do?”       \n\n“Ask him something only you know.”       \n\nI scoffed. “Then I can go home? This will be easy.”      \n\nI asked the phony, “What’s the kissy thing?”        \n\nThe imposter grinned again. “It’s the mole underneath Faye’s left tit.”      \n\nMy heart surged with adrenaline. Agent Marks was reading my reaction.        \n\nI asked the phony, “Who is the voice?”        \n\n“I don’t know,” he admitted. “Sometimes I think it’s grandpa. Sometimes I think it’s the devil himself. It changes.”      \n\nI looked at Agent Marks with pure terror on my face."}, {"comment_author": "Scorppio500", "comment_text": "I went to sleep in my bed. Then I awaken... in a very nicely furnished jail cell? What is this, the SCP foundation? \n\nTurns out I'd be closer to the correct answer than I thought. This is a cell in the USP Florence ADMAX facility. Says so on the wall. The supermax prison not too far from the city I live in. I feel like garbage. I must've been chloroformed or something. \n\nI don't remember coming here at all. I was still in my sexy lingerie my boyfriend got me and my kitty ears and tie-on tail. I'll bet carrying me while I was unconscious wearing this was awkward. I sent up a silent prayer the agents that took me here weren't weirded out. I might've also got really drunk last night, so on top of the chloroforming or other sedation method, the ick feeling was compounded by my clearly hungover state. I saw some mismatched clothing with the tags still on them sitting in the bunk across from the sofa I was laying on. I put those on. \n\nThere is a button on the wall with a note that says \"When you're up and dressed, press this. We'll bring you a coffee and some warm breakfast.\" The wire ran through the window to the veritable blast door which was removed so it could be run. I laced on the standard prison shoes and pressed the button. \n\nTwo armed security guards appeared at my door. One has a coffee in his hand, the other has a quite nice looking breakfast under a clear cloche carefully positioned under her arm. She asks me to unhook the button, shove it through the window, and pull the door to my left. I do as instructed and exit the cell. \n\nI'm led to an interrogation room and the guards let me eat my breakfast. \"Here,\" says the female guard. \"I've got some splenda for ya too.\" I take it gratefully and wash my breakfast down with the coffee. I feel better already. I finish and the guards take my tray and mug and dispose of them for me. It's only then that a suited man comes in. \n\n\"Miss Clearwater, I suppose you're wondering why you're here.\"\n\nI sit up straighter. This man sounds authoritative. \"Yes sir. I'd complain but you DID just feed me.\"\n\nThe man cracks what might be a rare smile on his frown lined face. \"Indeed. The circumstances are strange. But the person we aim to interrogate requested you and only you. Now I know that face. Why? I'll tell you. She looks exactly the same as you do and is allegedly you from another dimension.\"\n\nI'm dumbfounded. I don't know what to really respond with. The suited man continues. \"Just be warned, Miss Clearwater. She is very clever.\"\n\n\"Fantastic,\" I said. I'm in no way clever at all. \"I guess bring her in.\"\n\nThe man nods and walks outside. He taps a button on an intercom and goes into the observation room. The door opposite the one I came in and the man left out of opens. Out walks my doppelganger. Her eyes are aglow with a purple light and her hair shimmers with purple energy. \n\n\"Hello... Rhea Clearwater,\" the doppelganger says. \"Ask me who I am.\"\n\n\"Okay, uh... who are you?\"\n\n\"My name is also Rhea Clearwater. But where I'm from, I'm called The Night Witch.\" Her aura sparkled sickly purple sparks. \"I rule my dimension. And I shall rule here as well.\"\n\n\"Why?\" You'd think I'd be scared, but I'm not. \"What reason is there for that? Why not just go back?\"\n\n\"Oh, my dear doppelganger. *I'm* not going to do it. *You* are.\" My doppelganger grins evilly as she says this. \n\n\"What do you mean by that?\"\n\n\"Oh, it's simple. I give you access to my abilities, you send me back to my home dimension, then the power corrupts you by its very nature, and you repeat the cycle. Soon the world will be yours!\"\n\n\"And if I aim to not take over the world?\"\n\n\"You will want to. With the power I shall give you, there is no righteous thought you can have that will sway you.\"\n\n\"You might be wrong, you know.\" I said this with confidence but my mind was a little fearful. I didn't show it. \n\nBut she sends a bolt of energy from her eyes at me. Energy courses through my body and... absorbs. My hair begins to glow like hers and my eyes begin to glow like hers as well. I feel like a god. I do what she asks, and send her back to her dimension.\n\nBut now I'm scared. Do I become what she said? No. I won't. This world has super heroes! I'll have them help me hone this. If I'm going to be the one to break the cycle, I had better learn to use my power before they corrupt me, if they corrupt me at all."}, {"comment_author": "Deansdiatribes", "comment_text": " only thing too short and too few  the power as a viral vector kewl"}]}, {"post_title": "[WP] You are the sole superhero without powers to have lived longer than ten years. An old friend with powers asks how.", "post_url": "https://www.reddit.com/r/WritingPrompts/comments/1bynzd6/wp_you_are_the_sole_superhero_without_powers_to/", "post_main_text": "", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n>* [No AI-generated responses &#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n>* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n>* Responses don't have to fulfill every detail\n>* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22&restrict_sr=on&sort=new&t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22&restrict_sr=on&sort=new&t=all) for stricter titles\n>* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n&#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n&#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n&#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n&#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*"}, {"comment_author": "musicalharmonica", "comment_text": "Metallica was having a bad day.\n\nWiping a trickle of blood from her mouth, she staggered to her feet, shielding her eyes against the iron behemoth currently crashing its way through First National Bank. Powerman and Revengetress were tiny figures circling far above, punching dents into robot's titanium shell.\n\nMetallica watched as a flip was switched, and the robot's body flared with electricity. \n\nPowerman and Revengetress fell twenty stories to the ground.\n\nShe froze. Those had been their heavy hitters -- the best Heroes of America had been able to offer. Compared to them, her powers were less than useless. She had metal skin. That was all, and she was *still* bleeding from the times the robot had been able to catch her.\n\nSweat dripped down the back of her supersuit. Cursing under her breath, she radioed for back up, using the *smash glass in case of emergency* frequency and ran.\n\nOr tried to, anyway. That's how it should've happened, but the second she shifted her weight to the ball of her foot, something huge and shiny and gray slammed into her.\n\nThe next thirty seconds were a haze of darkness and panic. Screams overhead. She tried not to think about how many people were dying around her, how much money the guy controlling this thing was probably going to get from killing innocents.\n\n*Jackass. Fucking...* Pain whited out her thoughts.\n\nMore blackness, and then --\n\nStunning light. Silence.\n\nShe blinked. \n\nBeetle, the only un-powered member of the Heroes of America, was extending to her an outstretched hand. She took it, wincing as he hoisted her to her feet.\n\n\"Are you...\" She was going to ask *Are you okay*, but there wasn't a scratch on him.\n\n\"Fine.\" He shrugged. \"Wasn't too hard of a fight.\"\n\nHe gestured over towards the smoking remains of what had once been a world-ending, hero-killing robot. Metallica gaped. \"But... but... *how*?\"\n\n\"Couple of heat-seeking missiles, courtesy of BeetleTech. Easy peasy.\"\n\n\"Easy-peasy,\" she repeated, weak. \"Right.\"\n\nShe bent over and threw up over a spot of cracked pavement. Beetle patted her back awkwardly until she was done.\n\nReeling -- the world spun -- she couldn't help but mumble, \"But you're powerless. How... How could you...\"\n\n\"How do you think I've survived all these years?\" He flashed her a sly grin. \"Money, man. Fuckin' money.\"\n\n----\n\n(obligatory Batman \"money is my superpower reference here)"}, {"comment_author": "Skyshock-Imperative", "comment_text": "YES. EVERYTHING ABOUT THIS. YES."}, {"comment_author": "freakytapir", "comment_text": "The smell of eggs fills your nostrils, your jean jacket tattered, your pants evenly so, the red diner seats slightly sticky, the morning sun peeking over the horizon.\n\nAcross from you sits a man wearing a cape, spandex digging into every crevace.\n\n\"So, how do you do it? I mean, ... As far as I know ...\"\n\n\"That's the problem with you supers, you think you know. It's easy really. By minding my own damned bussiness. I can't fly, shoot lasers or hulk out. I delegate. Look.\"\n\nYou slide over your phone.\n\n\"Is that just the number of every super in metroplis?\"\n\n\"Just about, yeah. You guys wouldn't know your elbow from your asshole without me. Now, I am packing.\" You slap a Magnum .45 on the table. \"But that's just self defence. Now, you want in?\"\n\n\"Want in?\" The man tugs at his cheap cape, stuck beneath his buttocks.\n\n\"Hey, if you're good at something never do it for free. I send the saved person a bill, hack the insurance company to make up some bullshit claim so they pay out, and you get your cut for doing the legwork. I get my cut for facilitating.\"\n\n\"Isn't that ... unethical?\"\n\n\"Getting a lead salad to the face tends to be a lot more expensive than a super stopping by for 5 seconds and kicking some ganster's ass. Now, as you're an old friend, you're getting a premium rate, but don't go telling the others, all right?\"\n\n\"Can I think about it?\"\n\nSirens sound outside, a gang dressed as clowns running down the streets.\n\n\"Looks like a job for ...\" The caped man starts to rise.\n\n\"Don't bother. Already texted someone to come fix this. Now, breakfast's on me, all right. Let me know if you want in\"\n\nYou leasurely stroll outside to get a good view of the situation, the gang soon standing frozen in their tracks, shivering."}]}, {"post_title": "[WP] You have been destined to go on a life changing quest since your birth. Thing is, you don't want to go on the quest.", "post_url": "https://www.reddit.com/r/WritingPrompts/comments/1byherp/wp_you_have_been_destined_to_go_on_a_life/", "post_main_text": "", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n>* [No AI-generated responses &#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n>* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n>* Responses don't have to fulfill every detail\n>* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22&restrict_sr=on&sort=new&t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22&restrict_sr=on&sort=new&t=all) for stricter titles\n>* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n&#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n&#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n&#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n&#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*"}, {"comment_author": "Ceris5", "comment_text": "Plot twist, the main character is forcefully enlisted in the space marine corps because of a contract their parents signed"}, {"comment_author": "mintleaftea", "comment_text": "|PART 1|\n\n\"MARCUS!\" \nJess grabbed my arm, yanking me out my thoughts and stopping me in my tracks, just as a truck rumbled by, honking its horn. I stepped back from the curb and exhaled. \n\n\"Marc, look, I'm sorry. I know these things keep you on edge but I thought it would be a bit of fun. I'm sorry.\" \n\nJess peeked up at me through her heavy fringe, as her face became bright with embarassment, still cradling the plastic battery powered gnome she pranked me with. \n\nI exhaled again and relaxed my shoulders.\n\n\"It's ok. I'm just- I'm just really tense.\"\n\n\"I know. You always get like this before your birthday.\" \n\nWe started slowly strolling with a few crispy leaves dancing along side us, in the breeze. Jess pulled her scarf up around her neck and ears.\n\n\"I wish I didn't. But it's always like this. Quiet the week or two before my birthday, and then on the day some grand, glittery, glowing, human adjacent... thing, decides to popup and monologue at me like... I don't care!!!!\"\n\n I threw my hands up to the sky.\n\n \"I never cared!!!!!! And I'm just worried 'cos I'm gonna be 21, it's a big year and they're gonna do something stupid! I can just feel it! It's giving me anxiety! I have anxiety over this shit. Do you remember my 16th birthday??\"\n\nJess tried to hide her laugh but glaring at her didn't help and she eventually started giggling. I huffed in annoyance and picked up the pace. \n\n\"Oh, Marc, don't be like that. I know it wasn't funny at the time but you have to laugh about it now. Even the Q.G.A sent an apology letter.\"\n\nI was trying to be mad but Jess' giggle always makes me laugh.\n\n\"You're right,\" I chuckled \" I was very traumatised by a half fish, half woman slimey thing climbing out the toilet WHILE I was using it\" We burst out laughing.\n\n\"Who knew opposite mermaids were a thing!!!!!\" Jess exclaimed, making us laugh harder.\n\n\"Did I tell you she had pubes?!\" Jess was leaning against a postbox laughing so hard she could barely breath and her laugh was keeping me laughing.\n\n \"Glittery, and scaley pubic hair, Jess!! I wish I was making this up!\" Jess nearly collapsed with laughter, I helped her off the postbox. \n\n\"C'mon, I wanna get this lecture over with!\" Jess's laugh subsided into a giggle and she leaned into me gently saying \"You got this Big Marc! I know you can handle them.\" \n\nJess was grinning up at me with so much confidence, but I could not mirror her smile. I had a horrible feeling about turning 21."}, {"comment_author": "mintleaftea", "comment_text": "|PART 2|\n\nBzzzzz\nBzzzzz\nBzzzzz\n\nI closed my eyes tighter, turned over and pulled my sheet up over my head.\n\nBzzzzz\nBzzzzz\nBzzzzz\n\nMy damn phone... it's probably Jess wanting to wish me Happy Birthday... I opened my eyes and reached back to feel for my phone. \n\nWhy was Jess calling me so early? It's still dark...\nInstinctively, I sat up.\nThe pit in my stomach deepening as the darkness around me became darker, heavier and colder. \n\nMy phone stopped vibrating.\n\n\"Hello?\" I called out and heard my voice echo back... I tucked my knees up to my chest, scared to look out into the blackness but also anxious to see.\n\nSuddenly, the deafening sound of voices, so many of them. \n\nI immediately covered my ears but the voices didn't stop talking. I slowly lowered my hands and as I listened closely I could make out words and- \n\nWait....\n\nThis was my voice?...These were my words!!!\n\n\"I'm not leaving my life for a quest?\"\n\n\"Find somebody else!\"\n\n\"It's not my responsibility!\"\n\nI could make out small strings of sentences I had said over the years and years, of being asked to do some quest.\n\n\"Oh, great.\" I rolled my eyes and relaxed. \"Nothing else worked so, you decided to creepy guilt trip me ony 21st birthday??\" I shouted at the voices, and as soon as I did, it stopped.\n\nThe sudden silence made my ears ring.\n\n\"Guilt trip?\" Many voices asked in unison. I felt a cold breath at my neck and I curled myself up again, it was still just as dark. \n\n\"You feel guilty now, Marcus?\" The voices said, like they were teasing me.\n\n\"Who are you?\" I asked shakily.\n\n\"I am not a who, Marcus, but you would know that if you listened.\" the cold breath traced along my arm leaving a trail of goosebumps. I pulled away.\n\n\"This isn't funny anymore. You want to talk to me about my \"quest\", then talk! I'm listening!\" My lips were starting to feel numb and the end of my nose was so cold it had started running. I pulled my sheets around me and felt for the edge to wipe my nose.\n\nThe voices laughed. An unsettling, relaxed laugh.\n\n\"There is no quest, Marcus The Great.\"\n\nI frowned in confusing \"But they kept telling me-\"\n\n\"There is no quest, now.\" The voices interrupted me, and the hairs on the back of my neck stood up.\n\"Wh- what do you mean?\" I called out into the darkness.\n\"The quest has expired, Marcus The Invincible, or did you think yourself so important, that it was only about you and your wants?\"\n\nI was so cold that I was uncontrollably shaking but I was also terrified.\n\n\"There wasn't even a thought,\" the voices continued. \"That this quest was more important than you? More important than this world, even?\"\n\n\"I'm not sure what's happening. I'm cold, dangerously cold, I think. And, if you're wanting anything from me, keeping me in the literal dark and cold won't help.\" \n\nI was starting to lose feeling in my toes and it was becoming hard to breath.\n\"Wanting anything from you?\" The voices playfully asked. \"I already have everything.\" \nthe voices boomed so loud I had to cover my ears again.\n\n \"I have everything. EVERYTHING. Because you, Marcus The Saviour,\" the voices taunted. \"Did not stop me.\"\n\nI felt my heart beating slow and hard in my chest as the voices began to laugh.\n I tried to take a deep breath but there was no air, I was getting dizzy and scrambled to get out of bed but suddenly there was nothing beneath me.\n\nJust ice cold, endless darkness and voices laughing. \n\nLaughing at me."}, {"comment_author": "efd-", "comment_text": "Part 3 please?"}, {"comment_author": "Saint_Of_Silicon", "comment_text": "They say that fate never asks easy things of us. How one is chosen for a task is almost entirely opaque, even to the best minds of our time. I've known since I can remember, my parents have known since I was born. Something great would be demanded of me. Something that would change the course of my life, force me to become something utterly unlike the person I had been up to that point. I can see that I must, that failure to set out will lead to a dark future. But I strongly desire to stay home. To defy fate.\n\nI was twelve when my parents sat me down, told me about it. I knew I was destined for something, but they told me other things. That I was special for being marked for such a purpose, and that there would be danger. I told them, \"I just want to stay here, learn a trade and live a normal life.\" There was pain in their eyes as they said, \"You will have to go, son. People have tried to defy this sort of destiny before, and terrible things resulted. You still have years before the ordeal, but when it arrives, you must accept it. The call will come, and you will have to answer.\"\n\nI would stare into the dark at night and consider my future. I would meet new people, do interesting things. But the life of an adventurer did not interest me. I would be transformed, but what if the person I was now did not like the person I would become? I would be hollowed out and supplanted by something else. It was a sort of death, and there was also a risk of actual death, too.\n\nI was seventeen when the call came. I woke up in the night, warmth on my palm. The mark was glowing. I woke my parents, showed them. Tears formed in my mother's eyes, sadness played across my father's face. \"We'll give you money to pay for food and expenses on your way to Cerulean, those chosen always gather there before they embark.\"\n\nCerulean was the largest city for hundreds of miles and the seat of government. It had changed and grown over a long time, parts of it were built over seven hundred years ago. I was traveling with a modestly sized merchant caravan. It would be a five day long journey. Plenty of time to think things over, maybe find a way to escape. I wrapped my hand with a cloth, hoping to avoid the attention the mark might attract. When we stopped for the night, I sat on the periphery, looking up at the stars. I could vanish here, and no one would be the wiser.\n\nThe campfire is winding down when there is a cry in the dark. I am the closest. Without thinking, I go towards the scream. My eyes are well adjusted to the dark. I find a boy, no older than seven, being menaced by a feral dog. I look for a weapon, and find a stone. I throw it at the creature's head as hard as I can. It yelps, then runs off. \"You alright lad?\" \"I... I think so. I was emptying a chamber pot and that thing came out of the dark.\" There is a brief pause, then he looks at my hand. The cloth had fallen off, revealing the mark. \"You're one of the chosen? Here you are saving people, and the quest hasn't even begun!\"\n\nWe ran into others who had come to help, and explained to them what happened. The boy tells everyone about my mark. I am the center of attention, there will be no slipping away into the shadows tonight.\n\nThe next day, we make it to a village called Blisterwort. I try to hide the mark again. I hope to find another caravan heading away from my home and from Cerulean. I ask around, trying to avoid drawing attention to myself. I am about to fall in with another group, when I am tapped on the shoulder, \"Are you Tomas? You are, aren't you. They said they had one of the marked here, and you fit the description. I am Sally.\" She raises her right hand, and shows the glowing mark. Not knowing what else to do, I unwrap my hand. The marks are identical. \"It seems we are both heading to the same journey. It is good not be alone with the responsibility!\"\n\nWe depart, still heading towards Cerulean. I have lost all hope of escaping with another caravan. My last hope is that I can fade away into the crowd once we reach Cerulean. I understand there is a huge number of people there, disappearing into the multitude should be easy enough. Sally seeks me out, trying to start conversations. I reply tersely, I don't want to give an indication that I am still planning to defy destiny.\n\nThe next days pass without incident. We reach Cerulean early in the afternoon. To my horror, there is an official waiting in the market district, specifically looking for those intended for the quest. Sally pulls me towards them. The man looks at our marks, then tasks one of his underlings with taking us to a place called The Hall. The Hall is where all the marked are gathering. I can find no way to escape. It would seem that I am going on a quest after all."}, {"comment_author": "TheFlyingRavenBird", "comment_text": "John, the lost crown prince of the fantasy world Nahba, considers just turning around and going back to bed when he sees the old man sitting on his  kitchen table. But, alas, he has work in two hours.\n\n“You do know this is breaking and entering, right?” He eyes the broom propped up against the wall.\n\n“My prince, it is imperative that you listen to me,” Says the wizard for the sixteenth time in a month.\n\n“I did listen. I decided it's bullshit,” says John as he opens the freezer and pulls out a box of waffles. “Can you, like, go? I have work in a few hours.”\n\n\n“Work? Work?! The work of this realm is inconsequential! Your uncle's dark power grows every day! You must-”\n\n“Actually, I don't.” John bites directly into a frozen waffle while popping two more into the toaster.\n\n“The prophecy is clear! You must return to Nahba, retrieve the Sword of Glory, defeat your uncle, and reclaim-”\n\n“Rather not. I like my life, you know?” John takes another bite out of the frozen waffle.\n\n“You like it? A life of servitude, a life of mediocrity, for a prince? Have you been spelled?” \n\n“Hey, I get good benefits! I have a good dentist! And who'd watch Mr. Bitey and Princess if I was off killing skeleton lords, hmm? Hmm, Mr. Wizard?!” \n\n“I-”\n\n“Hmm?”\n\n“You would rather cats-” \n\n“Yep.” John sets his frozen waffle down (on a paper towel, he's not a heathen!) and reaches for the broom.\n\n“Cats?!” \n\n“Cats,” John says, and violently smacks the wizard in the head with his broom. The old man lets out a hiss and vanishes.\n\n“Works every time,” John says."}, {"comment_author": "santa_obis", "comment_text": "Oof, another old man.\n\n\"You, my friend, have been chosen-\"\n\n\"Let me stop you right there.\"\n\nI grabbed my tonic water and took a sip as his bewildered eyes fell behind what I could only describe as liquor bleached hair. I eyed him down as he did me, and no doubt he thought he has me pegged me as I did him.   He carried an authority, something reminiscent of an age gone by, but that didn't fool me. He started to eye the chip I was palming a little too obviously.\n\n\"My so called chosen days are over, old timer.\" He looked down at his feet, as if clicking them together would have taken him out of Kansas for a change. I almost felt sorry for him, if not for the reason I was here.\n\n\"Very well, you will not do!\"\n\nAs he stumbled to the next patron, I couldn't help but think that it'd be a matter of time before we'd be meeting again. I've been around, and I don't need another one."}, {"comment_author": "Relative_Warthog_421", "comment_text": "**\"And that about sums it up.\"** the old wise man slammed the book shut, small bits of dust came fluttering out of the ancient book. \n\n\"Wait hold on. I have to do what?\" The boy said. They both sat across from each-other, the old man's wooden desk placed in between them. \n\n\"Boy! were you not listening?\" The old man raised his brow. \"I was, it's just I need to make sure of what you said.\"        \"it's not hard to understand! look let me break it down for you; For your first part of the quest you'l need **THE BLADE OF A THOUSAND SOULS!**\" the old man's voice practically echoed as he said it's name. \"The blade of a thousand souls?\" The boy swallowed a ball of fear down his throat.  \"YES, the blade of a thousand souls. And you don't say it like that, you say it like this- **THE BLADE OF A THOUSAND SOULS!**\" the old man's voice echoed again this time even louder, where it made the room seem like the depts of a deep cave \"Okay, THE BLADE OF A THOUSAND SOULS.\"      \"Like I said before to get it you must climb to the top of **MOUNT DEATHSKULL**. It is the mountain with the highest peak within the whole realm.\" the old man smiled with the same childlike glee he wish the boy with would have. \"Then you must find the **TEMPLE OF THE FORGOTTEN!** Once in the temple you most solve some of the most complex puzzles that even the most knowledgeable of minds struggle on. Before then slaying the keeper of **THE BLADE OF A THOUSAND SOULS**- A giant troll.\n\n(EDIT: I'll probably finish this later, but right now its way too late to keep writing, I hope i don't forget about this, feel free to leave constructive criticism)"}, {"comment_author": "HuntsmanRoym", "comment_text": "Part I - Eclipse\n\nTomorrow's the day. The fated eclipse will occur, I will set off through nations and skies, oceans and mountains, great cities and quaint towns. My limits will be more than just tested.\n\n\"In your 26th year, there will be a solar eclipse. After that day, your life will change forever; you will lose a part of yourself, becoming something new. And the world will be better for it.\"\n\nThese words have been ricocheting through my head ever since I heard the eclipse was happening. I had forgotten all about them for the past decade or so. Many things have happened: my family being torn a part, unwanted invaders tormenting me for years, the struggles of living every day waking up each morning just to slog through it all yet again. I'm surprised I even remembered the stupid fortune.\n\nWell, tomorrow's it…I guess there isn't much use in worrying and dreading what's to come. I should probably use tonight to prepare, but I can't kid myself - I'll just continue to sit here, reflecting and letting these anxious feelings eat away at my insides into the early morning hours.\n\n \n\nPart II - Journey\n\nThroughout my journey so far, I haven't noticed a part of me change. My anxieties are still tearing me up, and I still suffer each day, waiting for the current one to end and the next one to begin. Perhaps the fortune wasn't meant to happen immediately, I suppose it's only been a few days since the eclipse. If anything though, that worries me even more. I'd just like to get it over with as quickly as possible.\n\nAs I travel through the sky toward a distant nation, I can't help but think of the potential issues I'll face. Firstly, the language barrier. I don't speak their language, they won't speak mine. How will we communicate? What if I spark animosity or offend the wrong people? There's also the issue of me not knowing where to go or how to get anywhere once I arrive. Coupling with the first issue, I won't even be able to ask for directions. Are these people going to think ill of me? Will they berate me? Laugh at me? Hate me? It's not like they are asking my to embark on this quest - it's something that was asked of me.\n\nI'll be arriving soon. I best try to stop thinking about this as much as possible - my stomach will be tossing and turning regardless, so l should just focus on trying to enjoy it.\n\n \n\nPart III - Growth\n\nI'm not sure when it happened. As these two weeks have passed, I've found myself able to do things I couldn't before. Not only is the language barrier not an issue, I can talk to people with little issue. Before hand, an invisible force inside me wouldn't let me. Any social interaction was incredibly difficult to perform. But now…now I've been conversing (well, as much as one can with a language barrier) with this nation's people and taking part in their culture.\n\nI'm no longer focusing on the negatives as much - I still have every now and then, I'll grant that. However, what's it matter that I got lost multiple times? I didn't inconvenience anyone…plus it was even kind of fun trying to interpret the different train lines and when I got off at the incorrect spots, there were people who would help me out of the goodness of their hearts.\n\nThe eclipse, this journey, and even the unfortunate events I lived through prior - they all lead to this. I've overcome these feelings that have held me back in life. That invisible force no longer binds me. I did lose a part of me. I lost a weakness. These experiences I went through, I've become a new me. I'm excited for tomorrow; I'm excited for what life will bring."}]}, {"post_title": "[WP] You originally started this restaurant as merely a front for a drug smuggling ring. However, as your restaurant has become inexplicably popular, you come to realize that you may truly have a passion for the culinary arts.", "post_url": "https://www.reddit.com/r/WritingPrompts/comments/1bymr70/wp_you_originally_started_this_restaurant_as/", "post_main_text": "", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n>* [No AI-generated responses &#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n>* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n>* Responses don't have to fulfill every detail\n>* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22&restrict_sr=on&sort=new&t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22&restrict_sr=on&sort=new&t=all) for stricter titles\n>* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n&#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n&#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n&#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n&#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*"}, {"comment_author": "SocalSteveOnReddit", "comment_text": "The idea of money laundering is straightforward.  You report income from a business that had nothing to do with the business, and can then turn that money into expenses, wages, or even an owner salary.  Like any act of fraud, numbers need to be kept reasonable, or else the G-men will come knocking.\n\nClown Burger had been profitable for five years; not an invented income, but people liked bright flavorful deserts, Funny and Very Funny cheeseburgers, and the Onion Rings were red hot.  New items were coming, \"Bozo Chili Sauce\" was good enough to eat with a spoon, but sold with an order of fries it was pure bliss.  And while 'Fearless Chicken' had long been a dad joke, it brought comparisons to a Kentucky Colonel.\n\nTaxes were due.  I had to to report my finances, but I had cleared a 10% operating profit on its own.\n\n///\n\nTen years ago, I was desperate.\n\nThe government still didn't understand marijuana, but they understood it even less than they did today.  You could smoke it, but the talent I had was 'edibles'.  It didn't take long for money to start to pile up, and the Bank would report anything over $10,000.\n\nClown Burger began as a paper fiction, before due diligence demanded I created a store front.  I had to dispose of dyes, so I turned Vanilla Ice Cream into a flavorful and colorful experiment.  I expected to run a loss for a long time, but I had something different, something unique, and in a world where giant chains sell very consistent things, Clown Burger was a bizarre novelty.\n\nI'd fenced off edibles to people, dumped the money into Clown Burger, and narrowed the losses, before reaching break even.  But there was something else to all of this--I'd gotten away with it all.  No one does that forever, not unless there is nothing to reveal.\n\n///\n\nI made my decision.\n\nI would exit the edibles business; I didn't need the money, and I certainly didn't need the risk.  I'd make a couple calls to sell off the old product, and close out that operation.\n\nClown Burger had begun in a bizarre way, but hadn't Pizza Hut been born out of a falling out between brothers?  Wasn't McDonalds a family restaurant that got bought out by the ice cream machine vendor?  Clown Burger didn't need an illegal off book activity, and neither did I.  It was time to set an old way of life aside.\n\nIndeed, it was time to head to the kitchen:  What if Potato wedges could be mixed with Bozo Chili? The costs would be lower than fries, and people would undoubtedly enjoy getting more for less."}, {"comment_author": "thehungriestnarwhal", "comment_text": "I looked up from the popcorn and oil and bags in the brief moment right after new kernels went into the freshly oiled popper. 1...2...4..12. Twelve people were lined up, on their phones and unphased by the wait, just eagerly anticipating my freshly popped popcorn. \n\nIt was a beautiful sunny yet cold day in late March, and the smell of bonfires filled the lakeside air. Elvis lazily drifted out the radio, and good vibes wafted down the street along with the popcorn. My popcorn, from the popcorn business I'd started to be a front for my cocaine business.\n\nA \"White\" bag of plain popcorn meant a bag with coke, if you winked twice with your left eye when you ordered. But coke wasn't even my best seller at this joint I'd somehow created. The Cashew Caramel popcorn started selling like wildfire the second it hit the streets. A little bit salty, perfectly encased in crispy caramel, and delicious as ever, as soon as June started raving about it at church,  practically the whole tone was coming over to get some popcorn..."}, {"comment_author": "EliteArc", "comment_text": "Something tells me there abit of cross contamination."}]}, {"post_title": "[WP] \"Congratulations, your self-righteous quest is complete. I hope you understand the scale of what you've done today, because there are such things as necessary evils. Best of luck for ya, kid.\"", "post_url": "https://www.reddit.com/r/WritingPrompts/comments/1by75mq/wp_congratulations_your_selfrighteous_quest_is/", "post_main_text": "", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n>* [No AI-generated responses &#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n>* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n>* Responses don't have to fulfill every detail\n>* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22&restrict_sr=on&sort=new&t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22&restrict_sr=on&sort=new&t=all) for stricter titles\n>* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n&#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n&#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n&#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n&#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*"}, {"comment_author": "TheWanderingBook", "comment_text": "\"Well, you defeated me, oh the great big bad Evil Demon king, as you call me.  \nFelicitations to you, young Hero, your self-righteous quest is complete, and my people, the demons are pushed backed into a small corner of this vast continent.  \nBut we shall see whether it was a good choice to crush us so decisively or not. Good luck kid.\", the Demon King said as he breathed his last.  \nThe hero watched with a cold gaze.  \n\"As if anything could be worse than what you did.  \nKilling people left and right, and wanting to conquer...  \nWhat am I doing? Talking to a dead ma...something.\", the hero snorted leaving.  \nOutside his companions, and the soldiers of the human kingdoms came to clean up the remaining demons, and when they saw him almost unscathed, they celebrated.  \nThey won.\n\nPeace was upon the continent, or so the hero thought at first, but then his few truly faithful followers were bringing worrying news to his newfound fief.  \n\"The Southern Kingdom just experienced a coup, the commoners are dying left and right as the noble faction is in the process of overthrowing the Royal family.\"  \n\"The Eastern Elven Empire just faced their first in these last 10 thousand years Dark Elves transformation, and Yggdrasil has lost one of its leaves.\"  \n\"The Free Islands of the Western Oceans are in Chaos as the troops and Lords returned and started vying for supremacy.\"  \n\"The Western Republic faces a drought, and a widespread famine due to fund embezzling that happened while the king was away to battle the demons.\"  \n\"The Northern Kingdom is faced with an unprecedented beast invasion, all beasts seemingly corrupted by a foreign energy.\"  \nAnd these were only the main reports, as many more were coming in with countless suspicious and weird occurrences from all around the continent.  \n\"This is what he meant?\", the hero muttered.\n\nHe quickly gathered his followers, and started to act using his fame as a Hero to force the nobles, merchants and everyone basically to bend to his will.  \nAfter all, the public, and a vast majority of the soldiers were his fans, they almost worshipped him.  \n\"Even after his death, that idiot is helpful...\", the hero smirked thinking about the Demon King.  \nBut it didn't stop.  \nNo matter how many schemes, and coups, invasions and skirmishes he stopped, new ones just appeared.  \nNo kingdom remained peaceful for too long, for the resources of the kingdoms, and loot from the demons were too enchanting, and everyone wanted everything.  \nThe Hero tried for months, and years to find a solution but he couldn't.\n\n\"It's as if the world itself thinks that we need an enemy...  \nInvaders, otherworldly corrupt forces, schemes, in-fighting, long deceased monsters reviving...  \nSigh, was he right? Should I have left the demons as a deterrent force, as a small nagging feeling so that everyone remained suspicious of them, not daring to do such bold moves?\", he muttered, drowning his thoughts in wine.  \nThen he started laughing.  \n\"If the world needs a common enemy, then I shall play that role!  \nDo you hear that world! Universe! God! Whatever! Stop sending all these annoying bugs at us anymore, for I will be a true threat!\", the hero swore, and left to do as he said.  \nTo become a true menace to the world itself..."}, {"comment_author": "sadnesslaughs", "comment_text": "The young knight knelt before the altar, praying twice to his god. Once for the forgiveness of his own sins, and second for the forgiveness of the priests’ sins. The priest laid in a pool of his blood, staring up at the painted ceiling of the church. It’s magnificent white clouds, the only glimpse of heaven he would get before his soul was dragged to hell. A punishment that didn’t seem fair from the priest’s perspective.\n\n \n\n“Congratulations, your self-righteous quest is complete. I hope you understand the scale of what you’ve done today, because there are such things as necessary evils. Best of luck to you, kid.” The priest’s last words held no malice behind them, genuinely wishing the best for the kid. Father Luke rolled his neck to the side, watching the boy as his life left him. The knight had the kind eyes of a believer, something he admired before he passed. \n\n \n\n“There was nothing self-righteous about this, Father Luke. I did it to spare the people of our village. How many have you fed to that thing?” Eric glanced at the priest, crossing his hand over his heart. “May the lord forgive your sins, for I’m unable to.” He set his blade in its sheath, hoping this would be the last battle to ever take place in this holy house.\n\n \n\nAs he examined the body, something strange caught his eye, a slight blue glimmer of magic coming from the priest’s bloodied palm. “What is that?” He squinted, only to feel a bitter touch on his shoulder, a woman’s voice in his ear.\n\n \n\n“I don’t appreciate being called a thing.” She clenched her hand, slicing off a piece of flesh from his shoulder. While the pain roared through his body, he knew he had to ignore it. Jumping back, he drew his blade, taking up a stance.\n\n \n\nThe creature had already finished devouring the flesh by the time Eric took his stance, its shadowy form towering over the young knight with a face full of eyes that twitched and blinked whenever it moved. The demon hurt to look at, the sight of it disorientating the young knight. It was like it changed shape whenever his mind got used to looking at it, a constant blur of dark shadows and features.\n\n \n\n“I’ll slay you, beast. For the honor of my god.” The knight’s words lacked resolve, unable to work up the strength to take a step forward.\n\n“God? Look around you. God left this church decades ago. How else was I able to get in?” A pointed tongue replaced an eye, licking the spot where its cheek should have been. “You’ll make a fine snack. Without the priest’s agreement, I’ll be allowed to feast as freely as I like.”\n\n \n\n“No…”\n\n \n\n“No?” It laughed, floating forward, lurching over the knight. “No? That’s cute. Annie is your little sister, right? I’ll visit her once I’m done with you. I just hope those little bones don’t get caught in my teeth.”\n\n \n\n“No.” The knight sobbed, building up whatever courage he had left, striking his sword at the creature, only to watch his blade break apart, scattering across the marble floor. “No……” His head fell, dropping beside the dead priest. “No. PLEASE, I DON’T WANT TO DIE. I DON’T DESERVE TO DIE, I’VE BEEN GOOD. I TRIED MY BEST. MOOOM. PLEASE, MOM.”\n\n \n\nThe demon cackled, letting him sob, enjoying the sight. “How did a weakling like you kill that priest? Oh, I see. He didn’t have the heart to fight back. I thought he was one of the smart humans, one that understood what needed to be done. Seems he was as flawed as the rest of you. Don’t worry, I’ll tell your mother your last thoughts were of her. Then she can join you.” The demon’s hand wrapped around the knight’s neck, only to drop him, feeling a sharp sting running up her arm.\n\n \n\n“No! THAT OLD BASTARD. I WON’T LET YOU SEAL ME.” The blue glow stirred even brighter, the priest’s last trick activating now that she was in range. No matter how much she pushed against the magic, the force of his seal was too strong, constantly blocking any attacks she threw at it. She spat fire, curses and ice, anything to break it, but nothing worked. So, she turned her attention to the knight. “IF I’M GOING TO HELL, YOU’RE COMING WITH ME.”\n\n \n Before she snagged the knight, her body faded. That claw going through his body as she vanished. “I’ll see you in hell, priest. I hope you understand you’ve made an enemy for your doomed eternity.” As her voice left the church, the knight rolled onto his back, panting as he stared at the ceiling, trying to catch his breath. \n\n \n\n“Father…. I’m so sorry. I didn’t know how bad that thing was.” Out of fear and grief, the knight sobbed, getting no comfort until later that evening, when a nun visited the church. A month after the events at the church, the knight resigned from his duties, wanting to honor the late priest by taking on his position.\n\n \n\nEric still didn’t know if necessary evils existed, but he understood why the priest did what he did. Sacrificing the sick and desperate that came to the church seemed reprehensible until one saw what he was trying to prevent. Sadly for the priest, Eric was the only living person who knew what the priest saw. \n\n \n\n“Brother, can we go home and have dinner?” Annie whined, watching her brother fix the altar. She had promised to help him with his duties, but had grown bored only minutes into helping him. Instead, deciding to jump the church pews while she waited. “Come on…”\n\n \n\n“One moment, Annie.” When he was happy with the altar’s presentation, he took her hand. “Let’s go.” As he left, he said a silent prayer of thanks to Father Luke, hoping that his prayers were enough to send the man to heaven. Wanting to repay Father Luke for sparing not only his life, but the lives of those that lived in the village. That seal required him to bind his own soul to the demon, which was why he was hesitant to use it, assured he would be stuck in hell with the demon for the rest of time.\n\n \n\nEric, on the other hand, liked to think Father Luke was out of the demon’s grasp. While their souls may be joined, that wouldn’t matter if the two were on different plains of existence. Not even a bound soul would be enough to allow the demon to torment someone in heaven. That’s at least the best Eric could have hoped for as he left the church.\n\n&nbsp;\n&nbsp;\n&nbsp;\n\n(If you enjoyed this feel free to check out my subreddit /r/Sadnesslaughs where I'll be posting more of my writing.)"}, {"comment_author": "Tregonial", "comment_text": "It was all over the news. A new young hero had slaughtered worshippers of evil gods by the hundreds in the span of just one month.\n\nThe Hero's Guild threw a party for him. Praised his bravery and glory of his achievements. He was on the fast track as their rising star.\n\nI tried to reach out to him. He showed up at the designated meeting place just to mock me. Crack jokes about how funky I would taste as eldritch calamari. My warning to him fell upon deaf ears. For he was too thrilled by his short-lived victory to know what he just did.\n\nHis self-righteous quest was complete in his eyes. He was too green and wet behind the ears to comprehend the consequences of his actions. An idealistic man who thought the solution to most supernatural problems was to kill what was evil.\n\nThe concept of necessary evil slipped his mind. Even as I tried to inject it into his brain, his mind threw out my whispers like taking out the trash. Rude. As impolite as him laughing at me when I wished him good luck.\n\nHe would need it the day the gods of those dead followers came to him for vengeance. They would punish him for sure. If I were to find my followers dead, I would mete out divine punishment.\n\nIf anything, those worshippers had kept their gods satiated with their tributes. Happy deities generally resulted in less smiting and more eating. I know that applies to me. With adequate quantities of chamomile tea and cheesecake, your friendly neighbourhood eldritch Lord Elvari is one happy camper.\n\nBack to the foolish hero. He was found dead a few months later. Can't say I didn't warn him. Evil or not, gods don't like seeing dead followers in their own places of worship.\n\nThe Hero's Guild panicked when the wrath of furious and still obviously evil gods swept across the lands. Their heroes were no match for them.\n\n\"Your only choice is to appease them. Worship them,\" I told their representative.\n\nThe woman baulked at my proposal that they disband and split themselves into various groups to begin praying to those gods. She thinks she can convince me to help them fight a dozen of malicious gods just because I'm the only eldritch deity they know to side with humans.\n\nIn her words, I'm crazy enough to do it. Because they're too embarrassed to seek the aid of the Monster Hunter Association or Holy Inquisition. But apparently, with sufficiently thick skin to ask the Eldritch God of Madness to go solo a dozen other gods.\n\nHey, I might not be a font of sanity, but I'm not suicidal.\n\n------------------------\n\n[Thanks for reading! Click here for more prompt responses and short stories featuring Elvari the eldritch god.](https://www.reddit.com/r/TregonialWrites/comments/11tkt9w/eldritch_god_elvari_series/)"}, {"comment_author": "Mr_-_-nobody", "comment_text": "The knight slowly looked at his dying enemy, even if they were true ,hearing his words filled him with rage.\n\n\"Come on, kill me and be done with it.\" Said the wretched bastard that had killed the rest of his old party, he wanted to attack them, oh, how he wanted to murder them and leave them to rot at the side of the road, and yet, their words rang true, if anyone else found the truth of the king's actions, the empire would fall like it had done oh so many times in the past, that was the reason why this... This... \n\nWho even are they? They weren't a knight, or at least not one of the registers... A mercenary perhaps... No matter.\n\n\"You're just going to leave me here to bleed oe something?\" Spoke the mercenary(?) again...\n\n\"You killed my team because we found out that the unification wars where because of a lie our king made, didn't you?\" Spoke the knight calmly \n\n\"What? How do you-\" the knight didn't allow them to finish their final words, slashing their throat open with a quick movement of their sword.\n\nEven if what the bastard had done was unforgivable, the least he could do was let them die in peace, but that left a last person who knew about the fact, maybe if they burned the information... Maybe then the kingdom they have served for so many years wont collapse... Right?"}, {"comment_author": "Mr_-_-nobody", "comment_text": "The auto corrector really straight up traduced 'unforgivable' into spanish (imperdonable)"}, {"comment_author": "ProsesAreRed", "comment_text": "His hands outstretched towards the sky and the iridescent prism disappeared into the morning light. It was finally over. He stepped back and looked out at the horizon, seeing the light travel over the clouds in rolling waves.\n\nSo. Now what?\n\nHe stood there, silently watching the wind pull the clouds across the sky like a fleet of sails. It was quiet. Quiet enough for the existential dread to kick in.\n\nThen, a hand clapped down on his shoulder, slicing through his thoughts. He lost his balance, teetering over the edge of the tower, over the expanse of white clouds. His heart leapt into his mouth and cold sweat shot through his body.\n\nThe hand jerked his shoulder back and he stumbled, falling hard on the stone floor.\n\nWhen he looked over his shoulder, his heart was still pounding.\n\nA strange man laughed, towering over him. \"I didn't mean to startle you.\" He was dressed head to toe in black, his suit pressed sharp, cutting a shadow against the pristine marble and sky. \"You're quite jumpy for a hero.\"\n\nHis eyes widened, \"Jumpy? You nearly killed me!\"\n\nThe man stepped forward and held out his hand. \"Come now, I came here to thank you personally.\"\n\n\"Thank me?\" his expression softened.\n\nThe young hero looked at the man's black, gloved hand. Begrudgingly, he clasped the man's hand.\n\nThe man pulled him forward, lifting him onto his feet with ease. He let go of the hero's hand once he steadied.  \n  \nThe man stepped back, his movements graceful as he bowed deeply, \"Congratulations, your self-righteous quest is complete. I hope you understand the scale of what you've done today.\"\n\nThe hero looked at him with a quizzical expression. \"It wasn't self-righteous,\" he muttered.\n\n\"Because,\" the man continued, ignoring his protest, \"there are such things as necessary evils.\"\n\n\"Necessary... evils?\" The hero's brows furrowed. Unconsciously, he stepped back, lifting his hand to the hilt of his sword.\n\nThe man said nothing, only smiled. As he took a step back, the wind carried the scent of something burning. \"Best of luck for ya, kid.\"\n\n\"Best of luck? Wait, what did you mean 'necessary evils'?\" The hero stepped forward.\n\n\"Thanks for helping out,\" the man said, waving his hand in a casual salute. Then, he turned to walk away. He didn't hurry. He didn't have to.\n\nBefore the man's heel hit the ground, a cacophony of shrieks ripped into the air behind the hero, pulling a rush of violent air into the sky. When the hero turned around, the blood drained from his face.\n\nA fleet of entangled demons erupted from the clouds, bringing a veil of darkness that blackened the sun and sky. How could this be? This wasn't supposed to happen.\n\n\"Wait, what is this?!\" The hero turned, only to find that the man had disappeared.\n\nHis breaths grew ragged as he drew his sword, his palms sweaty against the hilt. The blade’s silver darkened, reflecting sparks of obsidian flames twisting through the rush of demons. As the sky turned black, filling with ash and smoke, he knew. He would rather die standing than on his knees in fear."}]}, {"post_title": "[WP] They were taught to become immune to your magical fear, but they only learned to ignore the fear of death and harm. But as you ran through the trapped halls, they almost screamed while pursuing you, a fear of losing their titles, their positions and their honour.", "post_url": "https://www.reddit.com/r/WritingPrompts/comments/1bytnwm/wp_they_were_taught_to_become_immune_to_your/", "post_main_text": "", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n>* [No AI-generated responses &#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n>* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n>* Responses don't have to fulfill every detail\n>* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22&restrict_sr=on&sort=new&t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22&restrict_sr=on&sort=new&t=all) for stricter titles\n>* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n&#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n&#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n&#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n&#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*"}]}, {"post_title": "[WP] Ever since you were young, you have been able to save and load in real life like you would in a videogame. One day, you open your locker at school to reveal a hand written note with only the words \"I remember\" on it, as well as photos that shouldn't exist anymore.", "post_url": "https://www.reddit.com/r/WritingPrompts/comments/1byqw90/wp_ever_since_you_were_young_you_have_been_able/", "post_main_text": "", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n>* [No AI-generated responses &#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n>* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n>* Responses don't have to fulfill every detail\n>* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22&restrict_sr=on&sort=new&t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22&restrict_sr=on&sort=new&t=all) for stricter titles\n>* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n&#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n&#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n&#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n&#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*"}]}, {"post_title": "[WP] \"For our next generation of advance robots, I purpose to give them an advanced, synthetic musculoskeletal system that mimic human muscles in terms of function and it can grow bigger in response to stimuli.\"", "post_url": "https://www.reddit.com/r/WritingPrompts/comments/1byrmh5/wp_for_our_next_generation_of_advance_robots_i/", "post_main_text": "", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n>* [No AI-generated responses &#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n>* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n>* Responses don't have to fulfill every detail\n>* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22&restrict_sr=on&sort=new&t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22&restrict_sr=on&sort=new&t=all) for stricter titles\n>* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n&#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n&#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n&#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n&#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*"}]}, {"post_title": "[WP] When aliens first discovered Earth they were surprised that such a hostile world could produce life, let alone intelligent life. They were even more surprised to learn that Earth had not always been this deadly and that cockroaches were not its first technological species.", "post_url": "https://www.reddit.com/r/WritingPrompts/comments/1by3mlc/wp_when_aliens_first_discovered_earth_they_were/", "post_main_text": "", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n>* [No AI-generated responses &#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n>* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n>* Responses don't have to fulfill every detail\n>* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22&restrict_sr=on&sort=new&t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22&restrict_sr=on&sort=new&t=all) for stricter titles\n>* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n&#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n&#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n&#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n&#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*"}, {"comment_author": "Blackraptr", "comment_text": "Skittering. It was a phrase coined by Kaem'Zan of the Fwakshea, the lead scientist of its empirical ship. When one splits the atoms apart and fuses it with a neighboring particle of the same charge before it is put back together and reformed the ship and everything else on it. It was his nation's proudest scientific miracle for space travel. Capable of blinking across star systems in an instant, it was sought after by everyone on his home planet of Hyunalith.  \n\n\"Sir, we are finding an unusually high radioactive rating of 5 mega parcels per atom on a certain planet considering the system's sun is just a standard yellow ball.\" The planetary analyst rubbed his chin, the sound of knocking on his hard turtle carapace echoing in the ship's robust design. \"That shouldn't be possible considering its sun is nowhere near the UV index to produce such radiation of this caliber. I think we need to check out this new planet.\" He bowed slightly and was hopeful that his disposition would be appreciated. \n\nKaem'Zan struggled to find a reason why they should visit a planet considering their entire purpose was to just map the universe around their home planet.  \n\n\"Hm. Why do you wish this, hm?\" His voice sounding with malice as usual. \"Do you think it would be good for us to go to a planet that is more radioactive than its surroundings? That doesn't seem very smart.\" \n\n\"Well, that's the problem sir. It's radioactive, but only outside the planet. The planet itself is perfectly fine.\" He chimed in quick response hoping that he could sway his mind with speed rather than logic. \"It is extremely unusual for a planet to ward off such high amounts of radioactive particles when its sun isn't producing the necessary catalyst for it. I'm thinking of one of two possibilities: That there is life capable of atom fusion or that the atmosphere is incredibly durable. Both would be an important find, no, sir?\" The Planetary Analyst grinned slyly. He's got him now. \n\nKaem'Zan was impressed. He didn't think to scan for life forms on the planet as it was beyond his pay grade.  \n\n\"Have you been scanning for biological matter on each star system?\" He questioned him like a doctor asking a patient. \"Do you think we would benefit by-\" He stopped himself. It would be huge news if they were the first to discover not only life, but intelligent sentient life. \"On second thought, excuse my rudeness. I believe we will take a closer look at the Planet. \n\n1/8"}, {"comment_author": "Blackraptr", "comment_text": "Show me the elemental composition and atmospheric conditions as well as any other information you deem worthy.\" Kaem'Zan clicked his shoes as he walked away. \n\nAlright! His first time meeting the commander of the ship and he has already won him over in conversation. This is gonna be a fun analysis now that he doesn't have to hide it anymore. He began to bounce multiple lasers through its atmosphere analyzing the light refractions and the color the laser produces on each and every particle.    \n \n\n\"Hm... interesting.\" He squinted his eyes and began to read the small numbers that appeared before him. \"That... is that... what is that.\" He focused further as he read it. \"Why is there such a diverse composition of elements... argon... Oxygen... nitrogen... they're everywhere.\" He couldn't believe his eyes. There were even elements unknown to his vast knowledge. He was ecstatic to find such an incredible planet in space. He calmly got up, brushed off his hide, and sprinted towards the commander. \n\n“CAPTAIN! CAPTAIN!” He ran with all his might, forcing others out of the way or they would get tossed aside by his brute force. “THE PLANET IS A MIRACLE! IT’S GOT ELEMENTS UNKNOWN TO EVEN ME AND AFTER A QUICK ANALYSIS OF IT’S AERIAL COMPONENTS! I THINK LIFE IS THERE!” He collapsed to his feet in front of Kaem’Zan panting. “W-We sh-should go right away.” Kaem’Zan was amused that someone had stormed his room without knocking and figured that the planetary analysis wouldn’t do such a reckless thing if he was lying. \n\n“Hmmmm? You want to go down?” He laughed. “Why? So, you can collect more scientific anomalies? HA! Fat chance.”  \n\n“The radiation was artificially made.” The Planetary Analyst said so in confidence that it would spark interest.  \n\n“Artificial radiation, hm?” He looked out the ship’s visored window and towards the star. “So, how much of it around the planet is artificial? If you tell me an appropriate amount, I’ll forget this rudeness you’ve caused by running through into my headquarters.”   \n \n\n“78% sir.” His face was kept as straight as possible as to not give suspicion to his mind that he could lie, which he wasn’t. “I think sentient life is on that planet.” \n\n2/8"}, {"comment_author": "Blackraptr", "comment_text": "Kaem’Zan laughed more. His interest was piqued. He looked around for the ship’s telecommunication button and spoke. \n\n“This is Captain Kaem’Zan. Please prepare for planetary landing and atmospheric depressurization.” He looked at the analyst. “Tell me your name shelled-one.” He clicked his tongue amusingly. \n\n“I’m Teen, Sir.” He bowed fully this time. “Thank you for not reprimanding me. I’ll begin analyzing for lifeform composition and its other inhabitants.”  \n\nTeen went back to his work desk and began running biological scans and data mining frequencies across a wide radio band. He found that global communication was achieved, however, all the channels were empty. Only small sounds and noises remained, as if something completely alien was trying to communicate with itself. He found a lush green and blue marbled world that teemed with carbon-based life. Plants, animals, and everything else in between existed in the skies, on land, in the water, and even in places where light isn’t present. After 8 minutes of this, he was approached by the captain again. \n\n“Teen. Status Report?” He was excited to hear more news on the findings before the ship-fall. “Teen.” He said again, this time louder. \n\n“Huh- Oh sorry Sir. I was lost in my thoughts. I have found that this planet is filled with an overabundance of life. There are chemical readings everywhere on its land masses, its oceans were polluted in some parts, completely devoid of life outside of a few hardy specimens. It’s thrilling to see such durability in organism evolution, don’t you think?” He maliciously smiled at the reflection on the monitor. “I think it’s wonderful to find new things to study.” \n\nKaem’Zan focused his vision on Teen. He was intrigued in his thirst for scientific knowledge but fears it might be his downfall.  \n\n“I see. What about intelligent life? You said so, since there is artificial radiation, yes?”  \n\n“You see, that’s the problem, Captain... there are none. I’m seeing formations of metals and stones and even wooded materials forming what I assume could be alien buildings, but they are vacant. I’ve shot numerous particles in hopes of finding something that would return a biological survey, but I’m only finding large, very large, insectoids that seem to be chattering with themselves.\n\n3/8"}, {"comment_author": "Blackraptr", "comment_text": "I’m not able to decipher them, sadly. Their language matches nothing in our databases and I’m not finding any matches from the alien symbols on some buildings compared to how the insectoids speak.” Teen pursed his lips together. “I think, the original creators of the architecture had gone extinct and met their fate, leaving life on the planet to evolve, thus: The Insectoids.” He smiled with delight.  \n\nKaem’Zan smiled as well. He walked away. His feet producing that same clicking sound, a warning of the Captain’s Presence. \n\n“Prepare to make first contact, teen. We will get you some samples after all.” He held up his hand for a nod of approval and received it. “Excellent.” The sound faded, but not his beating heart. He was overwhelmed with excitement. Oh man, this is it. Fresh subjects, materials, and new ideas of the universe to be meddled with. Teen couldn't contain himself as he thought. \n\n“Please take off the Skittering Suits and remain seated for atmospheric decompression and arrival, welcome to an alien world. We are the first to make history.” Kaem’Zan let go of the button and began to let the ship count down and begin.  \n\nSeveral minutes passed by and they were finally on the planet and ready. Teen had run tests on the air, and it was deemed suitable for us, but it may prove difficult to breathe if we go too high due to how heavy the air is compared to our home planet. When the ship doors opened the crew found themselves bewildered at the sights. The planet was immensely rich in not just materials, but everything from smells, to sights, to even sounds. It didn’t matter where you looked, you could find life everywhere. Organisms that had taken flight, tiny chitin-shelled organisms, smaller insectoids, mammalian life.  \n\n“Well, Teen you’re lead here. You currently know more than anyone, even I.” Kaem’Zan had met his eyes and wasn’t accepting no for answer. “Lead away, Expedition Lead 1.” \n\n“R-Right, Captain-.” Then, he heard that same skittering noise from before. “Wait.” Teen had removed a listening device capable of showing where sounds waves were coming from and he could then translate the sound waves into a frequency, and finally into a language he can understand. \n\n4/8"}, {"comment_author": "Blackraptr", "comment_text": "“They’re here. Here. Here, them. Look. Look. Many. Turtle creature. Reptiles behind turtle. Insects too. Confused.” Teen was shocked. It was like talking to a child. Nothing was a complete sentence and everything was just words that pointed forward a single clear message. “Gun. They have gun. Not Human. Unknown. Scared.” The insects were intelligent, however they were still primitive. Then, he saw one in a bush poking it’s antennae out, probing.  \n\nHe spoke into the device and relayed the frequency into the insectoid language they spoke, albeit it was a little more advanced than what he was hoping to say back, “We come in peace. Please show. We wish to talk.” Then, the antennae disappeared as quickly as the message spoke. \n\n“It speak language. Ours. What happening. Find the leader. Need smart.” The listening device was picking up more skittering, albeit all too quiet to hear, however he could hear the bushes and grasses rustle. \n\n“Follow me if you wish. I have just spoken to them however; We will not harm them. They are still primitive. If we follow them silently, maybe we can find their village.” He walked silently as possible with his large form. Turtle. The fuck is a turtle. It was bothering him how much they already knew. Guns? Humans? Nothing made sense. It was like they were already being taught something and we failed to find the planet before these so called “Humans”. \n\nIt was him and 3 others that were ready to brave the planet, including the captain. They walked for a long time coming into close contact with many fauna and flora. Animals looked at them and ran, while some stared at a distance. Sounds of liquid water could be heard which was strange considering liquid water was considered only to be possible on Death Worlds due to their high probability of intense apex species, which was a problem considering they weren’t armed very well. It made him uneasy. \n\n“Captain, does anyone one have a weapon on them? I think... this could qualify as a death world.” Kaem’Zan froze in place as he looked around cautiously and pulled out a large, bladed staff, the Kensho.  \n\n“Shall I lead the charge, then?” He walked ahead of them and listened carefully for anything could even be a threat. They walked for a while as they tailed them. They got better glimpses of them as they walked in to a clearing. They were very, very large insectoids with wings and 6 appendages.\n\n5/8"}, {"comment_author": "Blackraptr", "comment_text": "They often crawled on all 6 legs at alarming speeds which would be a problem if it wasn’t for the fact that they are also bipedally walked once they got out of the forest. They were capable of language, although once we saw their village it was clear they hadn’t even a written language however, could easily produce fire and tools of surprisingly good quality. \n\n“These fuckers are fast, huh.” Teen said with bloodlust in his voice eager to get samples and start testing. “They are rather clever for how intelligent they are. I am worried about these Human people they mentioned. Maybe a false deity.” He wrote it down on a note pad someone was holding, the designated notes person. “I don’t think they’ll be too much a problem. They seemed pretty scared of our armaments. They even called something a “gun”. Whatever that means.” Teen cleared his throat as pronouncing words in his own language using their translation was very strenuous. “I think we should go down there before they leave with their “Lead”.  \n\nThey approached the village and carefully made sure that they were being loud so they wouldn’t freak anything out. \n\nHe spoke into the listening device, it’s translations slowly getting better through consistent use of hearing their tongue. It was determined that they called their language “English”, but said the wish their masters were still here to teach them more things before they had to depart.  \n\nThey walked into the village and were met by immediate action as what I could assume to be soldiers marched to us with 8 legs this time and sharp looking weapons. \n\n“Wait!” They held up their hands as the captain used the Kensho to cut the weapons they used in half with ease. “Th-thanks, hehe.” His laughter was forced as he was nearly killed by both the captain and the bug’s advance. \n\nThe insectoids made their noise of language and I waited for a translation. You not human. Explain or be wiped off the Earth. The device was improving significantly in their speech and pattern recognitions and was now able to give a detailed alphabet of 24 characters. Teen spoke into the device for it to radio back. What is Earth? Who are the Humans and what are you? We are the First Contact Vessel Venxrex of the Hyunalith. We hope for peace. \n\n6/8"}, {"comment_author": "Blackraptr", "comment_text": "The insectoids had looked at each other before speaking.  \n\n“We are Cockroaches. We do not know the meaning of the word, but Humans called us this. They realized that we were going to be the next intelligent life form on Earth, the planet, and imparted to us their vast knowledge throughout their 360,000 years of evolutionary expansion from Ape to Man. They used to be an apex specie on earth, until they had a devastating war. They were forced to flee the planet after the United Front won. They understood how durable we were and tasked us with the power of removing the radiation and toxic waste from Earth. If peace is what you wish, then we can accomodate you, but only you. The man with the staff is intimidating.” They looked at captain with prying eyes. \n\n“Captain Kame’Zan, they willl only allow me to follow them due to your menacing aura. I think I will be fine. They seem to be far more intelligent than I had originally thought. I think you should go back to the ship. I will return once I have satisfied with the information. Please, I ask this selfish request.” He bowed deeply and waited for Kaem’Zan to decapitate him where he stood. \n\n“Hmmm. I shall grant it. Don’t be late before night fall. I hope you know the cycle of this planet, because we will not come for you and will be closing the ship and sleeping on the surface. If you don’t make it. You will survive on your own. Understood?” His tone was harsh, as if he didn’t want me to stay alone and used this as a means of punishment. \n\n“Thank you, sir.” I began walking towards the Cockroaches as they cautiously looked me up and down.  \n\nTheir leader was just a slightly bigger cockroach that looked as if it had mutated. It’s skin was pale and colored purely unlike its other kind.  \n\n“Hello, the one from space. I am Cheech, Lead Director of the village in the east. Sit down and we shall begin.” Its noisy language was much firmer and confident in how it spoke. \n\n“You must be the Smart One I eavesdropped on.” The alphabet had been updated to include two more letters for a grand total of 26 characters and the device deemed it was a completed alphabet, but further analysis would be required. “Tell me more about the Humans first. I believe their history was the origin point of you guys and I would like to know about your uh... condition.”\n\n7/8"}, {"comment_author": "Blackraptr", "comment_text": "Teen gestured towards his pale complexion, while the cockroach did what I could only assume to be a laugh as terrifying as it was. \n\n“The humans were an apex specie that evolved from monkeys, a mammal. If you asked the others the same question, then I presume you heard of the war? I will tell you more later. However, to answer your simplest question first: I am an Albino. A term coined by the Humans meaning, ‘to be born without color.’ I was simply born white rather than the standard darker complexion of my brethren.” He clicked happily as we talked. Turns out the humans had abandoned their planet and fled underground to a planet called “Mars”. When I asked them how they were capable of hiding their traces from our planetary scans, Cheech wasn’t sure as he was the smartest in the village, but the Humans didn’t tell them unnecessary information. They told them to use their durable bodies to absorb the radiation and shed their molts to dispose of the radiation in a timely manner. They were told to put all their irradiated molts and other objects into a large tube the Humans built before they left. This tube somehow launches things into what the Humans called, “Space.” Which I determined to be the equivalent to what we call, “Uervun.” I was ecstatic. I ate something called a “cow” which looked like they have mastered husbandry and frequently also hunted. They were opportunistic scavengers at heart, but their recent few decades of exponential growth led them to mainly be carnivores – a term Humans used to describe organisms that only thrive on eating other organisms.  \n\nAfter a few hours, I realized the sky was getting dark and I was about an hour travel from the ship. However, thankfully Cheech had a team of cockroaches to escort me quickly as I rode their backs. They were very cold, almost chilling, massive muscle and fibrous bound insectoids. The one thing Cheech couldn’t tell me was how the atmosphere of your planet was able to withstand such radiation and UV rays while not breaking down. He suspected Human engineering, but ultimately could not tell me as he didn’t even know himself. \n\nI got back to the ship and told everyone of my great conversation with tier leader, Cheech the Albino Cockroach. After we returned to our home planet, word spread, and we were decorated and rewarded. A month later we returned for a more semi-permanent stay to help my understanding with them.  \n\n8/8\n\nHope you enjoyed it!"}, {"comment_author": "YellowSkar", "comment_text": "Incredible.... I'd love to see more of this."}, {"comment_author": "Crungled_Carrot", "comment_text": "I need more of this story!! Loving it so far, r/HFY would love this story of yours"}, {"comment_author": "kristinpeanuts", "comment_text": "Fantastic story! I really liked it"}]}, {"post_title": "[WP] The evil empire that’s really good at war has a big secret: the only reason they keep demanding tribute is because they never really figured out how to farm, and at this point, it would be way too embarrassing to ask.", "post_url": "https://www.reddit.com/r/WritingPrompts/comments/1bymqdm/wp_the_evil_empire_thats_really_good_at_war_has_a/", "post_main_text": "", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n>* [No AI-generated responses &#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n>* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n>* Responses don't have to fulfill every detail\n>* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22&restrict_sr=on&sort=new&t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22&restrict_sr=on&sort=new&t=all) for stricter titles\n>* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n&#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n&#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n&#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n&#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*"}]}, {"post_title": "[WP] When people ask you about your hobbies and you tell them, they often mishear you and believe you said 'Bird' Watcher. You are anything but. ", "post_url": "https://www.reddit.com/r/WritingPrompts/comments/1byj3sw/wp_when_people_ask_you_about_your_hobbies_and_you/", "post_main_text": "", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n>* [No AI-generated responses &#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n>* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n>* Responses don't have to fulfill every detail\n>* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22&restrict_sr=on&sort=new&t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22&restrict_sr=on&sort=new&t=all) for stricter titles\n>* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n&#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n&#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n&#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n&#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*"}, {"comment_author": "None", "comment_text": "[removed]"}, {"comment_author": "WritingPrompts-ModTeam", "comment_text": "Hi u/santa_obis, this comment has been removed.\n\nJoke responses / copypasta are not allowed Humor is OK, but don't write it just for the joke. \n\nWe also don't allow stories based solely on toilet humour.\n\n---\n\n\n\n---\n\n[Modmail](https://www.reddit.com/message/compose?to=%2Fr%2FWritingPrompts&subject=Removed%20post&message=https://old.reddit.com/r/WritingPrompts/comments/1byj3sw/-/kyjth5h/%0A%0A) us if you have any questions or concerns.  In the future, please refer to the [sidebar](https://www.reddit.com/r/WritingPrompts/wiki/config/sidebar) before posting. \n\n*This action was not automated and this moderator is human. Time to go do human things.*"}]}, {"post_title": "[WP] “Never be alone during an eclipse. Solar, lunar, partial, total, doesn’t matter. Just never be alone.” This has been considered basic common sense for generations, although the reason has been lost to history. You’re about to find out why.", "post_url": "https://www.reddit.com/r/WritingPrompts/comments/1byk3l4/wp_never_be_alone_during_an_eclipse_solar_lunar/", "post_main_text": "", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n>* [No AI-generated responses &#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n>* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n>* Responses don't have to fulfill every detail\n>* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22&restrict_sr=on&sort=new&t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22&restrict_sr=on&sort=new&t=all) for stricter titles\n>* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n&#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n&#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n&#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n&#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*"}]}, {"post_title": "[WP] After being disillusioned, you've changed allegiances and are now the world's latest threat to peace and freedom. However, your new alignment isn't as intuitive as you thought. You find old habits die hard in your quest for world domination.", "post_url": "https://www.reddit.com/r/WritingPrompts/comments/1byu1xc/wp_after_being_disillusioned_youve_changed/", "post_main_text": "", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n>* [No AI-generated responses &#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n>* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n>* Responses don't have to fulfill every detail\n>* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22&restrict_sr=on&sort=new&t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22&restrict_sr=on&sort=new&t=all) for stricter titles\n>* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n&#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n&#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n&#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n&#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*"}]}, {"post_title": "[WP] A dragon raised by humans, and a human raised by dragons. Turns out, there's an overlap between the two cultures.", "post_url": "https://www.reddit.com/r/WritingPrompts/comments/1byp2wo/wp_a_dragon_raised_by_humans_and_a_human_raised/", "post_main_text": "", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n>* [No AI-generated responses &#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n>* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n>* Responses don't have to fulfill every detail\n>* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22&restrict_sr=on&sort=new&t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22&restrict_sr=on&sort=new&t=all) for stricter titles\n>* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n&#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n&#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n&#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n&#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*"}]}, {"post_title": "[SP] If you feel drawn to a body of water for no reason, you need to run.", "post_url": "https://www.reddit.com/r/WritingPrompts/comments/1byrg93/sp_if_you_feel_drawn_to_a_body_of_water_for_no/", "post_main_text": "", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n>* [No AI-generated responses &#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n>* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n>* Responses don't have to fulfill every detail\n>* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22&restrict_sr=on&sort=new&t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22&restrict_sr=on&sort=new&t=all) for stricter titles\n>* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n&#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n&#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n&#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n&#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*"}]}, {"post_title": "[WP] A vampire lives so long, he's witnessing humans evolving. It's getting harder and harder to hide, as the differences become more visible. ", "post_url": "https://www.reddit.com/r/WritingPrompts/comments/1bypic1/wp_a_vampire_lives_so_long_hes_witnessing_humans/", "post_main_text": "", "post_comments": [{"comment_author": "AutoModerator", "comment_text": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n>* [No AI-generated responses &#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n>* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n>* Responses don't have to fulfill every detail\n>* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22&restrict_sr=on&sort=new&t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22&restrict_sr=on&sort=new&t=all) for stricter titles\n>* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n&#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n&#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n&#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n&#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*"}]}]